{
  "armor_of_god": {
    "The Spiritual Warfare": {
      "Introduction to Spiritual Warfare": {
        "title": "Wrestling Against Principalities and Powers",
        "description": "Paul's exposition of spiritual armor in Ephesians 6 reveals the true nature of the Christian's conflict. Believers battle not against flesh and blood—human opponents—but against spiritual forces of wickedness in heavenly places. This warfare requires spiritual weapons; human strategies and natural strength prove utterly insufficient. The devil employs cunning schemes (methodeia) requiring constant vigilance and complete dependence upon God's provision. Only by putting on the whole armor of God can believers stand against such formidable opposition. The conflict is real, the enemy is powerful, but the victory is assured through Christ who has already triumphed over principalities and powers at the cross.",
        "verses": [
          {
            "reference": "Ephesians 6:10-12",
            "text": "Finally, my brethren, be strong in the Lord, and in the power of his might. Put on the whole armour of God, that ye may be able to stand against the wiles of the devil. For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places."
          },
          {
            "reference": "Ephesians 6:13",
            "text": "Wherefore take unto you the whole armour of God, that ye may be able to withstand in the evil day, and having done all, to stand."
          },
          {
            "reference": "2 Corinthians 10:3-5",
            "text": "For though we walk in the flesh, we do not war after the flesh: For the weapons of our warfare are not carnal, but mighty through God to the pulling down of strong holds; Casting down imaginations, and every high thing that exalteth itself against the knowledge of God, and bringing into captivity every thought to the obedience of Christ."
          },
          {
            "reference": "1 Peter 5:8-9",
            "text": "Be sober, be vigilant; because your adversary the devil, as a roaring lion, walketh about, seeking whom he may devour: Whom resist stedfast in the faith, knowing that the same afflictions are accomplished in your brethren that are in the world."
          },
          {
            "reference": "James 4:7",
            "text": "Submit yourselves therefore to God. Resist the devil, and he will flee from you."
          },
          {
            "reference": "Colossians 2:15",
            "text": "And having spoiled principalities and powers, he made a shew of them openly, triumphing over them in it."
          },
          {
            "reference": "1 John 4:4",
            "text": "Ye are of God, little children, and have overcome them: because greater is he that is in you, than he that is in the world."
          },
          {
            "reference": "Romans 8:37-39",
            "text": "Nay, in all these things we are more than conquerors through him that loved us. For I am persuaded, that neither death, nor life, nor angels, nor principalities, nor powers, nor things present, nor things to come, Nor height, nor depth, nor any other creature, shall be able to separate us from the love of God, which is in Christ Jesus our Lord."
          },
          {
            "reference": "Revelation 12:11",
            "text": "And they overcame him by the blood of the Lamb, and by the word of their testimony; and they loved not their lives unto the death."
          },
          {
            "reference": "2 Timothy 2:3-4",
            "text": "Thou therefore endure hardness, as a good soldier of Jesus Christ. No man that warreth entangleth himself with the affairs of this life; that he may please him who hath chosen him to be a soldier."
          }
        ]
      }
    },
    "The Defensive Armor": {
      "The Belt of Truth": {
        "title": "Girding the Loins with Truth",
        "description": "The Roman soldier's belt (cingulum) gathered his tunic for freedom of movement and supported his sword. Truth serves a similar function in spiritual warfare—it holds everything together and enables effective action. This truth encompasses both doctrinal truth (believing what is true about God, Christ, salvation, and Scripture) and personal integrity (living honestly, rejecting self-deception, walking in the light). Satan is the father of lies; truth exposes his deceptions and enables the believer to stand firm.",
        "verses": [
          {
            "reference": "Ephesians 6:14a",
            "text": "Stand therefore, having your loins girt about with truth."
          },
          {
            "reference": "John 8:32",
            "text": "And ye shall know the truth, and the truth shall make you free."
          },
          {
            "reference": "John 14:6",
            "text": "Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me."
          },
          {
            "reference": "John 17:17",
            "text": "Sanctify them through thy truth: thy word is truth."
          }
        ]
      },
      "The Breastplate of Righteousness": {
        "title": "Guarding the Heart",
        "description": "The breastplate protected the soldier's vital organs, particularly the heart. Righteousness serves as the believer's breastplate, guarding against Satan's accusations and attacks. This includes both imputed righteousness—Christ's righteousness credited to believers through faith—and practical righteousness—holy living that gives the devil no foothold. When Satan accuses, believers stand in Christ's perfect righteousness; when he tempts, they resist through righteous conduct that keeps conscience clear and provides no opening for his attacks.",
        "verses": [
          {
            "reference": "Ephesians 6:14b",
            "text": "And having on the breastplate of righteousness."
          },
          {
            "reference": "Romans 3:22",
            "text": "Even the righteousness of God which is by faith of Jesus Christ unto all and upon all them that believe."
          },
          {
            "reference": "Isaiah 59:17",
            "text": "For he put on righteousness as a breastplate, and an helmet of salvation upon his head."
          },
          {
            "reference": "1 Thessalonians 5:8",
            "text": "But let us, who are of the day, be sober, putting on the breastplate of faith and love."
          }
        ]
      },
      "The Shoes of the Gospel of Peace": {
        "title": "Ready to Stand and Advance",
        "description": "Roman soldiers wore caligae—heavy sandals with hobnailed soles providing firm footing on any terrain. The gospel of peace equips believers similarly: grounded in the peace Christ provides (peace with God through justification), ready to stand firmly against attack, and prepared to advance with the good news. This readiness involves both defensive stability and offensive mobility—standing firm in faith while moving forward in mission.",
        "verses": [
          {
            "reference": "Ephesians 6:15",
            "text": "And your feet shod with the preparation of the gospel of peace."
          },
          {
            "reference": "Romans 5:1",
            "text": "Therefore being justified by faith, we have peace with God through our Lord Jesus Christ."
          },
          {
            "reference": "Isaiah 52:7",
            "text": "How beautiful upon the mountains are the feet of him that bringeth good tidings, that publisheth peace; that bringeth good tidings of good, that publisheth salvation."
          },
          {
            "reference": "Romans 10:15",
            "text": "And how shall they preach, except they be sent? as it is written, How beautiful are the feet of them that preach the gospel of peace, and bring glad tidings of good things!"
          }
        ]
      },
      "The Shield of Faith": {
        "title": "Quenching the Fiery Darts",
        "description": "The Roman scutum was a large, door-shaped shield covered with leather that could be soaked in water to extinguish flaming arrows. Faith serves as the believer's shield, deflecting Satan's fiery darts—his temptations, accusations, doubts, fears, and lies. Active trust in God's promises, character, and power quenches every attack. This faith looks to Christ, rests on Scripture, and refuses to yield to circumstances or feelings. 'Above all' suggests the shield's supreme importance in spiritual combat.",
        "verses": [
          {
            "reference": "Ephesians 6:16",
            "text": "Above all, taking the shield of faith, wherewith ye shall be able to quench all the fiery darts of the wicked."
          },
          {
            "reference": "1 John 5:4",
            "text": "For whatsoever is born of God overcometh the world: and this is the victory that overcometh the world, even our faith."
          },
          {
            "reference": "Hebrews 11:1",
            "text": "Now faith is the substance of things hoped for, the evidence of things not seen."
          },
          {
            "reference": "1 Peter 1:5",
            "text": "Who are kept by the power of God through faith unto salvation ready to be revealed in the last time."
          }
        ]
      },
      "The Helmet of Salvation": {
        "title": "Protecting the Mind",
        "description": "The helmet protected the soldier's head—the command center. Salvation guards the believer's mind, providing assurance against doubt and hope against despair. This helmet involves confidence in present salvation (deliverance from sin's penalty and power) and hope of future salvation (complete deliverance at Christ's return). Satan attacks the mind with doubts, discouragement, and despair; the helmet of salvation protects by securing the believer's identity in Christ and hope of glory.",
        "verses": [
          {
            "reference": "Ephesians 6:17a",
            "text": "And take the helmet of salvation."
          },
          {
            "reference": "1 Thessalonians 5:8",
            "text": "But let us, who are of the day, be sober, putting on the breastplate of faith and love; and for an helmet, the hope of salvation."
          },
          {
            "reference": "Romans 8:24",
            "text": "For we are saved by hope: but hope that is seen is not hope: for what a man seeth, why doth he yet hope for?"
          },
          {
            "reference": "Isaiah 59:17",
            "text": "For he put on righteousness as a breastplate, and an helmet of salvation upon his head."
          }
        ]
      }
    },
    "The Offensive Weapon": {
      "The Sword of the Spirit": {
        "title": "The Word of God",
        "description": "The sword (machaira) was the Roman soldier's close-combat weapon. The Word of God serves as the believer's offensive weapon—the only piece of armor designed for attack. 'Word' here is rhema (spoken word), emphasizing Scripture applied to specific situations. Jesus demonstrated this weapon's effectiveness in His wilderness temptation, responding to each satanic attack with 'It is written.' The sword must be known (through study), drawn (through memorization), and wielded (through application) to be effective against the enemy.",
        "verses": [
          {
            "reference": "Ephesians 6:17b",
            "text": "And the sword of the Spirit, which is the word of God."
          },
          {
            "reference": "Hebrews 4:12",
            "text": "For the word of God is quick, and powerful, and sharper than any twoedged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow, and is a discerner of the thoughts and intents of the heart."
          },
          {
            "reference": "Matthew 4:4",
            "text": "But he answered and said, It is written, Man shall not live by bread alone, but by every word that proceedeth out of the mouth of God."
          },
          {
            "reference": "Psalm 119:11",
            "text": "Thy word have I hid in mine heart, that I might not sin against thee."
          }
        ]
      }
    },
    "The Essential Support": {
      "Prayer and Supplication": {
        "title": "Praying Always in the Spirit",
        "description": "Prayer undergirds the entire armor—not another piece but the means by which all pieces are put on and employed. Paul calls for prayer that is constant ('always'), Spirit-guided ('in the Spirit'), varied ('prayer and supplication'), vigilant ('watching'), persevering ('with all perseverance'), and intercessory ('for all saints'). Spiritual warfare cannot be fought in human strength; prayer connects the believer to divine power, wisdom, and protection. Without prayer, the armor remains mere theory.",
        "verses": [
          {
            "reference": "Ephesians 6:18",
            "text": "Praying always with all prayer and supplication in the Spirit, and watching thereunto with all perseverance and supplication for all saints."
          },
          {
            "reference": "1 Thessalonians 5:17",
            "text": "Pray without ceasing."
          },
          {
            "reference": "Jude 1:20",
            "text": "But ye, beloved, building up yourselves on your most holy faith, praying in the Holy Ghost."
          },
          {
            "reference": "Romans 8:26",
            "text": "Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered."
          }
        ]
      }
    }
  }
}