{
  "blood_in_scripture": {
    "The Significance of Blood": {
      "Life is in the Blood": {
        "title": "The Soul of the Flesh",
        "description": "Scripture declares that the life of the flesh is in the blood. This is why God prohibited eating blood—the blood represents the life, and life belongs to God alone. Blood is sacred because life is sacred. When blood is shed, life is poured out. This biological and theological truth underlies the entire sacrificial system. Atonement is made by blood because atonement requires the giving of life. The blood of Christ is precious because it represents His perfect, sinless life given for us. Without the shedding of blood, there is no remission of sins.",
        "verses": [
          {
            "reference": "Leviticus 17:11",
            "text": "For the life of the flesh is in the blood: and I have given it to you upon the altar to make an atonement for your souls: for it is the blood that maketh an atonement for the soul."
          },
          {
            "reference": "Leviticus 17:14",
            "text": "For it is the life of all flesh; the blood of it is for the life thereof: therefore I said unto the children of Israel, Ye shall eat the blood of no manner of flesh: for the life of all flesh is the blood thereof: whosoever eateth it shall be cut off."
          },
          {
            "reference": "Genesis 9:4",
            "text": "But flesh with the life thereof, which is the blood thereof, shall ye not eat."
          },
          {
            "reference": "Hebrews 9:22",
            "text": "And almost all things are by the law purged with blood; and without shedding of blood is no remission."
          },
          {
            "reference": "1 Peter 1:19",
            "text": "But with the precious blood of Christ, as of a lamb without blemish and without spot."
          },
          {
            "reference": "Deuteronomy 12:23",
            "text": "Only be sure that thou eat not the blood: for the blood is the life; and thou mayest not eat the life with the flesh."
          }
        ]
      },
      "Blood Cries from the Ground": {
        "title": "The Voice of Blood",
        "description": "When Cain murdered Abel, God declared that Abel's blood cried from the ground. Blood has a voice—it testifies, it cries for justice, it speaks. The blood of martyrs throughout history cries to God for vindication. But the blood of Jesus speaks better things than the blood of Abel. Abel's blood cried for vengeance; Christ's blood speaks forgiveness. Abel's blood condemned his murderer; Christ's blood cleanses the guilty. The voice of Christ's blood drowns out the accusations of our sins, pleading mercy and reconciliation.",
        "verses": [
          {
            "reference": "Genesis 4:10",
            "text": "And he said, What hast thou done? the voice of thy brother's blood crieth unto me from the ground."
          },
          {
            "reference": "Hebrews 12:24",
            "text": "And to Jesus the mediator of the new covenant, and to the blood of sprinkling, that speaketh better things than that of Abel."
          },
          {
            "reference": "Revelation 6:10",
            "text": "And they cried with a loud voice, saying, How long, O Lord, holy and true, dost thou not judge and avenge our blood on them that dwell on the earth?"
          },
          {
            "reference": "Matthew 23:35",
            "text": "That upon you may come all the righteous blood shed upon the earth, from the blood of righteous Abel unto the blood of Zacharias son of Barachias, whom ye slew between the temple and the altar."
          },
          {
            "reference": "Hebrews 11:4",
            "text": "By faith Abel offered unto God a more excellent sacrifice than Cain, by which he obtained witness that he was righteous, God testifying of his gifts: and by it he being dead yet speaketh."
          }
        ]
      }
    },
    "Blood in the Old Testament": {
      "The Passover Blood": {
        "title": "When I See the Blood",
        "description": "The Passover is the foundational blood narrative of the Old Testament. The lamb was slain, and its blood applied to the doorposts. When the destroyer saw the blood, he passed over that house. The blood was not merely a sign but a propitiation—it satisfied the demands of divine justice. God said, 'When I see the blood, I will pass over you.' The blood alone averted judgment. Christ our Passover is sacrificed for us, and His blood applied to our hearts causes God's wrath to pass over us.",
        "verses": [
          {
            "reference": "Exodus 12:13",
            "text": "And the blood shall be to you for a token upon the houses where ye are: and when I see the blood, I will pass over you, and the plague shall not be upon you to destroy you, when I smite the land of Egypt."
          },
          {
            "reference": "Exodus 12:22-23",
            "text": "And ye shall take a bunch of hyssop, and dip it in the blood that is in the bason, and strike the lintel and the two side posts with the blood that is in the bason; and none of you shall go out at the door of his house until the morning. For the LORD will pass through to smite the Egyptians; and when he seeth the blood upon the lintel, and on the two side posts, the LORD will pass over the door, and will not suffer the destroyer to come in unto your houses to smite you."
          },
          {
            "reference": "1 Corinthians 5:7",
            "text": "Purge out therefore the old leaven, that ye may be a new lump, as ye are unleavened. For even Christ our passover is sacrificed for us."
          },
          {
            "reference": "1 Peter 1:18-19",
            "text": "Forasmuch as ye know that ye were not redeemed with corruptible things, as silver and gold... But with the precious blood of Christ, as of a lamb without blemish and without spot."
          },
          {
            "reference": "Hebrews 11:28",
            "text": "Through faith he kept the passover, and the sprinkling of blood, lest he that destroyed the firstborn should touch them."
          }
        ]
      },
      "The Covenant Blood": {
        "title": "The Blood of the Covenant",
        "description": "The Mosaic covenant was ratified with blood. Moses took the blood of sacrifices and sprinkled half on the altar (representing God) and half on the people, declaring, 'Behold the blood of the covenant.' Covenants were sealed in blood because they were matters of life and death. Christ established the new covenant in His blood—the cup represents His blood of the new testament shed for many for the remission of sins. We enter covenant relationship with God through Christ's blood.",
        "verses": [
          {
            "reference": "Exodus 24:8",
            "text": "And Moses took the blood, and sprinkled it on the people, and said, Behold the blood of the covenant, which the LORD hath made with you concerning all these words."
          },
          {
            "reference": "Hebrews 9:18-20",
            "text": "Whereupon neither the first testament was dedicated without blood. For when Moses had spoken every precept to all the people according to the law, he took the blood of calves and of goats, with water, and scarlet wool, and hyssop, and sprinkled both the book, and all the people, Saying, This is the blood of the testament which God hath enjoined unto you."
          },
          {
            "reference": "Matthew 26:28",
            "text": "For this is my blood of the new testament, which is shed for many for the remission of sins."
          },
          {
            "reference": "Hebrews 13:20",
            "text": "Now the God of peace, that brought again from the dead our Lord Jesus, that great shepherd of the sheep, through the blood of the everlasting covenant."
          },
          {
            "reference": "Zechariah 9:11",
            "text": "As for thee also, by the blood of thy covenant I have sent forth thy prisoners out of the pit wherein is no water."
          }
        ]
      },
      "The Day of Atonement Blood": {
        "title": "Blood Upon the Mercy Seat",
        "description": "On the Day of Atonement, the high priest entered the Most Holy Place with blood and sprinkled it on the mercy seat—the cover of the ark where God's presence dwelt. The blood came between God's holiness and the law's condemnation. This annual ritual demonstrated that access to God requires blood. The blood did not merely cover sins but propitiated God's wrath. Christ entered the true Most Holy Place with His own blood, obtaining eternal redemption, appearing in God's presence for us.",
        "verses": [
          {
            "reference": "Leviticus 16:14-15",
            "text": "And he shall take of the blood of the bullock, and sprinkle it with his finger upon the mercy seat eastward; and before the mercy seat shall he sprinkle of the blood with his finger seven times. Then shall he kill the goat of the sin offering, that is for the people, and bring his blood within the vail, and do with that blood as he did with the blood of the bullock, and sprinkle it upon the mercy seat, and before the mercy seat."
          },
          {
            "reference": "Hebrews 9:7",
            "text": "But into the second went the high priest alone once every year, not without blood, which he offered for himself, and for the errors of the people."
          },
          {
            "reference": "Hebrews 9:11-12",
            "text": "But Christ being come an high priest of good things to come, by a greater and more perfect tabernacle, not made with hands, that is to say, not of this building; Neither by the blood of goats and calves, but by his own blood he entered in once into the holy place, having obtained eternal redemption for us."
          },
          {
            "reference": "Romans 3:25",
            "text": "Whom God hath set forth to be a propitiation through faith in his blood, to declare his righteousness for the remission of sins that are past, through the forbearance of God."
          },
          {
            "reference": "Hebrews 9:24",
            "text": "For Christ is not entered into the holy places made with hands, which are the figures of the true; but into heaven itself, now to appear in the presence of God for us."
          }
        ]
      }
    },
    "The Blood of Christ": {
      "Redemption Through His Blood": {
        "title": "Purchased with Blood",
        "description": "Redemption means to purchase back, to liberate by paying a price. We were not redeemed with corruptible things like silver and gold but with the precious blood of Christ. His blood is the ransom price that freed us from slavery to sin. In Him we have redemption through His blood, the forgiveness of sins. The church was purchased with His own blood. This redemption is eternal—not temporary like the redemption pictured in Old Testament sacrifices. Christ's blood secures our freedom forever.",
        "verses": [
          {
            "reference": "Ephesians 1:7",
            "text": "In whom we have redemption through his blood, the forgiveness of sins, according to the riches of his grace."
          },
          {
            "reference": "1 Peter 1:18-19",
            "text": "Forasmuch as ye know that ye were not redeemed with corruptible things, as silver and gold, from your vain conversation received by tradition from your fathers; But with the precious blood of Christ, as of a lamb without blemish and without spot."
          },
          {
            "reference": "Acts 20:28",
            "text": "Take heed therefore unto yourselves, and to all the flock, over the which the Holy Ghost hath made you overseers, to feed the church of God, which he hath purchased with his own blood."
          },
          {
            "reference": "Colossians 1:14",
            "text": "In whom we have redemption through his blood, even the forgiveness of sins."
          },
          {
            "reference": "Revelation 5:9",
            "text": "And they sung a new song, saying, Thou art worthy to take the book, and to open the seals thereof: for thou wast slain, and hast redeemed us to God by thy blood out of every kindred, and tongue, and people, and nation."
          },
          {
            "reference": "Hebrews 9:12",
            "text": "Neither by the blood of goats and calves, but by his own blood he entered in once into the holy place, having obtained eternal redemption for us."
          }
        ]
      },
      "Justification by His Blood": {
        "title": "Justified by Blood",
        "description": "Justification is God's declaration that guilty sinners are righteous in His sight. This legal verdict is rendered on the basis of Christ's blood. Being now justified by His blood, we shall be saved from wrath through Him. The blood satisfies divine justice, paying the penalty our sins deserved. God is both just and the justifier of those who believe in Jesus—just because the penalty was paid, justifier because He declares believers righteous. The blood-bought justification ensures our salvation from wrath.",
        "verses": [
          {
            "reference": "Romans 5:9",
            "text": "Much more then, being now justified by his blood, we shall be saved from wrath through him."
          },
          {
            "reference": "Romans 3:24-26",
            "text": "Being justified freely by his grace through the redemption that is in Christ Jesus: Whom God hath set forth to be a propitiation through faith in his blood, to declare his righteousness for the remission of sins that are past, through the forbearance of God; To declare, I say, at this time his righteousness: that he might be just, and the justifier of him which believeth in Jesus."
          },
          {
            "reference": "Romans 5:1",
            "text": "Therefore being justified by faith, we have peace with God through our Lord Jesus Christ."
          },
          {
            "reference": "Galatians 2:16",
            "text": "Knowing that a man is not justified by the works of the law, but by the faith of Jesus Christ, even we have believed in Jesus Christ, that we might be justified by the faith of Christ, and not by the works of the law."
          },
          {
            "reference": "Titus 3:7",
            "text": "That being justified by his grace, we should be made heirs according to the hope of eternal life."
          }
        ]
      },
      "Cleansing by His Blood": {
        "title": "Washed in the Blood",
        "description": "The blood of Jesus Christ cleanses us from all sin. This cleansing is not merely ceremonial but actual—it purges the conscience from dead works to serve the living God. The great multitude in white robes have washed their robes and made them white in the blood of the Lamb. This cleansing is ongoing—if we walk in the light, His blood keeps on cleansing us. No stain is too deep, no sin too scarlet, for the blood of Christ to wash white as snow.",
        "verses": [
          {
            "reference": "1 John 1:7",
            "text": "But if we walk in the light, as he is in the light, we have fellowship one with another, and the blood of Jesus Christ his Son cleanseth us from all sin."
          },
          {
            "reference": "Hebrews 9:14",
            "text": "How much more shall the blood of Christ, who through the eternal Spirit offered himself without spot to God, purge your conscience from dead works to serve the living God?"
          },
          {
            "reference": "Revelation 7:14",
            "text": "And I said unto him, Sir, thou knowest. And he said to me, These are they which came out of great tribulation, and have washed their robes, and made them white in the blood of the Lamb."
          },
          {
            "reference": "Revelation 1:5",
            "text": "And from Jesus Christ, who is the faithful witness, and the first begotten of the dead, and the prince of the kings of the earth. Unto him that loved us, and washed us from our sins in his own blood."
          },
          {
            "reference": "Hebrews 10:22",
            "text": "Let us draw near with a true heart in full assurance of faith, having our hearts sprinkled from an evil conscience, and our bodies washed with pure water."
          },
          {
            "reference": "Isaiah 1:18",
            "text": "Come now, and let us reason together, saith the LORD: though your sins be as scarlet, they shall be as white as snow; though they be red like crimson, they shall be as wool."
          }
        ]
      },
      "Access Through His Blood": {
        "title": "Boldness to Enter",
        "description": "The blood of Christ provides access to God that was impossible under the old covenant. We have boldness to enter the holiest by the blood of Jesus. The veil that barred access was torn when Christ died. We who were far off are made nigh by the blood of Christ. Through Him we both have access by one Spirit unto the Father. The blood opens the way to the throne of grace. We come boldly, not presumptuously, because the blood has made the way.",
        "verses": [
          {
            "reference": "Hebrews 10:19-22",
            "text": "Having therefore, brethren, boldness to enter into the holiest by the blood of Jesus, By a new and living way, which he hath consecrated for us, through the veil, that is to say, his flesh; And having an high priest over the house of God; Let us draw near with a true heart in full assurance of faith."
          },
          {
            "reference": "Ephesians 2:13",
            "text": "But now in Christ Jesus ye who sometimes were far off are made nigh by the blood of Christ."
          },
          {
            "reference": "Ephesians 2:18",
            "text": "For through him we both have access by one Spirit unto the Father."
          },
          {
            "reference": "Hebrews 4:16",
            "text": "Let us therefore come boldly unto the throne of grace, that we may obtain mercy, and find grace to help in time of need."
          },
          {
            "reference": "Romans 5:2",
            "text": "By whom also we have access by faith into this grace wherein we stand, and rejoice in hope of the glory of God."
          },
          {
            "reference": "Colossians 1:20",
            "text": "And, having made peace through the blood of his cross, by him to reconcile all things unto himself; by him, I say, whether they be things in earth, or things in heaven."
          }
        ]
      }
    }
  }
}