{
  "christology": {
    "The Pre-Incarnate Christ": {
      "The Eternal Word": {
        "title": "Christ Before Bethlehem",
        "description": "Before the Word became flesh, He existed eternally as the second person of the Trinity. John's Gospel opens with this staggering truth: 'In the beginning was the Word'—not 'came to be' but 'was,' indicating eternal pre-existence. This Logos was both 'with God' (distinct person) and 'was God' (same essence). All creation came into being through Him; He is the agent of creation, not a creature. The pre-incarnate Christ appeared throughout the Old Testament as the Angel of the LORD, the Commander of the LORD's army, and in various theophanies. Bethlehem was not His beginning but His arrival—the eternal entering time.",
        "verses": [
          {
            "reference": "John 1:1-3",
            "text": "In the beginning was the Word, and the Word was with God, and the Word was God. The same was in the beginning with God. All things were made by him; and without him was not any thing made that was made."
          },
          {
            "reference": "John 17:5",
            "text": "And now, O Father, glorify thou me with thine own self with the glory which I had with thee before the world was."
          },
          {
            "reference": "Colossians 1:16-17",
            "text": "For by him were all things created, that are in heaven, and that are in earth, visible and invisible, whether they be thrones, or dominions, or principalities, or powers: all things were created by him, and for him: And he is before all things, and by him all things consist."
          },
          {
            "reference": "Micah 5:2",
            "text": "But thou, Bethlehem Ephratah, though thou be little among the thousands of Judah, yet out of thee shall he come forth unto me that is to be ruler in Israel; whose goings forth have been from of old, from everlasting."
          },
          {
            "reference": "Proverbs 8:22-23",
            "text": "The LORD possessed me in the beginning of his way, before his works of old. I was set up from everlasting, from the beginning, or ever the earth was."
          },
          {
            "reference": "Isaiah 9:6",
            "text": "For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace."
          }
        ]
      },
      "The Angel of the LORD": {
        "title": "The Pre-Incarnate Theophanies",
        "description": "Throughout the Old Testament, a mysterious figure called 'the Angel of the LORD' appears—distinct from ordinary angels and identified with YHWH Himself. He speaks as God, accepts worship, and exercises divine prerogatives. This Angel appeared to Hagar, Abraham, Jacob, Moses, Gideon, and Manoah's wife, among others. He is called 'God' yet is sent by God, speaks for God yet is God. The early church fathers identified this Angel as the pre-incarnate Christ—the second person of the Trinity manifesting visibly before the incarnation. These appearances foreshadowed and prepared for the full incarnation in Bethlehem.",
        "verses": [
          {
            "reference": "Genesis 16:10-13",
            "text": "And the angel of the LORD said unto her, I will multiply thy seed exceedingly... And she called the name of the LORD that spake unto her, Thou God seest me."
          },
          {
            "reference": "Genesis 22:11-12",
            "text": "And the angel of the LORD called unto him out of heaven, and said, Abraham, Abraham... now I know that thou fearest God, seeing thou hast not withheld thy son, thine only son from me."
          },
          {
            "reference": "Exodus 3:2-6",
            "text": "And the angel of the LORD appeared unto him in a flame of fire out of the midst of a bush... Moreover he said, I am the God of thy father, the God of Abraham, the God of Isaac, and the God of Jacob."
          },
          {
            "reference": "Judges 13:18-22",
            "text": "And the angel of the LORD said unto him, Why askest thou thus after my name, seeing it is secret?... And Manoah said unto his wife, We shall surely die, because we have seen God."
          },
          {
            "reference": "Genesis 32:30",
            "text": "And Jacob called the name of the place Peniel: for I have seen God face to face, and my life is preserved."
          },
          {
            "reference": "Joshua 5:14-15",
            "text": "And he said, Nay; but as captain of the host of the LORD am I now come... Loose thy shoe from off thy foot; for the place whereon thou standest is holy."
          }
        ]
      }
    },
    "The Incarnation": {
      "The Virgin Birth": {
        "title": "Conceived by the Holy Spirit, Born of the Virgin Mary",
        "description": "The incarnation began with a miracle: the eternal Son took human nature through conception in the womb of the Virgin Mary by the power of the Holy Spirit, without a human father. This was not a mythological divine-human mating but a supernatural creative act. The virgin birth protected Christ from inheriting Adam's guilt through natural generation while ensuring His true humanity through Mary. He was born of a woman, born under the law, fully human in every respect yet without sin. The miracle of the virgin birth signals the newness of what God was doing—beginning the new creation in the womb of a virgin.",
        "verses": [
          {
            "reference": "Matthew 1:18",
            "text": "Now the birth of Jesus Christ was on this wise: When as his mother Mary was espoused to Joseph, before they came together, she was found with child of the Holy Ghost."
          },
          {
            "reference": "Matthew 1:20-23",
            "text": "But while he thought on these things, behold, the angel of the Lord appeared unto him in a dream, saying, Joseph, thou son of David, fear not to take unto thee Mary thy wife: for that which is conceived in her is of the Holy Ghost. And she shall bring forth a son, and thou shalt call his name JESUS: for he shall save his people from their sins."
          },
          {
            "reference": "Luke 1:34-35",
            "text": "Then said Mary unto the angel, How shall this be, seeing I know not a man? And the angel answered and said unto her, The Holy Ghost shall come upon thee, and the power of the Highest shall overshadow thee: therefore also that holy thing which shall be born of thee shall be called the Son of God."
          },
          {
            "reference": "Isaiah 7:14",
            "text": "Therefore the Lord himself shall give you a sign; Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel."
          },
          {
            "reference": "Galatians 4:4",
            "text": "But when the fulness of the time was come, God sent forth his Son, made of a woman, made under the law."
          },
          {
            "reference": "Hebrews 10:5",
            "text": "Wherefore when he cometh into the world, he saith, Sacrifice and offering thou wouldest not, but a body hast thou prepared me."
          }
        ]
      },
      "The Hypostatic Union": {
        "title": "Two Natures in One Person",
        "description": "In the incarnation, the divine and human natures were united in one person without confusion, change, division, or separation (the Chalcedonian Definition). Christ did not cease to be God when He became man; He did not have a human person added to His divine person. Rather, the eternal Son assumed human nature into personal union with Himself. He is one person with two complete natures—fully God and fully man. Each nature retains its own properties: as God He is omniscient, as man He grew in wisdom; as God He cannot die, as man He suffered death. This union is permanent—Christ remains the God-man forever.",
        "verses": [
          {
            "reference": "John 1:14",
            "text": "And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth."
          },
          {
            "reference": "Philippians 2:6-8",
            "text": "Who, being in the form of God, thought it not robbery to be equal with God: But made himself of no reputation, and took upon him the form of a servant, and was made in the likeness of men: And being found in fashion as a man, he humbled himself, and became obedient unto death, even the death of the cross."
          },
          {
            "reference": "Colossians 2:9",
            "text": "For in him dwelleth all the fulness of the Godhead bodily."
          },
          {
            "reference": "1 Timothy 3:16",
            "text": "And without controversy great is the mystery of godliness: God was manifest in the flesh, justified in the Spirit, seen of angels, preached unto the Gentiles, believed on in the world, received up into glory."
          },
          {
            "reference": "Hebrews 2:14",
            "text": "Forasmuch then as the children are partakers of flesh and blood, he also himself likewise took part of the same; that through death he might destroy him that had the power of death, that is, the devil."
          },
          {
            "reference": "Romans 1:3-4",
            "text": "Concerning his Son Jesus Christ our Lord, which was made of the seed of David according to the flesh; And declared to be the Son of God with power, according to the spirit of holiness, by the resurrection from the dead."
          }
        ]
      },
      "The Humiliation of Christ": {
        "title": "The Kenosis - Self-Emptying",
        "description": "The incarnation involved a profound humiliation, described in Philippians 2 as Christ 'emptying Himself.' This kenosis does not mean He ceased to be God or surrendered divine attributes; rather, He voluntarily veiled His glory, declined to exercise certain divine prerogatives independently, and submitted to human limitations. The eternal, infinite, omnipotent God became a helpless infant, grew tired, thirsted, and ultimately died. He who was rich became poor; He who was served became a servant; He who was worshiped was mocked. This self-emptying reached its nadir at Calvary, where the Lord of glory hung naked between criminals.",
        "verses": [
          {
            "reference": "Philippians 2:5-8",
            "text": "Let this mind be in you, which was also in Christ Jesus: Who, being in the form of God, thought it not robbery to be equal with God: But made himself of no reputation, and took upon him the form of a servant, and was made in the likeness of men: And being found in fashion as a man, he humbled himself, and became obedient unto death, even the death of the cross."
          },
          {
            "reference": "2 Corinthians 8:9",
            "text": "For ye know the grace of our Lord Jesus Christ, that, though he was rich, yet for your sakes he became poor, that ye through his poverty might be rich."
          },
          {
            "reference": "John 17:5",
            "text": "And now, O Father, glorify thou me with thine own self with the glory which I had with thee before the world was."
          },
          {
            "reference": "Matthew 8:20",
            "text": "And Jesus saith unto him, The foxes have holes, and the birds of the air have nests; but the Son of man hath not where to lay his head."
          },
          {
            "reference": "Hebrews 5:8",
            "text": "Though he were a Son, yet learned he obedience by the things which he suffered."
          },
          {
            "reference": "Isaiah 53:3",
            "text": "He is despised and rejected of men; a man of sorrows, and acquainted with grief: and we hid as it were our faces from him; he was despised, and we esteemed him not."
          }
        ]
      }
    },
    "The Offices of Christ": {
      "Christ as Prophet": {
        "title": "The Word of God to Man",
        "description": "Christ fulfills the prophetic office as the ultimate revelation of God to humanity. Moses predicted a prophet like himself whom Israel must heed. Jesus is that Prophet—greater than Moses, for He is not merely a messenger but the Message itself, the Word made flesh. As Prophet, He reveals the Father perfectly ('He who has seen Me has seen the Father'), declares God's truth authoritatively, and pronounces divine judgment on sin. His prophetic ministry continues through His Spirit illuminating Scripture to His church. He is prophet not by calling but by nature—the eternal Word who makes the Father known.",
        "verses": [
          {
            "reference": "Deuteronomy 18:15",
            "text": "The LORD thy God will raise up unto thee a Prophet from the midst of thee, of thy brethren, like unto me; unto him ye shall hearken."
          },
          {
            "reference": "Acts 3:22-23",
            "text": "For Moses truly said unto the fathers, A prophet shall the Lord your God raise up unto you of your brethren, like unto me; him shall ye hear in all things whatsoever he shall say unto you."
          },
          {
            "reference": "John 1:18",
            "text": "No man hath seen God at any time; the only begotten Son, which is in the bosom of the Father, he hath declared him."
          },
          {
            "reference": "Hebrews 1:1-2",
            "text": "God, who at sundry times and in divers manners spake in time past unto the fathers by the prophets, Hath in these last days spoken unto us by his Son."
          },
          {
            "reference": "John 14:9",
            "text": "Jesus saith unto him, Have I been so long time with you, and yet hast thou not known me, Philip? he that hath seen me hath seen the Father."
          },
          {
            "reference": "Luke 24:19",
            "text": "And they said unto him, Concerning Jesus of Nazareth, which was a prophet mighty in deed and word before God and all the people."
          }
        ]
      },
      "Christ as Priest": {
        "title": "The Mediator Between God and Man",
        "description": "Christ is our great High Priest who offered Himself as the perfect sacrifice for sin and now intercedes for His people at the Father's right hand. Unlike Levitical priests who offered repeatedly and for their own sins first, Christ offered one sacrifice—Himself—once for all. He is both the priest who offers and the lamb who is offered. His priesthood is not Levitical but after the order of Melchizedek—eternal, royal, and without predecessor or successor. Having passed through the heavens, He sympathizes with our weaknesses, having been tempted in all points yet without sin. We therefore approach the throne of grace boldly through Him.",
        "verses": [
          {
            "reference": "Hebrews 4:14-15",
            "text": "Seeing then that we have a great high priest, that is passed into the heavens, Jesus the Son of God, let us hold fast our profession. For we have not an high priest which cannot be touched with the feeling of our infirmities; but was in all points tempted like as we are, yet without sin."
          },
          {
            "reference": "Hebrews 7:24-25",
            "text": "But this man, because he continueth ever, hath an unchangeable priesthood. Wherefore he is able also to save them to the uttermost that come unto God by him, seeing he ever liveth to make intercession for them."
          },
          {
            "reference": "Hebrews 9:11-12",
            "text": "But Christ being come an high priest of good things to come, by a greater and more perfect tabernacle, not made with hands... Neither by the blood of goats and calves, but by his own blood he entered in once into the holy place, having obtained eternal redemption for us."
          },
          {
            "reference": "Hebrews 10:12",
            "text": "But this man, after he had offered one sacrifice for sins for ever, sat down on the right hand of God."
          },
          {
            "reference": "1 John 2:1",
            "text": "My little children, these things write I unto you, that ye sin not. And if any man sin, we have an advocate with the Father, Jesus Christ the righteous."
          },
          {
            "reference": "Romans 8:34",
            "text": "Who is he that condemneth? It is Christ that died, yea rather, that is risen again, who is even at the right hand of God, who also maketh intercession for us."
          }
        ]
      },
      "Christ as King": {
        "title": "The Ruler of All",
        "description": "Christ is the anointed King, heir to David's throne, yet His kingdom far surpasses any earthly monarchy. He is 'King of kings and Lord of lords,' exercising sovereign authority over all creation. His kingdom is 'not of this world'—not established by worldly power but by the Spirit's work in human hearts. Yet it is real, present (in the church), and future (in consummation). As King, He protects His people, conquers their enemies, and governs them by His Word and Spirit. Every knee shall bow to this King—willingly now in worship or unwillingly at judgment.",
        "verses": [
          {
            "reference": "Revelation 19:16",
            "text": "And he hath on his vesture and on his thigh a name written, KING OF KINGS, AND LORD OF LORDS."
          },
          {
            "reference": "Matthew 28:18",
            "text": "And Jesus came and spake unto them, saying, All power is given unto me in heaven and in earth."
          },
          {
            "reference": "John 18:36-37",
            "text": "Jesus answered, My kingdom is not of this world: if my kingdom were of this world, then would my servants fight... Pilate therefore said unto him, Art thou a king then? Jesus answered, Thou sayest that I am a king. To this end was I born, and for this cause came I into the world."
          },
          {
            "reference": "Luke 1:32-33",
            "text": "He shall be great, and shall be called the Son of the Highest: and the Lord God shall give unto him the throne of his father David: And he shall reign over the house of Jacob for ever; and of his kingdom there shall be no end."
          },
          {
            "reference": "Psalm 2:6-7",
            "text": "Yet have I set my king upon my holy hill of Zion. I will declare the decree: the LORD hath said unto me, Thou art my Son; this day have I begotten thee."
          },
          {
            "reference": "Philippians 2:9-11",
            "text": "Wherefore God also hath highly exalted him, and given him a name which is above every name: That at the name of Jesus every knee should bow, of things in heaven, and things in earth, and things under the earth."
          }
        ]
      }
    },
    "The Atonement": {
      "Penal Substitutionary Atonement": {
        "title": "Christ Bearing Our Punishment",
        "description": "At the heart of the gospel stands the cross, where Christ died as a substitute for sinners, bearing the penalty they deserved. This is penal substitution: 'penal' because He bore the legal penalty due to sin; 'substitution' because He took our place. God's justice required that sin be punished; God's love provided a substitute. On the cross, the Father imputed our sins to Christ and punished Him in our stead. The sinless One became sin for us. He was wounded for our transgressions, bruised for our iniquities. The wrath we deserved fell upon Him. This is not cosmic child abuse but the Father and Son together executing the plan of redemption.",
        "verses": [
          {
            "reference": "Isaiah 53:5-6",
            "text": "But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed. All we like sheep have gone astray; we have turned every one to his own way; and the LORD hath laid on him the iniquity of us all."
          },
          {
            "reference": "2 Corinthians 5:21",
            "text": "For he hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in him."
          },
          {
            "reference": "1 Peter 2:24",
            "text": "Who his own self bare our sins in his own body on the tree, that we, being dead to sins, should live unto righteousness: by whose stripes ye were healed."
          },
          {
            "reference": "Romans 3:25-26",
            "text": "Whom God hath set forth to be a propitiation through faith in his blood, to declare his righteousness for the remission of sins that are past, through the forbearance of God; To declare, I say, at this time his righteousness: that he might be just, and the justifier of him which believeth in Jesus."
          },
          {
            "reference": "Galatians 3:13",
            "text": "Christ hath redeemed us from the curse of the law, being made a curse for us: for it is written, Cursed is every one that hangeth on a tree."
          },
          {
            "reference": "1 Peter 3:18",
            "text": "For Christ also hath once suffered for sins, the just for the unjust, that he might bring us to God."
          }
        ]
      },
      "Propitiation and Expiation": {
        "title": "Satisfying God's Wrath and Removing Sin",
        "description": "Christ's death accomplished both propitiation (satisfying God's righteous wrath against sin) and expiation (removing the guilt of sin). Propitiation addresses the Godward aspect—the holy God who must punish sin has been appeased; His wrath has been turned away through the sacrifice of Christ. Expiation addresses the manward aspect—our sins have been covered, removed, blotted out. The mercy seat (hilasterion) was where blood was sprinkled on the Day of Atonement; Christ is our mercy seat, the place where God's wrath and mercy meet. In Him, justice is satisfied and sinners are cleansed.",
        "verses": [
          {
            "reference": "Romans 3:25",
            "text": "Whom God hath set forth to be a propitiation through faith in his blood."
          },
          {
            "reference": "1 John 2:2",
            "text": "And he is the propitiation for our sins: and not for ours only, but also for the sins of the whole world."
          },
          {
            "reference": "1 John 4:10",
            "text": "Herein is love, not that we loved God, but that he loved us, and sent his Son to be the propitiation for our sins."
          },
          {
            "reference": "Hebrews 2:17",
            "text": "Wherefore in all things it behoved him to be made like unto his brethren, that he might be a merciful and faithful high priest in things pertaining to God, to make reconciliation for the sins of the people."
          },
          {
            "reference": "Leviticus 16:15-16",
            "text": "Then shall he kill the goat of the sin offering, that is for the people, and bring his blood within the vail... and make an atonement for the holy place, because of the uncleanness of the children of Israel."
          },
          {
            "reference": "Psalm 103:12",
            "text": "As far as the east is from the west, so far hath he removed our transgressions from us."
          }
        ]
      },
      "Redemption and Ransom": {
        "title": "Purchased with a Price",
        "description": "Redemption language pervades Scripture's description of Christ's work. We were slaves to sin, held captive by Satan, under the curse of the law—and Christ paid the ransom price to set us free. This redemption is not paid to Satan (as if he had legitimate claims) but represents the costly price of our deliverance. Christ's blood is the purchase price. We are bought with a price and no longer belong to ourselves. This redemption is comprehensive—delivering us from sin's penalty, power, and ultimately its presence. The Exodus from Egypt foreshadowed this greater exodus accomplished through Christ's blood.",
        "verses": [
          {
            "reference": "1 Peter 1:18-19",
            "text": "Forasmuch as ye know that ye were not redeemed with corruptible things, as silver and gold, from your vain conversation received by tradition from your fathers; But with the precious blood of Christ, as of a lamb without blemish and without spot."
          },
          {
            "reference": "Mark 10:45",
            "text": "For even the Son of man came not to be ministered unto, but to minister, and to give his life a ransom for many."
          },
          {
            "reference": "Galatians 3:13",
            "text": "Christ hath redeemed us from the curse of the law, being made a curse for us."
          },
          {
            "reference": "Ephesians 1:7",
            "text": "In whom we have redemption through his blood, the forgiveness of sins, according to the riches of his grace."
          },
          {
            "reference": "Titus 2:14",
            "text": "Who gave himself for us, that he might redeem us from all iniquity, and purify unto himself a peculiar people, zealous of good works."
          },
          {
            "reference": "Revelation 5:9",
            "text": "And they sung a new song, saying, Thou art worthy to take the book, and to open the seals thereof: for thou wast slain, and hast redeemed us to God by thy blood out of every kindred, and tongue, and people, and nation."
          },
          {
            "reference": "1 Corinthians 6:20",
            "text": "For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's."
          }
        ]
      },
      "Reconciliation": {
        "title": "Enemies Made Friends",
        "description": "Sin made us enemies of God—not merely estranged but actively hostile, under His wrath. Reconciliation is the restoration of this broken relationship. Through Christ's death, the enmity is abolished, the barrier removed, and peace established between God and man. God was in Christ reconciling the world to Himself, not counting their trespasses against them. This reconciliation is not mutual negotiation but one-sided initiative—God reconciles us to Himself while we were enemies. Having been reconciled by Christ's death, we shall be saved by His life. We are now ambassadors of reconciliation, proclaiming this peace to a hostile world.",
        "verses": [
          {
            "reference": "Romans 5:10-11",
            "text": "For if, when we were enemies, we were reconciled to God by the death of his Son, much more, being reconciled, we shall be saved by his life. And not only so, but we also joy in God through our Lord Jesus Christ, by whom we have now received the atonement."
          },
          {
            "reference": "2 Corinthians 5:18-19",
            "text": "And all things are of God, who hath reconciled us to himself by Jesus Christ, and hath given to us the ministry of reconciliation; To wit, that God was in Christ, reconciling the world unto himself, not imputing their trespasses unto them."
          },
          {
            "reference": "Colossians 1:20-21",
            "text": "And, having made peace through the blood of his cross, by him to reconcile all things unto himself; by him, I say, whether they be things in earth, or things in heaven. And you, that were sometime alienated and enemies in your mind by wicked works, yet now hath he reconciled."
          },
          {
            "reference": "Ephesians 2:14-16",
            "text": "For he is our peace, who hath made both one, and hath broken down the middle wall of partition between us; Having abolished in his flesh the enmity, even the law of commandments contained in ordinances; for to make in himself of twain one new man, so making peace; And that he might reconcile both unto God in one body by the cross, having slain the enmity thereby."
          },
          {
            "reference": "Romans 8:7",
            "text": "Because the carnal mind is enmity against God: for it is not subject to the law of God, neither indeed can be."
          }
        ]
      }
    },
    "The Exaltation of Christ": {
      "The Resurrection": {
        "title": "Raised for Our Justification",
        "description": "Christ's resurrection is not merely a happy ending to a tragic story but the vindication of His person and work. The resurrection declared Him to be the Son of God with power, demonstrated the Father's acceptance of His sacrifice, and guaranteed our justification. He was delivered for our offenses and raised for our justification. The empty tomb proclaims that death could not hold Him, sin's penalty was fully paid, and the new creation has begun. Christ is the firstfruits of those who sleep—His resurrection guarantees the resurrection of all who are in Him. The resurrection transformed a band of terrified disciples into bold witnesses who turned the world upside down.",
        "verses": [
          {
            "reference": "Romans 1:4",
            "text": "And declared to be the Son of God with power, according to the spirit of holiness, by the resurrection from the dead."
          },
          {
            "reference": "Romans 4:25",
            "text": "Who was delivered for our offences, and was raised again for our justification."
          },
          {
            "reference": "1 Corinthians 15:17",
            "text": "And if Christ be not raised, your faith is vain; ye are yet in your sins."
          },
          {
            "reference": "1 Corinthians 15:20",
            "text": "But now is Christ risen from the dead, and become the firstfruits of them that slept."
          },
          {
            "reference": "Acts 2:24",
            "text": "Whom God hath raised up, having loosed the pains of death: because it was not possible that he should be holden of it."
          },
          {
            "reference": "1 Peter 1:3",
            "text": "Blessed be the God and Father of our Lord Jesus Christ, which according to his abundant mercy hath begotten us again unto a lively hope by the resurrection of Jesus Christ from the dead."
          },
          {
            "reference": "Romans 6:9",
            "text": "Knowing that Christ being raised from the dead dieth no more; death hath no more dominion over him."
          }
        ]
      },
      "The Ascension": {
        "title": "Exalted to the Right Hand of God",
        "description": "Forty days after His resurrection, Christ ascended visibly into heaven, received up in glory, and seated at the Father's right hand—the position of supreme honor and authority. The ascension completes the humiliation-exaltation pattern: He who descended is the same who ascended far above all heavens. From this throne He pours out the Spirit, intercedes for His people, and rules over all creation. The ascension marks the beginning of His heavenly session, where He awaits the subjugation of all enemies under His feet. He ascended to prepare a place for us and promised to return in the same manner—visibly, bodily, gloriously.",
        "verses": [
          {
            "reference": "Acts 1:9-11",
            "text": "And when he had spoken these things, while they beheld, he was taken up; and a cloud received him out of their sight. And while they looked stedfastly toward heaven as he went up, behold, two men stood by them in white apparel; Which also said, Ye men of Galilee, why stand ye gazing up into heaven? this same Jesus, which is taken up from you into heaven, shall so come in like manner as ye have seen him go into heaven."
          },
          {
            "reference": "Ephesians 4:8-10",
            "text": "Wherefore he saith, When he ascended up on high, he led captivity captive, and gave gifts unto men... He that descended is the same also that ascended up far above all heavens, that he might fill all things."
          },
          {
            "reference": "Hebrews 1:3",
            "text": "Who being the brightness of his glory, and the express image of his person, and upholding all things by the word of his power, when he had by himself purged our sins, sat down on the right hand of the Majesty on high."
          },
          {
            "reference": "Ephesians 1:20-21",
            "text": "Which he wrought in Christ, when he raised him from the dead, and set him at his own right hand in the heavenly places, Far above all principality, and power, and might, and dominion, and every name that is named."
          },
          {
            "reference": "Philippians 2:9-11",
            "text": "Wherefore God also hath highly exalted him, and given him a name which is above every name: That at the name of Jesus every knee should bow."
          },
          {
            "reference": "Hebrews 4:14",
            "text": "Seeing then that we have a great high priest, that is passed into the heavens, Jesus the Son of God, let us hold fast our profession."
          }
        ]
      },
      "The Session and Return": {
        "title": "Reigning Until He Comes Again",
        "description": "Christ currently reigns at the Father's right hand, exercising dominion over all creation and interceding for His people. This heavenly session continues until all enemies are made His footstool. He is now putting all things under His feet through the preaching of the gospel and the advance of His kingdom. Yet this present reign is not the consummation—Christ will return personally, visibly, and gloriously to judge the living and dead, resurrect His people, and establish His eternal kingdom. The same Jesus who ascended will return in like manner. This blessed hope animates Christian living, fuels evangelistic urgency, and comforts suffering saints.",
        "verses": [
          {
            "reference": "Hebrews 10:12-13",
            "text": "But this man, after he had offered one sacrifice for sins for ever, sat down on the right hand of God; From henceforth expecting till his enemies be made his footstool."
          },
          {
            "reference": "1 Corinthians 15:25-26",
            "text": "For he must reign, till he hath put all enemies under his feet. The last enemy that shall be destroyed is death."
          },
          {
            "reference": "Acts 3:21",
            "text": "Whom the heaven must receive until the times of restitution of all things, which God hath spoken by the mouth of all his holy prophets since the world began."
          },
          {
            "reference": "Matthew 24:30",
            "text": "And then shall appear the sign of the Son of man in heaven: and then shall all the tribes of the earth mourn, and they shall see the Son of man coming in the clouds of heaven with power and great glory."
          },
          {
            "reference": "1 Thessalonians 4:16-17",
            "text": "For the Lord himself shall descend from heaven with a shout, with the voice of the archangel, and with the trump of God: and the dead in Christ shall rise first: Then we which are alive and remain shall be caught up together with them in the clouds, to meet the Lord in the air: and so shall we ever be with the Lord."
          },
          {
            "reference": "Revelation 22:20",
            "text": "He which testifieth these things saith, Surely I come quickly. Amen. Even so, come, Lord Jesus."
          }
        ]
      }
    }
  }
}