{
  "ecclesiology": {
    "The Nature of the Church": {
      "The Definition of the Church": {
        "title": "The Called-Out Assembly",
        "description": "The word 'church' (ekklesia) means 'called-out assembly'—those whom God has called out of the world unto Himself. The church is not a building but a people, not an organization but an organism. It is the body of Christ, the household of God, the pillar and ground of truth. The church exists wherever believers gather in Christ's name—for where two or three are gathered in His name, there He is in the midst. The church is both local (congregations in specific places) and universal (all believers throughout all time). Christ loved the church and gave Himself for it.",
        "verses": [
          {
            "reference": "Matthew 16:18",
            "text": "And I say also unto thee, That thou art Peter, and upon this rock I will build my church; and the gates of hell shall not prevail against it."
          },
          {
            "reference": "Ephesians 5:25",
            "text": "Husbands, love your wives, even as Christ also loved the church, and gave himself for it."
          },
          {
            "reference": "1 Timothy 3:15",
            "text": "But if I tarry long, that thou mayest know how thou oughtest to behave thyself in the house of God, which is the church of the living God, the pillar and ground of the truth."
          },
          {
            "reference": "Matthew 18:20",
            "text": "For where two or three are gathered together in my name, there am I in the midst of them."
          },
          {
            "reference": "Acts 2:47",
            "text": "Praising God, and having favour with all the people. And the Lord added to the church daily such as should be saved."
          },
          {
            "reference": "Colossians 1:18",
            "text": "And he is the head of the body, the church: who is the beginning, the firstborn from the dead; that in all things he might have the preeminence."
          }
        ]
      },
      "The Body of Christ": {
        "title": "One Body, Many Members",
        "description": "The church is the body of Christ—He is the head, believers are the members. This is not mere metaphor but mystical union. By one Spirit we were all baptized into one body, whether Jews or Gentiles, bond or free. The body has many members with different functions, yet all are necessary. The eye cannot say to the hand, 'I have no need of you.' There is one body, one Spirit, one hope, one Lord, one faith, one baptism, one God and Father of all. The body grows and builds itself up in love as each part does its work. We are members one of another.",
        "verses": [
          {
            "reference": "1 Corinthians 12:12-13",
            "text": "For as the body is one, and hath many members, and all the members of that one body, being many, are one body: so also is Christ. For by one Spirit are we all baptized into one body, whether we be Jews or Gentiles, whether we be bond or free; and have been all made to drink into one Spirit."
          },
          {
            "reference": "1 Corinthians 12:21-22",
            "text": "And the eye cannot say unto the hand, I have no need of thee: nor again the head to the feet, I have no need of you. Nay, much more those members of the body, which seem to be more feeble, are necessary."
          },
          {
            "reference": "Ephesians 4:4-6",
            "text": "There is one body, and one Spirit, even as ye are called in one hope of your calling; One Lord, one faith, one baptism, One God and Father of all, who is above all, and through all, and in you all."
          },
          {
            "reference": "Ephesians 4:15-16",
            "text": "But speaking the truth in love, may grow up into him in all things, which is the head, even Christ: From whom the whole body fitly joined together and compacted by that which every joint supplieth, according to the effectual working in the measure of every part, maketh increase of the body unto the edifying of itself in love."
          },
          {
            "reference": "Romans 12:4-5",
            "text": "For as we have many members in one body, and all members have not the same office: So we, being many, are one body in Christ, and every one members one of another."
          },
          {
            "reference": "Colossians 1:24",
            "text": "Who now rejoice in my sufferings for you, and fill up that which is behind of the afflictions of Christ in my flesh for his body's sake, which is the church."
          }
        ]
      },
      "The Bride of Christ": {
        "title": "Prepared for the Bridegroom",
        "description": "The church is the bride of Christ, betrothed to Him and awaiting the marriage supper of the Lamb. Christ loved the church and gave Himself for her, that He might sanctify and cleanse her, presenting her to Himself as a glorious church without spot or wrinkle. The marriage relationship between husband and wife is a mystery that points to Christ and the church. John saw the holy city, New Jerusalem, coming down from God out of heaven, prepared as a bride adorned for her husband. The Spirit and the bride say, 'Come.' This imagery speaks of intimacy, covenant faithfulness, and eternal union.",
        "verses": [
          {
            "reference": "Ephesians 5:25-27",
            "text": "Husbands, love your wives, even as Christ also loved the church, and gave himself for it; That he might sanctify and cleanse it with the washing of water by the word, That he might present it to himself a glorious church, not having spot, or wrinkle, or any such thing; but that it should be holy and without blemish."
          },
          {
            "reference": "Ephesians 5:31-32",
            "text": "For this cause shall a man leave his father and mother, and shall be joined unto his wife, and they two shall be one flesh. This is a great mystery: but I speak concerning Christ and the church."
          },
          {
            "reference": "Revelation 19:7-8",
            "text": "Let us be glad and rejoice, and give honour to him: for the marriage of the Lamb is come, and his wife hath made herself ready. And to her was granted that she should be arrayed in fine linen, clean and white: for the fine linen is the righteousness of saints."
          },
          {
            "reference": "Revelation 21:2",
            "text": "And I John saw the holy city, new Jerusalem, coming down from God out of heaven, prepared as a bride adorned for her husband."
          },
          {
            "reference": "Revelation 22:17",
            "text": "And the Spirit and the bride say, Come. And let him that heareth say, Come. And let him that is athirst come. And whosoever will, let him take the water of life freely."
          },
          {
            "reference": "2 Corinthians 11:2",
            "text": "For I am jealous over you with godly jealousy: for I have espoused you to one husband, that I may present you as a chaste virgin to Christ."
          }
        ]
      }
    },
    "The Marks of the Church": {
      "The Unity of the Church": {
        "title": "That They May Be One",
        "description": "Christ prayed that His followers would be one, even as He and the Father are one—that the world might believe. This unity is not organizational uniformity but spiritual oneness in Christ. There is one body, one Spirit, one hope, one Lord, one faith, one baptism, one God. We are to endeavor to keep the unity of the Spirit in the bond of peace. Division is carnal; factions indicate spiritual immaturity. The church's unity should reflect the unity of the Godhead—diverse persons in perfect harmony. This unity is both a gift to be received and a goal to be pursued.",
        "verses": [
          {
            "reference": "John 17:21-23",
            "text": "That they all may be one; as thou, Father, art in me, and I in thee, that they also may be one in us: that the world may believe that thou hast sent me. And the glory which thou gavest me I have given them; that they may be one, even as we are one: I in them, and thou in me, that they may be made perfect in one; and that the world may know that thou hast sent me."
          },
          {
            "reference": "Ephesians 4:3-6",
            "text": "Endeavouring to keep the unity of the Spirit in the bond of peace. There is one body, and one Spirit, even as ye are called in one hope of your calling; One Lord, one faith, one baptism, One God and Father of all, who is above all, and through all, and in you all."
          },
          {
            "reference": "1 Corinthians 1:10",
            "text": "Now I beseech you, brethren, by the name of our Lord Jesus Christ, that ye all speak the same thing, and that there be no divisions among you; but that ye be perfectly joined together in the same mind and in the same judgment."
          },
          {
            "reference": "1 Corinthians 3:3",
            "text": "For ye are yet carnal: for whereas there is among you envying, and strife, and divisions, are ye not carnal, and walk as men?"
          },
          {
            "reference": "Psalm 133:1",
            "text": "Behold, how good and how pleasant it is for brethren to dwell together in unity!"
          },
          {
            "reference": "Philippians 2:2",
            "text": "Fulfil ye my joy, that ye be likeminded, having the same love, being of one accord, of one mind."
          }
        ]
      },
      "The Holiness of the Church": {
        "title": "A Holy Nation",
        "description": "The church is called to be holy, set apart from the world for God's purposes. We are a chosen generation, a royal priesthood, a holy nation, a peculiar people. Christ gave Himself for the church that He might sanctify and cleanse her. The church is the temple of the Holy Spirit—God's dwelling place. Therefore we are to cleanse ourselves from all filthiness of the flesh and spirit, perfecting holiness in the fear of God. The church must maintain moral purity through discipline, putting away from yourselves that wicked person. Holiness is not optional but essential to the church's identity.",
        "verses": [
          {
            "reference": "1 Peter 2:9",
            "text": "But ye are a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of him who hath called you out of darkness into his marvellous light."
          },
          {
            "reference": "Ephesians 5:25-26",
            "text": "Husbands, love your wives, even as Christ also loved the church, and gave himself for it; That he might sanctify and cleanse it with the washing of water by the word."
          },
          {
            "reference": "1 Corinthians 3:16-17",
            "text": "Know ye not that ye are the temple of God, and that the Spirit of God dwelleth in you? If any man defile the temple of God, him shall God destroy; for the temple of God is holy, which temple ye are."
          },
          {
            "reference": "2 Corinthians 7:1",
            "text": "Having therefore these promises, dearly beloved, let us cleanse ourselves from all filthiness of the flesh and spirit, perfecting holiness in the fear of God."
          },
          {
            "reference": "1 Corinthians 5:13",
            "text": "But them that are without God judgeth. Therefore put away from among yourselves that wicked person."
          },
          {
            "reference": "Hebrews 12:14",
            "text": "Follow peace with all men, and holiness, without which no man shall see the Lord."
          }
        ]
      }
    },
    "The Government of the Church": {
      "Christ the Head": {
        "title": "The Supreme Authority",
        "description": "Christ alone is the head of the church—He has all authority in heaven and on earth. God put all things under His feet and gave Him to be head over all things to the church. No human being, council, or tradition can usurp His headship. The church submits to Christ as a wife submits to her husband. Christ directs the church through His Word and Spirit. Every knee must bow to Him; every tongue confess that He is Lord. The church has no king but Jesus. All earthly leadership in the church derives from and is accountable to His authority.",
        "verses": [
          {
            "reference": "Ephesians 1:22-23",
            "text": "And hath put all things under his feet, and gave him to be the head over all things to the church, Which is his body, the fulness of him that filleth all in all."
          },
          {
            "reference": "Colossians 1:18",
            "text": "And he is the head of the body, the church: who is the beginning, the firstborn from the dead; that in all things he might have the preeminence."
          },
          {
            "reference": "Matthew 28:18",
            "text": "And Jesus came and spake unto them, saying, All power is given unto me in heaven and in earth."
          },
          {
            "reference": "Ephesians 5:23-24",
            "text": "For the husband is the head of the wife, even as Christ is the head of the church: and he is the saviour of the body. Therefore as the church is subject unto Christ, so let the wives be to their own husbands in every thing."
          },
          {
            "reference": "Philippians 2:10-11",
            "text": "That at the name of Jesus every knee should bow, of things in heaven, and things in earth, and things under the earth; And that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father."
          },
          {
            "reference": "Colossians 2:10",
            "text": "And ye are complete in him, which is the head of all principality and power."
          }
        ]
      },
      "Elders and Deacons": {
        "title": "Servant Leadership",
        "description": "Christ has given the church officers for its government and care. Elders (also called bishops, pastors, overseers) are to shepherd the flock of God, exercising oversight not by constraint but willingly. They must be blameless, able to teach, not given to wine, not greedy, ruling their own houses well. Deacons are servants who care for practical needs, freeing elders for prayer and the ministry of the Word. They too must be grave, not doubletongued, holding the mystery of faith in a pure conscience. These offices are qualifications-based, not merely appointed positions.",
        "verses": [
          {
            "reference": "1 Peter 5:1-3",
            "text": "The elders which are among you I exhort, who am also an elder, and a witness of the sufferings of Christ, and also a partaker of the glory that shall be revealed: Feed the flock of God which is among you, taking the oversight thereof, not by constraint, but willingly; not for filthy lucre, but of a ready mind; Neither as being lords over God's heritage, but being ensamples to the flock."
          },
          {
            "reference": "1 Timothy 3:1-2",
            "text": "This is a true saying, If a man desire the office of a bishop, he desireth a good work. A bishop then must be blameless, the husband of one wife, vigilant, sober, of good behaviour, given to hospitality, apt to teach."
          },
          {
            "reference": "Acts 6:3-4",
            "text": "Wherefore, brethren, look ye out among you seven men of honest report, full of the Holy Ghost and wisdom, whom we may appoint over this business. But we will give ourselves continually to prayer, and to the ministry of the word."
          },
          {
            "reference": "1 Timothy 3:8-9",
            "text": "Likewise must the deacons be grave, not doubletongued, not given to much wine, not greedy of filthy lucre; Holding the mystery of the faith in a pure conscience."
          },
          {
            "reference": "Titus 1:5-6",
            "text": "For this cause left I thee in Crete, that thou shouldest set in order the things that are wanting, and ordain elders in every city, as I had appointed thee: If any be blameless, the husband of one wife, having faithful children not accused of riot or unruly."
          },
          {
            "reference": "Hebrews 13:17",
            "text": "Obey them that have the rule over you, and submit yourselves: for they watch for your souls, as they that must give account, that they may do it with joy, and not with grief: for that is unprofitable for you."
          }
        ]
      }
    },
    "The Mission of the Church": {
      "The Great Commission": {
        "title": "Go and Make Disciples",
        "description": "Christ commissioned His church to make disciples of all nations, baptizing them and teaching them to observe all that He commanded. This is the church's primary mission—not social reform, political action, or cultural engagement, though these may flow from it. The gospel must be preached to every creature. We are Christ's ambassadors, imploring the world to be reconciled to God. The harvest is plentiful but the laborers are few—we must pray the Lord of the harvest to send workers. This commission remains until the end of the age.",
        "verses": [
          {
            "reference": "Matthew 28:19-20",
            "text": "Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost: Teaching them to observe all things whatsoever I have commanded you: and, lo, I am with you alway, even unto the end of the world."
          },
          {
            "reference": "Mark 16:15",
            "text": "And he said unto them, Go ye into all the world, and preach the gospel to every creature."
          },
          {
            "reference": "2 Corinthians 5:20",
            "text": "Now then we are ambassadors for Christ, as though God did beseech you by us: we pray you in Christ's stead, be ye reconciled to God."
          },
          {
            "reference": "Acts 1:8",
            "text": "But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judaea, and in Samaria, and unto the uttermost part of the earth."
          },
          {
            "reference": "Matthew 9:37-38",
            "text": "Then saith he unto his disciples, The harvest truly is plenteous, but the labourers are few; Pray ye therefore the Lord of the harvest, that he will send forth labourers into his harvest."
          },
          {
            "reference": "Romans 10:14-15",
            "text": "How then shall they call on him in whom they have not believed? and how shall they believe in him of whom they have not heard? and how shall they hear without a preacher? And how shall they preach, except they be sent?"
          }
        ]
      },
      "Worship and Edification": {
        "title": "Building Up the Body",
        "description": "The church gathers for the worship of God and the mutual edification of believers. We are to let the word of Christ dwell in us richly, teaching and admonishing one another. Forsake not the assembling of yourselves together. When the church gathers, each one has a psalm, a doctrine, a tongue, a revelation—let all things be done unto edifying. The purpose of spiritual gifts is the building up of the body. We are to grow up into Christ in all things. Worship is not entertainment; edification is not self-help. Both center on Christ and His Word.",
        "verses": [
          {
            "reference": "Colossians 3:16",
            "text": "Let the word of Christ dwell in you richly in all wisdom; teaching and admonishing one another in psalms and hymns and spiritual songs, singing with grace in your hearts to the Lord."
          },
          {
            "reference": "Hebrews 10:24-25",
            "text": "And let us consider one another to provoke unto love and to good works: Not forsaking the assembling of ourselves together, as the manner of some is; but exhorting one another: and so much the more, as ye see the day approaching."
          },
          {
            "reference": "1 Corinthians 14:26",
            "text": "How is it then, brethren? when ye come together, every one of you hath a psalm, hath a doctrine, hath a tongue, hath a revelation, hath an interpretation. Let all things be done unto edifying."
          },
          {
            "reference": "Ephesians 4:15-16",
            "text": "But speaking the truth in love, may grow up into him in all things, which is the head, even Christ: From whom the whole body fitly joined together and compacted by that which every joint supplieth."
          },
          {
            "reference": "1 Corinthians 14:12",
            "text": "Even so ye, forasmuch as ye are zealous of spiritual gifts, seek that ye may excel to the edifying of the church."
          },
          {
            "reference": "Acts 2:42",
            "text": "And they continued stedfastly in the apostles' doctrine and fellowship, and in breaking of bread, and in prayers."
          }
        ]
      }
    },
    "The Ordinances of the Church": {
      "Baptism": {
        "title": "Buried with Christ",
        "description": "Baptism is the initiatory ordinance of the church, commanded by Christ and practiced from the church's beginning. It is the outward sign of inward grace—a public confession of faith in Christ. In baptism we identify with Christ's death, burial, and resurrection. We are buried with Him by baptism into death, that like as Christ was raised, even so we should walk in newness of life. Baptism does not save but demonstrates salvation already received. It pictures the washing of regeneration and marks entrance into the visible community of faith.",
        "verses": [
          {
            "reference": "Matthew 28:19",
            "text": "Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost."
          },
          {
            "reference": "Romans 6:3-4",
            "text": "Know ye not, that so many of us as were baptized into Jesus Christ were baptized into his death? Therefore we are buried with him by baptism into death: that like as Christ was raised up from the dead by the glory of the Father, even so we also should walk in newness of life."
          },
          {
            "reference": "Acts 2:38",
            "text": "Then Peter said unto them, Repent, and be baptized every one of you in the name of Jesus Christ for the remission of sins, and ye shall receive the gift of the Holy Ghost."
          },
          {
            "reference": "Acts 8:36-38",
            "text": "And as they went on their way, they came unto a certain water: and the eunuch said, See, here is water; what doth hinder me to be baptized? And Philip said, If thou believest with all thine heart, thou mayest."
          },
          {
            "reference": "Colossians 2:12",
            "text": "Buried with him in baptism, wherein also ye are risen with him through the faith of the operation of God, who hath raised him from the dead."
          },
          {
            "reference": "1 Peter 3:21",
            "text": "The like figure whereunto even baptism doth also now save us (not the putting away of the filth of the flesh, but the answer of a good conscience toward God,) by the resurrection of Jesus Christ."
          }
        ]
      },
      "The Lord's Supper": {
        "title": "Proclaiming His Death",
        "description": "The Lord's Supper is the ongoing ordinance by which the church remembers Christ's death until He comes. On the night He was betrayed, Jesus took bread and the cup, establishing this memorial: 'This do in remembrance of me.' As often as we eat this bread and drink this cup, we proclaim the Lord's death. It is communion—participation in the body and blood of Christ. The church is to examine itself before partaking, discerning the Lord's body. Those who eat and drink unworthily eat and drink judgment to themselves. It is a solemn, sacred feast of remembrance and proclamation.",
        "verses": [
          {
            "reference": "1 Corinthians 11:23-26",
            "text": "For I have received of the Lord that which also I delivered unto you, That the Lord Jesus the same night in which he was betrayed took bread: And when he had given thanks, he brake it, and said, Take, eat: this is my body, which is broken for you: this do in remembrance of me. After the same manner also he took the cup, when he had supped, saying, This cup is the new testament in my blood: this do ye, as oft as ye drink it, in remembrance of me. For as often as ye eat this bread, and drink this cup, ye do shew the Lord's death till he come."
          },
          {
            "reference": "1 Corinthians 10:16",
            "text": "The cup of blessing which we bless, is it not the communion of the blood of Christ? The bread which we break, is it not the communion of the body of Christ?"
          },
          {
            "reference": "1 Corinthians 11:28-29",
            "text": "But let a man examine himself, and so let him eat of that bread, and drink of that cup. For he that eateth and drinketh unworthily, eateth and drinketh damnation to himself, not discerning the Lord's body."
          },
          {
            "reference": "Matthew 26:26-28",
            "text": "And as they were eating, Jesus took bread, and blessed it, and brake it, and gave it to the disciples, and said, Take, eat; this is my body. And he took the cup, and gave thanks, and gave it to them, saying, Drink ye all of it; For this is my blood of the new testament, which is shed for many for the remission of sins."
          },
          {
            "reference": "Luke 22:19",
            "text": "And he took bread, and gave thanks, and brake it, and gave unto them, saying, This is my body which is given for you: this do in remembrance of me."
          },
          {
            "reference": "Acts 2:42",
            "text": "And they continued stedfastly in the apostles' doctrine and fellowship, and in breaking of bread, and in prayers."
          }
        ]
      }
    }
  }
}