{
  "eschatology": {
    "Death and the Intermediate State": {
      "The Reality of Death": {
        "title": "The Wages of Sin",
        "description": "Death entered the world through sin—by one man sin entered, and death by sin. It is appointed unto men once to die, and after this the judgment. Death is the separation of soul from body, the dissolution of our earthly tent. Yet for the believer, death has lost its sting. Christ has abolished death and brought life and immortality to light through the gospel. To be absent from the body is to be present with the Lord. For the Christian, death is gain—to depart and be with Christ is far better. The last enemy to be destroyed is death itself, which will be swallowed up in victory at the resurrection.",
        "verses": [
          {
            "reference": "Romans 5:12",
            "text": "Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned."
          },
          {
            "reference": "Hebrews 9:27",
            "text": "And as it is appointed unto men once to die, but after this the judgment."
          },
          {
            "reference": "2 Corinthians 5:8",
            "text": "We are confident, I say, and willing rather to be absent from the body, and to be present with the Lord."
          },
          {
            "reference": "Philippians 1:21-23",
            "text": "For to me to live is Christ, and to die is gain. For I am in a strait betwixt two, having a desire to depart, and to be with Christ; which is far better."
          },
          {
            "reference": "1 Corinthians 15:55-56",
            "text": "O death, where is thy sting? O grave, where is thy victory? The sting of death is sin; and the strength of sin is the law."
          },
          {
            "reference": "2 Timothy 1:10",
            "text": "But is now made manifest by the appearing of our Saviour Jesus Christ, who hath abolished death, and hath brought life and immortality to light through the gospel."
          }
        ]
      },
      "The Intermediate State": {
        "title": "Between Death and Resurrection",
        "description": "Between death and the final resurrection, the souls of believers are made perfect in holiness and enter into the presence of Christ in heaven. This is the intermediate state—conscious blessedness awaiting the resurrection of the body. The souls under the altar cry out to God, showing conscious awareness. Paradise is where the departed righteous dwell with Christ. Abraham's bosom depicts the comfort of the righteous dead. While the body sleeps in the grave, the spirit returns to God who gave it. This state, though blessed, is incomplete—we await the redemption of our bodies and the consummation of all things.",
        "verses": [
          {
            "reference": "Luke 23:43",
            "text": "And Jesus said unto him, Verily I say unto thee, To day shalt thou be with me in paradise."
          },
          {
            "reference": "Revelation 6:9-10",
            "text": "And when he had opened the fifth seal, I saw under the altar the souls of them that were slain for the word of God, and for the testimony which they held: And they cried with a loud voice, saying, How long, O Lord, holy and true, dost thou not judge and avenge our blood on them that dwell on the earth?"
          },
          {
            "reference": "Luke 16:22-23",
            "text": "And it came to pass, that the beggar died, and was carried by the angels into Abraham's bosom: the rich man also died, and was buried; And in hell he lift up his eyes, being in torments."
          },
          {
            "reference": "Ecclesiastes 12:7",
            "text": "Then shall the dust return to the earth as it was: and the spirit shall return unto God who gave it."
          },
          {
            "reference": "2 Corinthians 5:1",
            "text": "For we know that if our earthly house of this tabernacle were dissolved, we have a building of God, an house not made with hands, eternal in the heavens."
          },
          {
            "reference": "Hebrews 12:23",
            "text": "To the general assembly and church of the firstborn, which are written in heaven, and to God the Judge of all, and to the spirits of just men made perfect."
          }
        ]
      }
    },
    "The Second Coming of Christ": {
      "The Promise of His Return": {
        "title": "He Will Come Again",
        "description": "The same Jesus who ascended will return in like manner—personally, visibly, bodily, and gloriously. This is the blessed hope of the church, the promise that sustains believers through tribulation. He who testified these things says, 'Surely I come quickly.' The early church lived in eager expectation: 'Even so, come, Lord Jesus.' His coming will be sudden, unexpected by the world—like a thief in the night, like lightning flashing across the sky. Every eye shall see Him, and all tribes of the earth will mourn. This is not metaphor but the actual, physical return of Christ to earth.",
        "verses": [
          {
            "reference": "Acts 1:11",
            "text": "Which also said, Ye men of Galilee, why stand ye gazing up into heaven? this same Jesus, which is taken up from you into heaven, shall so come in like manner as ye have seen him go into heaven."
          },
          {
            "reference": "Titus 2:13",
            "text": "Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ."
          },
          {
            "reference": "Revelation 22:20",
            "text": "He which testifieth these things saith, Surely I come quickly. Amen. Even so, come, Lord Jesus."
          },
          {
            "reference": "1 Thessalonians 5:2",
            "text": "For yourselves know perfectly that the day of the Lord so cometh as a thief in the night."
          },
          {
            "reference": "Matthew 24:27",
            "text": "For as the lightning cometh out of the east, and shineth even unto the west; so shall also the coming of the Son of man be."
          },
          {
            "reference": "Revelation 1:7",
            "text": "Behold, he cometh with clouds; and every eye shall see him, and they also which pierced him: and all kindreds of the earth shall wail because of him. Even so, Amen."
          }
        ]
      },
      "The Manner of His Coming": {
        "title": "With Power and Great Glory",
        "description": "Christ's return will be in power and great glory, a stark contrast to His humble first advent. He will come on the clouds of heaven with His mighty angels in flaming fire. The Lord Himself shall descend from heaven with a shout, with the voice of the archangel, and with the trump of God. He will be revealed from heaven, taking vengeance on those who know not God. His coming will shake the heavens and earth. The sign of the Son of Man will appear in heaven, and all nations will see Him coming. This glorious appearing will vindicate the faith of all who trusted Him.",
        "verses": [
          {
            "reference": "Matthew 24:30",
            "text": "And then shall appear the sign of the Son of man in heaven: and then shall all the tribes of the earth mourn, and they shall see the Son of man coming in the clouds of heaven with power and great glory."
          },
          {
            "reference": "2 Thessalonians 1:7-8",
            "text": "And to you who are troubled rest with us, when the Lord Jesus shall be revealed from heaven with his mighty angels, In flaming fire taking vengeance on them that know not God, and that obey not the gospel of our Lord Jesus Christ."
          },
          {
            "reference": "1 Thessalonians 4:16",
            "text": "For the Lord himself shall descend from heaven with a shout, with the voice of the archangel, and with the trump of God: and the dead in Christ shall rise first."
          },
          {
            "reference": "Matthew 25:31",
            "text": "When the Son of man shall come in his glory, and all the holy angels with him, then shall he sit upon the throne of his glory."
          },
          {
            "reference": "Mark 13:26",
            "text": "And then shall they see the Son of man coming in the clouds with great power and glory."
          },
          {
            "reference": "Hebrews 12:26",
            "text": "Whose voice then shook the earth: but now he hath promised, saying, Yet once more I shake not the earth only, but also heaven."
          }
        ]
      },
      "The Time Unknown": {
        "title": "Watch and Be Ready",
        "description": "Of that day and hour knows no man—not the angels of heaven, nor the Son in His humiliation, but the Father only. Christ's return will catch the world unaware, as in the days of Noah. Therefore we are commanded to watch, for we know not what hour our Lord comes. The wise virgins had oil in their lamps; the foolish were unprepared. We are to be found faithful when He comes, occupying till He returns. The uncertainty of timing is intentional—it keeps believers vigilant and holy, always ready for His appearing. Those who love His appearing will receive the crown of righteousness.",
        "verses": [
          {
            "reference": "Matthew 24:36",
            "text": "But of that day and hour knoweth no man, no, not the angels of heaven, but my Father only."
          },
          {
            "reference": "Matthew 24:42-44",
            "text": "Watch therefore: for ye know not what hour your Lord doth come. But know this, that if the goodman of the house had known in what watch the thief would come, he would have watched, and would not have suffered his house to be broken up. Therefore be ye also ready: for in such an hour as ye think not the Son of man cometh."
          },
          {
            "reference": "Matthew 24:37-39",
            "text": "But as the days of Noe were, so shall also the coming of the Son of man be. For as in the days that were before the flood they were eating and drinking, marrying and giving in marriage, until the day that Noe entered into the ark, And knew not until the flood came, and took them all away; so shall also the coming of the Son of man be."
          },
          {
            "reference": "Matthew 25:13",
            "text": "Watch therefore, for ye know neither the day nor the hour wherein the Son of man cometh."
          },
          {
            "reference": "Luke 19:13",
            "text": "And he called his ten servants, and delivered them ten pounds, and said unto them, Occupy till I come."
          },
          {
            "reference": "2 Timothy 4:8",
            "text": "Henceforth there is laid up for me a crown of righteousness, which the Lord, the righteous judge, shall give me at that day: and not to me only, but unto all them also that love his appearing."
          }
        ]
      }
    },
    "The Resurrection": {
      "The Resurrection of Christ": {
        "title": "The Firstfruits of Those Who Sleep",
        "description": "Christ's resurrection is the foundation of our hope. If Christ be not risen, our faith is vain and we are still in our sins. But now is Christ risen from the dead and become the firstfruits of them that slept. His resurrection guarantees ours—as in Adam all die, so in Christ shall all be made alive. The same power that raised Christ from the dead will raise us. His resurrection was bodily—He invited Thomas to touch His wounds, ate fish with His disciples, and declared He was not a spirit. The resurrection body is real, physical, yet glorified and transformed.",
        "verses": [
          {
            "reference": "1 Corinthians 15:17-20",
            "text": "And if Christ be not raised, your faith is vain; ye are yet in your sins. Then they also which are fallen asleep in Christ are perished. If in this life only we have hope in Christ, we are of all men most miserable. But now is Christ risen from the dead, and become the firstfruits of them that slept."
          },
          {
            "reference": "1 Corinthians 15:22-23",
            "text": "For as in Adam all die, even so in Christ shall all be made alive. But every man in his own order: Christ the firstfruits; afterward they that are Christ's at his coming."
          },
          {
            "reference": "Romans 8:11",
            "text": "But if the Spirit of him that raised up Jesus from the dead dwell in you, he that raised up Christ from the dead shall also quicken your mortal bodies by his Spirit that dwelleth in you."
          },
          {
            "reference": "John 20:27",
            "text": "Then saith he to Thomas, Reach hither thy finger, and behold my hands; and reach hither thy hand, and thrust it into my side: and be not faithless, but believing."
          },
          {
            "reference": "Luke 24:39",
            "text": "Behold my hands and my feet, that it is I myself: handle me, and see; for a spirit hath not flesh and bones, as ye see me have."
          },
          {
            "reference": "Acts 2:24",
            "text": "Whom God hath raised up, having loosed the pains of death: because it was not possible that he should be holden of it."
          }
        ]
      },
      "The Resurrection of Believers": {
        "title": "Raised in Glory",
        "description": "At Christ's coming, the dead in Christ shall rise first. This mortal must put on immortality; this corruptible must put on incorruption. The resurrection body will be like Christ's glorious body—sown in corruption, raised in incorruption; sown in dishonor, raised in glory; sown in weakness, raised in power; sown a natural body, raised a spiritual body. We shall be changed in a moment, in the twinkling of an eye, at the last trump. Those alive at His coming will be caught up together with the risen saints to meet the Lord in the air. So shall we ever be with the Lord.",
        "verses": [
          {
            "reference": "1 Thessalonians 4:16-17",
            "text": "For the Lord himself shall descend from heaven with a shout, with the voice of the archangel, and with the trump of God: and the dead in Christ shall rise first: Then we which are alive and remain shall be caught up together with them in the clouds, to meet the Lord in the air: and so shall we ever be with the Lord."
          },
          {
            "reference": "1 Corinthians 15:42-44",
            "text": "So also is the resurrection of the dead. It is sown in corruption; it is raised in incorruption: It is sown in dishonour; it is raised in glory: it is sown in weakness; it is raised in power: It is sown a natural body; it is raised a spiritual body. There is a natural body, and there is a spiritual body."
          },
          {
            "reference": "1 Corinthians 15:51-52",
            "text": "Behold, I shew you a mystery; We shall not all sleep, but we shall all be changed, In a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed."
          },
          {
            "reference": "Philippians 3:21",
            "text": "Who shall change our vile body, that it may be fashioned like unto his glorious body, according to the working whereby he is able even to subdue all things unto himself."
          },
          {
            "reference": "1 John 3:2",
            "text": "Beloved, now are we the sons of God, and it doth not yet appear what we shall be: but we know that, when he shall appear, we shall be like him; for we shall see him as he is."
          },
          {
            "reference": "John 5:28-29",
            "text": "Marvel not at this: for the hour is coming, in the which all that are in the graves shall hear his voice, And shall come forth; they that have done good, unto the resurrection of life; and they that have done evil, unto the resurrection of damnation."
          }
        ]
      }
    },
    "The Final Judgment": {
      "The Judgment Seat of Christ": {
        "title": "Believers Judged for Rewards",
        "description": "All believers will stand before the judgment seat of Christ to give account for deeds done in the body, whether good or bad. This is not a judgment of condemnation—there is no condemnation for those in Christ Jesus—but a judgment of works for rewards. Our works will be tested by fire; some will receive rewards, some will suffer loss though saved. This judgment will reveal the quality of each one's work. Faithful service will be rewarded; wood, hay, and stubble will be burned up. Every secret thing will come to light. We labor to be accepted of Him at that day.",
        "verses": [
          {
            "reference": "2 Corinthians 5:10",
            "text": "For we must all appear before the judgment seat of Christ; that every one may receive the things done in his body, according to that he hath done, whether it be good or bad."
          },
          {
            "reference": "Romans 14:10-12",
            "text": "But why dost thou judge thy brother? or why dost thou set at nought thy brother? for we shall all stand before the judgment seat of Christ. For it is written, As I live, saith the Lord, every knee shall bow to me, and every tongue shall confess to God. So then every one of us shall give account of himself to God."
          },
          {
            "reference": "1 Corinthians 3:13-15",
            "text": "Every man's work shall be made manifest: for the day shall declare it, because it shall be revealed by fire; and the fire shall try every man's work of what sort it is. If any man's work abide which he hath built thereupon, he shall receive a reward. If any man's work shall be burned, he shall suffer loss: but he himself shall be saved; yet so as by fire."
          },
          {
            "reference": "1 Corinthians 4:5",
            "text": "Therefore judge nothing before the time, until the Lord come, who both will bring to light the hidden things of darkness, and will make manifest the counsels of the hearts: and then shall every man have praise of God."
          },
          {
            "reference": "2 Corinthians 5:9",
            "text": "Wherefore we labour, that, whether present or absent, we may be accepted of him."
          },
          {
            "reference": "Revelation 22:12",
            "text": "And, behold, I come quickly; and my reward is with me, to give every man according as his work shall be."
          }
        ]
      },
      "The Great White Throne": {
        "title": "Final Judgment of the Lost",
        "description": "John saw a great white throne and Him who sat on it, from whose face the earth and heaven fled away. The dead, small and great, stood before God. Books were opened, and another book—the book of life. The dead were judged according to their works. Death and hell were cast into the lake of fire. Whoever was not found in the book of life was cast into the lake of fire. This is the second death. This final judgment is terrifying in its finality—there is no appeal, no excuse, no escape. Every idle word will be accounted for. God will render to every man according to his deeds.",
        "verses": [
          {
            "reference": "Revelation 20:11-12",
            "text": "And I saw a great white throne, and him that sat on it, from whose face the earth and the heaven fled away; and there was found no place for them. And I saw the dead, small and great, stand before God; and the books were opened: and another book was opened, which is the book of life: and the dead were judged out of those things which were written in the books, according to their works."
          },
          {
            "reference": "Revelation 20:14-15",
            "text": "And death and hell were cast into the lake of fire. This is the second death. And whosoever was not found written in the book of life was cast into the lake of fire."
          },
          {
            "reference": "Matthew 12:36",
            "text": "But I say unto you, That every idle word that men shall speak, they shall give account thereof in the day of judgment."
          },
          {
            "reference": "Romans 2:5-6",
            "text": "But after thy hardness and impenitent heart treasurest up unto thyself wrath against the day of wrath and revelation of the righteous judgment of God; Who will render to every man according to his deeds."
          },
          {
            "reference": "Ecclesiastes 12:14",
            "text": "For God shall bring every work into judgment, with every secret thing, whether it be good, or whether it be evil."
          },
          {
            "reference": "Acts 17:31",
            "text": "Because he hath appointed a day, in the which he will judge the world in righteousness by that man whom he hath ordained; whereof he hath given assurance unto all men, in that he hath raised him from the dead."
          }
        ]
      }
    },
    "Eternal Destinies": {
      "Hell and Eternal Punishment": {
        "title": "The Lake of Fire",
        "description": "Scripture teaches the reality of eternal punishment for those who reject Christ. Hell is described as a lake burning with fire and brimstone, where the worm dies not and the fire is not quenched. The smoke of their torment ascends forever and ever; they have no rest day or night. This is everlasting punishment, as eternal as the life of the righteous. It was prepared for the devil and his angels but awaits all whose names are not in the book of life. The severity of this doctrine underscores the urgency of the gospel and the infinite cost of rejecting Christ.",
        "verses": [
          {
            "reference": "Revelation 20:10",
            "text": "And the devil that deceived them was cast into the lake of fire and brimstone, where the beast and the false prophet are, and shall be tormented day and night for ever and ever."
          },
          {
            "reference": "Mark 9:43-44",
            "text": "And if thy hand offend thee, cut it off: it is better for thee to enter into life maimed, than having two hands to go into hell, into the fire that never shall be quenched: Where their worm dieth not, and the fire is not quenched."
          },
          {
            "reference": "Revelation 14:11",
            "text": "And the smoke of their torment ascendeth up for ever and ever: and they have no rest day nor night, who worship the beast and his image, and whosoever receiveth the mark of his name."
          },
          {
            "reference": "Matthew 25:41",
            "text": "Then shall he say also unto them on the left hand, Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels."
          },
          {
            "reference": "Matthew 25:46",
            "text": "And these shall go away into everlasting punishment: but the righteous into life eternal."
          },
          {
            "reference": "2 Thessalonians 1:9",
            "text": "Who shall be punished with everlasting destruction from the presence of the Lord, and from the glory of his power."
          }
        ]
      },
      "Heaven and Eternal Life": {
        "title": "The New Jerusalem",
        "description": "For the redeemed, eternity brings unimaginable blessing. God shall wipe away all tears; there shall be no more death, sorrow, crying, or pain. The holy city, New Jerusalem, comes down from God out of heaven, prepared as a bride adorned for her husband. God Himself will dwell with His people. We shall see His face; His name shall be on our foreheads. There shall be no night there; no need of sun or moon, for the glory of God and the Lamb are its light. The tree of life yields its fruit, and the nations are healed. Forever we shall reign with Christ, enjoying the beatific vision.",
        "verses": [
          {
            "reference": "Revelation 21:4",
            "text": "And God shall wipe away all tears from their eyes; and there shall be no more death, neither sorrow, nor crying, neither shall there be any more pain: for the former things are passed away."
          },
          {
            "reference": "Revelation 21:2-3",
            "text": "And I John saw the holy city, new Jerusalem, coming down from God out of heaven, prepared as a bride adorned for her husband. And I heard a great voice out of heaven saying, Behold, the tabernacle of God is with men, and he will dwell with them, and they shall be his people, and God himself shall be with them, and be their God."
          },
          {
            "reference": "Revelation 22:3-5",
            "text": "And there shall be no more curse: but the throne of God and of the Lamb shall be in it; and his servants shall serve him: And they shall see his face; and his name shall be in their foreheads. And there shall be no night there; and they need no candle, neither light of the sun; for the Lord God giveth them light: and they shall reign for ever and ever."
          },
          {
            "reference": "Revelation 21:23",
            "text": "And the city had no need of the sun, neither of the moon, to shine in it: for the glory of God did lighten it, and the Lamb is the light thereof."
          },
          {
            "reference": "1 Corinthians 2:9",
            "text": "But as it is written, Eye hath not seen, nor ear heard, neither have entered into the heart of man, the things which God hath prepared for them that love him."
          },
          {
            "reference": "John 14:2-3",
            "text": "In my Father's house are many mansions: if it were not so, I would have told you. I go to prepare a place for you. And if I go and prepare a place for you, I will come again, and receive you unto myself; that where I am, there ye may be also."
          }
        ]
      },
      "New Heavens and New Earth": {
        "title": "All Things Made New",
        "description": "God has promised new heavens and a new earth wherein dwells righteousness. The present heavens and earth will be dissolved by fire, making way for the new creation. The elements shall melt with fervent heat; the earth and its works shall be burned up. But God will create new heavens and a new earth. The first things will pass away; He makes all things new. This is not mere renovation but new creation—the restoration of all things, the cosmic redemption anticipated since the fall. Creation itself will be delivered from the bondage of corruption into the glorious liberty of the children of God.",
        "verses": [
          {
            "reference": "2 Peter 3:13",
            "text": "Nevertheless we, according to his promise, look for new heavens and a new earth, wherein dwelleth righteousness."
          },
          {
            "reference": "2 Peter 3:10-12",
            "text": "But the day of the Lord will come as a thief in the night; in the which the heavens shall pass away with a great noise, and the elements shall melt with fervent heat, the earth also and the works that are therein shall be burned up. Seeing then that all these things shall be dissolved, what manner of persons ought ye to be in all holy conversation and godliness, Looking for and hasting unto the coming of the day of God, wherein the heavens being on fire shall be dissolved, and the elements shall melt with fervent heat?"
          },
          {
            "reference": "Revelation 21:1",
            "text": "And I saw a new heaven and a new earth: for the first heaven and the first earth were passed away; and there was no more sea."
          },
          {
            "reference": "Revelation 21:5",
            "text": "And he that sat upon the throne said, Behold, I make all things new. And he said unto me, Write: for these words are true and faithful."
          },
          {
            "reference": "Isaiah 65:17",
            "text": "For, behold, I create new heavens and a new earth: and the former shall not be remembered, nor come into mind."
          },
          {
            "reference": "Romans 8:21",
            "text": "Because the creature itself also shall be delivered from the bondage of corruption into the glorious liberty of the children of God."
          }
        ]
      }
    }
  }
}