{
  "i_am_statements": {
    "The Seven I AM Statements in John": {
      "I Am the Bread of Life": {
        "title": "Spiritual Sustenance",
        "description": "After feeding the five thousand, Jesus declared Himself the true bread from heaven—the sustenance of eternal life. Just as physical bread sustains bodily life, Jesus sustains spiritual life. Unlike manna that sustained Israel temporarily in the wilderness, Jesus gives life eternally. Those who come to Him will never hunger; those who believe will never thirst. This statement emphasizes that Jesus alone satisfies the soul's deepest hunger and provides nourishment that endures to everlasting life.",
        "verses": [
          {
            "reference": "John 6:35",
            "text": "And Jesus said unto them, I am the bread of life: he that cometh to me shall never hunger; and he that believeth on me shall never thirst."
          },
          {
            "reference": "John 6:48-51",
            "text": "I am that bread of life. Your fathers did eat manna in the wilderness, and are dead. This is the bread which cometh down from heaven, that a man may eat thereof, and not die. I am the living bread which came down from heaven: if any man eat of this bread, he shall live for ever: and the bread that I will give is my flesh, which I will give for the life of the world."
          }
        ]
      },
      "I Am the Light of the World": {
        "title": "Illumination and Guidance",
        "description": "During the Feast of Tabernacles, when giant candelabras illuminated the temple courts, Jesus proclaimed Himself the true light. Light reveals, guides, and gives life; darkness conceals, confuses, and represents death. Jesus illuminates truth, exposes sin, guides the path of life, and overcomes the darkness of ignorance and evil. Those who follow Him escape the darkness of spiritual blindness and walk in the light of life.",
        "verses": [
          {
            "reference": "John 8:12",
            "text": "Then spake Jesus again unto them, saying, I am the light of the world: he that followeth me shall not walk in darkness, but shall have the light of life."
          },
          {
            "reference": "John 9:5",
            "text": "As long as I am in the world, I am the light of the world."
          },
          {
            "reference": "John 12:46",
            "text": "I am come a light into the world, that whosoever believeth on me should not abide in darkness."
          }
        ]
      },
      "I Am the Door": {
        "title": "The Only Entrance",
        "description": "Using shepherd imagery familiar to His audience, Jesus declared Himself the door of the sheepfold—the only legitimate entrance to safety and salvation. Ancient shepherds often slept across the sheepfold's entrance, literally becoming the door. All who enter through Christ find salvation; those who climb in another way are thieves and robbers. This exclusive claim affirms that Jesus is the only way to God, the only access to the Father's fold.",
        "verses": [
          {
            "reference": "John 10:7",
            "text": "Then said Jesus unto them again, Verily, verily, I say unto you, I am the door of the sheep."
          },
          {
            "reference": "John 10:9",
            "text": "I am the door: by me if any man enter in, he shall be saved, and shall go in and out, and find pasture."
          }
        ]
      },
      "I Am the Good Shepherd": {
        "title": "Sacrificial Care",
        "description": "Building on the door imagery, Jesus identifies Himself as the Good Shepherd who lays down His life for the sheep. Unlike hired hands who flee when wolves attack, the Good Shepherd sacrifices Himself for His flock. He knows His sheep intimately—each by name—and they know His voice. This statement anticipates the cross where Jesus, the Shepherd, would be struck and die for His sheep, gathering them into one fold under one Shepherd.",
        "verses": [
          {
            "reference": "John 10:11",
            "text": "I am the good shepherd: the good shepherd giveth his life for the sheep."
          },
          {
            "reference": "John 10:14-15",
            "text": "I am the good shepherd, and know my sheep, and am known of mine. As the Father knoweth me, even so know I the Father: and I lay down my life for the sheep."
          },
          {
            "reference": "John 10:27-28",
            "text": "My sheep hear my voice, and I know them, and they follow me: And I give unto them eternal life; and they shall never perish, neither shall any man pluck them out of my hand."
          }
        ]
      },
      "I Am the Resurrection and the Life": {
        "title": "Victory Over Death",
        "description": "At Lazarus's tomb, Jesus made His most dramatic claim: He is not merely a future hope but the present reality of resurrection and life. Belief in Him transcends physical death—the believer who dies will live, and the one who lives and believes will never truly die. Jesus then demonstrated this claim by raising Lazarus from four days' death, proving His authority over death itself and foreshadowing His own resurrection.",
        "verses": [
          {
            "reference": "John 11:25-26",
            "text": "Jesus said unto her, I am the resurrection, and the life: he that believeth in me, though he were dead, yet shall he live: And whosoever liveth and believeth in me shall never die. Believest thou this?"
          },
          {
            "reference": "John 11:43-44",
            "text": "And when he thus had spoken, he cried with a loud voice, Lazarus, come forth. And he that was dead came forth, bound hand and foot with graveclothes: and his face was bound about with a napkin. Jesus saith unto them, Loose him, and let him go."
          }
        ]
      },
      "I Am the Way, the Truth, and the Life": {
        "title": "Exclusive Access to the Father",
        "description": "In the upper room, responding to Thomas's question about the way, Jesus declared Himself the exclusive path to God. He is the way—the only route to the Father; the truth—the full revelation of God; the life—the source of eternal life. No one comes to the Father except through Him. This comprehensive claim excludes all other paths to God while opening wide the door through Christ alone.",
        "verses": [
          {
            "reference": "John 14:6",
            "text": "Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me."
          },
          {
            "reference": "John 14:7",
            "text": "If ye had known me, ye should have known my Father also: and from henceforth ye know him, and have seen him."
          }
        ]
      },
      "I Am the True Vine": {
        "title": "Vital Union",
        "description": "Using Israel's symbol of the vine, Jesus declared Himself the true vine—the source of all spiritual life and fruitfulness. Believers are branches deriving their life from vital union with Him. Apart from Christ, they can do nothing; abiding in Him, they bear much fruit. The Father, as vinedresser, prunes fruitful branches for greater yield and removes fruitless ones. This statement emphasizes the necessity of continual dependence upon Christ for spiritual vitality and productivity.",
        "verses": [
          {
            "reference": "John 15:1",
            "text": "I am the true vine, and my Father is the husbandman."
          },
          {
            "reference": "John 15:5",
            "text": "I am the vine, ye are the branches: He that abideth in me, and I in him, the same bringeth forth much fruit: for without me ye can do nothing."
          },
          {
            "reference": "John 15:7-8",
            "text": "If ye abide in me, and my words abide in you, ye shall ask what ye will, and it shall be done unto you. Herein is my Father glorified, that ye bear much fruit; so shall ye be my disciples."
          }
        ]
      }
    },
    "The Absolute I AM": {
      "Before Abraham Was, I AM": {
        "title": "The Divine Name",
        "description": "In His most shocking claim, Jesus appropriated the divine name revealed to Moses at the burning bush. 'I AM' (Greek: ego eimi) echoes God's self-revelation as 'I AM THAT I AM' (Hebrew: ehyeh asher ehyeh). By saying 'Before Abraham was, I am,' Jesus claimed not merely pre-existence but eternal, self-existent deity. The Jews understood perfectly—they took up stones to kill Him for blasphemy. This claim stands at the heart of Christ's identity: He is not a prophet pointing to God but God Himself incarnate.",
        "verses": [
          {
            "reference": "John 8:58",
            "text": "Jesus said unto them, Verily, verily, I say unto you, Before Abraham was, I am."
          },
          {
            "reference": "Exodus 3:14",
            "text": "And God said unto Moses, I AM THAT I AM: and he said, Thus shalt thou say unto the children of Israel, I AM hath sent me unto you."
          },
          {
            "reference": "John 8:24",
            "text": "I said therefore unto you, that ye shall die in your sins: for if ye believe not that I am he, ye shall die in your sins."
          },
          {
            "reference": "John 18:5-6",
            "text": "They answered him, Jesus of Nazareth. Jesus saith unto them, I am he. And Judas also, which betrayed him, stood with them. As soon then as he had said unto them, I am he, they went backward, and fell to the ground."
          }
        ]
      }
    }
  }
}