{
  "kingdom_of_god": {
    "The Nature of the Kingdom": {
      "The Kingdom Defined": {
        "title": "God's Sovereign Rule",
        "description": "The kingdom of God is the reign of God over all creation—His sovereign rule exercised through His appointed King, Jesus Christ. It is not primarily a place but a reign, not territory but authority. The kingdom is wherever God's will is done, wherever His rule is acknowledged. It is both a present reality (the kingdom is at hand, the kingdom is within you) and a future consummation (thy kingdom come). The kingdom was the central theme of Jesus' preaching and the burden of apostolic proclamation.",
        "verses": [
          {
            "reference": "Matthew 4:17",
            "text": "From that time Jesus began to preach, and to say, Repent: for the kingdom of heaven is at hand."
          },
          {
            "reference": "Luke 17:20-21",
            "text": "And when he was demanded of the Pharisees, when the kingdom of God should come, he answered them and said, The kingdom of God cometh not with observation: Neither shall they say, Lo here! or, lo there! for, behold, the kingdom of God is within you."
          },
          {
            "reference": "Matthew 6:10",
            "text": "Thy kingdom come. Thy will be done in earth, as it is in heaven."
          },
          {
            "reference": "Psalm 103:19",
            "text": "The LORD hath prepared his throne in the heavens; and his kingdom ruleth over all."
          },
          {
            "reference": "Daniel 4:34-35",
            "text": "I blessed the most High, and I praised and honoured him that liveth for ever, whose dominion is an everlasting dominion, and his kingdom is from generation to generation: And all the inhabitants of the earth are reputed as nothing: and he doeth according to his will."
          },
          {
            "reference": "Acts 28:31",
            "text": "Preaching the kingdom of God, and teaching those things which concern the Lord Jesus Christ, with all confidence, no man forbidding him."
          }
        ]
      },
      "Not of This World": {
        "title": "A Spiritual Kingdom",
        "description": "Jesus declared to Pilate that His kingdom is not of this world. If it were, His servants would fight. The kingdom of God is not meat and drink but righteousness, peace, and joy in the Holy Ghost. It does not come with outward observation—no one can point and say 'here it is' or 'there it is.' The kingdom conquers not through political power or military might but through the preaching of the gospel and the work of the Spirit. It is entered not by birth or citizenship but by new birth—being born again of water and Spirit.",
        "verses": [
          {
            "reference": "John 18:36",
            "text": "Jesus answered, My kingdom is not of this world: if my kingdom were of this world, then would my servants fight, that I should not be delivered to the Jews: but now is my kingdom not from hence."
          },
          {
            "reference": "Romans 14:17",
            "text": "For the kingdom of God is not meat and drink; but righteousness, and peace, and joy in the Holy Ghost."
          },
          {
            "reference": "John 3:3-5",
            "text": "Jesus answered and said unto him, Verily, verily, I say unto thee, Except a man be born again, he cannot see the kingdom of God... Except a man be born of water and of the Spirit, he cannot enter into the kingdom of God."
          },
          {
            "reference": "1 Corinthians 4:20",
            "text": "For the kingdom of God is not in word, but in power."
          },
          {
            "reference": "Luke 17:20-21",
            "text": "The kingdom of God cometh not with observation: Neither shall they say, Lo here! or, lo there! for, behold, the kingdom of God is within you."
          },
          {
            "reference": "Colossians 1:13",
            "text": "Who hath delivered us from the power of darkness, and hath translated us into the kingdom of his dear Son."
          }
        ]
      }
    },
    "The King of the Kingdom": {
      "Christ the King": {
        "title": "King of Kings",
        "description": "Jesus Christ is the King of the kingdom. He was born King of the Jews, lived as the rejected King, died with 'King of the Jews' above His head, rose as the victorious King, and will return as King of kings and Lord of lords. All authority in heaven and earth has been given to Him. He is the King eternal, immortal, invisible. Every knee shall bow and every tongue confess that Jesus Christ is Lord. His kingdom is not of this world, yet His dominion is universal and His reign eternal.",
        "verses": [
          {
            "reference": "Matthew 2:2",
            "text": "Saying, Where is he that is born King of the Jews? for we have seen his star in the east, and are come to worship him."
          },
          {
            "reference": "John 19:19",
            "text": "And Pilate wrote a title, and put it on the cross. And the writing was, JESUS OF NAZARETH THE KING OF THE JEWS."
          },
          {
            "reference": "Revelation 19:16",
            "text": "And he hath on his vesture and on his thigh a name written, KING OF KINGS, AND LORD OF LORDS."
          },
          {
            "reference": "Matthew 28:18",
            "text": "And Jesus came and spake unto them, saying, All power is given unto me in heaven and in earth."
          },
          {
            "reference": "1 Timothy 1:17",
            "text": "Now unto the King eternal, immortal, invisible, the only wise God, be honour and glory for ever and ever. Amen."
          },
          {
            "reference": "Philippians 2:10-11",
            "text": "That at the name of Jesus every knee should bow, of things in heaven, and things in earth, and things under the earth; And that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father."
          }
        ]
      },
      "The Davidic Throne": {
        "title": "On the Throne of David Forever",
        "description": "God promised David that his throne would be established forever. The angel Gabriel announced to Mary that God would give Jesus the throne of His father David, and He would reign over the house of Jacob forever. Peter at Pentecost declared that God raised Christ to sit on David's throne. Christ is the root and offspring of David, the righteous Branch who shall reign and prosper. The kingdom promised to David finds its ultimate fulfillment in the eternal reign of David's greater Son.",
        "verses": [
          {
            "reference": "2 Samuel 7:12-13",
            "text": "And when thy days be fulfilled, and thou shalt sleep with thy fathers, I will set up thy seed after thee, which shall proceed out of thy bowels, and I will establish his kingdom. He shall build an house for my name, and I will stablish the throne of his kingdom for ever."
          },
          {
            "reference": "Luke 1:32-33",
            "text": "He shall be great, and shall be called the Son of the Highest: and the Lord God shall give unto him the throne of his father David: And he shall reign over the house of Jacob for ever; and of his kingdom there shall be no end."
          },
          {
            "reference": "Acts 2:30-31",
            "text": "Therefore being a prophet, and knowing that God had sworn with an oath to him, that of the fruit of his loins, according to the flesh, he would raise up Christ to sit on his throne; He seeing this before spake of the resurrection of Christ."
          },
          {
            "reference": "Jeremiah 23:5-6",
            "text": "Behold, the days come, saith the LORD, that I will raise unto David a righteous Branch, and a King shall reign and prosper, and shall execute judgment and justice in the earth. In his days Judah shall be saved, and Israel shall dwell safely."
          },
          {
            "reference": "Revelation 22:16",
            "text": "I Jesus have sent mine angel to testify unto you these things in the churches. I am the root and the offspring of David, and the bright and morning star."
          },
          {
            "reference": "Isaiah 9:7",
            "text": "Of the increase of his government and peace there shall be no end, upon the throne of David, and upon his kingdom, to order it, and to establish it with judgment and with justice from henceforth even for ever."
          }
        ]
      }
    },
    "Entering the Kingdom": {
      "Through the New Birth": {
        "title": "Born Again to See",
        "description": "Jesus declared that no one can see or enter the kingdom of God unless born again—born of water and Spirit. The kingdom is not inherited naturally but supernaturally. Flesh and blood cannot inherit the kingdom of God. Entrance requires spiritual rebirth, a radical transformation by the Holy Spirit. This new birth produces citizens of heaven, strangers and pilgrims on earth. The kingdom is entered not by human effort or religious works but by sovereign grace working new life in dead sinners.",
        "verses": [
          {
            "reference": "John 3:3",
            "text": "Jesus answered and said unto him, Verily, verily, I say unto thee, Except a man be born again, he cannot see the kingdom of God."
          },
          {
            "reference": "John 3:5",
            "text": "Jesus answered, Verily, verily, I say unto thee, Except a man be born of water and of the Spirit, he cannot enter into the kingdom of God."
          },
          {
            "reference": "1 Corinthians 15:50",
            "text": "Now this I say, brethren, that flesh and blood cannot inherit the kingdom of God; neither doth corruption inherit incorruption."
          },
          {
            "reference": "Titus 3:5",
            "text": "Not by works of righteousness which we have done, but according to his mercy he saved us, by the washing of regeneration, and renewing of the Holy Ghost."
          },
          {
            "reference": "1 Peter 1:23",
            "text": "Being born again, not of corruptible seed, but of incorruptible, by the word of God, which liveth and abideth for ever."
          },
          {
            "reference": "Philippians 3:20",
            "text": "For our conversation is in heaven; from whence also we look for the Saviour, the Lord Jesus Christ."
          }
        ]
      },
      "As Little Children": {
        "title": "Humble Like a Child",
        "description": "Jesus said that unless we become like little children, we cannot enter the kingdom of heaven. The kingdom belongs to such as these. The greatest in the kingdom is whoever humbles himself like a child. Children model the dependent, trusting, humble posture required for kingdom entrance. The proud and self-sufficient are excluded; the poor in spirit inherit. Those who think they are something cannot receive the kingdom as a gift. It must be received with childlike faith and humility.",
        "verses": [
          {
            "reference": "Matthew 18:3-4",
            "text": "And said, Verily I say unto you, Except ye be converted, and become as little children, ye shall not enter into the kingdom of heaven. Whosoever therefore shall humble himself as this little child, the same is greatest in the kingdom of heaven."
          },
          {
            "reference": "Mark 10:14-15",
            "text": "But when Jesus saw it, he was much displeased, and said unto them, Suffer the little children to come unto me, and forbid them not: for of such is the kingdom of God. Verily I say unto you, Whosoever shall not receive the kingdom of God as a little child, he shall not enter therein."
          },
          {
            "reference": "Matthew 5:3",
            "text": "Blessed are the poor in spirit: for theirs is the kingdom of heaven."
          },
          {
            "reference": "Luke 18:17",
            "text": "Verily I say unto you, Whosoever shall not receive the kingdom of God as a little child shall in no wise enter therein."
          },
          {
            "reference": "James 4:6",
            "text": "But he giveth more grace. Wherefore he saith, God resisteth the proud, but giveth grace unto the humble."
          },
          {
            "reference": "1 Peter 5:5",
            "text": "Likewise, ye younger, submit yourselves unto the elder. Yea, all of you be subject one to another, and be clothed with humility: for God resisteth the proud, and giveth grace to the humble."
          }
        ]
      }
    },
    "The Kingdom's Growth": {
      "From Small Beginnings": {
        "title": "The Mustard Seed",
        "description": "Jesus compared the kingdom to a mustard seed—the smallest of seeds that grows into the greatest of herbs, providing shelter for birds. The kingdom begins small and seemingly insignificant but grows to worldwide influence. The church began with twelve disciples and has spread to every nation. The kingdom grows organically, not through human programs or political power but through the mysterious working of God. The seed grows while the sower sleeps—first the blade, then the ear, then the full corn.",
        "verses": [
          {
            "reference": "Matthew 13:31-32",
            "text": "Another parable put he forth unto them, saying, The kingdom of heaven is like to a grain of mustard seed, which a man took, and sowed in his field: Which indeed is the least of all seeds: but when it is grown, it is the greatest among herbs, and becometh a tree, so that the birds of the air come and lodge in the branches thereof."
          },
          {
            "reference": "Mark 4:26-28",
            "text": "And he said, So is the kingdom of God, as if a man should cast seed into the ground; And should sleep, and rise night and day, and the seed should spring and grow up, he knoweth not how. For the earth bringeth forth fruit of herself; first the blade, then the ear, after that the full corn in the ear."
          },
          {
            "reference": "Daniel 2:35",
            "text": "Then was the iron, the clay, the brass, the silver, and the gold, broken to pieces together, and became like the chaff of the summer threshingfloors; and the wind carried them away, that no place was found for them: and the stone that smote the image became a great mountain, and filled the whole earth."
          },
          {
            "reference": "Zechariah 4:10",
            "text": "For who hath despised the day of small things?"
          },
          {
            "reference": "Isaiah 9:7",
            "text": "Of the increase of his government and peace there shall be no end."
          }
        ]
      },
      "The Hidden Leaven": {
        "title": "Permeating Influence",
        "description": "The kingdom is like leaven hidden in meal until the whole is leavened. Though invisible, leaven works pervasively, transforming everything it touches. The kingdom's influence penetrates society, culture, and individual hearts. It works silently but powerfully, changing hearts from within rather than reforming behavior from without. The kingdom transforms families, communities, and eventually the whole world. Though hidden from sight, its effects are undeniable.",
        "verses": [
          {
            "reference": "Matthew 13:33",
            "text": "Another parable spake he unto them; The kingdom of heaven is like unto leaven, which a woman took, and hid in three measures of meal, till the whole was leavened."
          },
          {
            "reference": "Luke 13:20-21",
            "text": "And again he said, Whereunto shall I liken the kingdom of God? It is like leaven, which a woman took and hid in three measures of meal, till the whole was leavened."
          },
          {
            "reference": "Romans 12:2",
            "text": "And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God."
          },
          {
            "reference": "2 Corinthians 3:18",
            "text": "But we all, with open face beholding as in a glass the glory of the Lord, are changed into the same image from glory to glory, even as by the Spirit of the Lord."
          },
          {
            "reference": "Galatians 5:9",
            "text": "A little leaven leaveneth the whole lump."
          }
        ]
      }
    },
    "The Kingdom Consummated": {
      "Christ's Return": {
        "title": "The King Shall Return",
        "description": "The kingdom will be consummated when Christ returns in glory. He will gather His elect, judge the nations, destroy His enemies, and establish His eternal reign. The kingdoms of this world will become the kingdom of our Lord and of His Christ. What is now invisible will become visible; what is now contested will be uncontested. Every knee will bow, every tongue confess. The meek shall inherit the earth, and the saints shall reign with Christ forever.",
        "verses": [
          {
            "reference": "Revelation 11:15",
            "text": "And the seventh angel sounded; and there were great voices in heaven, saying, The kingdoms of this world are become the kingdoms of our Lord, and of his Christ; and he shall reign for ever and ever."
          },
          {
            "reference": "Matthew 25:31-34",
            "text": "When the Son of man shall come in his glory, and all the holy angels with him, then shall he sit upon the throne of his glory: And before him shall be gathered all nations... Then shall the King say unto them on his right hand, Come, ye blessed of my Father, inherit the kingdom prepared for you from the foundation of the world."
          },
          {
            "reference": "2 Timothy 4:1",
            "text": "I charge thee therefore before God, and the Lord Jesus Christ, who shall judge the quick and the dead at his appearing and his kingdom."
          },
          {
            "reference": "1 Corinthians 15:24-25",
            "text": "Then cometh the end, when he shall have delivered up the kingdom to God, even the Father; when he shall have put down all rule and all authority and power. For he must reign, till he hath put all enemies under his feet."
          },
          {
            "reference": "Matthew 5:5",
            "text": "Blessed are the meek: for they shall inherit the earth."
          },
          {
            "reference": "Daniel 7:27",
            "text": "And the kingdom and dominion, and the greatness of the kingdom under the whole heaven, shall be given to the people of the saints of the most High, whose kingdom is an everlasting kingdom, and all dominions shall serve and obey him."
          }
        ]
      },
      "The Eternal Kingdom": {
        "title": "Everlasting Dominion",
        "description": "The kingdom of God is everlasting—it shall never be destroyed, never pass away, never end. Unlike earthly kingdoms that rise and fall, God's kingdom endures forever. Daniel saw that the kingdom given to the Son of Man was an everlasting dominion that shall not be destroyed. We receive a kingdom that cannot be shaken. This eternal kingdom is the ultimate hope of believers—to reign with Christ forever in the new heavens and new earth where righteousness dwells.",
        "verses": [
          {
            "reference": "Daniel 7:14",
            "text": "And there was given him dominion, and glory, and a kingdom, that all people, nations, and languages, should serve him: his dominion is an everlasting dominion, which shall not pass away, and his kingdom that which shall not be destroyed."
          },
          {
            "reference": "Daniel 2:44",
            "text": "And in the days of these kings shall the God of heaven set up a kingdom, which shall never be destroyed: and the kingdom shall not be left to other people, but it shall break in pieces and consume all these kingdoms, and it shall stand for ever."
          },
          {
            "reference": "Hebrews 12:28",
            "text": "Wherefore we receiving a kingdom which cannot be moved, let us have grace, whereby we may serve God acceptably with reverence and godly fear."
          },
          {
            "reference": "2 Peter 1:11",
            "text": "For so an entrance shall be ministered unto you abundantly into the everlasting kingdom of our Lord and Saviour Jesus Christ."
          },
          {
            "reference": "Revelation 22:5",
            "text": "And there shall be no night there; and they need no candle, neither light of the sun; for the Lord God giveth them light: and they shall reign for ever and ever."
          },
          {
            "reference": "Luke 1:33",
            "text": "And he shall reign over the house of Jacob for ever; and of his kingdom there shall be no end."
          }
        ]
      }
    }
  }
}