{
  "names": {
    "Primary Names of God": {
      "Elohim (אֱלֹהִים)": {
        "title": "God as Creator and Judge",
        "description": "The first divine name revealed in Scripture opens the biblical narrative: 'In the beginning Elohim created the heaven and the earth' (Genesis 1:1). This majestic plural name, derived from the Hebrew root אֵל (<em>El</em>) meaning 'might' or 'power,' occurs over 2,500 times in the Old Testament. Despite its plural form (<em>-im</em> ending), it consistently takes singular verbs when referring to the true God, creating a grammatical peculiarity that has intrigued Hebrew scholars for millennia. Some interpreters see in this construction the plural of majesty, similar to the royal 'we'; others discern intimations of the Tri-unity of God—three persons, one essence—a truth more fully revealed in the New Testament.<br><br>Elohim emphasizes God's transcendent power, creative might, and judicial authority. The name appears throughout Genesis 1 as the Creator speaks the universe into existence through divine fiat, establishing order from chaos, separating light from darkness, populating earth and sky with innumerable forms of life. The name's association with creative power continues throughout Scripture: 'By the word of the LORD were the heavens made; and all the host of them by the breath of his mouth' (Psalm 33:6). When Scripture wishes to emphasize God's majesty, sovereignty, or power over creation and nations, Elohim is the preferred designation.<label for=\"sn-elohim\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-elohim\" class=\"margin-toggle\"/><span class=\"sidenote\">The plural form אֱלֹהִים (<em>Elohim</em>) with singular verbs ('God created,' not 'gods created') appears consistently throughout the Hebrew Bible. This unique grammatical construction distinguishes the true God from pagan deities, which are sometimes referenced with plural verbs. Trinitarians point to Genesis 1:26 ('Let us make man in our image') as evidence of plurality within the Godhead. The related singular form אֱלוֹהַּ (<em>Eloah</em>) appears primarily in Job and poetry, while the shortened form אֵל (<em>El</em>) frequently appears in compound divine names.</span><br><br>Elohim also functions as the name of divine judgment. When Genesis introduces God's relationship with all humanity, before the revelation of the covenant name YHWH, Elohim is the judge of earth who evaluates Adam and Eve's disobedience, who sends the flood upon a corrupt world, who confounds languages at Babel. 'Shall not the Judge of all the earth do right?' Abraham asks (Genesis 18:25), using Elohim. This judicial aspect extends throughout Scripture: Elohim executes justice, vindicates the righteous, and judges nations.<br><br>The name appears in significant plural references suggesting divine plurality: 'Let us make man in our image' (Genesis 1:26), 'Behold, the man is become as one of us' (Genesis 3:22), 'let us go down' (Genesis 11:7). While scholars debate whether these plurals indicate consultation with angels, rhetorical self-address, or Trinitarian conversation, New Testament revelation clarifies that Christ the Son participated in creation: 'All things were made by him; and without him was not any thing made that was made' (John 1:3), and the Spirit hovered over the waters (Genesis 1:2), suggesting the Triune God was active from the beginning. Thus Elohim, the first divine name encountered in Scripture, establishes God's transcendent power, creative authority, judicial sovereignty, and—as later revelation confirms—Trinitarian nature.",
        "verses": [
          {
            "reference": "Genesis 1:1",
            "text": "In the beginning God created the heaven and the earth."
          },
          {
            "reference": "Genesis 1:26",
            "text": "And God said, Let us make man in our image, after our likeness: and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth."
          },
          {
            "reference": "Deuteronomy 10:17",
            "text": "For the LORD your God is God of gods, and Lord of lords, a great God, a mighty, and a terrible, which regardeth not persons, nor taketh reward:"
          },
          {
            "reference": "Psalm 19:1",
            "text": "The heavens declare the glory of God; and the firmament sheweth his handywork."
          },
          {
            "reference": "Psalm 33:6",
            "text": "By the word of the LORD were the heavens made; and all the host of them by the breath of his mouth."
          },
          {
            "reference": "John 1:1-3",
            "text": "In the beginning was the Word, and the Word was with God, and the Word was God. The same was in the beginning with God. All things were made by him; and without him was not any thing made that was made."
          }
        ]
      },
      "Yahweh/Jehovah (יהוה)": {
        "title": "The Self-Existent, Eternal God",
        "description": "The sacred Tetragrammaton יהוה (YHWH)—four Hebrew consonants representing God's most intimate, covenant name—stands at the heart of Israel's faith and worship. Revealed to Moses at the burning bush when he asked God's name, the divine response was 'I AM THAT I AM' (<em>Ehyeh Asher Ehyeh</em>)—a declaration rooted in the Hebrew verb הָיָה (<em>hayah</em>), meaning 'to be' or 'to exist.' The name YHWH derives from this verbal root, signifying eternal, self-existent, underived being. God exists necessarily, eternally, independently of all else; He is the one who was, who is, and who forever shall be.<br><br>This name occurs approximately 6,800 times in the Old Testament, far exceeding any other divine designation. While Elohim emphasizes God's power and majesty as Creator-Judge, YHWH stresses His covenant faithfulness, His redemptive purposes, and His personal relationship with His chosen people. The name first appears in Genesis 2:4 in connection with God's intimate work in Eden, forming man from dust and breathing life into him. Throughout the Pentateuch, YHWH is the God who calls Abraham, who covenants with the patriarchs, who remembers His promises, who redeems Israel from Egypt, who gives the Law at Sinai, who dwells among His people in the tabernacle.<label for=\"sn-yahweh\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-yahweh\" class=\"margin-toggle\"/><span class=\"sidenote\">The sacred Tetragrammaton יהוה (YHWH) was considered too holy to pronounce aloud. By at least the third century BC, Jewish readers substituted אֲדֹנָי (<em>Adonai</em>, 'Lord') when encountering YHWH in Scripture. When medieval Masoretes added vowel points to the Hebrew text, they placed <em>Adonai's</em> vowels (a-o-a) under YHWH's consonants as a reminder to say <em>Adonai</em>. Christian scholars unfamiliar with this convention combined the consonants of YHWH with the vowels of <em>Adonai</em>, producing 'Jehovah'—a hybrid form that appeared in English translations. Modern scholarship reconstructs the pronunciation as 'Yahweh,' based on Greek transcriptions and comparative Semitic linguistics, though absolute certainty is impossible since the original pronunciation was lost.</span><br><br>God explains this name's significance to Moses: 'And I appeared unto Abraham, unto Isaac, and unto Jacob, by the name of God Almighty, but by my name JEHOVAH was I not known to them' (Exodus 6:3). The patriarchs knew God's power (El Shaddai) but had not experienced the full revelation of His covenant faithfulness (YHWH) until the Exodus generation witnessed Him keeping His promises to deliver, redeem, and establish Israel as His people. YHWH is the name of promise-keeping redemption.<br><br>The name's theological depth is staggering: it declares God's self-existence ('I AM'), His eternality (unchanging being), His faithfulness (He remains constant to His covenant), and His sovereignty (He defines Himself rather than being defined by creation). When Christ declared, 'Before Abraham was, I am' (John 8:58), He claimed this name for Himself, identifying with YHWH and provoking accusation of blasphemy from His Jewish hearers who recognized the claim to deity. Revelation 1:8 echoes this: 'I am Alpha and Omega, the beginning and the ending, saith the Lord, which is, and which was, and which is to come, the Almighty'—the eternal I AM revealed in Christ.",
        "verses": [
          {
            "reference": "Exodus 3:14-15",
            "text": "And God said unto Moses, I AM THAT I AM: and he said, Thus shalt thou say unto the children of Israel, I AM hath sent me unto you. And God said moreover unto Moses, Thus shalt thou say unto the children of Israel, The LORD God of your fathers, the God of Abraham, the God of Isaac, and the God of Jacob, hath sent me unto you: this is my name for ever, and this is my memorial unto all generations."
          },
          {
            "reference": "Exodus 6:3",
            "text": "And I appeared unto Abraham, unto Isaac, and unto Jacob, by the name of God Almighty, but by my name JEHOVAH was I not known to them."
          },
          {
            "reference": "Psalm 83:18",
            "text": "That men may know that thou, whose name alone is JEHOVAH, art the most high over all the earth."
          },
          {
            "reference": "Psalm 102:27",
            "text": "But thou art the same, and thy years shall have no end."
          },
          {
            "reference": "John 8:58",
            "text": "Jesus said unto them, Verily, verily, I say unto you, Before Abraham was, I am."
          },
          {
            "reference": "Revelation 1:8",
            "text": "I am Alpha and Omega, the beginning and the ending, saith the Lord, which is, and which was, and which is to come, the Almighty."
          }
        ]
      },
      "Adonai (אֲדֹנָי)": {
        "title": "Lord, Master, Owner",
        "description": "The Hebrew title אֲדֹנָי (<em>Adonai</em>), meaning 'my Lord' or 'my Master,' appears approximately 450 times in the Old Testament, emphasizing God's sovereign lordship, absolute authority, and rightful ownership of all creation. Derived from the singular אָדוֹן (<em>adon</em>), meaning 'lord' or 'master,' the plural intensive form <em>Adonai</em> conveys majesty and supreme authority. This name acknowledges that God is not merely powerful (as Elohim suggests) or faithful (as YHWH emphasizes), but that He possesses absolute right to command, to govern, and to dispose of His creation according to His will. The appropriate human response to <em>Adonai</em> is submission, obedience, and worship.<br><br>Unlike YHWH, which was restricted to Israel's covenant God, <em>adon</em> could be used of human masters, kings, or lords (Genesis 24:9, 1 Samuel 25:14), though when applied to deity in its intensive plural form <em>Adonai</em>, it designated the supreme Lord. The name frequently appears in contexts of worship, prayer, and prophetic vision—moments when human creatures consciously acknowledge divine sovereignty. Abraham addresses God as <em>Adonai</em> when questioning the covenant promise (Genesis 15:2), recognizing God's lordship even while expressing human perplexity. Isaiah uses it in his temple vision: 'I saw also the Lord sitting upon a throne, high and lifted up' (Isaiah 6:1), and again when volunteering for service: 'Also I heard the voice of the Lord, saying, Whom shall I send, and who will go for us? Then said I, Here am I; send me' (Isaiah 6:8).<label for=\"sn-adonai\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-adonai\" class=\"margin-toggle\"/><span class=\"sidenote\">When <em>Adonai</em> appears alongside יהוה (YHWH) in the Hebrew text, English translations typically render the combination as 'Lord GOD' (small caps LORD for YHWH, regular GOD for <em>Adonai</em>) to distinguish the two divine names occurring together. This combination appears frequently in the Prophets, as in Genesis 15:2: 'Abram said, Lord GOD...' The doubling emphasizes both covenant relationship (YHWH) and sovereign authority (<em>Adonai</em>). Psalm 8:1 contains a different combination: 'O LORD (<em>YHWH</em>) our Lord (<em>Adonai</em>),' distinguishing the covenant name from the title of lordship.</span><br><br>The name's theological import centers on divine sovereignty and human submission. If God is <em>Adonai</em>—Lord and Master—then His people are servants bound to obedience. This was not oppressive slavery but willing, joyful service to the one whose yoke is easy and whose burden is light. David's prayer employs <em>Adonai</em> repeatedly: 'O Lord GOD, thou art that God, and thy words be true, and thou hast promised this goodness unto thy servant' (2 Samuel 7:28). The prophet's submission to divine lordship appears in Ezekiel's visions, where God addresses him as 'son of man' while Ezekiel responds to the sovereign 'Lord GOD.'<br><br>New Testament revelation identifies Jesus Christ as <em>Adonai</em>. Thomas's confession, 'My Lord and my God' (John 20:28), employs the Greek equivalent <em>kurios</em> for <em>Adonai</em>. Paul declares, 'God also hath highly exalted him, and given him a name which is above every name: that at the name of Jesus every knee should bow... and that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father' (Philippians 2:9-11). Christ is <em>Adonai</em>—sovereign Lord to whom every knee will bow, whose authority extends over all creation, whose right to command brooks no rival. The Christian's confession 'Jesus is Lord' acknowledges this absolute sovereignty.",
        "verses": [
          {
            "reference": "Genesis 15:2",
            "text": "And Abram said, Lord GOD, what wilt thou give me, seeing I go childless, and the steward of my house is this Eliezer of Damascus?"
          },
          {
            "reference": "Psalm 8:1",
            "text": "O LORD our Lord, how excellent is thy name in all the earth! who hast set thy glory above the heavens."
          },
          {
            "reference": "Isaiah 6:1",
            "text": "In the year that king Uzziah died I saw also the Lord sitting upon a throne, high and lifted up, and his train filled the temple."
          },
          {
            "reference": "Isaiah 6:8",
            "text": "Also I heard the voice of the Lord, saying, Whom shall I send, and who will go for us? Then said I, Here am I; send me."
          },
          {
            "reference": "2 Samuel 7:28",
            "text": "And now, O Lord GOD, thou art that God, and thy words be true, and thou hast promised this goodness unto thy servant:"
          },
          {
            "reference": "Philippians 2:9-11",
            "text": "Wherefore God also hath highly exalted him, and given him a name which is above every name: that at the name of Jesus every knee should bow, of things in heaven, and things in earth, and things under the earth; and that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father."
          }
        ]
      },
      "El Shaddai (אֵל שַׁדַּי)": {
        "title": "God Almighty, All-Sufficient One",
        "description": "The divine name אֵל שַׁדַּי (<em>El Shaddai</em>)—combining אֵל (<em>El</em>, 'God' or 'Mighty One') with שַׁדַּי (<em>Shaddai</em>)—appears 48 times in the Old Testament, emphasizing God's omnipotence, sufficiency, and ability to fulfill His promises despite human impossibility. This name was particularly precious to the patriarchs, the designation by which God revealed Himself to Abraham, Isaac, and Jacob before the fuller disclosure of His covenant name YHWH at Sinai. When circumstances appeared hopeless—barrenness, famine, danger, delay—<em>El Shaddai</em> demonstrated power to accomplish what human effort could never achieve.<br><br>God first revealed this name to Abram at age 99, when both he and Sarai were 'well stricken in age' and long past childbearing: 'I am the Almighty God (<em>El Shaddai</em>); walk before me, and be thou perfect' (Genesis 17:1). Immediately following this revelation, God changed Abram's name to Abraham ('father of many nations') and established the covenant of circumcision, promising that Sarah would bear Isaac within the year. The name declared that nothing is too hard for the Lord; His power transcends natural limitations. To aged, barren Abraham and Sarah, <em>El Shaddai</em> promised descendants numberless as stars; He alone possessed sufficiency to fulfill that impossible word.<label for=\"sn-shaddai\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-shaddai\" class=\"margin-toggle\"/><span class=\"sidenote\">The etymology of שַׁדַּי (<em>Shaddai</em>) remains debated among Hebrew scholars. Three primary theories exist: (1) derivation from שַׁד (<em>shad</em>), meaning 'breast,' suggesting God as nourisher and sustainer who provides abundantly, like a nursing mother supplies her infant's every need; (2) connection to שָׁדַד (<em>shadad</em>), meaning 'to overpower' or 'to destroy,' emphasizing irresistible might; (3) derivation from an Akkadian word meaning 'mountain,' suggesting God's strength and immovability. The first etymology—God as all-sufficient nourisher—finds support in Jacob's blessing: 'by the Almighty, who shall bless thee with blessings... of the breasts, and of the womb' (Genesis 49:25), directly connecting <em>Shaddai</em> with provision and fertility. The Septuagint translates it <em>pantokratōr</em> ('all-powerful'), emphasizing omnipotence.</span><br><br>Isaac invoked this name blessing Jacob: 'God Almighty (<em>El Shaddai</em>) bless thee, and make thee fruitful, and multiply thee' (Genesis 28:3). Jacob later testified, 'God Almighty appeared unto me at Luz in the land of Canaan, and blessed me, and said unto me, Behold, I will make thee fruitful, and multiply thee' (Genesis 48:3-4). The name consistently appears in contexts of divine blessing, multiplication, and fulfillment of promises against impossible odds. When natural resources fail, when human ability reaches its limit, when circumstances appear hopeless, <em>El Shaddai</em> manifests as the all-sufficient One whose power knows no constraint.<br><br>The book of Job employs <em>Shaddai</em> 31 times (more than all other biblical books combined), usually without <em>El</em>. In Job's extremity—having lost children, wealth, health, and comfort—the name that sustained the patriarchs in their trials becomes central. Job's friends invoke <em>Shaddai's</em> justice; Job appeals to <em>Shaddai's</em> sovereignty; God ultimately answers from the whirlwind, demonstrating <em>Shaddai's</em> incomprehensible power over creation. The Almighty who promised Isaac to Abraham, who multiplied Jacob's descendants, reveals Himself as sovereign over all suffering, all providence, all purpose—sufficient for every trial, adequate for every need, powerful enough to accomplish every promise. New Testament revelation connects this name to Christ, 'the Almighty' (<em>pantokratōr</em>) of Revelation 1:8, whose sufficiency supplies grace for every situation.",
        "verses": [
          {
            "reference": "Genesis 17:1-2",
            "text": "And when Abram was ninety years old and nine, the LORD appeared to Abram, and said unto him, I am the Almighty God; walk before me, and be thou perfect. And I will make my covenant between me and thee, and will multiply thee exceedingly."
          },
          {
            "reference": "Genesis 28:3",
            "text": "And God Almighty bless thee, and make thee fruitful, and multiply thee, that thou mayest be a multitude of people;"
          },
          {
            "reference": "Genesis 49:25",
            "text": "Even by the God of thy father, who shall help thee; and by the Almighty, who shall bless thee with blessings of heaven above, blessings of the deep that lieth under, blessings of the breasts, and of the womb:"
          },
          {
            "reference": "Job 13:3",
            "text": "Surely I would speak to the Almighty, and I desire to reason with God."
          },
          {
            "reference": "Psalm 91:1",
            "text": "He that dwelleth in the secret place of the most High shall abide under the shadow of the Almighty."
          },
          {
            "reference": "Revelation 1:8",
            "text": "I am Alpha and Omega, the beginning and the ending, saith the Lord, which is, and which was, and which is to come, the Almighty."
          }
        ]
      }
    },
    "Compound Names with Jehovah": {
      "Jehovah-Jireh (יְהוָה יִרְאֶה)": {
        "title": "The LORD Will Provide",
        "description": "The compound name יְהוָה יִרְאֶה (<em>Jehovah-Jireh</em>), meaning 'the LORD will provide' or 'the LORD will see to it,' emerged from the most harrowing test of Abraham's faith—God's command to offer Isaac, the son of promise, as a burnt offering on Mount Moriah. This trial, recorded in Genesis 22, represents the apex of patriarchal testing: would Abraham trust God's promise of innumerable descendants through Isaac even while obeying God's command to sacrifice that very son? The narrative tension is unbearable; the theological paradox seemingly insoluble. Yet Abraham's faith, forged through decades of divine dealings, held firm.<br><br>As father and son ascended the mountain, Isaac asked the piercing question: 'Behold the fire and the wood: but where is the lamb for a burnt offering?' (Genesis 22:7). Abraham's response revealed prophetic faith: 'My son, God will provide himself a lamb for a burnt offering' (Genesis 22:8). Whether Abraham anticipated angelic intervention, believed God would raise Isaac from the dead (Hebrews 11:19), or simply trusted without understanding, his words proved true. At the critical moment—Isaac bound on the altar, Abraham's hand grasping the knife—the angel of the LORD called from heaven, 'Lay not thine hand upon the lad' (Genesis 22:12). Abraham lifted his eyes and saw a ram caught in a thicket by his horns, provided by God as a substitute sacrifice.<label for=\"sn-jireh\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-jireh\" class=\"margin-toggle\"/><span class=\"sidenote\">The Hebrew verb רָאָה (<em>ra'ah</em>) means 'to see,' and in various stems carries nuances of 'provide,' 'see to,' or 'appear.' <em>Jireh</em> (יִרְאֶה) is the imperfect form, meaning 'he will see' or 'he will provide.' The name combines YHWH's covenant faithfulness with His providential seeing and supplying. The saying preserved—'In the mount of the LORD it shall be seen' (or 'provided')—became proverbial. Mount Moriah, tradition holds, is the site where Solomon later built the Temple (2 Chronicles 3:1), the place of continual sacrifice and substitutionary atonement, ultimately fulfilled in Christ's sacrifice on nearby Golgotha.</span><br><br>Abraham named that place <em>Jehovah-Jireh</em>—'the LORD will provide.' The name commemorates not merely timely provision but substitutionary provision: a ram in Isaac's place, a sacrifice instead of the son, God's provision of atonement when human resources utterly failed. This substitutionary theme runs throughout redemptive history: the Passover lamb's blood protecting Israel's firstborn, the Levitical sacrifices providing atonement for sin, and supremely, 'the Lamb of God, which taketh away the sin of the world' (John 1:29)—Jesus Christ, God's ultimate provision of Himself as substitutionary sacrifice.<br><br>The name assures believers that God sees their need before they ask, provides according to His perfect wisdom and timing, and supplies not merely material necessities but spiritual redemption. Just as Abraham's declaration 'God will provide himself a lamb' found fulfillment in both the ram and ultimately in Christ, so <em>Jehovah-Jireh</em> declares that the covenant-keeping God who sees all need will faithfully provide all that His purposes require and His love desires. 'He that spared not his own Son, but delivered him up for us all, how shall he not with him also freely give us all things?' (Romans 8:32). The provision of Christ guarantees all lesser provisions.",
        "verses": [
          {
            "reference": "Genesis 22:7-8",
            "text": "And Isaac spake unto Abraham his father, and said, My father: and he said, Here am I, my son. And he said, Behold the fire and the wood: but where is the lamb for a burnt offering? And Abraham said, My son, God will provide himself a lamb for a burnt offering: so they went both of them together."
          },
          {
            "reference": "Genesis 22:13-14",
            "text": "And Abraham lifted up his eyes, and looked, and behold behind him a ram caught in a thicket by his horns: and Abraham went and took the ram, and offered him up for a burnt offering in the stead of his son. And Abraham called the name of that place Jehovahjireh: as it is said to this day, In the mount of the LORD it shall be seen."
          },
          {
            "reference": "John 1:29",
            "text": "The next day John seeth Jesus coming unto him, and saith, Behold the Lamb of God, which taketh away the sin of the world."
          },
          {
            "reference": "Romans 8:32",
            "text": "He that spared not his own Son, but delivered him up for us all, how shall he not with him also freely give us all things?"
          },
          {
            "reference": "Philippians 4:19",
            "text": "But my God shall supply all your need according to his riches in glory by Christ Jesus."
          },
          {
            "reference": "Hebrews 11:17-19",
            "text": "By faith Abraham, when he was tried, offered up Isaac: and he that had received the promises offered up his only begotten son, of whom it was said, That in Isaac shall thy seed be called: accounting that God was able to raise him up, even from the dead; from whence also he received him in a figure."
          }
        ]
      },
      "Jehovah-Rapha (יְהוָה רֹפְאֶךָ)": {
        "title": "The LORD Who Heals",
        "description": "The covenant name יְהוָה רֹפְאֶךָ (<em>Jehovah-Rapha</em>), meaning 'the LORD your healer,' was revealed at Marah ('bitterness'), the first stop after Israel's Red Sea deliverance where the people found only bitter, undrinkable water. Having witnessed Pharaoh's armies drown in the sea, Israel now faced death by thirst in the wilderness. The people murmured against Moses; Moses cried unto the LORD; and God showed him a tree which, when cast into the waters, made them sweet (Exodus 15:23-25). This miracle of healing the waters became the occasion for revealing God's identity as Israel's healer.<br><br>Immediately following this sign, the LORD declared, 'If thou wilt diligently hearken to the voice of the LORD thy God, and wilt do that which is right in his sight, and wilt give ear to his commandments, and keep all his statutes, I will put none of these diseases upon thee, which I have brought upon the Egyptians: for I am the LORD that healeth thee' (Exodus 15:26). The revelation linked obedience to health, establishing a principle later developed in Deuteronomy's blessings and curses (Deuteronomy 28). Yet the name's significance transcends physical health; it encompasses spiritual, emotional, and relational healing—wholeness in every dimension.<label for=\"sn-rapha\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-rapha\" class=\"margin-toggle\"/><span class=\"sidenote\">The Hebrew verb רָפָא (<em>rapha</em>) carries a rich semantic range: physical healing of disease or injury, emotional restoration from grief or trauma, spiritual renewal from sin's corruption, and even 'healing' of inanimate objects like water (2 Kings 2:21) or the land (2 Chronicles 7:14). God's healing touches every aspect of fallen creation's brokenness. The participial form רֹפְאֶךָ (<em>rophe'kha</em>) means 'your healer'—God is not merely able to heal but is Israel's designated, covenant healer. The name appears in contexts of physical illness (Exodus 15:26), spiritual restoration (Psalm 41:4, 'Heal my soul'), national repentance (Jeremiah 3:22), and eschatological renewal (Malachi 4:2).</span><br><br>Throughout Scripture, <em>Jehovah-Rapha</em> demonstrates His healing power: restoring Hezekiah from terminal illness (2 Kings 20:5), healing Miriam's leprosy (Numbers 12:13), curing Naaman's leprosy through Elisha (2 Kings 5:14), and renewing Job's health after testing (Job 42:10). Yet physical healing serves as sign and type of deeper spiritual healing. The Psalmist connects forgiveness and healing: 'Who forgiveth all thine iniquities; who healeth all thy diseases' (Psalm 103:3), recognizing that sin is the ultimate disease requiring divine remedy. Jeremiah pleads, 'Heal me, O LORD, and I shall be healed; save me, and I shall be saved' (Jeremiah 17:14), acknowledging that only God's power can restore the soul.<br><br>Christ's earthly ministry revealed <em>Jehovah-Rapha</em> incarnate. Matthew notes, 'He healed all that were sick: that it might be fulfilled which was spoken by Esaias the prophet, saying, Himself took our infirmities, and bare our sicknesses' (Matthew 8:16-17). Jesus healed paralytics, lepers, the blind, the deaf, the demon-possessed—demonstrating power over every form of affliction while declaring His authority to forgive sins (Mark 2:10). His healings were not merely compassionate acts but messianic signs revealing His identity as <em>Jehovah-Rapha</em>. Ultimately, Isaiah prophesied, 'With his stripes we are healed' (Isaiah 53:5)—spiritual healing purchased through Christ's atoning suffering. While believers may experience physical healing as foretaste of resurrection glory, the name's deepest fulfillment is redemption from sin's disease, healing of the soul, and ultimate bodily resurrection when 'there shall be no more death, neither sorrow, nor crying, neither shall there be any more pain' (Revelation 21:4).",
        "verses": [
          {
            "reference": "Exodus 15:25-26",
            "text": "And he cried unto the LORD; and the LORD shewed him a tree, which when he had cast into the waters, the waters were made sweet: there he made for them a statute and an ordinance, and there he proved them, and said, If thou wilt diligently hearken to the voice of the LORD thy God, and wilt do that which is right in his sight, and wilt give ear to his commandments, and keep all his statutes, I will put none of these diseases upon thee, which I have brought upon the Egyptians: for I am the LORD that healeth thee."
          },
          {
            "reference": "Psalm 103:2-3",
            "text": "Bless the LORD, O my soul, and forget not all his benefits: who forgiveth all thine iniquities; who healeth all thy diseases;"
          },
          {
            "reference": "Jeremiah 17:14",
            "text": "Heal me, O LORD, and I shall be healed; save me, and I shall be saved: for thou art my praise."
          },
          {
            "reference": "Isaiah 53:5",
            "text": "But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed."
          },
          {
            "reference": "Matthew 8:16-17",
            "text": "When the even was come, they brought unto him many that were possessed with devils: and he cast out the spirits with his word, and healed all that were sick: that it might be fulfilled which was spoken by Esaias the prophet, saying, Himself took our infirmities, and bare our sicknesses."
          },
          {
            "reference": "1 Peter 2:24",
            "text": "Who his own self bare our sins in his own body on the tree, that we, being dead to sins, should live unto righteousness: by whose stripes ye were healed."
          }
        ]
      },
      "Jehovah-Nissi (יְהוָה נִסִּי)": {
        "title": "The LORD My Banner",
        "description": "The memorial name יְהוָה נִסִּי (<em>Jehovah-Nissi</em>), meaning 'the LORD is my banner,' commemorates Israel's first military conflict after the Exodus—Amalek's unprovoked attack on the weary, straggling Hebrews at Rephidim (Exodus 17:8-16). This assault was particularly treacherous: Amalek struck from the rear, targeting the feeble and exhausted (Deuteronomy 25:17-18), showing no fear of God. Moses commanded Joshua to gather fighting men while he stationed himself on a hilltop with the rod of God. As long as Moses held up his hands, Israel prevailed; when he lowered them from weariness, Amalek prevailed. Aaron and Hur supported Moses's hands until sunset, and Joshua defeated Amalek with the sword.<br><br>After the victory, the LORD declared perpetual war against Amalek: 'The LORD hath sworn that the LORD will have war with Amalek from generation to generation' (Exodus 17:16). Moses built an altar and named it <em>Jehovah-Nissi</em>—'the LORD is my banner.' The name acknowledged that victory belonged not to Israel's military prowess, not to Joshua's tactical skill, not even to Moses's upraised hands, but to the LORD who fought for His people. The uplifted rod symbolized dependence on divine power; the sagging arms, human weakness. Victory required constant reliance on God's strength, sustained by community support (Aaron and Hur), and executed through faithful obedience (Joshua's warfare).<label for=\"sn-nissi\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-nissi\" class=\"margin-toggle\"/><span class=\"sidenote\">The Hebrew נֵס (<em>nes</em>) means 'banner,' 'standard,' or 'ensign'—a pole bearing an emblem around which troops rallied for battle. Ancient armies used banners to identify units, coordinate movements, and inspire courage. Soldiers fixed their eyes on the banner to maintain formation and direction. The name <em>Jehovah-Nissi</em> declares that God Himself is Israel's rallying point, their source of courage, their standard of victory. Just as troops follow their banner into battle, so God's people look to Him for strength, direction, and triumph. Isaiah prophesied of Messiah: 'In that day there shall be a root of Jesse, which shall stand for an ensign of the people; to it shall the Gentiles seek' (Isaiah 11:10)—Christ as the banner around whom all nations rally.</span><br><br>The Amalekite conflict establishes a pattern repeated throughout Israel's history: enemies attack, God's people cry to Him, He delivers through human instruments who acknowledge that victory comes from the LORD alone. When overwhelmed by Midianites, Gideon saw an angel who declared, 'The LORD is with thee, thou mighty man of valour' (Judges 6:12); God then reduced Gideon's army from 32,000 to 300 lest Israel claim, 'Mine own hand hath saved me' (Judges 7:2). Jehoshaphat faced a vast coalition but proclaimed, 'O our God... we have no might against this great company that cometh against us; neither know we what to do: but our eyes are upon thee' (2 Chronicles 20:12). David confronted Goliath declaring, 'The battle is the LORD's' (1 Samuel 17:47).<br><br><em>Jehovah-Nissi</em> assures believers that spiritual warfare is won not by human strength but by divine power. Paul instructs, 'Put on the whole armour of God, that ye may be able to stand against the wiles of the devil' (Ephesians 6:11), acknowledging that 'we wrestle not against flesh and blood, but against principalities, against powers' (Ephesians 6:12). Christ is the banner under whom believers fight: 'In all these things we are more than conquerors through him that loved us' (Romans 8:37). Like Moses's upraised hands, persistent prayer sustains victory; like Aaron and Hur's support, Christian community strengthens; like Joshua's obedience, faithful action follows; but the triumph belongs to <em>Jehovah-Nissi</em> alone, who leads His people in triumphal procession (2 Corinthians 2:14).",
        "verses": [
          {
            "reference": "Exodus 17:11-13",
            "text": "And it came to pass, when Moses held up his hand, that Israel prevailed: and when he let down his hand, Amalek prevailed. But Moses' hands were heavy; and they took a stone, and put it under him, and he sat thereon; and Aaron and Hur stayed up his hands, the one on the one side, and the other on the other side; and his hands were steady until the going down of the sun. And Joshua discomfited Amalek and his people with the edge of the sword."
          },
          {
            "reference": "Exodus 17:15-16",
            "text": "And Moses built an altar, and called the name of it Jehovahnissi: for he said, Because the LORD hath sworn that the LORD will have war with Amalek from generation to generation."
          },
          {
            "reference": "Psalm 60:4",
            "text": "Thou hast given a banner to them that fear thee, that it may be displayed because of the truth. Selah."
          },
          {
            "reference": "Isaiah 11:10",
            "text": "And in that day there shall be a root of Jesse, which shall stand for an ensign of the people; to it shall the Gentiles seek: and his rest shall be glorious."
          },
          {
            "reference": "Romans 8:37",
            "text": "Nay, in all these things we are more than conquerors through him that loved us."
          },
          {
            "reference": "2 Corinthians 2:14",
            "text": "Now thanks be unto God, which always causeth us to triumph in Christ, and maketh manifest the savour of his knowledge by us in every place."
          }
        ]
      },
      "Jehovah-Shalom (יְהוָה שָׁלוֹם)": {
        "title": "The LORD Is Peace",
        "description": "The altar name יְהוָה שָׁלוֹם (<em>Jehovah-Shalom</em>), meaning 'the LORD is peace,' arose from Gideon's terrifying encounter with the angel of the LORD during Israel's oppression under Midian. For seven years, Midianite hordes had invaded Israel at harvest time, destroying crops and livestock, reducing Israel to desperate poverty. Gideon was secretly threshing wheat in a winepress (rather than the exposed threshing floor) when the angel appeared, addressing him, 'The LORD is with thee, thou mighty man of valour' (Judges 6:12)—words that seemed mocking given Israel's subjugation and Gideon's fearful hiding.<br><br>After the angel confirmed his divine identity through miraculous signs (fire consuming Gideon's offering), Gideon realized with terror that he had seen the angel of the LORD face to face. Israel believed that seeing God meant death: 'Alas, O Lord GOD! for because I have seen an angel of the LORD face to face' (Judges 6:22). But the LORD spoke peace to his fear: 'Peace be unto thee; fear not: thou shalt not die' (Judges 6:23). In response to this gracious assurance, Gideon built an altar and named it <em>Jehovah-Shalom</em>—'the LORD is peace'—commemorating both the divine word of peace and his survival of the theophany.<label for=\"sn-shalom\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-shalom\" class=\"margin-toggle\"/><span class=\"sidenote\">The Hebrew שָׁלוֹם (<em>shalom</em>) encompasses far more than absence of conflict or cessation of hostilities. Its semantic range includes completeness, wholeness, soundness, welfare, safety, health, prosperity, harmony, and right relationship with God and others. <em>Shalom</em> represents the comprehensive well-being that results from covenant relationship with YHWH. When God speaks <em>shalom</em>, He bestows not merely the absence of harm but the presence of every blessing—spiritual, physical, relational, material. The common Hebrew greeting <em>shalom</em> ('peace') thus wishes comprehensive divine blessing. The name <em>Jehovah-Shalom</em> identifies God Himself as the source and essence of this multifaceted peace.</span><br><br>The context enriches the name's meaning. Israel had no peace—Midianites ravaged the land, Israelites lived in caves and dens, crops failed, poverty reigned. Gideon had no peace—hiding in fear, questioning God's presence ('if the LORD be with us, why then is all this befallen us?'), doubting his own adequacy ('wherewith shall I save Israel? behold, my family is poor in Manasseh, and I am the least in my father's house'). Yet God declared peace: peace despite circumstances, peace through His presence, peace preceding deliverance. <em>Jehovah-Shalom</em> announces that God Himself constitutes Israel's peace; His presence brings wholeness regardless of external chaos.<br><br>This peace theme resonates throughout Scripture. Isaiah prophesies of Messiah as 'the Prince of Peace' whose 'government and peace there shall be no end' (Isaiah 9:6-7). Micah 5:5 declares, 'This man shall be the peace' when Assyria invades. Christ's birth announcement proclaimed 'on earth peace, good will toward men' (Luke 2:14). Jesus told His disciples, 'Peace I leave with you, my peace I give unto you: not as the world giveth, give I unto you' (John 14:27)—peace independent of circumstances, rooted in relationship with God. Paul declares Christ 'is our peace' (Ephesians 2:14), having made peace through the blood of His cross (Colossians 1:20), reconciling sinners to God. The God who spoke peace to terrified Gideon is <em>Jehovah-Shalom</em>, 'the God of peace' who will 'bruise Satan under your feet shortly' (Romans 16:20), granting not merely tranquility but comprehensive shalom—reconciliation, wholeness, eternal fellowship.",
        "verses": [
          {
            "reference": "Judges 6:22-24",
            "text": "And when Gideon perceived that he was an angel of the LORD, Gideon said, Alas, O Lord GOD! for because I have seen an angel of the LORD face to face. And the LORD said unto him, Peace be unto thee; fear not: thou shalt not die. Then Gideon built an altar there unto the LORD, and called it Jehovahshalom: unto this day it is yet in Ophrah of the Abiezrites."
          },
          {
            "reference": "Isaiah 9:6-7",
            "text": "For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace. Of the increase of his government and peace there shall be no end, upon the throne of David, and upon his kingdom, to order it, and to establish it with judgment and with justice from henceforth even for ever. The zeal of the LORD of hosts will perform this."
          },
          {
            "reference": "John 14:27",
            "text": "Peace I leave with you, my peace I give unto you: not as the world giveth, give I unto you. Let not your heart be troubled, neither let it be afraid."
          },
          {
            "reference": "Ephesians 2:14",
            "text": "For he is our peace, who hath made both one, and hath broken down the middle wall of partition between us;"
          },
          {
            "reference": "Colossians 1:20",
            "text": "And, having made peace through the blood of his cross, by him to reconcile all things unto himself; by him, I say, whether they be things in earth, or things in heaven."
          },
          {
            "reference": "Romans 16:20",
            "text": "And the God of peace shall bruise Satan under your feet shortly. The grace of our Lord Jesus Christ be with you. Amen."
          }
        ]
      },
      "Jehovah-Tsidkenu (יְהוָה צִדְקֵנוּ)": {
        "title": "The LORD Our Righteousness",
        "description": "The prophetic name יְהוָה צִדְקֵנוּ (<em>Jehovah-Tsidkenu</em>), meaning 'the LORD our righteousness,' appears in Jeremiah's oracle concerning the coming Messiah, the righteous Branch of David who would reign as King, executing judgment and justice in the earth. Jeremiah ministered during Judah's final catastrophic decline—a succession of wicked kings (Jehoiakim, Jehoiachin, Zedekiah) led the nation to Babylonian exile. Against this backdrop of failed human leadership and comprehensive moral collapse, God promised a future King unlike all who preceded Him: 'Behold, the days come, saith the LORD, that I will raise unto David a righteous Branch, and a King shall reign and prosper, and shall execute judgment and justice in the earth' (Jeremiah 23:5).<br><br>This coming King's name would be <em>Jehovah-Tsidkenu</em>—'THE LORD OUR RIGHTEOUSNESS' (Jeremiah 23:6). The name is theologically explosive: it identifies the Messiah with YHWH Himself while declaring that He becomes righteousness <em>for</em> His people. The Hebrew צֶדֶק (<em>tsedeq</em>) and its variant צְדָקָה (<em>tsedaqah</em>) denote conformity to God's standard, moral rightness, vindication, justification—the quality of being and acting in accordance with God's holy character. No mere human possesses this righteousness; Isaiah declared, 'all our righteousnesses are as filthy rags' (Isaiah 64:6). Yet the coming King would not merely possess righteousness but <em>be</em> righteousness for His people—providing what they utterly lacked.<label for=\"sn-tsidkenu\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-tsidkenu\" class=\"margin-toggle\"/><span class=\"sidenote\">The name's structure is significant: יְהוָה (YHWH, the covenant name) + צִדְקֵנוּ (<em>tsidkenu</em>, 'our righteousness'—from צֶדֶק 'righteousness' with the first-person plural possessive suffix). The name declares that YHWH Himself becomes the righteousness of His people. This is imputed righteousness—God's own righteousness reckoned to sinners who possess none of their own. The parallel passage in Jeremiah 33:16 applies a similar name to Jerusalem: 'THE LORD OUR RIGHTEOUSNESS,' indicating that the city's righteousness derives entirely from her Messiah-King. The contrast with Zedekiah ('righteousness of YHWH'), Judah's final king who proved utterly unrighteous, is deliberate and poignant.</span><br><br>The prophecy promises restoration: 'In his days Judah shall be saved, and Israel shall dwell safely' (Jeremiah 23:6). Salvation and security would flow not from Israel's righteousness (which was nonexistent) but from their King's righteousness imputed to them. This anticipates the New Testament doctrine of justification: sinners declared righteous not through personal merit but through faith in Christ, who 'was delivered for our offences, and was raised again for our justification' (Romans 4:25). Paul explicitly identifies Christ as <em>Jehovah-Tsidkenu</em>: 'But of him are ye in Christ Jesus, who of God is made unto us wisdom, and righteousness, and sanctification, and redemption' (1 Corinthians 1:30).<br><br>The theological mechanism is substitution and imputation: Christ's perfect obedience to God's law (active righteousness) and His sin-bearing death (passive righteousness satisfying divine justice) provide the righteousness God requires. This righteousness is imputed—credited, reckoned—to believers through faith: 'For he hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in him' (2 Corinthians 5:21). The great exchange: our sin placed on Christ, His righteousness placed on us. Thus <em>Jehovah-Tsidkenu</em> reveals both Christ's deity (He bears the covenant name YHWH) and His saving work (He becomes righteousness for unrighteous sinners). Believers stand before God clothed not in filthy rags of self-righteousness but in Christ's perfect righteousness, the wedding garment without which none enter the King's banquet (Matthew 22:11-12). This is the gospel: 'Christ Jesus... is made unto us... righteousness.'",
        "verses": [
          {
            "reference": "Jeremiah 23:5-6",
            "text": "Behold, the days come, saith the LORD, that I will raise unto David a righteous Branch, and a King shall reign and prosper, and shall execute judgment and justice in the earth. In his days Judah shall be saved, and Israel shall dwell safely: and this is his name whereby he shall be called, THE LORD OUR RIGHTEOUSNESS."
          },
          {
            "reference": "Isaiah 64:6",
            "text": "But we are all as an unclean thing, and all our righteousnesses are as filthy rags; and we all do fade as a leaf; and our iniquities, like the wind, have taken us away."
          },
          {
            "reference": "Romans 4:25",
            "text": "Who was delivered for our offences, and was raised again for our justification."
          },
          {
            "reference": "1 Corinthians 1:30",
            "text": "But of him are ye in Christ Jesus, who of God is made unto us wisdom, and righteousness, and sanctification, and redemption:"
          },
          {
            "reference": "2 Corinthians 5:21",
            "text": "For he hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in him."
          },
          {
            "reference": "Philippians 3:9",
            "text": "And be found in him, not having mine own righteousness, which is of the law, but that which is through the faith of Christ, the righteousness which is of God by faith:"
          }
        ]
      },
      "Jehovah-Shammah (יְהוָה שָׁמָּה)": {
        "title": "The LORD Is There",
        "description": "The climactic name יְהוָה שָׁמָּה (<em>Jehovah-Shammah</em>), meaning 'the LORD is there,' forms the final words of Ezekiel's prophecy, concluding his extraordinary visions of judgment, exile, and restoration. Ezekiel had witnessed the glory of the LORD depart from the temple and Jerusalem (Ezekiel 10:18-19, 11:23)—the most devastating moment in Israel's history, when God's manifest presence abandoned His sanctuary because of the people's abominations. The prophet who saw the glory depart was also granted to see the glory return. Ezekiel's final nine chapters (40-48) present an elaborate vision of a restored temple, reconstituted priesthood, purified worship, reapportioned land, and—supremely—the return of God's glory filling the house (Ezekiel 43:1-5).<br><br>The vision's final verse names the restored city: 'And the name of the city from that day shall be, The LORD is there' (Ezekiel 48:35). After detailing the city's dimensions (18,000 measures around), gates (twelve, named for Israel's tribes), and boundaries, Ezekiel identifies the city's essential character: not Jerusalem ('city of peace') but <em>Jehovah-Shammah</em>—'the LORD is there.' What makes the restored city glorious is not its architecture, not its gates, not its measurements, but YHWH's abiding presence. Where God dwells, there is life, blessing, security, worship, joy—everything the exile lacked.<label for=\"sn-shammah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-shammah\" class=\"margin-toggle\"/><span class=\"sidenote\">The Hebrew שָׁמָּה (<em>shammah</em>) is an adverb meaning 'there,' 'in that place,' or 'thither.' The name <em>Jehovah-Shammah</em> thus means 'YHWH [is] there'—a declaration of divine presence and dwelling. This recalls the tabernacle promise: 'I will dwell among the children of Israel, and will be their God' (Exodus 29:45), and the temple dedication: 'the glory of the LORD had filled the house of God' (2 Chronicles 5:14). God's presence constitutes the supreme covenant blessing; His absence, the ultimate curse. Ezekiel's vision promises permanent, uninterrupted presence—God dwelling with His people forever.</span><br><br>The vision is eschatological—it describes realities not fully realized in the post-exilic return from Babylon. The second temple, though rebuilt, never witnessed the glory-cloud's return; Herod's expansion, though magnificent, housed a corrupted priesthood; when Messiah came to His temple, the religious leaders rejected Him. Ezekiel's vision awaits complete fulfillment in the New Jerusalem, which John saw descending from heaven: 'Behold, the tabernacle of God is with men, and he will dwell with them, and they shall be his people, and God himself shall be with them, and be their God' (Revelation 21:3). Significantly, John's vision contains no temple: 'For the Lord God Almighty and the Lamb are the temple of it' (Revelation 21:22). The reality surpasses the shadow—direct, unmediated divine presence forever.<br><br>Meanwhile, <em>Jehovah-Shammah</em> finds present application in Christ and His church. When the Word became flesh and 'dwelt among us' (John 1:14—literally 'tabernacled'), God was 'there' in Bethlehem, Nazareth, Jerusalem. Jesus is Immanuel, 'God with us' (Matthew 1:23), and promised, 'Where two or three are gathered together in my name, there am I in the midst of them' (Matthew 18:20). His final words assured, 'Lo, I am with you alway, even unto the end of the world' (Matthew 28:20). The church is God's temple, indwelt by the Holy Spirit (1 Corinthians 3:16, Ephesians 2:22). Where believers gather in Christ's name, <em>Jehovah-Shammah</em>—the LORD is there. Ultimate fulfillment awaits the eternal city where God and the Lamb dwell with redeemed humanity forever, and the tabernacle of God is eternally with men.",
        "verses": [
          {
            "reference": "Ezekiel 48:35",
            "text": "It was round about eighteen thousand measures: and the name of the city from that day shall be, The LORD is there."
          },
          {
            "reference": "Ezekiel 43:4-5",
            "text": "And the glory of the LORD came into the house by the way of the gate whose prospect is toward the east. So the spirit took me up, and brought me into the inner court; and, behold, the glory of the LORD filled the house."
          },
          {
            "reference": "John 1:14",
            "text": "And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth."
          },
          {
            "reference": "Matthew 28:20",
            "text": "Teaching them to observe all things whatsoever I have commanded you: and, lo, I am with you alway, even unto the end of the world. Amen."
          },
          {
            "reference": "Revelation 21:3",
            "text": "And I heard a great voice out of heaven saying, Behold, the tabernacle of God is with men, and he will dwell with them, and they shall be his people, and God himself shall be with them, and be their God."
          },
          {
            "reference": "Revelation 21:22-23",
            "text": "And I saw no temple therein: for the Lord God Almighty and the Lamb are the temple of it. And the city had no need of the sun, neither of the moon, to shine in it: for the glory of God did lighten it, and the Lamb is the light thereof."
          }
        ]
      }
    },
    "Descriptive Titles": {
      "El Elyon (אֵל עֶלְיוֹן)": {
        "title": "The Most High God",
        "description": "The ancient title אֵל עֶלְיוֹן (<em>El Elyon</em>), meaning 'God Most High,' appears first in Genesis 14 when the enigmatic priest-king Melchizedek blessed Abraham after his victory over the coalition of eastern kings who had captured Lot. Melchizedek, king of Salem (likely ancient Jerusalem) and 'priest of the most high God' (<em>El Elyon</em>), brought bread and wine and pronounced blessing: 'Blessed be Abram of the most high God, possessor of heaven and earth: and blessed be the most high God, which hath delivered thine enemies into thy hand' (Genesis 14:19-20). Abraham acknowledged Melchizedek's priesthood by giving him tithes of all, and invoked the same divine name when refusing the king of Sodom's offer: 'I have lift up mine hand unto the LORD, the most high God, the possessor of heaven and earth' (Genesis 14:22).<br><br>The name <em>Elyon</em> (עֶלְיוֹן) derives from the Hebrew root עָלָה (<em>alah</em>), 'to go up, ascend, be high.' As a divine title, <em>Elyon</em> designates the supreme God, highest over all powers and authorities, exalted above every rival deity or earthly potentate. This is particularly significant in Genesis 14's context: Abraham had just defeated Chedorlaomer and allied kings who represented the mighty Mesopotamian empires. Yet Melchizedek identified the true sovereign as <em>El Elyon</em>, possessor (owner, creator) of heaven and earth—no regional deity but the universal God who transcends all earthly kingdoms.<label for=\"sn-elyon\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-elyon\" class=\"margin-toggle\"/><span class=\"sidenote\">The title עֶלְיוֹן (<em>Elyon</em>, 'Most High') appears approximately 50 times in the Old Testament, often in contexts emphasizing God's sovereignty over nations and kings. Deuteronomy 32:8 indicates that when <em>Elyon</em> divided the nations, He established Israel's boundaries—exercising universal jurisdiction. Psalms frequently employ the title in contexts of worship and kingship: 'The LORD most high is terrible; he is a great King over all the earth' (Psalm 47:2). Daniel's use (particularly in chapter 4, Nebuchadnezzar's confession) demonstrates that even pagan monarchs must acknowledge <em>El Elyon's</em> supremacy. The Aramaic equivalent עִלָּאָה (<em>illaya</em>) appears in Daniel 3:26, 4:2, and elsewhere.</span><br><br>Psalm 91 celebrates the security of those who dwell 'in the secret place of the most High' (<em>Elyon</em>), declaring they 'shall abide under the shadow of the Almighty' (<em>Shaddai</em>). The Psalm combines multiple divine names—<em>Elyon, Shaddai, YHWH, Elohim</em>—each emphasizing different attributes, together assuring complete protection. The title appears prominently in Psalms of kingship and judgment (Psalms 7:17, 9:2, 18:13, 21:7, 46:4, 47:2), establishing that <em>El Elyon</em> reigns over all earthly powers, judges nations, determines boundaries, executes vengeance, and ultimately prevails.<br><br>Daniel's prophecies employ the title in contexts of Gentile kingdoms and their eventual subjugation to God's kingdom. When Nebuchadnezzar's pride brought divine judgment—seven years of beast-like madness—his restoration came through acknowledging 'the most High' whose 'dominion is an everlasting dominion, and his kingdom is from generation to generation' (Daniel 4:34). This theme recurs: Daniel 7 prophesies that 'the saints of the most High shall take the kingdom, and possess the kingdom for ever' (Daniel 7:18), after successive empires rise and fall. <em>El Elyon</em> sovereignly rules history's flow, raising and deposing kings, establishing and overthrowing kingdoms.<br><br>New Testament fulfillment appears when Gabriel announced to Mary that her son 'shall be called the Son of the Highest (<em>huios hupsistou</em>): and the Lord God shall give unto him the throne of his father David' (Luke 1:32). Jesus Christ, Son of <em>El Elyon</em>, inherits universal dominion. Even demons recognized Him: 'What have I to do with thee, Jesus, thou Son of the most high God?' (Mark 5:7). The title assures believers that no power—earthly or spiritual—exceeds God's authority; all rival claims to sovereignty are subordinate to <em>El Elyon</em>, the Most High God, possessor of heaven and earth.",
        "verses": [
          {
            "reference": "Genesis 14:18-20",
            "text": "And Melchizedek king of Salem brought forth bread and wine: and he was the priest of the most high God. And he blessed him, and said, Blessed be Abram of the most high God, possessor of heaven and earth: and blessed be the most high God, which hath delivered thine enemies into thy hand. And he gave him tithes of all."
          },
          {
            "reference": "Psalm 91:1",
            "text": "He that dwelleth in the secret place of the most High shall abide under the shadow of the Almighty."
          },
          {
            "reference": "Daniel 4:34",
            "text": "And at the end of the days I Nebuchadnezzar lifted up mine eyes unto heaven, and mine understanding returned unto me, and I blessed the most High, and I praised and honoured him that liveth for ever, whose dominion is an everlasting dominion, and his kingdom is from generation to generation:"
          },
          {
            "reference": "Daniel 7:18",
            "text": "But the saints of the most High shall take the kingdom, and possess the kingdom for ever, even for ever and ever."
          },
          {
            "reference": "Luke 1:32",
            "text": "He shall be great, and shall be called the Son of the Highest: and the Lord God shall give unto him the throne of his father David:"
          },
          {
            "reference": "Mark 5:7",
            "text": "And cried with a loud voice, and said, What have I to do with thee, Jesus, thou Son of the most high God? I adjure thee by God, that thou torment me not."
          }
        ]
      },
      "El Roi (אֵל רֳאִי)": {
        "title": "The God Who Sees",
        "description": "The deeply personal name אֵל רֳאִי (<em>El Roi</em>), meaning 'God who sees' or 'God of seeing,' arose from Hagar's desperate wilderness encounter with the angel of the LORD. Hagar, Sarai's Egyptian maidservant, had been given to Abram as a surrogate to provide the promised heir. When she conceived, she despised her barren mistress; Sarai responded with harsh treatment; Hagar fled into the wilderness toward Egypt (Genesis 16:1-6). Alone, pregnant, vulnerable, fleeing domestic abuse—Hagar represented the powerless, the oppressed, the forgotten.<br><br>At a spring in the wilderness on the way to Shur, the angel of the LORD found her and addressed her by name: 'Hagar, Sarai's maid, whence camest thou? and whither wilt thou go?' (Genesis 16:8). The questions demonstrated divine knowledge—He knew who she was, where she'd come from, what she was fleeing. After instructing her to return and submit to Sarai, He promised, 'I will multiply thy seed exceedingly, that it shall not be numbered for multitude' (Genesis 16:10)—a promise echoing God's covenant with Abram, now extended to Hagar's descendants. He prophesied concerning her son: she would name him Ishmael ('God hears') because 'the LORD hath heard thy affliction' (Genesis 16:11).<label for=\"sn-roi\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-roi\" class=\"margin-toggle\"/><span class=\"sidenote\">The Hebrew אֵל רֳאִי (<em>El Roi</em>) combines אֵל (<em>El</em>, 'God') with רֳאִי (<em>roi</em>), a participial form from the verb רָאָה (<em>ra'ah</em>), 'to see.' The precise grammatical form and resulting translation are debated: 'God who sees me,' 'God of seeing,' or possibly 'God who allows Himself to be seen.' The context strongly supports 'God who sees'—emphasizing divine observation of Hagar's distress. Hagar's rhetorical question ('Have I also here looked after him that seeth me?') suggests amazement that she had seen God and lived. The well's name Beer-lahai-roi ('well of the Living One who sees me') commemorates this encounter.</span><br><br>Hagar's response revealed profound theological insight: 'And she called the name of the LORD that spake unto her, Thou God seest me: for she said, Have I also here looked after him that seeth me?' (Genesis 16:13). She named the well Beer-lahai-roi ('well of the Living One who sees me'), testifying that <em>El Roi</em>—the God who sees—had observed her affliction, knew her plight, cared about her circumstances, and intervened on behalf of a powerless Egyptian slave woman. No one else saw her, knew her, or cared; but <em>El Roi</em> did.<br><br>This name assures believers that nothing escapes God's notice. When circumstances seem random, when suffering appears unobserved, when oppression continues unchecked, <em>El Roi</em> sees. He saw Hagar's tears, Israel's slavery in Egypt ('I have surely seen the affliction of my people,' Exodus 3:7), Job's integrity amid suffering, the widow's mite, the sparrow's fall, the disciple's secret prayer. David testified, 'O LORD, thou hast searched me, and known me. Thou knowest my downsitting and mine uprising, thou understandest my thought afar off' (Psalm 139:1-2). Jesus taught, 'The very hairs of your head are all numbered' (Matthew 10:30).<br><br><em>El Roi</em> also sees sin. 'The eyes of the LORD are in every place, beholding the evil and the good' (Proverbs 15:3). Hagar's encounter occurred while she was fleeing duty, yet God's seeing combined knowledge, compassion, and correction—He commanded her return while promising blessing. His seeing is not distant observation but engaged providence: He sees in order to know, to care, to act. Hebrews declares, 'All things are naked and opened unto the eyes of him with whom we have to do' (Hebrews 4:13)—simultaneously sobering (no sin is hidden) and comforting (no suffering is overlooked). <em>El Roi</em> sees the afflicted and delivers, sees the righteous and vindicates, sees injustice and judges. The God who saw Hagar in the wilderness sees every believer's trial and will bring deliverance in His perfect time.",
        "verses": [
          {
            "reference": "Genesis 16:11-13",
            "text": "And the angel of the LORD said unto her, Behold, thou art with child, and shalt bear a son, and shalt call his name Ishmael; because the LORD hath heard thy affliction. And he will be a wild man; his hand will be against every man, and every man's hand against him; and he shall dwell in the presence of all his brethren. And she called the name of the LORD that spake unto her, Thou God seest me: for she said, Have I also here looked after him that seeth me?"
          },
          {
            "reference": "Exodus 3:7",
            "text": "And the LORD said, I have surely seen the affliction of my people which are in Egypt, and have heard their cry by reason of their taskmasters; for I know their sorrows;"
          },
          {
            "reference": "Psalm 139:1-3",
            "text": "O LORD, thou hast searched me, and known me. Thou knowest my downsitting and mine uprising, thou understandest my thought afar off. Thou compassest my path and my lying down, and art acquainted with all my ways."
          },
          {
            "reference": "Proverbs 15:3",
            "text": "The eyes of the LORD are in every place, beholding the evil and the good."
          },
          {
            "reference": "Matthew 10:29-30",
            "text": "Are not two sparrows sold for a farthing? and one of them shall not fall on the ground without your Father. But the very hairs of your head are all numbered."
          },
          {
            "reference": "Hebrews 4:13",
            "text": "Neither is there any creature that is not manifest in his sight: but all things are naked and opened unto the eyes of him with whom we have to do."
          }
        ]
      },
      "Ancient of Days": {
        "title": "The Eternal, Everlasting God",
        "description": "The majestic Aramaic title עַתִּיק יוֹמִין (<em>Attiq Yomin</em>), translated 'Ancient of Days,' appears uniquely in Daniel's apocalyptic night visions (Daniel 7), the same chapter revealing the succession of world empires (depicted as beasts) and their ultimate subjugation to God's eternal kingdom. Daniel beheld thrones set in place, and 'the Ancient of days did sit, whose garment was white as snow, and the hair of his head like the pure wool: his throne was like the fiery flame, and his wheels as burning fire' (Daniel 7:9). The imagery conveys timeless existence, absolute holiness, and judicial authority—God as the eternal Judge before whom all earthly kingdoms must give account.<br><br>The title literally means 'advanced in days' or 'aged of days,' evoking not frailty but infinite existence. God is the one 'from everlasting to everlasting' (Psalm 90:2), who preceded all creation, who witnessed all history, who outlasts all empires. The white garment and hair symbolize holiness and purity; the fiery throne, consuming judgment; the burning wheels, divine mobility and omnipresence. 'A fiery stream issued and came forth from before him: thousand thousands ministered unto him, and ten thousand times ten thousand stood before him: the judgment was set, and the books were opened' (Daniel 7:10). The scene depicts the heavenly court convened for universal judgment.<label for=\"sn-ancient\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-ancient\" class=\"margin-toggle\"/><span class=\"sidenote\">The Aramaic עַתִּיק יוֹמִין (<em>Attiq Yomin</em>) combines עַתִּיק (<em>attiq</em>, 'aged, ancient, advanced') with יוֹמִין (<em>yomin</em>, 'days'). The phrase appears three times in Daniel 7 (verses 9, 13, 22), always in judicial contexts. Some scholars see Trinitarian implications in verse 13, where 'one like the Son of man' comes to the Ancient of Days—suggesting two distinct persons within the Godhead. The description resembles Ezekiel's vision of God's throne-chariot (Ezekiel 1) and anticipates Revelation's throne-room scenes (Revelation 4-5). The title emphasizes God's eternal pre-existence in contrast to temporal human kingdoms.</span><br><br>The vision's climax occurs when 'one like the Son of man came with the clouds of heaven, and came to the Ancient of days, and they brought him near before him. And there was given him dominion, and glory, and a kingdom, that all people, nations, and languages, should serve him: his dominion is an everlasting dominion, which shall not pass away, and his kingdom that which shall not be destroyed' (Daniel 7:13-14). This 'Son of man' figure—distinguished from the Ancient of Days yet receiving divine honors and eternal kingdom—finds fulfillment in Jesus Christ, who repeatedly identified Himself with Daniel's Son of man, claiming authority to judge (John 5:27) and promising to return 'in the clouds of heaven with power and great glory' (Matthew 24:30).<br><br>The vision's interpretation reveals God's sovereign control over history: four successive empires rise and fall (Babylon, Medo-Persia, Greece, Rome), each more terrible than the last, culminating in a final blasphemous kingdom. Yet 'the Ancient of days came, and judgment was given to the saints of the most High; and the time came that the saints possessed the kingdom' (Daniel 7:22). The eternal God outlasts all empires, judges all rulers, vindicates all saints, establishes an everlasting kingdom through the Son of man. The title assures believers that however dominant earthly powers appear, however prolonged their tyranny, the Ancient of Days pre-existed them, presides over them, and will ultimately dispose of them—His throne established from eternity, His kingdom without end, His judgments absolutely righteous. When time concludes, the timeless God remains; when kingdoms crumble, His dominion endures; when the books are opened, He who is 'from everlasting to everlasting' sits in perfect justice, rendering to each according to their deeds. The Ancient of Days is the Alpha and Omega, the First and the Last, He who was and is and is to come, the eternal Judge before whom all creation bows.",
        "verses": [
          {
            "reference": "Daniel 7:9-10",
            "text": "I beheld till the thrones were cast down, and the Ancient of days did sit, whose garment was white as snow, and the hair of his head like the pure wool: his throne was like the fiery flame, and his wheels as burning fire. A fiery stream issued and came forth from before him: thousand thousands ministered unto him, and ten thousand times ten thousand stood before him: the judgment was set, and the books were opened."
          },
          {
            "reference": "Daniel 7:13-14",
            "text": "I saw in the night visions, and, behold, one like the Son of man came with the clouds of heaven, and came to the Ancient of days, and they brought him near before him. And there was given him dominion, and glory, and a kingdom, that all people, nations, and languages, should serve him: his dominion is an everlasting dominion, which shall not pass away, and his kingdom that which shall not be destroyed."
          },
          {
            "reference": "Daniel 7:22",
            "text": "Until the Ancient of days came, and judgment was given to the saints of the most High; and the time came that the saints possessed the kingdom."
          },
          {
            "reference": "Psalm 90:2",
            "text": "Before the mountains were brought forth, or ever thou hadst formed the earth and the world, even from everlasting to everlasting, thou art God."
          },
          {
            "reference": "Revelation 1:8",
            "text": "I am Alpha and Omega, the beginning and the ending, saith the Lord, which is, and which was, and which is to come, the Almighty."
          },
          {
            "reference": "Revelation 4:2-3",
            "text": "And immediately I was in the spirit: and, behold, a throne was set in heaven, and one sat on the throne. And he that sat was to look upon like a jasper and a sardine stone: and there was a rainbow round about the throne, in sight like unto an emerald."
          }
        ]
      }
    }
  }
}