{
  "names_of_christ": {
    "Divine Names": {
      "I AM": {
        "title": "The Eternal Self-Existent One",
        "description": "When Jesus declared 'Before Abraham was, I AM,' He claimed the divine name revealed to Moses at the burning bush. The Jews understood this claim to deity—they took up stones to kill Him for blasphemy. Throughout John's Gospel, Jesus uses 'I AM' statements that echo Yahweh's self-revelation: I am the bread of life, the light of the world, the door, the good shepherd, the resurrection and the life, the way, the truth, and the life, the true vine. Each 'I AM' reveals Christ's sufficiency for every human need.",
        "verses": [
          {
            "reference": "John 8:58",
            "text": "Jesus said unto them, Verily, verily, I say unto you, Before Abraham was, I am."
          },
          {
            "reference": "Exodus 3:14",
            "text": "And God said unto Moses, I AM THAT I AM: and he said, Thus shalt thou say unto the children of Israel, I AM hath sent me unto you."
          },
          {
            "reference": "John 6:35",
            "text": "And Jesus said unto them, I am the bread of life: he that cometh to me shall never hunger; and he that believeth on me shall never thirst."
          },
          {
            "reference": "John 8:12",
            "text": "Then spake Jesus again unto them, saying, I am the light of the world: he that followeth me shall not walk in darkness, but shall have the light of life."
          },
          {
            "reference": "John 11:25",
            "text": "Jesus said unto her, I am the resurrection, and the life: he that believeth in me, though he were dead, yet shall he live."
          },
          {
            "reference": "John 14:6",
            "text": "Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me."
          }
        ]
      },
      "Lord": {
        "title": "Kurios - Master and Ruler",
        "description": "The title 'Lord' (Kurios) is used throughout the New Testament for Jesus. In the Septuagint, Kurios translates Yahweh—applying this title to Jesus affirms His deity. Thomas confessed the risen Christ as 'My Lord and my God.' Paul declares that every tongue will confess Jesus Christ is Lord. To call Jesus 'Lord' is to acknowledge His absolute authority, His deity, and His right to rule every area of life. Jesus asked, 'Why call ye me Lord, Lord, and do not the things which I say?'",
        "verses": [
          {
            "reference": "John 20:28",
            "text": "And Thomas answered and said unto him, My Lord and my God."
          },
          {
            "reference": "Philippians 2:11",
            "text": "And that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father."
          },
          {
            "reference": "Romans 10:9",
            "text": "That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved."
          },
          {
            "reference": "Acts 2:36",
            "text": "Therefore let all the house of Israel know assuredly, that God hath made that same Jesus, whom ye have crucified, both Lord and Christ."
          },
          {
            "reference": "Luke 6:46",
            "text": "And why call ye me, Lord, Lord, and do not the things which I say?"
          },
          {
            "reference": "1 Corinthians 12:3",
            "text": "Wherefore I give you to understand, that no man speaking by the Spirit of God calleth Jesus accursed: and that no man can say that Jesus is the Lord, but by the Holy Ghost."
          }
        ]
      },
      "Son of God": {
        "title": "The Only Begotten",
        "description": "Jesus is the Son of God in a unique sense—the only begotten of the Father. While believers become children of God by adoption, Jesus is Son by nature, eternally begotten. He is in the bosom of the Father, the exact representation of His being. The Father declared at Jesus' baptism and transfiguration, 'This is my beloved Son.' Jesus' Sonship means He shares the Father's divine nature. To deny the Son is to deny the Father; to honor the Son is to honor the Father.",
        "verses": [
          {
            "reference": "John 1:14",
            "text": "And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth."
          },
          {
            "reference": "John 3:16",
            "text": "For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life."
          },
          {
            "reference": "Matthew 3:17",
            "text": "And lo a voice from heaven, saying, This is my beloved Son, in whom I am well pleased."
          },
          {
            "reference": "Hebrews 1:3",
            "text": "Who being the brightness of his glory, and the express image of his person, and upholding all things by the word of his power, when he had by himself purged our sins, sat down on the right hand of the Majesty on high."
          },
          {
            "reference": "1 John 2:23",
            "text": "Whosoever denieth the Son, the same hath not the Father: (but) he that acknowledgeth the Son hath the Father also."
          },
          {
            "reference": "Matthew 16:16",
            "text": "And Simon Peter answered and said, Thou art the Christ, the Son of the living God."
          }
        ]
      }
    },
    "Messianic Titles": {
      "Christ / Messiah": {
        "title": "The Anointed One",
        "description": "Christ (Greek) and Messiah (Hebrew) both mean 'Anointed One.' In the Old Testament, prophets, priests, and kings were anointed for service. Jesus is the ultimate Anointed One—anointed by the Spirit without measure to fulfill all three offices. Peter's confession—'Thou art the Christ'—acknowledged Jesus as the long-awaited Messiah promised throughout Scripture. The title 'Jesus Christ' combines His personal name (Savior) with His office (Anointed King). He is the Christ, the Son of the living God.",
        "verses": [
          {
            "reference": "Matthew 16:16",
            "text": "And Simon Peter answered and said, Thou art the Christ, the Son of the living God."
          },
          {
            "reference": "John 1:41",
            "text": "He first findeth his own brother Simon, and saith unto him, We have found the Messias, which is, being interpreted, the Christ."
          },
          {
            "reference": "Luke 4:18",
            "text": "The Spirit of the Lord is upon me, because he hath anointed me to preach the gospel to the poor; he hath sent me to heal the brokenhearted, to preach deliverance to the captives, and recovering of sight to the blind, to set at liberty them that are bruised."
          },
          {
            "reference": "Acts 10:38",
            "text": "How God anointed Jesus of Nazareth with the Holy Ghost and with power: who went about doing good, and healing all that were oppressed of the devil; for God was with him."
          },
          {
            "reference": "John 4:25-26",
            "text": "The woman saith unto him, I know that Messias cometh, which is called Christ: when he is come, he will tell us all things. Jesus saith unto her, I that speak unto thee am he."
          },
          {
            "reference": "Daniel 9:25",
            "text": "Know therefore and understand, that from the going forth of the commandment to restore and to build Jerusalem unto the Messiah the Prince shall be seven weeks, and threescore and two weeks."
          }
        ]
      },
      "Son of Man": {
        "title": "The Human-Divine One",
        "description": "Jesus' favorite self-designation was 'Son of Man'—used over eighty times in the Gospels. The title emphasizes His true humanity while echoing Daniel's vision of one 'like the Son of Man' who receives everlasting dominion. The Son of Man has authority to forgive sins, is Lord of the Sabbath, came to seek and save the lost, and will come again in glory. This title captures both Christ's humble identification with humanity and His exalted position as the heavenly ruler.",
        "verses": [
          {
            "reference": "Daniel 7:13-14",
            "text": "I saw in the night visions, and, behold, one like the Son of man came with the clouds of heaven, and came to the Ancient of days... And there was given him dominion, and glory, and a kingdom, that all people, nations, and languages, should serve him."
          },
          {
            "reference": "Matthew 9:6",
            "text": "But that ye may know that the Son of man hath power on earth to forgive sins, (then saith he to the sick of the palsy,) Arise, take up thy bed, and go unto thine house."
          },
          {
            "reference": "Luke 19:10",
            "text": "For the Son of man is come to seek and to save that which was lost."
          },
          {
            "reference": "Matthew 26:64",
            "text": "Jesus saith unto him, Thou hast said: nevertheless I say unto you, Hereafter shall ye see the Son of man sitting on the right hand of power, and coming in the clouds of heaven."
          },
          {
            "reference": "John 3:13-14",
            "text": "And no man hath ascended up to heaven, but he that came down from heaven, even the Son of man which is in heaven. And as Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up."
          },
          {
            "reference": "Matthew 20:28",
            "text": "Even as the Son of man came not to be ministered unto, but to minister, and to give his life a ransom for many."
          }
        ]
      },
      "Son of David": {
        "title": "Heir to the Throne",
        "description": "Jesus is the Son of David—the rightful heir to David's throne, fulfilling God's promise of an eternal kingdom. Matthew opens his Gospel establishing Jesus as 'the son of David.' The crowds hailed Him as Son of David when He entered Jerusalem. The blind called out for mercy from the Son of David. Yet Jesus posed the puzzle: if David calls Him Lord, how is He merely his Son? The answer: Jesus is both David's descendant according to the flesh and David's Lord by His divine nature.",
        "verses": [
          {
            "reference": "Matthew 1:1",
            "text": "The book of the generation of Jesus Christ, the son of David, the son of Abraham."
          },
          {
            "reference": "Matthew 21:9",
            "text": "And the multitudes that went before, and that followed, cried, saying, Hosanna to the Son of David: Blessed is he that cometh in the name of the Lord; Hosanna in the highest."
          },
          {
            "reference": "Matthew 22:42-45",
            "text": "Saying, What think ye of Christ? whose son is he? They say unto him, The Son of David. He saith unto them, How then doth David in spirit call him Lord... If David then call him Lord, how is he his son?"
          },
          {
            "reference": "Romans 1:3",
            "text": "Concerning his Son Jesus Christ our Lord, which was made of the seed of David according to the flesh."
          },
          {
            "reference": "Revelation 22:16",
            "text": "I Jesus have sent mine angel to testify unto you these things in the churches. I am the root and the offspring of David, and the bright and morning star."
          },
          {
            "reference": "2 Timothy 2:8",
            "text": "Remember that Jesus Christ of the seed of David was raised from the dead according to my gospel."
          }
        ]
      }
    },
    "Redemptive Titles": {
      "Lamb of God": {
        "title": "The Sacrificial Lamb",
        "description": "John the Baptist introduced Jesus as 'the Lamb of God who takes away the sin of the world.' This title evokes the Passover lamb, the daily sacrifices, and Isaiah's suffering Servant led as a lamb to slaughter. Christ is our Passover, sacrificed for us. In Revelation, the Lamb who was slain is worthy to open the seals, and the redeemed praise Him who washed them in His blood. The Lamb on the throne receives the worship of all creation.",
        "verses": [
          {
            "reference": "John 1:29",
            "text": "The next day John seeth Jesus coming unto him, and saith, Behold the Lamb of God, which taketh away the sin of the world."
          },
          {
            "reference": "1 Peter 1:18-19",
            "text": "Forasmuch as ye know that ye were not redeemed with corruptible things, as silver and gold... But with the precious blood of Christ, as of a lamb without blemish and without spot."
          },
          {
            "reference": "Revelation 5:12",
            "text": "Saying with a loud voice, Worthy is the Lamb that was slain to receive power, and riches, and wisdom, and strength, and honour, and glory, and blessing."
          },
          {
            "reference": "1 Corinthians 5:7",
            "text": "Purge out therefore the old leaven, that ye may be a new lump, as ye are unleavened. For even Christ our passover is sacrificed for us."
          },
          {
            "reference": "Isaiah 53:7",
            "text": "He was oppressed, and he was afflicted, yet he opened not his mouth: he is brought as a lamb to the slaughter, and as a sheep before her shearers is dumb, so he openeth not his mouth."
          },
          {
            "reference": "Revelation 7:17",
            "text": "For the Lamb which is in the midst of the throne shall feed them, and shall lead them unto living fountains of waters: and God shall wipe away all tears from their eyes."
          }
        ]
      },
      "Savior": {
        "title": "Jesus - Yahweh Saves",
        "description": "The name 'Jesus' means 'Yahweh saves' or 'Yahweh is salvation.' He was given this name because He would save His people from their sins. There is no other name under heaven given among men whereby we must be saved. He is the Savior of the world, not just of Israel. He came to seek and save the lost. God sent not His Son to condemn the world but that the world through Him might be saved. He is able to save to the uttermost all who come to God through Him.",
        "verses": [
          {
            "reference": "Matthew 1:21",
            "text": "And she shall bring forth a son, and thou shalt call his name JESUS: for he shall save his people from their sins."
          },
          {
            "reference": "Acts 4:12",
            "text": "Neither is there salvation in any other: for there is none other name under heaven given among men, whereby we must be saved."
          },
          {
            "reference": "1 John 4:14",
            "text": "And we have seen and do testify that the Father sent the Son to be the Saviour of the world."
          },
          {
            "reference": "Luke 19:10",
            "text": "For the Son of man is come to seek and to save that which was lost."
          },
          {
            "reference": "John 3:17",
            "text": "For God sent not his Son into the world to condemn the world; but that the world through him might be saved."
          },
          {
            "reference": "Hebrews 7:25",
            "text": "Wherefore he is able also to save them to the uttermost that come unto God by him, seeing he ever liveth to make intercession for them."
          }
        ]
      },
      "Mediator": {
        "title": "The One Between",
        "description": "There is one God and one Mediator between God and men—the man Christ Jesus. A mediator stands between two parties to reconcile them. Jesus bridges the infinite gap between holy God and sinful humanity. He is qualified to mediate because He is both God and man—able to represent both parties. He is the mediator of the new covenant, securing eternal redemption. Through Him we have access to the Father. No one comes to the Father except through Him.",
        "verses": [
          {
            "reference": "1 Timothy 2:5",
            "text": "For there is one God, and one mediator between God and men, the man Christ Jesus."
          },
          {
            "reference": "Hebrews 9:15",
            "text": "And for this cause he is the mediator of the new testament, that by means of death, for the redemption of the transgressions that were under the first testament, they which are called might receive the promise of eternal inheritance."
          },
          {
            "reference": "Hebrews 12:24",
            "text": "And to Jesus the mediator of the new covenant, and to the blood of sprinkling, that speaketh better things than that of Abel."
          },
          {
            "reference": "Hebrews 8:6",
            "text": "But now hath he obtained a more excellent ministry, by how much also he is the mediator of a better covenant, which was established upon better promises."
          },
          {
            "reference": "John 14:6",
            "text": "Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me."
          },
          {
            "reference": "Ephesians 2:18",
            "text": "For through him we both have access by one Spirit unto the Father."
          }
        ]
      }
    },
    "Relational Titles": {
      "Good Shepherd": {
        "title": "The Shepherd of Our Souls",
        "description": "Jesus declared Himself the Good Shepherd who lays down His life for the sheep. The shepherd imagery runs throughout Scripture—the LORD is my shepherd. Jesus is the Chief Shepherd, the Great Shepherd of the sheep brought back from death by the blood of the everlasting covenant. He knows His sheep and is known by them. He calls them by name and leads them out. His sheep hear His voice and follow Him. He gives them eternal life, and they shall never perish.",
        "verses": [
          {
            "reference": "John 10:11",
            "text": "I am the good shepherd: the good shepherd giveth his life for the sheep."
          },
          {
            "reference": "John 10:14",
            "text": "I am the good shepherd, and know my sheep, and am known of mine."
          },
          {
            "reference": "Psalm 23:1",
            "text": "The LORD is my shepherd; I shall not want."
          },
          {
            "reference": "1 Peter 5:4",
            "text": "And when the chief Shepherd shall appear, ye shall receive a crown of glory that fadeth not away."
          },
          {
            "reference": "Hebrews 13:20",
            "text": "Now the God of peace, that brought again from the dead our Lord Jesus, that great shepherd of the sheep, through the blood of the everlasting covenant."
          },
          {
            "reference": "John 10:27-28",
            "text": "My sheep hear my voice, and I know them, and they follow me: And I give unto them eternal life; and they shall never perish, neither shall any man pluck them out of my hand."
          }
        ]
      },
      "Friend of Sinners": {
        "title": "Welcomer of the Outcast",
        "description": "The Pharisees used 'friend of sinners' as a slur against Jesus, but it became a title of glory. He came not to call the righteous but sinners to repentance. He ate with tax collectors and sinners, scandalizing the religious elite. The Son of Man came eating and drinking, welcoming those whom others rejected. He called His disciples friends, not servants. Greater love has no man than this—that a man lay down his life for his friends. He befriended us while we were yet sinners.",
        "verses": [
          {
            "reference": "Matthew 11:19",
            "text": "The Son of man came eating and drinking, and they say, Behold a man gluttonous, and a winebibber, a friend of publicans and sinners. But wisdom is justified of her children."
          },
          {
            "reference": "Luke 15:2",
            "text": "And the Pharisees and scribes murmured, saying, This man receiveth sinners, and eateth with them."
          },
          {
            "reference": "Mark 2:17",
            "text": "When Jesus heard it, he saith unto them, They that are whole have no need of the physician, but they that are sick: I came not to call the righteous, but sinners to repentance."
          },
          {
            "reference": "John 15:13-15",
            "text": "Greater love hath no man than this, that a man lay down his life for his friends. Ye are my friends, if ye do whatsoever I command you. Henceforth I call you not servants; for the servant knoweth not what his lord doeth: but I have called you friends."
          },
          {
            "reference": "Romans 5:8",
            "text": "But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us."
          },
          {
            "reference": "Luke 7:34",
            "text": "The Son of man is come eating and drinking; and ye say, Behold a gluttonous man, and a winebibber, a friend of publicans and sinners!"
          }
        ]
      }
    }
  }
}