{
  "pneumatology": {
    "The Person of the Holy Spirit": {
      "The Spirit is God": {
        "title": "The Third Person of the Trinity",
        "description": "The Holy Spirit is not merely a force or influence but a divine Person—the third Person of the Trinity, coequal and coeternal with the Father and the Son. He possesses all the attributes of deity: omniscience, omnipresence, omnipotence, and eternality. To lie to the Holy Spirit is to lie to God. He is called the Lord, the Spirit. He was present at creation, hovering over the face of the waters. He is the Spirit of God and the Spirit of Christ. The Spirit searches all things, even the deep things of God. Blaspheming the Holy Spirit is the unforgivable sin, testifying to His full deity.",
        "verses": [
          {
            "reference": "Acts 5:3-4",
            "text": "But Peter said, Ananias, why hath Satan filled thine heart to lie to the Holy Ghost, and to keep back part of the price of the land? Whiles it remained, was it not thine own? and after it was sold, was it not in thine own power? why hast thou conceived this thing in thine heart? thou hast not lied unto men, but unto God."
          },
          {
            "reference": "2 Corinthians 3:17-18",
            "text": "Now the Lord is that Spirit: and where the Spirit of the Lord is, there is liberty. But we all, with open face beholding as in a glass the glory of the Lord, are changed into the same image from glory to glory, even as by the Spirit of the Lord."
          },
          {
            "reference": "Genesis 1:2",
            "text": "And the earth was without form, and void; and darkness was upon the face of the deep. And the Spirit of God moved upon the face of the waters."
          },
          {
            "reference": "1 Corinthians 2:10-11",
            "text": "But God hath revealed them unto us by his Spirit: for the Spirit searcheth all things, yea, the deep things of God. For what man knoweth the things of a man, save the spirit of man which is in him? even so the things of God knoweth no man, but the Spirit of God."
          },
          {
            "reference": "Psalm 139:7-8",
            "text": "Whither shall I go from thy spirit? or whither shall I flee from thy presence? If I ascend up into heaven, thou art there: if I make my bed in hell, behold, thou art there."
          },
          {
            "reference": "Hebrews 9:14",
            "text": "How much more shall the blood of Christ, who through the eternal Spirit offered himself without spot to God, purge your conscience from dead works to serve the living God?"
          }
        ]
      },
      "The Personality of the Spirit": {
        "title": "He, Not It",
        "description": "The Holy Spirit is a Person, not an impersonal force. He has all the marks of personality: intellect (He knows and teaches), emotions (He can be grieved), and will (He distributes gifts as He wills). He speaks, testifies, guides, commands, forbids, intercedes, and can be lied to, resisted, and blasphemed—all personal activities. Jesus consistently used personal pronouns for the Spirit, calling Him 'He' and 'Him,' not 'it.' The Spirit is the Comforter, the Advocate, who comes alongside believers. Recognizing His personhood transforms our relationship with Him from using a power to knowing a Person.",
        "verses": [
          {
            "reference": "John 14:16-17",
            "text": "And I will pray the Father, and he shall give you another Comforter, that he may abide with you for ever; Even the Spirit of truth; whom the world cannot receive, because it seeth him not, neither knoweth him: but ye know him; for he dwelleth with you, and shall be in you."
          },
          {
            "reference": "John 16:13",
            "text": "Howbeit when he, the Spirit of truth, is come, he will guide you into all truth: for he shall not speak of himself; but whatsoever he shall hear, that shall he speak: and he will shew you things to come."
          },
          {
            "reference": "Ephesians 4:30",
            "text": "And grieve not the holy Spirit of God, whereby ye are sealed unto the day of redemption."
          },
          {
            "reference": "1 Corinthians 12:11",
            "text": "But all these worketh that one and the selfsame Spirit, dividing to every man severally as he will."
          },
          {
            "reference": "Acts 13:2",
            "text": "As they ministered to the Lord, and fasted, the Holy Ghost said, Separate me Barnabas and Saul for the work whereunto I have called them."
          },
          {
            "reference": "Romans 8:26-27",
            "text": "Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered. And he that searcheth the hearts knoweth what is the mind of the Spirit, because he maketh intercession for the saints according to the will of God."
          }
        ]
      },
      "Names and Titles of the Spirit": {
        "title": "The Many Names Revealing His Nature",
        "description": "Scripture gives the Holy Spirit numerous names that reveal His nature and work. He is the Spirit of God and the Spirit of Christ, showing His relationship to the other Persons of the Trinity. He is the Spirit of Truth who guides into all truth. He is the Comforter (Parakletos)—one called alongside to help, advocate, and encourage. He is the Spirit of holiness, of grace, of glory, of life, of adoption, of wisdom and revelation. He is the Spirit of promise, the guarantee of our inheritance. Each name illuminates a facet of His glorious person and ministry.",
        "verses": [
          {
            "reference": "Romans 8:9",
            "text": "But ye are not in the flesh, but in the Spirit, if so be that the Spirit of God dwell in you. Now if any man have not the Spirit of Christ, he is none of his."
          },
          {
            "reference": "John 14:17",
            "text": "Even the Spirit of truth; whom the world cannot receive, because it seeth him not, neither knoweth him: but ye know him; for he dwelleth with you, and shall be in you."
          },
          {
            "reference": "John 14:26",
            "text": "But the Comforter, which is the Holy Ghost, whom the Father will send in my name, he shall teach you all things, and bring all things to your remembrance, whatsoever I have said unto you."
          },
          {
            "reference": "Romans 1:4",
            "text": "And declared to be the Son of God with power, according to the spirit of holiness, by the resurrection from the dead."
          },
          {
            "reference": "Hebrews 10:29",
            "text": "Of how much sorer punishment, suppose ye, shall he be thought worthy, who hath trodden under foot the Son of God, and hath counted the blood of the covenant, wherewith he was sanctified, an unholy thing, and hath done despite unto the Spirit of grace?"
          },
          {
            "reference": "Ephesians 1:13-14",
            "text": "In whom ye also trusted, after that ye heard the word of truth, the gospel of your salvation: in whom also after that ye believed, ye were sealed with that holy Spirit of promise, Which is the earnest of our inheritance until the redemption of the purchased possession, unto the praise of his glory."
          }
        ]
      }
    },
    "The Work of the Spirit in Salvation": {
      "Conviction of Sin": {
        "title": "Convincing the World",
        "description": "The Holy Spirit's first work in salvation is conviction—He convinces the world of sin, righteousness, and judgment. Without this divine work, no one would feel their need of Christ. The Spirit shows sinners that their fundamental sin is unbelief in Christ, that true righteousness is found only in Christ who ascended to the Father, and that judgment is certain because Satan has already been judged. This conviction is not merely guilt feelings but a Spirit-wrought understanding of one's true condition before God. It is the necessary precursor to repentance and faith.",
        "verses": [
          {
            "reference": "John 16:8-11",
            "text": "And when he is come, he will reprove the world of sin, and of righteousness, and of judgment: Of sin, because they believe not on me; Of righteousness, because I go to my Father, and ye see me no more; Of judgment, because the prince of this world is judged."
          },
          {
            "reference": "Acts 2:37",
            "text": "Now when they heard this, they were pricked in their heart, and said unto Peter and to the rest of the apostles, Men and brethren, what shall we do?"
          },
          {
            "reference": "1 Thessalonians 1:5",
            "text": "For our gospel came not unto you in word only, but also in power, and in the Holy Ghost, and in much assurance; as ye know what manner of men we were among you for your sake."
          },
          {
            "reference": "Acts 7:51",
            "text": "Ye stiffnecked and uncircumcised in heart and ears, ye do always resist the Holy Ghost: as your fathers did, so do ye."
          },
          {
            "reference": "John 6:63",
            "text": "It is the spirit that quickeneth; the flesh profiteth nothing: the words that I speak unto you, they are spirit, and they are life."
          }
        ]
      },
      "Regeneration": {
        "title": "The Spirit Gives New Life",
        "description": "Regeneration is the Spirit's work of imparting new life to spiritually dead sinners. Jesus told Nicodemus that one must be born of the Spirit to enter the kingdom of God. The wind blows where it wishes—this sovereign act cannot be controlled or predicted by human effort. The Spirit breathes life into dead souls just as God breathed life into Adam. He creates clean hearts and renews right spirits within us. This new birth produces new creatures—old things pass away, all things become new. Regeneration is instantaneous, supernatural, and transformative.",
        "verses": [
          {
            "reference": "John 3:5-8",
            "text": "Jesus answered, Verily, verily, I say unto thee, Except a man be born of water and of the Spirit, he cannot enter into the kingdom of God. That which is born of the flesh is flesh; and that which is born of the Spirit is spirit. Marvel not that I said unto thee, Ye must be born again. The wind bloweth where it listeth, and thou hearest the sound thereof, but canst not tell whence it cometh, and whither it goeth: so is every one that is born of the Spirit."
          },
          {
            "reference": "Titus 3:5",
            "text": "Not by works of righteousness which we have done, but according to his mercy he saved us, by the washing of regeneration, and renewing of the Holy Ghost."
          },
          {
            "reference": "Ezekiel 37:14",
            "text": "And shall put my spirit in you, and ye shall live, and I shall place you in your own land: then shall ye know that I the LORD have spoken it, and performed it, saith the LORD."
          },
          {
            "reference": "Psalm 51:10",
            "text": "Create in me a clean heart, O God; and renew a right spirit within me."
          },
          {
            "reference": "2 Corinthians 5:17",
            "text": "Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new."
          },
          {
            "reference": "John 6:63",
            "text": "It is the spirit that quickeneth; the flesh profiteth nothing: the words that I speak unto you, they are spirit, and they are life."
          }
        ]
      },
      "Indwelling and Sealing": {
        "title": "The Spirit Lives Within",
        "description": "Every believer is indwelt by the Holy Spirit from the moment of conversion. Our bodies become temples of the Holy Spirit. This indwelling is not temporary but permanent—He will abide with us forever. The Spirit's indwelling distinguishes the new covenant from the old, when the Spirit came upon people for specific tasks but did not permanently indwell. We are also sealed with the Spirit, marked as God's possession, secured until the day of redemption. This seal is the guarantee of our inheritance, the down payment of heaven. No one can break God's seal.",
        "verses": [
          {
            "reference": "1 Corinthians 6:19-20",
            "text": "What? know ye not that your body is the temple of the Holy Ghost which is in you, which ye have of God, and ye are not your own? For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's."
          },
          {
            "reference": "John 14:16-17",
            "text": "And I will pray the Father, and he shall give you another Comforter, that he may abide with you for ever; Even the Spirit of truth; whom the world cannot receive, because it seeth him not, neither knoweth him: but ye know him; for he dwelleth with you, and shall be in you."
          },
          {
            "reference": "Ephesians 1:13-14",
            "text": "In whom ye also trusted, after that ye heard the word of truth, the gospel of your salvation: in whom also after that ye believed, ye were sealed with that holy Spirit of promise, Which is the earnest of our inheritance until the redemption of the purchased possession, unto the praise of his glory."
          },
          {
            "reference": "Ephesians 4:30",
            "text": "And grieve not the holy Spirit of God, whereby ye are sealed unto the day of redemption."
          },
          {
            "reference": "Romans 8:9",
            "text": "But ye are not in the flesh, but in the Spirit, if so be that the Spirit of God dwell in you. Now if any man have not the Spirit of Christ, he is none of his."
          },
          {
            "reference": "2 Corinthians 1:21-22",
            "text": "Now he which stablisheth us with you in Christ, and hath anointed us, is God; Who hath also sealed us, and given the earnest of the Spirit in our hearts."
          }
        ]
      }
    },
    "The Spirit's Ministry to Believers": {
      "Teaching and Illumination": {
        "title": "The Spirit of Truth",
        "description": "The Holy Spirit teaches believers and guides them into all truth. He takes the things of Christ and reveals them to us. He illuminates Scripture, opening our understanding to perceive spiritual truths that the natural mind cannot receive. He brings to remembrance the words of Christ. The Spirit is the anointing that teaches us concerning all things—we need not that any man teach us, for His anointing teaches truth. This does not eliminate human teachers but means the Spirit enables us to discern truth from error. He gives wisdom and revelation in the knowledge of Christ.",
        "verses": [
          {
            "reference": "John 16:13-14",
            "text": "Howbeit when he, the Spirit of truth, is come, he will guide you into all truth: for he shall not speak of himself; but whatsoever he shall hear, that shall he speak: and he will shew you things to come. He shall glorify me: for he shall receive of mine, and shall shew it unto you."
          },
          {
            "reference": "John 14:26",
            "text": "But the Comforter, which is the Holy Ghost, whom the Father will send in my name, he shall teach you all things, and bring all things to your remembrance, whatsoever I have said unto you."
          },
          {
            "reference": "1 Corinthians 2:12-14",
            "text": "Now we have received, not the spirit of the world, but the spirit which is of God; that we might know the things that are freely given to us of God. Which things also we speak, not in the words which man's wisdom teacheth, but which the Holy Ghost teacheth; comparing spiritual things with spiritual."
          },
          {
            "reference": "1 John 2:27",
            "text": "But the anointing which ye have received of him abideth in you, and ye need not that any man teach you: but as the same anointing teacheth you of all things, and is truth, and is no lie, and even as it hath taught you, ye shall abide in him."
          },
          {
            "reference": "Ephesians 1:17-18",
            "text": "That the God of our Lord Jesus Christ, the Father of glory, may give unto you the spirit of wisdom and revelation in the knowledge of him: The eyes of your understanding being enlightened."
          }
        ]
      },
      "Sanctification": {
        "title": "Growing in Holiness by the Spirit",
        "description": "The Holy Spirit is the primary agent of sanctification in the believer's life. We are sanctified by the Spirit. He produces holiness by conforming us to the image of Christ, transforming us from glory to glory. The flesh and Spirit are at war—the Spirit helps us mortify the deeds of the body. If we walk in the Spirit, we will not fulfill the lusts of the flesh. The Spirit produces His fruit in us: love, joy, peace, longsuffering, gentleness, goodness, faith, meekness, and temperance. Sanctification is not self-improvement but Spirit-empowerment.",
        "verses": [
          {
            "reference": "2 Thessalonians 2:13",
            "text": "But we are bound to give thanks alway to God for you, brethren beloved of the Lord, because God hath from the beginning chosen you to salvation through sanctification of the Spirit and belief of the truth."
          },
          {
            "reference": "2 Corinthians 3:18",
            "text": "But we all, with open face beholding as in a glass the glory of the Lord, are changed into the same image from glory to glory, even as by the Spirit of the Lord."
          },
          {
            "reference": "Galatians 5:16-17",
            "text": "This I say then, Walk in the Spirit, and ye shall not fulfil the lust of the flesh. For the flesh lusteth against the Spirit, and the Spirit against the flesh: and these are contrary the one to the other: so that ye cannot do the things that ye would."
          },
          {
            "reference": "Romans 8:13",
            "text": "For if ye live after the flesh, ye shall die: but if ye through the Spirit do mortify the deeds of the body, ye shall live."
          },
          {
            "reference": "Galatians 5:22-23",
            "text": "But the fruit of the Spirit is love, joy, peace, longsuffering, gentleness, goodness, faith, Meekness, temperance: against such there is no law."
          },
          {
            "reference": "1 Peter 1:2",
            "text": "Elect according to the foreknowledge of God the Father, through sanctification of the Spirit, unto obedience and sprinkling of the blood of Jesus Christ."
          }
        ]
      },
      "Assurance and Witness": {
        "title": "The Spirit Bears Witness",
        "description": "The Holy Spirit provides assurance of salvation to believers. He bears witness with our spirit that we are children of God. This internal testimony is not mere subjective feeling but the Spirit's supernatural work of confirming our adoption. He cries 'Abba, Father' within us. By the Spirit we know that Christ abides in us. The Spirit is the earnest—the down payment—of our inheritance, guaranteeing that God will complete what He began. This assurance enables us to approach God with confidence and to endure trials knowing our eternal destiny is secure.",
        "verses": [
          {
            "reference": "Romans 8:16",
            "text": "The Spirit itself beareth witness with our spirit, that we are the children of God."
          },
          {
            "reference": "Galatians 4:6",
            "text": "And because ye are sons, God hath sent forth the Spirit of his Son into your hearts, crying, Abba, Father."
          },
          {
            "reference": "1 John 3:24",
            "text": "And he that keepeth his commandments dwelleth in him, and he in him. And hereby we know that he abideth in us, by the Spirit which he hath given us."
          },
          {
            "reference": "1 John 4:13",
            "text": "Hereby know we that we dwell in him, and he in us, because he hath given us of his Spirit."
          },
          {
            "reference": "2 Corinthians 5:5",
            "text": "Now he that hath wrought us for the selfsame thing is God, who also hath given unto us the earnest of the Spirit."
          },
          {
            "reference": "Romans 8:15",
            "text": "For ye have not received the spirit of bondage again to fear; but ye have received the Spirit of adoption, whereby we cry, Abba, Father."
          }
        ]
      },
      "Intercession": {
        "title": "The Spirit Prays for Us",
        "description": "The Holy Spirit helps our weakness in prayer. We do not know what to pray for as we ought, but the Spirit intercedes for us with groanings that cannot be uttered. He who searches hearts knows the mind of the Spirit, for the Spirit intercedes for the saints according to God's will. This means our prayers, even when feeble and confused, are transformed by the Spirit into perfect petitions aligned with God's purposes. We have two intercessors: Christ at God's right hand and the Spirit within our hearts. We never pray alone.",
        "verses": [
          {
            "reference": "Romans 8:26-27",
            "text": "Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered. And he that searcheth the hearts knoweth what is the mind of the Spirit, because he maketh intercession for the saints according to the will of God."
          },
          {
            "reference": "Ephesians 6:18",
            "text": "Praying always with all prayer and supplication in the Spirit, and watching thereunto with all perseverance and supplication for all saints."
          },
          {
            "reference": "Jude 20",
            "text": "But ye, beloved, building up yourselves on your most holy faith, praying in the Holy Ghost."
          },
          {
            "reference": "Zechariah 12:10",
            "text": "And I will pour upon the house of David, and upon the inhabitants of Jerusalem, the spirit of grace and of supplications."
          },
          {
            "reference": "Romans 8:34",
            "text": "Who is he that condemneth? It is Christ that died, yea rather, that is risen again, who is even at the right hand of God, who also maketh intercession for us."
          }
        ]
      }
    },
    "The Gifts of the Spirit": {
      "Spiritual Gifts Given": {
        "title": "Gifts for Ministry",
        "description": "The Holy Spirit distributes spiritual gifts to every believer for the common good of the church. These gifts are not natural talents but supernatural endowments for ministry. The Spirit divides to every man severally as He wills—we do not choose our gifts, but we are to earnestly desire the best gifts. The purpose of gifts is not personal edification or display but building up the body of Christ. Every member has at least one gift; no member has all gifts. The diversity of gifts creates interdependence within the body.",
        "verses": [
          {
            "reference": "1 Corinthians 12:4-7",
            "text": "Now there are diversities of gifts, but the same Spirit. And there are differences of administrations, but the same Lord. And there are diversities of operations, but it is the same God which worketh all in all. But the manifestation of the Spirit is given to every man to profit withal."
          },
          {
            "reference": "1 Corinthians 12:11",
            "text": "But all these worketh that one and the selfsame Spirit, dividing to every man severally as he will."
          },
          {
            "reference": "Romans 12:6-8",
            "text": "Having then gifts differing according to the grace that is given to us, whether prophecy, let us prophesy according to the proportion of faith; Or ministry, let us wait on our ministering: or he that teacheth, on teaching; Or he that exhorteth, on exhortation: he that giveth, let him do it with simplicity; he that ruleth, with diligence; he that sheweth mercy, with cheerfulness."
          },
          {
            "reference": "1 Peter 4:10-11",
            "text": "As every man hath received the gift, even so minister the same one to another, as good stewards of the manifold grace of God. If any man speak, let him speak as the oracles of God; if any man minister, let him do it as of the ability which God giveth."
          },
          {
            "reference": "1 Corinthians 14:12",
            "text": "Even so ye, forasmuch as ye are zealous of spiritual gifts, seek that ye may excel to the edifying of the church."
          },
          {
            "reference": "Ephesians 4:11-12",
            "text": "And he gave some, apostles; and some, prophets; and some, evangelists; and some, pastors and teachers; For the perfecting of the saints, for the work of the ministry, for the edifying of the body of Christ."
          }
        ]
      },
      "The Fruit of the Spirit": {
        "title": "Character Produced by the Spirit",
        "description": "While gifts are what we do for God, fruit is what God produces in us—the character of Christ formed within. The fruit of the Spirit is singular—one cluster with nine manifestations: love, joy, peace, longsuffering, gentleness, goodness, faith, meekness, and temperance. This fruit stands in stark contrast to the works of the flesh. Fruit is not produced by human effort but by abiding in Christ—the branch cannot bear fruit of itself. Against such fruit there is no law—it is the fulfillment of all that the law required. The Spirit's fruit is the evidence of genuine salvation.",
        "verses": [
          {
            "reference": "Galatians 5:22-23",
            "text": "But the fruit of the Spirit is love, joy, peace, longsuffering, gentleness, goodness, faith, Meekness, temperance: against such there is no law."
          },
          {
            "reference": "Galatians 5:19-21",
            "text": "Now the works of the flesh are manifest, which are these; Adultery, fornication, uncleanness, lasciviousness, Idolatry, witchcraft, hatred, variance, emulations, wrath, strife, seditions, heresies, Envyings, murders, drunkenness, revellings, and such like."
          },
          {
            "reference": "John 15:4-5",
            "text": "Abide in me, and I in you. As the branch cannot bear fruit of itself, except it abide in the vine; no more can ye, except ye abide in me. I am the vine, ye are the branches: He that abideth in me, and I in him, the same bringeth forth much fruit: for without me ye can do nothing."
          },
          {
            "reference": "John 15:8",
            "text": "Herein is my Father glorified, that ye bear much fruit; so shall ye be my disciples."
          },
          {
            "reference": "Colossians 1:10",
            "text": "That ye might walk worthy of the Lord unto all pleasing, being fruitful in every good work, and increasing in the knowledge of God."
          },
          {
            "reference": "Matthew 7:20",
            "text": "Wherefore by their fruits ye shall know them."
          }
        ]
      }
    },
    "Being Filled with the Spirit": {
      "The Command to Be Filled": {
        "title": "Continuously Controlled by the Spirit",
        "description": "While every believer is indwelt by the Spirit, not every believer is filled with the Spirit. We are commanded: 'Be filled with the Spirit'—a present imperative indicating continuous, ongoing action. This is not a second blessing but a repeated appropriation of the Spirit's control. Being filled means being controlled by, directed by, empowered by the Spirit. It contrasts with being drunk with wine—as alcohol controls the intoxicated person, so the Spirit is to control the believer. The evidence of filling is not spectacular manifestations but speaking to one another in psalms and hymns, giving thanks always, and submitting to one another.",
        "verses": [
          {
            "reference": "Ephesians 5:18-21",
            "text": "And be not drunk with wine, wherein is excess; but be filled with the Spirit; Speaking to yourselves in psalms and hymns and spiritual songs, singing and making melody in your heart to the Lord; Giving thanks always for all things unto God and the Father in the name of our Lord Jesus Christ; Submitting yourselves one to another in the fear of God."
          },
          {
            "reference": "Acts 4:31",
            "text": "And when they had prayed, the place was shaken where they were assembled together; and they were all filled with the Holy Ghost, and they spake the word of God with boldness."
          },
          {
            "reference": "Acts 13:52",
            "text": "And the disciples were filled with joy, and with the Holy Ghost."
          },
          {
            "reference": "Colossians 3:16",
            "text": "Let the word of Christ dwell in you richly in all wisdom; teaching and admonishing one another in psalms and hymns and spiritual songs, singing with grace in your hearts to the Lord."
          },
          {
            "reference": "Acts 6:3",
            "text": "Wherefore, brethren, look ye out among you seven men of honest report, full of the Holy Ghost and wisdom, whom we may appoint over this business."
          },
          {
            "reference": "Acts 11:24",
            "text": "For he was a good man, and full of the Holy Ghost and of faith: and much people was added unto the Lord."
          }
        ]
      },
      "Walking in the Spirit": {
        "title": "Daily Dependence on the Spirit",
        "description": "Walking in the Spirit describes the moment-by-moment dependence on the Spirit's guidance and power. If we walk in the Spirit, we will not fulfill the lust of the flesh. Walking implies progress, direction, and consistent movement. We are to live by the Spirit, be led by the Spirit, and keep in step with the Spirit. This is not passive but active—following where He leads, obeying what He reveals, depending on His strength. Those who are led by the Spirit are sons of God. The Spirit-led life is the normal Christian life, not an exceptional level of spirituality.",
        "verses": [
          {
            "reference": "Galatians 5:16",
            "text": "This I say then, Walk in the Spirit, and ye shall not fulfil the lust of the flesh."
          },
          {
            "reference": "Galatians 5:25",
            "text": "If we live in the Spirit, let us also walk in the Spirit."
          },
          {
            "reference": "Romans 8:14",
            "text": "For as many as are led by the Spirit of God, they are the sons of God."
          },
          {
            "reference": "Galatians 5:18",
            "text": "But if ye be led of the Spirit, ye are not under the law."
          },
          {
            "reference": "Romans 8:4",
            "text": "That the righteousness of the law might be fulfilled in us, who walk not after the flesh, but after the Spirit."
          },
          {
            "reference": "Romans 8:5-6",
            "text": "For they that are after the flesh do mind the things of the flesh; but they that are after the Spirit the things of the Spirit. For to be carnally minded is death; but to be spiritually minded is life and peace."
          }
        ]
      }
    }
  }
}