{
  "prophets": {
    "Non-Writing Prophets": {
      "Moses": {
        "title": "The Prophet Like No Other",
        "description": "Moses stands unique among Israel's prophets, the one with whom God spoke 'mouth to mouth, even apparently, and not in dark speeches' (Numbers 12:8). Scripture explicitly identifies him as a prophet: 'And there arose not a prophet since in Israel like unto Moses, whom the LORD knew face to face' (Deuteronomy 34:10).</p><p>His prophetic ministry began at the burning bush, where God commissioned him to deliver Israel from Egyptian bondage, authenticating his message through miraculous signs. Through Moses, God delivered the Torah—the foundational revelation upon which all subsequent prophecy builds. He mediated the covenant at Sinai, receiving the law directly from God's hand, and interceded repeatedly for rebellious Israel, even offering his own life for their forgiveness.</p><p>Moses's greatest prophecy concerned the coming Messiah: 'The LORD thy God will raise up unto thee a Prophet from the midst of thee, of thy brethren, like unto me; unto him ye shall hearken' (Deuteronomy 18:15). The New Testament repeatedly identifies Jesus as this prophet like Moses (Acts 3:22, 7:37). At the Transfiguration, Moses appeared with Elijah, representing the Law and the Prophets, both bearing witness to Christ. Though Moses died on Mount Nebo viewing but not entering Canaan, his prophetic legacy endures as the foundation of biblical revelation.<label for=\"sn-moses\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-moses\" class=\"margin-toggle\"/><span class=\"sidenote\">The phrase 'face to face' describing God's communication with Moses distinguishes his prophetic experience from all others. While other prophets received visions and dreams, Moses enjoyed direct divine discourse. His sister Miriam and brother Aaron were rebuked for claiming equal prophetic authority (Numbers 12). The 'prophet like Moses' prophecy establishes a typological pattern: as Moses delivered Israel from Egyptian bondage, so Christ delivers His people from sin's slavery; as Moses mediated the old covenant, Christ mediates the new.</span>",
        "verses": [
          {
            "reference": "Deuteronomy 18:15",
            "text": "The LORD thy God will raise up unto thee a Prophet from the midst of thee, of thy brethren, like unto me; unto him ye shall hearken."
          },
          {
            "reference": "Deuteronomy 34:10",
            "text": "And there arose not a prophet since in Israel like unto Moses, whom the LORD knew face to face."
          },
          {
            "reference": "Numbers 12:6-8",
            "text": "And he said, Hear now my words: If there be a prophet among you, I the LORD will make myself known unto him in a vision, and will speak unto him in a dream. My servant Moses is not so, who is faithful in all mine house. With him will I speak mouth to mouth, even apparently, and not in dark speeches; and the similitude of the LORD shall he behold."
          },
          {
            "reference": "Exodus 3:10",
            "text": "Come now therefore, and I will send thee unto Pharaoh, that thou mayest bring forth my people the children of Israel out of Egypt."
          },
          {
            "reference": "Acts 3:22",
            "text": "For Moses truly said unto the fathers, A prophet shall the Lord your God raise up unto you of your brethren, like unto me; him shall ye hear in all things whatsoever he shall say unto you."
          }
        ]
      },
      "Samuel": {
        "title": "The Kingmaker Prophet",
        "description": "Samuel, the last of Israel's judges and first of the prophetic order that would continue until Malachi, bridged the transition from theocracy to monarchy. Dedicated to the LORD before birth by his barren mother Hannah, he was raised in the tabernacle at Shiloh under Eli the priest. As a child, he received his prophetic call when God spoke to him in the night, revealing judgment upon Eli's house.</p><p>Scripture testifies that 'the LORD was with him, and did let none of his words fall to the ground' and 'all Israel from Dan even to Beersheba knew that Samuel was established to be a prophet of the LORD' (1 Samuel 3:19-20). His ministry included anointing Israel's first two kings: Saul, whom God later rejected, and David, the man after God's own heart. Samuel established schools of prophets (1 Samuel 19:20), institutionalizing prophetic ministry in Israel.</p><p>He rebuked Saul's disobedience with words that define true worship: 'Hath the LORD as great delight in burnt offerings and sacrifices, as in obeying the voice of the LORD? Behold, to obey is better than sacrifice, and to hearken than the fat of rams.' Even after death, Samuel appeared to Saul at Endor, pronouncing his doom. His influence continued through the prophetic guilds he established, which trained generations of prophets.<label for=\"sn-samuel\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-samuel\" class=\"margin-toggle\"/><span class=\"sidenote\">Samuel's birth narrative parallels Hannah's song with Mary's Magnificat, both celebrating God's reversal of human conditions. The 'sons of the prophets' (schools of prophets) Samuel established appear throughout Kings and represent an institutional prophetic tradition distinct from the lone figures like Elijah. Peter's sermon at Pentecost cites Samuel as inaugurating the prophetic witness to Christ: 'All the prophets from Samuel and those that follow after' (Acts 3:24).</span>",
        "verses": [
          {
            "reference": "1 Samuel 3:19-20",
            "text": "And Samuel grew, and the LORD was with him, and did let none of his words fall to the ground. And all Israel from Dan even to Beersheba knew that Samuel was established to be a prophet of the LORD."
          },
          {
            "reference": "1 Samuel 3:10",
            "text": "And the LORD came, and stood, and called as at other times, Samuel, Samuel. Then Samuel answered, Speak; for thy servant heareth."
          },
          {
            "reference": "1 Samuel 15:22",
            "text": "And Samuel said, Hath the LORD as great delight in burnt offerings and sacrifices, as in obeying the voice of the LORD? Behold, to obey is better than sacrifice, and to hearken than the fat of rams."
          },
          {
            "reference": "1 Samuel 16:13",
            "text": "Then Samuel took the horn of oil, and anointed him in the midst of his brethren: and the Spirit of the LORD came upon David from that day forward."
          },
          {
            "reference": "Acts 3:24",
            "text": "Yea, and all the prophets from Samuel and those that follow after, as many as have spoken, have likewise foretold of these days."
          }
        ]
      },
      "Nathan": {
        "title": "Prophet to King David",
        "description": "Nathan served as court prophet during David's reign and into Solomon's, delivering some of Scripture's most significant prophecies and confrontations. Through Nathan, God revealed the Davidic covenant—the unconditional promise that David's throne would be established forever, finding ultimate fulfillment in Christ, 'great David's greater Son.'</p><p>When David desired to build God a house, Nathan initially approved but was corrected by divine revelation: God would instead build David a house (dynasty), promising that his seed would establish an eternal kingdom. This prophecy (2 Samuel 7) forms the theological foundation for Messianic expectation.</p><p>Nathan's most dramatic moment came after David's adultery with Bathsheba and murder of Uriah. Through the parable of the rich man who stole a poor man's lamb, Nathan drew David into pronouncing his own judgment before declaring, 'Thou art the man!' His courageous confrontation of royal sin exemplifies prophetic boldness in speaking truth to power. Nathan also played a crucial role in securing Solomon's succession, informing Bathsheba of Adonijah's coup and orchestrating the actions that placed Solomon on the throne before David's death.<label for=\"sn-nathan\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-nathan\" class=\"margin-toggle\"/><span class=\"sidenote\">Nathan's parable technique—leading the hearer to condemn himself before revealing application—demonstrates sophisticated prophetic methodology. David's response to Nathan's accusation—immediate confession rather than defensive anger—reveals his heart, explaining why Scripture calls him 'a man after God's own heart' despite his grievous sin. Chronicles credits Nathan with writing portions of royal history (1 Chronicles 29:29, 2 Chronicles 9:29), though these works have not survived.</span>",
        "verses": [
          {
            "reference": "2 Samuel 7:12-13",
            "text": "And when thy days be fulfilled, and thou shalt sleep with thy fathers, I will set up thy seed after thee, which shall proceed out of thy bowels, and I will establish his kingdom. He shall build an house for my name, and I will stablish the throne of his kingdom for ever."
          },
          {
            "reference": "2 Samuel 12:7",
            "text": "And Nathan said to David, Thou art the man. Thus saith the LORD God of Israel, I anointed thee king over Israel, and I delivered thee out of the hand of Saul."
          },
          {
            "reference": "2 Samuel 12:13",
            "text": "And David said unto Nathan, I have sinned against the LORD. And Nathan said unto David, The LORD also hath put away thy sin; thou shalt not die."
          },
          {
            "reference": "2 Samuel 7:16",
            "text": "And thine house and thy kingdom shall be established for ever before thee: thy throne shall be established for ever."
          }
        ]
      },
      "Elijah": {
        "title": "The Prophet of Fire",
        "description": "Elijah the Tishbite, from Gilead's rugged terrain, appeared suddenly in Scripture's narrative to confront Ahab and Jezebel's Baal worship with uncompromising boldness. His very name—'My God is Yahweh'—proclaimed his message. He announced a three-year drought, was fed by ravens at Cherith and by a widow at Zarephath (where he raised her son from death), and challenged 450 prophets of Baal to a contest on Mount Carmel. There, fire from heaven consumed his sacrifice, vindicating Yahweh and leading Israel to cry, 'The LORD, he is the God!'</p><p>Yet immediately after this triumph, Elijah fled from Jezebel's death threat, experiencing such despair that he requested death. God met him at Horeb (Sinai) not in wind, earthquake, or fire, but in a still small voice, commissioning him to anoint kings and his prophetic successor. Elijah confronted Ahab again over Naboth's vineyard, pronouncing doom on his dynasty.</p><p>His ministry concluded uniquely: he did not die but was taken to heaven in a chariot of fire with horses of fire, parting from Elisha with a whirlwind. Malachi prophesied Elijah's return before the Day of the LORD, which Christ identified with John the Baptist's ministry. At the Transfiguration, Elijah appeared with Moses, witnessing to Christ as the fulfillment of Law and Prophets.<label for=\"sn-elijah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-elijah\" class=\"margin-toggle\"/><span class=\"sidenote\">Elijah's translation without death parallels only Enoch's experience (Genesis 5:24). Jewish tradition expected Elijah to return personally, leading some to ask John the Baptist if he was Elijah (he denied being Elijah literally returned but fulfilled the Malachi prophecy in Spirit). The 'spirit and power of Elijah' characterizes prophetic ministry that confronts apostasy and calls for decision. James cites Elijah's prayer as exemplary: 'Elias was a man subject to like passions as we are, and he prayed earnestly' (James 5:17).</span>",
        "verses": [
          {
            "reference": "1 Kings 18:21",
            "text": "And Elijah came unto all the people, and said, How long halt ye between two opinions? if the LORD be God, follow him: but if Baal, then follow him. And the people answered him not a word."
          },
          {
            "reference": "1 Kings 18:38-39",
            "text": "Then the fire of the LORD fell, and consumed the burnt sacrifice, and the wood, and the stones, and the dust, and licked up the water that was in the trench. And when all the people saw it, they fell on their faces: and they said, The LORD, he is the God; the LORD, he is the God."
          },
          {
            "reference": "1 Kings 19:12",
            "text": "And after the earthquake a fire; but the LORD was not in the fire: and after the fire a still small voice."
          },
          {
            "reference": "2 Kings 2:11",
            "text": "And it came to pass, as they still went on, and talked, that, behold, there appeared a chariot of fire, and horses of fire, and parted them both asunder; and Elijah went up by a whirlwind into heaven."
          },
          {
            "reference": "Malachi 4:5",
            "text": "Behold, I will send you Elijah the prophet before the coming of the great and dreadful day of the LORD."
          }
        ]
      },
      "Elisha": {
        "title": "The Prophet of Grace",
        "description": "Elisha son of Shaphat received Elijah's mantle—literally and figuratively—when the elder prophet was taken to heaven. Having asked for 'a double portion' of Elijah's spirit (the firstborn's inheritance share), Elisha's ministry was marked by twice as many recorded miracles as his master's.</p><p>While Elijah's ministry emphasized judgment, Elisha's demonstrated grace: purifying poisoned water, multiplying a widow's oil to pay her debts, providing food during famine, healing Naaman the Syrian leper, raising the Shunammite's son, and causing an iron axe head to float. His ministry extended beyond Israel's borders—he wept knowing the evil Hazael would do to Israel, yet anointed him king of Syria as God commanded.</p><p>He served as Israel's true defense: 'My father, my father, the chariot of Israel, and the horsemen thereof!' When Syrian armies surrounded Dothan to capture him, Elisha's servant panicked until the prophet prayed that his eyes be opened to see the mountain filled with horses and chariots of fire. Elisha then led the blinded Syrian army into Samaria, where he commanded Israel to feed rather than slay them. His influence continued even after death: a corpse thrown into his grave revived upon touching his bones, demonstrating that prophetic power derived from God, not human vitality.<label for=\"sn-elisha\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-elisha\" class=\"margin-toggle\"/><span class=\"sidenote\">Elisha's 'double portion' request was not for twice Elijah's power but for the recognized inheritance of the firstborn son—the right of prophetic succession. His miracles often parallel and exceed Elijah's: Elijah multiplied meal and oil for one widow; Elisha did likewise and additionally raised her son. The contrast between Elijah's severity and Elisha's compassion may reflect different emphases within unified prophetic tradition. Naaman's healing prefigures Gentile inclusion: Christ cited it as evidence that 'no prophet is accepted in his own country' (Luke 4:27).</span>",
        "verses": [
          {
            "reference": "2 Kings 2:9",
            "text": "And it came to pass, when they were gone over, that Elijah said unto Elisha, Ask what I shall do for thee, before I be taken away from thee. And Elisha said, I pray thee, let a double portion of thy spirit be upon me."
          },
          {
            "reference": "2 Kings 6:16-17",
            "text": "And he answered, Fear not: for they that be with us are more than they that be with them. And Elisha prayed, and said, LORD, I pray thee, open his eyes, that he may see. And the LORD opened the eyes of the young man; and he saw: and, behold, the mountain was full of horses and chariots of fire round about Elisha."
          },
          {
            "reference": "2 Kings 5:14",
            "text": "Then went he down, and dipped himself seven times in Jordan, according to the saying of the man of God: and his flesh came again like unto the flesh of a little child, and he was clean."
          },
          {
            "reference": "2 Kings 4:43-44",
            "text": "And his servitor said, What, should I set this before an hundred men? He said again, Give the people, that they may eat: for thus saith the LORD, They shall eat, and shall leave thereof. So he set it before them, and they did eat, and left thereof, according to the word of the LORD."
          }
        ]
      }
    },
    "Major Prophets": {
      "Isaiah": {
        "title": "The Evangelical Prophet",
        "description": "The prince of Hebrew prophets, Isaiah son of Amoz ministered in Jerusalem during the tumultuous reigns of Uzziah, Jotham, Ahaz, and Hezekiah, spanning approximately sixty years from 740 to 680 BC. His ministry witnessed the northern kingdom's fall to Assyria and Judah's miraculous deliverance from Sennacherib's siege.</p><p>Called to prophesy in the year King Uzziah died, Isaiah received his commission through a dramatic theophany—a vision of the Lord seated upon His throne, high and lifted up, surrounded by seraphim crying 'Holy, holy, holy is the LORD of hosts.' Confronted with divine holiness, he cried 'Woe is me! for I am undone; because I am a man of unclean lips,' until a seraph touched his mouth with a live coal from the altar, purging his iniquity.</p><p>His prophecies masterfully alternate between pronouncements of judgment upon Judah, Israel, and surrounding nations, and glorious promises of Messianic redemption that have earned him the title 'Evangelical Prophet.' The book's fifty-three chapters of suffering servant prophecy finds its ultimate fulfillment in Christ's passion, while his predictions of virgin birth, Emmanuel's coming, and the government upon Messiah's shoulder demonstrate inspired precision. Isaiah's literary grandeur and theological depth make his work the most frequently quoted prophetic book in the New Testament.<label for=\"sn-isaiah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-isaiah\" class=\"margin-toggle\"/><span class=\"sidenote\">Jewish tradition holds that Isaiah was sawn asunder during Manasseh's persecution, an event possibly referenced in Hebrews 11:37. The book's structure divides naturally into chapters 1-39 (judgment) and 40-66 (consolation), paralleling the Old and New Testament division. His prophecies span from his contemporary era to the eschaton, encompassing Assyrian invasion, Babylonian captivity, Cyrus's decree, Christ's advent, and millennial glory. The Dead Sea Scrolls' complete Isaiah manuscript validates the text's remarkable preservation across millennia.</span>",
        "verses": [
          {
            "reference": "Isaiah 6:1",
            "text": "In the year that king Uzziah died I saw also the Lord sitting upon a throne, high and lifted up, and his train filled the temple."
          },
          {
            "reference": "Isaiah 6:5",
            "text": "Then said I, Woe is me! for I am undone; because I am a man of unclean lips, and I dwell in the midst of a people of unclean lips: for mine eyes have seen the King, the LORD of hosts."
          },
          {
            "reference": "Isaiah 6:8",
            "text": "Also I heard the voice of the Lord, saying, Whom shall I send, and who will go for us? Then said I, Here am I; send me."
          },
          {
            "reference": "Isaiah 7:14",
            "text": "Therefore the Lord himself shall give you a sign; Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel."
          },
          {
            "reference": "Isaiah 9:6",
            "text": "For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace."
          },
          {
            "reference": "Isaiah 53:5",
            "text": "But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed."
          }
        ]
      },
      "Jeremiah": {
        "title": "The Weeping Prophet",
        "description": "Born to a priestly family in Anathoth, Jeremiah son of Hilkiah received his prophetic call as a youth during Josiah's thirteenth regnal year (627 BC), ministering through Judah's final convulsive decades until Jerusalem's destruction in 586 BC. God's word came to him before his birth: 'Before I formed thee in the belly I knew thee; and before thou camest forth out of the womb I sanctified thee, and I ordained thee a prophet unto the nations.'</p><p>His forty-year ministry spanned the reigns of Josiah, Jehoahaz, Jehoiakim, Jehoiachin, and Zedekiah, witnessing the nation's moral collapse despite brief reformation under godly Josiah. Called to proclaim unpopular messages of certain judgment, Jeremiah suffered rejection by his family, persecution by religious and political leaders, imprisonment in a miry dungeon, and profound emotional anguish over his people's impenitence.</p><p>His prophecies alternate between impassioned pleas for repentance and stark predictions of Babylonian conquest, yet even in darkest judgment he proclaimed God's ultimate purpose of restoration. The promise of a New Covenant written upon the heart, not on tablets of stone, represents one of Scripture's most glorious Messianic predictions. His personal sufferings—rejected by his people, cast into a pit, forbidden to marry, hated without cause—prefigure Christ's passion in remarkable detail. The book of Lamentations preserves his anguished dirges over Jerusalem's fall, while his prophecies predicted both the seventy-year Babylonian captivity and subsequent return.<label for=\"sn-jeremiah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-jeremiah\" class=\"margin-toggle\"/><span class=\"sidenote\">Jeremiah's use of symbolic acts includes wearing a yoke, burying a linen belt, remaining unmarried, and purchasing a field during the siege—all dramatizing his prophetic messages. Tradition states he was stoned to death in Egypt by Jewish refugees who fled there against his counsel. His scribe Baruch preserved his oracles, which King Jehoiakim burned, prompting divine judgment and re-dictation with additions. The prophet's emotional transparency—his 'confessions' reveal inner turmoil—makes him Scripture's most psychologically accessible prophet.</span>",
        "verses": [
          {
            "reference": "Jeremiah 1:5",
            "text": "Before I formed thee in the belly I knew thee; and before thou camest forth out of the womb I sanctified thee, and I ordained thee a prophet unto the nations."
          },
          {
            "reference": "Jeremiah 1:9",
            "text": "Then the LORD put forth his hand, and touched my mouth. And the LORD said unto me, Behold, I have put my words in thy mouth."
          },
          {
            "reference": "Jeremiah 9:1",
            "text": "Oh that my head were waters, and mine eyes a fountain of tears, that I might weep day and night for the slain of the daughter of my people!"
          },
          {
            "reference": "Jeremiah 29:11",
            "text": "For I know the thoughts that I think toward you, saith the LORD, thoughts of peace, and not of evil, to give you an expected end."
          },
          {
            "reference": "Jeremiah 31:31",
            "text": "Behold, the days come, saith the LORD, that I will make a new covenant with the house of Israel, and with the house of Judah:"
          },
          {
            "reference": "Jeremiah 31:33",
            "text": "But this shall be the covenant that I will make with the house of Israel; After those days, saith the LORD, I will put my law in their inward parts, and write it in their hearts; and will be their God, and they shall be my people."
          }
        ]
      },
      "Ezekiel": {
        "title": "The Prophet of Visions",
        "description": "A priest among the exiles, Ezekiel son of Buzi prophesied from Babylon after being carried captive with King Jehoiachin in the second deportation of 597 BC. His prophetic ministry commenced in the fifth year of exile (593 BC) by the river Chebar, where the heavens opened and he saw visions of God—the divine chariot-throne borne by cherubim, gleaming like beryl, moving with wheels within wheels full of eyes, attended by living creatures with faces of man, lion, ox, and eagle.</p><p>Called repeatedly 'son of man' (over ninety times), emphasizing his humanity before divine majesty, Ezekiel received both auditory and visionary revelations of extraordinary symbolic complexity. His ministry employed dramatic enacted prophecies: lying on his left side 390 days for Israel's iniquity and his right side 40 days for Judah's, shaving his head and beard and dividing the hair to symbolize Jerusalem's fate, cooking food over dung, digging through a wall at night, and remaining mute except when prophesying.</p><p>These symbolic actions, combined with apocalyptic visions and detailed allegories, made visible the invisible spiritual realities behind historical events. Ezekiel's message balanced judgment and hope—declaring Jerusalem's certain destruction while among exiles who refused to believe it, then proclaiming restoration when despair threatened to overwhelm survivors.</p><p>His vision of the valley of dry bones becoming a living army dramatizes Israel's future resurrection, while chapters 40-48's detailed temple vision depicts millennial worship. He emphasized individual responsibility, declaring that the soul that sins shall die, while his theology of God's glory departing from and returning to the temple structures the book's movement from judgment to restoration.<label for=\"sn-ezekiel\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-ezekiel\" class=\"margin-toggle\"/><span class=\"sidenote\">Ezekiel's wife died on the day Babylon began Jerusalem's siege, and God commanded him not to mourn publicly, making his restrained grief a sign to the exiles (24:15-27). His prophecies against Tyre and Egypt demonstrate God's sovereignty over Gentile nations. The phrase 'they shall know that I am the LORD' appears over sixty times, revealing God's central purpose in all His dealings—the vindication of His holy name. His chariot vision inspired Jewish mystical speculation, while Revelation draws heavily on his imagery.</span>",
        "verses": [
          {
            "reference": "Ezekiel 1:1",
            "text": "Now it came to pass in the thirtieth year, in the fourth month, in the fifth day of the month, as I was among the captives by the river of Chebar, that the heavens were opened, and I saw visions of God."
          },
          {
            "reference": "Ezekiel 1:28",
            "text": "As the appearance of the bow that is in the cloud in the day of rain, so was the appearance of the brightness round about. This was the appearance of the likeness of the glory of the LORD. And when I saw it, I fell upon my face, and I heard a voice of one that spake."
          },
          {
            "reference": "Ezekiel 18:20",
            "text": "The soul that sinneth, it shall die. The son shall not bear the iniquity of the father, neither shall the father bear the iniquity of the son: the righteousness of the righteous shall be upon him, and the wickedness of the wicked shall be upon him."
          },
          {
            "reference": "Ezekiel 36:26",
            "text": "A new heart also will I give you, and a new spirit will I put within you: and I will take away the stony heart out of your flesh, and I will give you an heart of flesh."
          },
          {
            "reference": "Ezekiel 37:3",
            "text": "And he said unto me, Son of man, can these bones live? And I answered, O Lord GOD, thou knowest."
          },
          {
            "reference": "Ezekiel 37:14",
            "text": "And shall put my spirit in you, and ye shall live, and I shall place you in your own land: then shall ye know that I the LORD have spoken it, and performed it, saith the LORD."
          }
        ]
      },
      "Daniel": {
        "title": "The Prophet of Kings",
        "description": "Of royal or noble seed, Daniel was carried to Babylon as a youth in Nebuchadnezzar's first deportation (605 BC), where he and three companions—Hananiah, Mishael, and Azariah (renamed Shadrach, Meshach, and Abednego)—were selected for training in Chaldean wisdom and language for service in the king's court. Purposed in his heart not to defile himself with the king's meat and wine, Daniel's early faithfulness established a pattern of uncompromising devotion that sustained him through seventy years of exile.</p><p>His God-given ability to interpret dreams elevated him to chief of the wise men under Nebuchadnezzar, and his interpretation of the handwriting on the wall brought him to prominence under Belshazzar. Surviving regime changes, he served also under Darius the Mede and Cyrus the Persian, maintaining integrity despite jealous plots that cast him into the lions' den.</p><p>His prophetic ministry combined historical narrative with apocalyptic vision: Nebuchadnezzar's statue of successive world empires, the four beasts from the sea, the ram and the goat, and the elaborate revelation concerning Israel's future delivered by the angel Gabriel. The seventy weeks prophecy provides Scripture's most detailed chronological framework for Messianic fulfillment, precisely predicting the timing of Messiah's advent and cutting off.</p><p>His visions of the Ancient of Days, the Son of Man coming with clouds, and Michael the great prince standing up for Israel inform both Jewish and Christian eschatology. Gabriel addressed him as 'greatly beloved,' while his fasting and prayer secured revelation concerning Israel's future restoration.<label for=\"sn-daniel\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-daniel\" class=\"margin-toggle\"/><span class=\"sidenote\">Daniel's book is written partially in Hebrew (chapters 1, 8-12) and partially in Aramaic (chapters 2-7), the portions concerning Gentile dominion being in the lingua franca of the empire. His prophecies detail successive kingdoms—Babylon, Medo-Persia, Greece, and Rome—with remarkable historical precision, causing liberal scholars to date the book later. Yet Ezekiel, his contemporary, referenced Daniel's righteousness alongside Noah and Job (14:14). Christ Himself authenticated Daniel's authorship and prophecies (Matthew 24:15). The seventy weeks prophecy's fulfillment in Christ's triumphal entry, crucifixion, and the 70 AD temple destruction validates divine inspiration.</span>",
        "verses": [
          {
            "reference": "Daniel 1:8",
            "text": "But Daniel purposed in his heart that he would not defile himself with the portion of the king's meat, nor with the wine which he drank: therefore he requested of the prince of the eunuchs that he might not defile himself."
          },
          {
            "reference": "Daniel 2:44",
            "text": "And in the days of these kings shall the God of heaven set up a kingdom, which shall never be destroyed: and the kingdom shall not be left to other people, but it shall break in pieces and consume all these kingdoms, and it shall stand for ever."
          },
          {
            "reference": "Daniel 6:10",
            "text": "Now when Daniel knew that the writing was signed, he went into his house; and his windows being open in his chamber toward Jerusalem, he kneeled upon his knees three times a day, and prayed, and gave thanks before his God, as he did aforetime."
          },
          {
            "reference": "Daniel 7:13",
            "text": "I saw in the night visions, and, behold, one like the Son of man came with the clouds of heaven, and came to the Ancient of days, and they brought him near before him."
          },
          {
            "reference": "Daniel 9:24",
            "text": "Seventy weeks are determined upon thy people and upon thy holy city, to finish the transgression, and to make an end of sins, and to make reconciliation for iniquity, and to bring in everlasting righteousness, and to seal up the vision and prophecy, and to anoint the most Holy."
          },
          {
            "reference": "Daniel 12:3",
            "text": "And they that be wise shall shine as the brightness of the firmament; and they that turn many to righteousness as the stars for ever and ever."
          }
        ]
      }
    },
    "The Twelve Minor Prophets": {
      "Hosea": {
        "title": "Prophet of God's Unfailing Love",
        "description": "Prophesying to the northern kingdom during its final decades before Assyrian conquest (c. 755-715 BC), Hosea son of Beeri received an extraordinary commission that transformed his personal life into a living parable of God's relationship with Israel. Commanded to marry Gomer, daughter of Diblaim, a woman of whoredoms, Hosea's subsequent experience of marital betrayal mirrored Israel's spiritual adultery in pursuing Baal worship.</p><p>He fathered three children whose prophetic names—Jezreel ('God sows'), Lo-ruhamah ('not pitied'), and Lo-ammi ('not my people')—proclaimed judgment upon the nation. When Gomer abandoned him for lovers, God commanded Hosea to redeem and restore her, dramatizing divine love that pursues the unfaithful beloved. This enacted prophecy gives Hosea's message unique emotional power, alternating between anguished accusations of Israel's harlotry and tender appeals for return.</p><p>The prophet exposes Israel's syncretistic Baal worship, political alliances with Egypt and Assyria, and empty ritual divorced from covenant faithfulness. Yet even in pronouncing judgment, Hosea reveals God's reluctant heart: 'How shall I give thee up, Ephraim?' The Hebrew word <em>hesed</em>—covenant love, lovingkindness, loyal mercy—appears repeatedly, describing God's enduring commitment despite Israel's faithlessness. Hosea's prophecy that God would call His son out of Egypt finds application in Matthew's gospel to Christ's return from Egyptian exile, while his promise of resurrection after two days prefigures Christ's rising on the third day.<label for=\"sn-hosea\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-hosea\" class=\"margin-toggle\"/><span class=\"sidenote\">Hosea's marriage to Gomer raises interpretive questions: was she already immoral when he married her, or did she become unfaithful afterward? Did he actually marry a prostitute, or is the account purely allegorical? Most conservative scholars understand it as historical, God commanding Hosea to marry a woman with propensity toward unfaithfulness, whose subsequent adultery would mirror Israel's sin. His purchase price of fifteen pieces of silver and measures of barley to redeem her equals thirty pieces of silver total—the price of a slave, foreshadowing Christ's betrayal price.</span>",
        "verses": [
          {
            "reference": "Hosea 1:2",
            "text": "The beginning of the word of the LORD by Hosea. And the LORD said to Hosea, Go, take unto thee a wife of whoredoms and children of whoredoms: for the land hath committed great whoredom, departing from the LORD."
          },
          {
            "reference": "Hosea 3:1",
            "text": "Then said the LORD unto me, Go yet, love a woman beloved of her friend, yet an adulteress, according to the love of the LORD toward the children of Israel, who look to other gods, and love flagons of wine."
          },
          {
            "reference": "Hosea 6:6",
            "text": "For I desired mercy, and not sacrifice; and the knowledge of God more than burnt offerings."
          },
          {
            "reference": "Hosea 11:1",
            "text": "When Israel was a child, then I loved him, and called my son out of Egypt."
          },
          {
            "reference": "Hosea 11:8",
            "text": "How shall I give thee up, Ephraim? how shall I deliver thee, Israel? how shall I make thee as Admah? how shall I set thee as Zeboim? mine heart is turned within me, my repentings are kindled together."
          },
          {
            "reference": "Hosea 14:4",
            "text": "I will heal their backsliding, I will love them freely: for mine anger is turned away from him."
          }
        ]
      },
      "Joel": {
        "title": "Prophet of the Spirit's Outpouring",
        "description": "Little is known of Joel son of Pethuel beyond his prophecy, which lacks the historical markers found in other prophetic books, though linguistic evidence and historical allusions suggest a date around 835-796 BC during Joash's reign, making him possibly the earliest writing prophet. His message emerged from a crisis: an unprecedented locust plague that stripped Judah's land bare, devastating crops, vineyards, and fig trees in waves of destruction.</p><p>Joel interpreted this agricultural catastrophe as divine judgment and harbinger of a greater 'Day of the LORD'—that eschatological day when God would judge all nations and vindicate His people. He called for national repentance expressed through fasting, weeping, and rending hearts rather than garments, summoning priests to consecrate a solemn assembly before the LORD.</p><p>Beyond immediate restoration from the locust plague, Joel prophesied the outpouring of God's Spirit upon all flesh—sons and daughters prophesying, old men dreaming dreams, young men seeing visions, and even servants receiving the Spirit's empowerment. Peter identified Pentecost as this prophecy's fulfillment, when the Holy Spirit descended upon the gathered disciples in tongues of fire, enabling them to speak in foreign languages and inaugurating the church age.</p><p>Joel's vision extends beyond Pentecost to the eschaton, describing cosmic signs—blood, fire, pillars of smoke, darkened sun, blood-red moon—preceding the great and terrible Day of the LORD. His prophecy of the nations gathering in the valley of Jehoshaphat for judgment, where God would judge them for scattering Israel, awaits final fulfillment in Armageddon's battle.<label for=\"sn-joel\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-joel\" class=\"margin-toggle\"/><span class=\"sidenote\">Joel's four-stage locust plague—palmerworm, locust, cankerworm, caterpillar—may describe successive waves of the same invasion or different species devastating crops sequentially. His call to 'blow the trumpet in Zion' combines liturgical summons with eschatological warning. The Spirit's outpouring 'afterward' in Hebrew is literally 'after these things,' connecting it to both restoration from the plague and ultimate eschatological fulfillment. Christ applied Joel's promise 'whosoever shall call on the name of the LORD shall be saved' to gospel salvation (Romans 10:13).</span>",
        "verses": [
          {
            "reference": "Joel 1:4",
            "text": "That which the palmerworm hath left hath the locust eaten; and that which the locust hath left hath the cankerworm eaten; and that which the cankerworm hath left hath the caterpillar eaten."
          },
          {
            "reference": "Joel 2:12",
            "text": "Therefore also now, saith the LORD, turn ye even to me with all your heart, and with fasting, and with weeping, and with mourning:"
          },
          {
            "reference": "Joel 2:13",
            "text": "And rend your heart, and not your garments, and turn unto the LORD your God: for he is gracious and merciful, slow to anger, and of great kindness, and repenteth him of the evil."
          },
          {
            "reference": "Joel 2:28",
            "text": "And it shall come to pass afterward, that I will pour out my spirit upon all flesh; and your sons and your daughters shall prophesy, your old men shall dream dreams, your young men shall see visions:"
          },
          {
            "reference": "Joel 2:32",
            "text": "And it shall come to pass, that whosoever shall call on the name of the LORD shall be delivered: for in mount Zion and in Jerusalem shall be deliverance, as the LORD hath said, and in the remnant whom the LORD shall call."
          },
          {
            "reference": "Joel 3:14",
            "text": "Multitudes, multitudes in the valley of decision: for the day of the LORD is near in the valley of decision."
          }
        ]
      },
      "Amos": {
        "title": "The Shepherd Prophet",
        "description": "From Tekoa in Judah, twelve miles south of Jerusalem, Amos ministered as shepherd and gatherer of sycamore fruit before God called him to prophesy against northern Israel during the prosperous but morally corrupt reign of Jeroboam II (c. 760-750 BC). Unlike professional prophets trained in prophetic guilds, Amos declared, 'I was no prophet, neither was I a prophet's son; but I was an herdman, and a gatherer of sycomore fruit: and the LORD took me as I followed the flock, and the LORD said unto me, Go, prophesy unto my people Israel.'</p><p>This rustic background, far from disqualifying him, authenticated his message as coming purely from divine commission rather than institutional credentials or inherited office. His prophecies exposed Israel's social injustices during an era of unprecedented prosperity—the wealthy who 'sold the righteous for silver, and the poor for a pair of shoes,' oppressed the needy, perverted justice in the gates, and combined luxury with religious formalism.</p><p>He pronounced oracles against six surrounding nations—Damascus, Gaza, Tyre, Edom, Ammon, Moab—before focusing judgment on Judah and especially Israel, showing that proximity to God brings greater accountability. Amos's famous declaration 'let judgment run down as waters, and righteousness as a mighty stream' established the prophetic principle that God values justice and righteousness over religious ritual.</p><p>When confronted by Amaziah the priest of Bethel, who commanded him to flee back to Judah, Amos fearlessly proclaimed Israel's coming exile. His visions—locusts, fire, plumb line, summer fruit, the Lord standing upon the altar—conveyed divine judgment's certainty. Yet even Amos concluded with restoration promises: the tabernacle of David raised up, Israel replanted in their land never to be uprooted.<label for=\"sn-amos\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-amos\" class=\"margin-toggle\"/><span class=\"sidenote\">Amos's rhetorical style employs numerical parallelism ('For three transgressions...and for four') and rhetorical questions demonstrating cause and effect. His humble occupation as 'gatherer of sycamore fruit' involved piercing the figs to hasten ripening—detailed agricultural knowledge pervading his prophecies through metaphors of plowing, threshing, sifting, and harvest. James's quotation at the Jerusalem Council (Acts 15:16-17) of Amos's promise concerning David's tabernacle validated Gentile inclusion in God's purposes. Archaeological evidence confirms the eighth century BC prosperity and injustice Amos condemned.</span>",
        "verses": [
          {
            "reference": "Amos 3:7",
            "text": "Surely the Lord GOD will do nothing, but he revealeth his secret unto his servants the prophets."
          },
          {
            "reference": "Amos 5:14",
            "text": "Seek good, and not evil, that ye may live: and so the LORD, the God of hosts, shall be with you, as ye have spoken."
          },
          {
            "reference": "Amos 5:21",
            "text": "I hate, I despise your feast days, and I will not smell in your solemn assemblies."
          },
          {
            "reference": "Amos 5:24",
            "text": "But let judgment run down as waters, and righteousness as a mighty stream."
          },
          {
            "reference": "Amos 7:14",
            "text": "Then answered Amos, and said to Amaziah, I was no prophet, neither was I a prophet's son; but I was an herdman, and a gatherer of sycomore fruit:"
          },
          {
            "reference": "Amos 9:11",
            "text": "In that day will I raise up the tabernacle of David that is fallen, and close up the breaches thereof; and I will raise up his ruins, and I will build it as in the days of old:"
          }
        ]
      },
      "Jonah": {
        "title": "The Reluctant Missionary",
        "description": "Jonah son of Amittai, from Gath-hepher in Galilee, previously prophesied Israel's territorial expansion under Jeroboam II (2 Kings 14:25), establishing him as eighth-century contemporary of Amos and Hosea. When commissioned to preach repentance to Nineveh—capital of Assyria, Israel's brutal enemy—Jonah's response was immediate flight in the opposite direction toward Tarshish (possibly Spain), attempting to flee from the LORD's presence.</p><p>God pursued His reluctant prophet through a violent storm that threatened the ship, Jonah's confession and self-sacrifice, and the sailors' terrified obedience in casting him overboard. The LORD prepared a great fish to swallow Jonah, preserving him three days and nights in its belly while he prayed from 'the belly of hell,' acknowledging that 'salvation is of the LORD.' Vomited onto dry land, Jonah obeyed his renewed commission, preaching Nineveh's overthrow in forty days.</p><p>The city's response—from king to cattle, all fasting in sackcloth and ashes—demonstrated repentance on an unprecedented scale, causing God to relent from promised judgment. Jonah's anger at divine mercy reveals his true motivation for fleeing: not fear, but knowledge that God's compassion would extend even to Israel's oppressors. His complaint—'I knew that thou art a gracious God, and merciful, slow to anger, and of great kindness'—quotes the very character of God that should have brought him joy.</p><p>God's lesson through a gourd, which Jonah mourned when it withered, taught that if Jonah could pity a plant, how much more should God pity Nineveh's 120,000 people 'that cannot discern between their right hand and their left hand; and also much cattle.' Christ authenticated Jonah's account, citing his three-day entombment as a sign prefiguring His own burial and resurrection.<label for=\"sn-jonah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-jonah\" class=\"margin-toggle\"/><span class=\"sidenote\">Skeptics question the fish account, yet Christ's explicit reference validates its historicity (Matthew 12:40). The Hebrew word (<em>dag gadol</em>) simply means 'great fish,' not necessarily a whale. Mediterranean sperm whales and great white sharks could accommodate a man. Jonah's prayer from the fish's belly quotes and alludes to multiple Psalms, suggesting he knew Scripture intimately. The book's message extends beyond individual obedience to demonstrate God's universal compassion—Gentiles (sailors and Ninevites) respond better than God's prophet. Nineveh's repentance proved temporary; within a century, Nahum prophesied its final destruction, fulfilled in 612 BC.</span>",
        "verses": [
          {
            "reference": "Jonah 1:3",
            "text": "But Jonah rose up to flee unto Tarshish from the presence of the LORD, and went down to Joppa; and he found a ship going to Tarshish: so he paid the fare thereof, and went down into it, to go with them unto Tarshish from the presence of the LORD."
          },
          {
            "reference": "Jonah 1:17",
            "text": "Now the LORD had prepared a great fish to swallow up Jonah. And Jonah was in the belly of the fish three days and three nights."
          },
          {
            "reference": "Jonah 2:9",
            "text": "But I will sacrifice unto thee with the voice of thanksgiving; I will pay that that I have vowed. Salvation is of the LORD."
          },
          {
            "reference": "Jonah 3:10",
            "text": "And God saw their works, that they turned from their evil way; and God repented of the evil, that he had said that he would do unto them; and he did it not."
          },
          {
            "reference": "Jonah 4:2",
            "text": "And he prayed unto the LORD, and said, I pray thee, O LORD, was not this my saying, when I was yet in my country? Therefore I fled before unto Tarshish: for I knew that thou art a gracious God, and merciful, slow to anger, and of great kindness, and repentest thee of the evil."
          },
          {
            "reference": "Jonah 4:11",
            "text": "And should not I spare Nineveh, that great city, wherein are more than sixscore thousand persons that cannot discern between their right hand and their left hand; and also much cattle?"
          }
        ]
      },
      "Micah": {
        "title": "Champion of the Oppressed",
        "description": "From Moresheth-gath in Judah's Shephelah region, Micah prophesied during the reigns of Jotham, Ahaz, and Hezekiah (c. 735-700 BC), making him a younger contemporary of Isaiah. While Isaiah ministered primarily to Jerusalem's royal court, Micah addressed common people and rural communities, giving his prophecies a distinctly populist character emphasizing social justice. His name, meaning 'Who is like Yahweh?', finds echo in his prophecy's concluding question: 'Who is a God like unto thee, that pardoneth iniquity?'</p><p>Micah denounced the sins of both Samaria and Jerusalem: greedy landlords who 'covet fields, and take them by violence,' false prophets who 'bite with their teeth, and cry, Peace,' corrupt judges who 'build up Zion with blood,' and priests who 'teach for hire.' Yet his condemnations always balanced judgment with restoration promises.</p><p>His most famous prophecy foretold Messiah's birth: 'But thou, Bethlehem Ephratah, though thou be little among the thousands of Judah, yet out of thee shall he come forth unto me that is to be ruler in Israel; whose goings forth have been from of old, from everlasting.' The chief priests quoted this very passage to Herod when wise men inquired where Christ should be born.</p><p>Micah's summary of true religion—'what doth the LORD require of thee, but to do justly, and to love mercy, and to walk humbly with thy God?'—distills biblical ethics to their essence, contrasting genuine piety with empty ritualism. His prophecies alternate between judgment oracles and restoration promises: Israel scattered then regathered, the mountain of the LORD's house established above all mountains, nations streaming to Zion to learn God's ways, swords beaten into plowshares. Jeremiah later cited Micah's prophecy of Zion plowed as a field (26:18), crediting it with moving Hezekiah to repentance.<label for=\"sn-micah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-micah\" class=\"margin-toggle\"/><span class=\"sidenote\">Micah's Bethlehem prophecy not only predicts Messiah's birthplace but affirms His eternal pre-existence—'whose goings forth have been from of old, from everlasting.' The prophecy's context describes tribulation preceding millennial blessing, the woman in travail (possibly referencing both Israel and Mary), and the ruler feeding his flock in the LORD's strength. Micah's vision of universal peace (4:3-4) parallels Isaiah 2:2-4 so closely that scholars debate whether one borrowed from the other or both drew from common prophetic tradition. His theodicy—'I will bear the indignation of the LORD, because I have sinned against him'—demonstrates submission under divine chastisement.</span>",
        "verses": [
          {
            "reference": "Micah 3:8",
            "text": "But truly I am full of power by the spirit of the LORD, and of judgment, and of might, to declare unto Jacob his transgression, and to Israel his sin."
          },
          {
            "reference": "Micah 4:3",
            "text": "And he shall judge among many people, and rebuke strong nations afar off; and they shall beat their swords into plowshares, and their spears into pruninghooks: nation shall not lift up a sword against nation, neither shall they learn war any more."
          },
          {
            "reference": "Micah 5:2",
            "text": "But thou, Bethlehem Ephratah, though thou be little among the thousands of Judah, yet out of thee shall he come forth unto me that is to be ruler in Israel; whose goings forth have been from of old, from everlasting."
          },
          {
            "reference": "Micah 6:8",
            "text": "He hath shewed thee, O man, what is good; and what doth the LORD require of thee, but to do justly, and to love mercy, and to walk humbly with thy God?"
          },
          {
            "reference": "Micah 7:18",
            "text": "Who is a God like unto thee, that pardoneth iniquity, and passeth by the transgression of the remnant of his heritage? he retaineth not his anger for ever, because he delighteth in mercy."
          },
          {
            "reference": "Micah 7:19",
            "text": "He will turn again, he will have compassion upon us; he will subdue our iniquities; and thou wilt cast all their sins into the depths of the sea."
          }
        ]
      },
      "Obadiah": {
        "title": "Prophet Against Edom",
        "description": "Obadiah's prophecy, the shortest book in the Old Testament at only 21 verses, is entirely devoted to pronouncing judgment upon Edom, the nation descended from Esau, Jacob's twin brother.<label for=\"sn-obadiah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-obadiah\" class=\"margin-toggle\"/><span class=\"sidenote\">The 'clefts of the rock' likely refers to Petra, Edom's spectacular capital carved into rose-red sandstone cliffs in modern-day Jordan. These seemingly impregnable fortresses, accessible only through narrow gorges, fostered Edom's arrogant self-confidence. The prophecy against Edom was thoroughly fulfilled: the Nabateans displaced them in the 6th-4th centuries BC, forcing them into southern Judea (Idumea). The Maccabees later subjugated them, and they ceased to exist as a distinct people after Jerusalem's destruction in AD 70.</span> The ancient enmity between these brother nations, originating from their ancestor's rivalry (Genesis 25), culminated when Edom rejoiced over Jerusalem's destruction by Babylon in 586 BC, participated in the plunder, and cut off fleeing refugees. Obadiah's oracle declares that as Edom had done to Israel, so it would be done to them. The Edomites' pride in their seemingly impregnable mountain fortresses—'Thou that dwellest in the clefts of the rock, whose habitation is high; that saith in his heart, Who shall bring me down to the ground?'—would be their undoing, for God would bring them down. Though Edom thought itself wise and secure, divine judgment would strip away every refuge. The book concludes with eschatological hope: 'And saviours shall come up on mount Zion to judge the mount of Esau; and the kingdom shall be the LORD's.'",
        "verses": [
          {
            "reference": "Obadiah 1:3-4",
            "text": "The pride of thine heart hath deceived thee, thou that dwellest in the clefts of the rock, whose habitation is high; that saith in his heart, Who shall bring me down to the ground? Though thou exalt thyself as the eagle, and though thou set thy nest among the stars, thence will I bring thee down, saith the LORD."
          },
          {
            "reference": "Obadiah 1:10",
            "text": "For thy violence against thy brother Jacob shame shall cover thee, and thou shalt be cut off for ever."
          },
          {
            "reference": "Obadiah 1:15",
            "text": "For the day of the LORD is near upon all the heathen: as thou hast done, it shall be done unto thee: thy reward shall return upon thine own head."
          },
          {
            "reference": "Obadiah 1:21",
            "text": "And saviours shall come up on mount Zion to judge the mount of Esau; and the kingdom shall be the LORD's."
          }
        ]
      },
      "Nahum": {
        "title": "Prophet of Nineveh's Doom",
        "description": "Nahum the Elkoshite prophesied against Nineveh approximately a century after Jonah's preaching had prompted the city's temporary repentance.<label for=\"sn-nahum\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-nahum\" class=\"margin-toggle\"/><span class=\"sidenote\">The contrast between Jonah and Nahum illustrates both divine attributes: God's mercy extends to repentant Gentiles (Jonah), yet persistent wickedness ultimately exhausts patience (Nahum). Assyrian brutality was legendary—their own monuments boast of flaying enemies alive, impaling captives, building pyramids of severed heads, and deporting entire populations. Nineveh's fall in 612 BC to combined Babylonian-Median forces was so complete that Greek historians centuries later doubted the city had existed. Sir Austen Henry Layard's 1840s excavations near Mosul, Iraq, rediscovered the city and Ashurbanipal's massive library, vindicating biblical accuracy.</span> The Assyrian capital had returned to its brutal ways, becoming the most feared empire of the ancient world. Nahum's oracle—'the burden of Nineveh'—proclaimed the city's certain, irreversible destruction. While Jonah emphasized God's mercy to repentant sinners, Nahum reveals that mercy exhausted becomes judgment executed. The prophet's vivid imagery depicts attacking armies, flashing swords, galloping horses, and Nineveh's fall as divine vengeance for centuries of atrocities. Yet the message comforts Judah: 'The LORD is good, a strong hold in the day of trouble; and he knoweth them that trust in him.' Nineveh fell to the Babylonians and Medes in 612 BC, exactly as prophesied, and was so thoroughly destroyed that its location was lost until archaeological excavation in the nineteenth century.",
        "verses": [
          {
            "reference": "Nahum 1:2-3",
            "text": "God is jealous, and the LORD revengeth; the LORD revengeth, and is furious; the LORD will take vengeance on his adversaries, and he reserveth wrath for his enemies. The LORD is slow to anger, and great in power, and will not at all acquit the wicked."
          },
          {
            "reference": "Nahum 1:7",
            "text": "The LORD is good, a strong hold in the day of trouble; and he knoweth them that trust in him."
          },
          {
            "reference": "Nahum 1:15",
            "text": "Behold upon the mountains the feet of him that bringeth good tidings, that publisheth peace! O Judah, keep thy solemn feasts, perform thy vows: for the wicked shall no more pass through thee; he is utterly cut off."
          },
          {
            "reference": "Nahum 3:19",
            "text": "There is no healing of thy bruise; thy wound is grievous: all that hear the bruit of thee shall clap the hands over thee: for upon whom hath not thy wickedness passed continually?"
          }
        ]
      },
      "Habakkuk": {
        "title": "The Questioning Prophet",
        "description": "Habakkuk's prophecy uniquely presents a dialogue between the prophet and God, wrestling with the problem of evil and divine justice.<label for=\"sn-habakkuk\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-habakkuk\" class=\"margin-toggle\"/><span class=\"sidenote\">Habakkuk 2:4—'the just shall live by his faith'—is quoted three times in the New Testament with different emphases: Romans 1:17 stresses 'the just' (justification), Galatians 3:11 emphasizes 'by faith' (means), and Hebrews 10:38 highlights 'shall live' (perseverance). The prophet's watchtower imagery (2:1) reflects ancient Near Eastern practice where watchmen stood guard to announce approaching messengers. Habakkuk's chapter 3, marked 'to the chief singer on my stringed instruments,' is a psalm with musical notations including 'Shigionoth' (possibly indicating an intense, passionate style) and three 'Selah' pauses.</span> Writing around 609-605 BC as Babylon rose to power, Habakkuk first complained that God tolerated violence and injustice in Judah without acting. God's startling response—He would use the even more wicked Babylonians as His instrument of judgment—provoked Habakkuk's deeper theological crisis: How could a holy God use such an unrighteous nation to punish His people? The prophet stationed himself on his watchtower to await God's answer. The divine response established a principle central to both Judaism and Christianity: 'The just shall live by his faith.' Though Babylon would indeed conquer, it too would face judgment. Habakkuk's concluding prayer-psalm expresses faith triumphant: though fig trees fail and fields yield no food, 'Yet I will rejoice in the LORD, I will joy in the God of my salvation.' Paul quotes Habakkuk 2:4 to establish justification by faith (Romans 1:17, Galatians 3:11).",
        "verses": [
          {
            "reference": "Habakkuk 1:13",
            "text": "Thou art of purer eyes than to behold evil, and canst not look on iniquity: wherefore lookest thou upon them that deal treacherously, and holdest thy tongue when the wicked devoureth the man that is more righteous than he?"
          },
          {
            "reference": "Habakkuk 2:4",
            "text": "Behold, his soul which is lifted up is not upright in him: but the just shall live by his faith."
          },
          {
            "reference": "Habakkuk 2:14",
            "text": "For the earth shall be filled with the knowledge of the glory of the LORD, as the waters cover the sea."
          },
          {
            "reference": "Habakkuk 3:17-18",
            "text": "Although the fig tree shall not blossom, neither shall fruit be in the vines; the labour of the olive shall fail, and the fields shall yield no meat; the flock shall be cut off from the fold, and there shall be no herd in the stalls: Yet I will rejoice in the LORD, I will joy in the God of my salvation."
          }
        ]
      },
      "Zephaniah": {
        "title": "Prophet of the Day of the LORD",
        "description": "Zephaniah, a descendant of King Hezekiah, prophesied during the reign of Josiah (c. 640-609 BC), likely before the king's reforms.<label for=\"sn-zephaniah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-zephaniah\" class=\"margin-toggle\"/><span class=\"sidenote\">Zephaniah's genealogy is unusually detailed, tracing four generations back to Hezekiah—likely the righteous king of that name, making Zephaniah of royal blood. His prophecy probably preceded Josiah's reforms (beginning 622 BC), as it condemns idolatrous practices Josiah later abolished. The terrifying description in 1:14-15 inspired the medieval Latin hymn 'Dies Irae' ('Day of Wrath'), attributed to Thomas of Celano (13th century), which became the standard Requiem Mass sequence and profoundly influenced Western literature and music, including works by Mozart, Verdi, and Berlioz.</span> His message centers on 'the day of the LORD'—that eschatological day of divine judgment that would first fall on Judah and Jerusalem, then extend to surrounding nations, and ultimately encompass all the earth. Zephaniah's description of this day is among Scripture's most terrifying: 'A day of wrath, a day of trouble and distress, a day of wasteness and desolation, a day of darkness and gloominess, a day of clouds and thick darkness.' The medieval hymn 'Dies Irae' drew upon this passage. Yet Zephaniah's prophecy does not end in darkness. Following judgment comes restoration: God will purify a remnant, gathering the scattered, restoring the humble, and dwelling in Zion's midst. The book's conclusion portrays God rejoicing over His people with singing—a stunning image of divine delight in redeemed humanity.",
        "verses": [
          {
            "reference": "Zephaniah 1:14-15",
            "text": "The great day of the LORD is near, it is near, and hasteth greatly, even the voice of the day of the LORD: the mighty man shall cry there bitterly. That day is a day of wrath, a day of trouble and distress, a day of wasteness and desolation, a day of darkness and gloominess, a day of clouds and thick darkness."
          },
          {
            "reference": "Zephaniah 2:3",
            "text": "Seek ye the LORD, all ye meek of the earth, which have wrought his judgment; seek righteousness, seek meekness: it may be ye shall be hid in the day of the LORD's anger."
          },
          {
            "reference": "Zephaniah 3:9",
            "text": "For then will I turn to the people a pure language, that they may all call upon the name of the LORD, to serve him with one consent."
          },
          {
            "reference": "Zephaniah 3:17",
            "text": "The LORD thy God in the midst of thee is mighty; he will save, he will rejoice over thee with joy; he will rest in his love, he will joy over thee with singing."
          }
        ]
      },
      "Haggai": {
        "title": "Prophet of Temple Rebuilding",
        "description": "Haggai prophesied in 520 BC, eighteen years after the first exiles returned from Babylon under Zerubbabel.<label for=\"sn-haggai\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-haggai\" class=\"margin-toggle\"/><span class=\"sidenote\">Haggai's precise dating system uses Persian regnal years: 'the second year of Darius the king' (Darius I Hystaspes, 522-486 BC), with exact days given—1st day of 6th month, 24th of 6th month, 21st of 7th month, 24th of 9th month—making this among Scripture's most precisely dated books. This chronology aligns perfectly with Ezra 4-6, which describes the temple rebuilding. Zerubbabel's designation as God's 'signet' (2:23) is profoundly messianic: signet rings bore the king's authority and identity. Though Zerubbabel mysteriously disappears from history after this (possibly recalled to Persia), he appears in both Matthew's and Luke's genealogies of Christ.</span> Though they had laid the temple's foundation, opposition and discouragement had halted construction while the people built their own 'cieled houses.' Haggai's pointed message challenged this misplaced priority: 'Is it time for you, O ye, to dwell in your cieled houses, and this house lie waste?' Economic hardship—sowing much but harvesting little, earning wages that disappeared 'into a bag with holes'—resulted from neglecting God's house. Haggai's four dated oracles (five specific dates within a four-month period make this one of Scripture's most precisely dated books) called for temple completion. The prophet encouraged the builders not to despair that this temple seemed inferior to Solomon's glory: 'The glory of this latter house shall be greater than of the former'—a prophecy fulfilled when Christ, 'the desire of all nations,' entered this very temple. Zerubbabel, the governor, is singled out as God's signet ring, a messianic type pointing to Christ.",
        "verses": [
          {
            "reference": "Haggai 1:4",
            "text": "Is it time for you, O ye, to dwell in your cieled houses, and this house lie waste?"
          },
          {
            "reference": "Haggai 1:6",
            "text": "Ye have sown much, and bring in little; ye eat, but ye have not enough; ye drink, but ye are not filled with drink; ye clothe you, but there is none warm; and he that earneth wages earneth wages to put it into a bag with holes."
          },
          {
            "reference": "Haggai 2:7",
            "text": "And I will shake all nations, and the desire of all nations shall come: and I will fill this house with glory, saith the LORD of hosts."
          },
          {
            "reference": "Haggai 2:9",
            "text": "The glory of this latter house shall be greater than of the former, saith the LORD of hosts: and in this place will I give peace, saith the LORD of hosts."
          },
          {
            "reference": "Haggai 2:23",
            "text": "In that day, saith the LORD of hosts, will I take thee, O Zerubbabel, my servant, the son of Shealtiel, saith the LORD, and will make thee as a signet: for I have chosen thee, saith the LORD of hosts."
          }
        ]
      },
      "Zechariah": {
        "title": "Prophet of Messianic Visions",
        "description": "Zechariah, a priest and prophet contemporary with Haggai, received his first oracle in 520 BC and continued prophesying into the early fifth century.<label for=\"sn-zechariah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-zechariah\" class=\"margin-toggle\"/><span class=\"sidenote\">Zechariah's book contains the most Messianic prophecies of any minor prophet. The eight night visions (chapters 1-6) include: the horsemen among myrtles, four horns and four craftsmen, the man with a measuring line, Joshua the high priest cleansed, the golden lampstand and olive trees, the flying scroll, the woman in the ephah, and the four chariots. The stark stylistic shift between chapters 1-8 (dated, specific, hopeful) and 9-14 (undated, apocalyptic, depicting conflict) has led some scholars to propose multiple authorship, though conservative scholarship maintains unity. Dead Sea Scroll evidence and New Testament citations (attributing 11:12-13 and 12:10 to 'Zechariah the prophet') support single authorship.</span></p><p>His book divides into two distinct sections: chapters 1-8 contain eight night visions and prophetic oracles encouraging the temple rebuilders, while chapters 9-14 present apocalyptic prophecies of Messiah's coming and Israel's ultimate restoration.</p><p>Zechariah's Messianic prophecies are remarkably detailed and frequently quoted in the New Testament: the Branch who is both priest and king, the king entering Jerusalem 'lowly, and riding upon an ass,' the thirty pieces of silver cast to the potter in the LORD's house, the pierced one upon whom Israel shall look and mourn, the smitten shepherd whose sheep scatter, living waters flowing from Jerusalem, and the LORD becoming king over all the earth.</p><p>The New Testament applies these prophecies to Christ's triumphal entry, Judas's betrayal, the crucifixion, and the Second Coming. More than any other prophet, Zechariah bridges the testaments, his visions illuminating Christ's work in both advents.",
        "verses": [
          {
            "reference": "Zechariah 4:6",
            "text": "Then he answered and spake unto me, saying, This is the word of the LORD unto Zerubbabel, saying, Not by might, nor by power, but by my spirit, saith the LORD of hosts."
          },
          {
            "reference": "Zechariah 9:9",
            "text": "Rejoice greatly, O daughter of Zion; shout, O daughter of Jerusalem: behold, thy King cometh unto thee: he is just, and having salvation; lowly, and riding upon an ass, and upon a colt the foal of an ass."
          },
          {
            "reference": "Zechariah 12:10",
            "text": "And I will pour upon the house of David, and upon the inhabitants of Jerusalem, the spirit of grace and of supplications: and they shall look upon me whom they have pierced, and they shall mourn for him, as one mourneth for his only son."
          },
          {
            "reference": "Zechariah 13:7",
            "text": "Awake, O sword, against my shepherd, and against the man that is my fellow, saith the LORD of hosts: smite the shepherd, and the sheep shall be scattered: and I will turn mine hand upon the little ones."
          },
          {
            "reference": "Zechariah 14:9",
            "text": "And the LORD shall be king over all the earth: in that day shall there be one LORD, and his name one."
          }
        ]
      },
      "Malachi": {
        "title": "The Last Old Testament Prophet",
        "description": "Malachi ('my messenger'), the final prophetic voice before four centuries of silence, ministered around 460-430 BC during the post-exilic period when spiritual lethargy had replaced early enthusiasm.<label for=\"sn-malachi\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-malachi\" class=\"margin-toggle\"/><span class=\"sidenote\">'Malachi' (מַלְאָכִי) means 'my messenger' or 'my angel,' leading some scholars to question whether this is a personal name or a title. The Septuagint renders 3:1 as 'his messenger' rather than as a proper name. However, Jewish tradition and most conservative scholars accept Malachi as the prophet's actual name. The 'four hundred silent years' between Malachi and Matthew's Gospel (roughly 430 BC to 5 BC) saw no canonical prophetic voice in Israel, though this intertestamental period witnessed the Maccabean revolt, the rise of Pharisees and Sadducees, synagogue development, and the completion of the Septuagint translation.</span></p><p>His prophecy employs a distinctive disputational style: God makes a statement, the people question it, and God elaborates. Through this format, Malachi exposed Israel's sins—defiled offerings, faithless priests, divorce, withholding tithes, and speaking against God—while affirming divine love and calling for repentance.</p><p>His most famous passage concerning tithes—'Bring ye all the tithes into the storehouse... and prove me now herewith, saith the LORD of hosts, if I will not open you the windows of heaven, and pour you out a blessing'—promises supernatural provision for faithful givers.</p><p>Malachi concludes the Old Testament with twin prophecies: Elijah would come before the great and dreadful day of the LORD (fulfilled in John the Baptist), and 'the Sun of righteousness' would arise 'with healing in his wings' (fulfilled in Christ). The final words—a curse unless hearts turn—leave Israel awaiting the messenger who would prepare Messiah's way.",
        "verses": [
          {
            "reference": "Malachi 1:2",
            "text": "I have loved you, saith the LORD. Yet ye say, Wherein hast thou loved us? Was not Esau Jacob's brother? saith the LORD: yet I loved Jacob."
          },
          {
            "reference": "Malachi 3:1",
            "text": "Behold, I will send my messenger, and he shall prepare the way before me: and the Lord, whom ye seek, shall suddenly come to his temple, even the messenger of the covenant, whom ye delight in: behold, he shall come, saith the LORD of hosts."
          },
          {
            "reference": "Malachi 3:10",
            "text": "Bring ye all the tithes into the storehouse, that there may be meat in mine house, and prove me now herewith, saith the LORD of hosts, if I will not open you the windows of heaven, and pour you out a blessing, that there shall not be room enough to receive it."
          },
          {
            "reference": "Malachi 4:2",
            "text": "But unto you that fear my name shall the Sun of righteousness arise with healing in his wings; and ye shall go forth, and grow up as calves of the stall."
          },
          {
            "reference": "Malachi 4:5-6",
            "text": "Behold, I will send you Elijah the prophet before the coming of the great and dreadful day of the LORD: And he shall turn the heart of the fathers to the children, and the heart of the children to their fathers, lest I come and smite the earth with a curse."
          }
        ]
      }
    }
  }
}