{
  "soteriology": {
    "The Need for Salvation": {
      "The Fall of Man": {
        "title": "Sin Entered Through Adam",
        "description": "The doctrine of salvation begins with understanding why salvation is necessary. In Adam, all humanity fell from original righteousness into sin and misery. By one man's disobedience, many were made sinners. The fall was not merely a bad example but a federal headship—Adam represented all his posterity, and when he sinned, we sinned in him. The result is total depravity: not that humans are as bad as possible, but that every faculty—mind, will, emotions, body—is corrupted by sin. We are by nature children of wrath, dead in trespasses and sins, unable to save ourselves or even desire salvation apart from grace.",
        "verses": [
          {
            "reference": "Romans 5:12",
            "text": "Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned."
          },
          {
            "reference": "Romans 5:19",
            "text": "For as by one man's disobedience many were made sinners, so by the obedience of one shall many be made righteous."
          },
          {
            "reference": "Genesis 3:6-7",
            "text": "And when the woman saw that the tree was good for food, and that it was pleasant to the eyes, and a tree to be desired to make one wise, she took of the fruit thereof, and did eat, and gave also unto her husband with her; and he did eat. And the eyes of them both were opened, and they knew that they were naked."
          },
          {
            "reference": "Ephesians 2:1-3",
            "text": "And you hath he quickened, who were dead in trespasses and sins; Wherein in time past ye walked according to the course of this world... and were by nature the children of wrath, even as others."
          },
          {
            "reference": "Psalm 51:5",
            "text": "Behold, I was shapen in iniquity; and in sin did my mother conceive me."
          },
          {
            "reference": "Romans 3:23",
            "text": "For all have sinned, and come short of the glory of God."
          }
        ]
      },
      "Total Depravity": {
        "title": "The Corruption of Human Nature",
        "description": "Total depravity describes the extent of sin's corruption in human nature. It does not mean that humans are utterly depraved in every act, but that sin has affected every part of our being. The heart is deceitful above all things and desperately wicked. The mind is hostile to God, unable to submit to His law. The will is enslaved to sin—we are free to choose, but our choices are limited by our sinful nature. No one seeks God; no one does good. This condition is universal and inescapable apart from sovereign grace. Understanding depravity is essential because those who think themselves well have no need of a physician.",
        "verses": [
          {
            "reference": "Jeremiah 17:9",
            "text": "The heart is deceitful above all things, and desperately wicked: who can know it?"
          },
          {
            "reference": "Romans 8:7-8",
            "text": "Because the carnal mind is enmity against God: for it is not subject to the law of God, neither indeed can be. So then they that are in the flesh cannot please God."
          },
          {
            "reference": "Romans 3:10-12",
            "text": "As it is written, There is none righteous, no, not one: There is none that understandeth, there is none that seeketh after God. They are all gone out of the way, they are together become unprofitable; there is none that doeth good, no, not one."
          },
          {
            "reference": "John 6:44",
            "text": "No man can come to me, except the Father which hath sent me draw him: and I will raise him up at the last day."
          },
          {
            "reference": "1 Corinthians 2:14",
            "text": "But the natural man receiveth not the things of the Spirit of God: for they are foolishness unto him: neither can he know them, because they are spiritually discerned."
          },
          {
            "reference": "Genesis 6:5",
            "text": "And GOD saw that the wickedness of man was great in the earth, and that every imagination of the thoughts of his heart was only evil continually."
          }
        ]
      },
      "Spiritual Death": {
        "title": "Dead in Trespasses and Sins",
        "description": "Scripture describes the unregenerate state as spiritual death—not merely sickness or weakness, but death. The dead cannot respond, cannot feel, cannot act. This is our condition apart from Christ: dead in trespasses and sins, alienated from the life of God, having no hope and without God in the world. We were children of wrath, fulfilling the desires of the flesh and mind. This death is not annihilation but separation from God, the source of all life and blessing. Only the voice of the Son of God can call the spiritually dead to life, just as He called Lazarus from the tomb. Regeneration is resurrection—the giving of new life to those who were dead.",
        "verses": [
          {
            "reference": "Ephesians 2:1",
            "text": "And you hath he quickened, who were dead in trespasses and sins."
          },
          {
            "reference": "Ephesians 2:5",
            "text": "Even when we were dead in sins, hath quickened us together with Christ, (by grace ye are saved;)"
          },
          {
            "reference": "Colossians 2:13",
            "text": "And you, being dead in your sins and the uncircumcision of your flesh, hath he quickened together with him, having forgiven you all trespasses."
          },
          {
            "reference": "Ephesians 4:18",
            "text": "Having the understanding darkened, being alienated from the life of God through the ignorance that is in them, because of the blindness of their heart."
          },
          {
            "reference": "John 5:25",
            "text": "Verily, verily, I say unto you, The hour is coming, and now is, when the dead shall hear the voice of the Son of God: and they that hear shall live."
          },
          {
            "reference": "Romans 6:23",
            "text": "For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord."
          }
        ]
      }
    },
    "The Accomplishment of Salvation": {
      "Election and Predestination": {
        "title": "Chosen Before the Foundation of the World",
        "description": "Before time began, God the Father, in His sovereign grace, chose a people for Himself. This election was not based on foreseen faith or merit but on His own purpose and grace given us in Christ Jesus before the world began. He predestinated us unto adoption as children according to the good pleasure of His will. Election is the fountain of all saving benefits—calling, justification, sanctification, glorification all flow from this eternal decree. This doctrine humbles human pride (we contributed nothing to our salvation), magnifies divine grace (salvation is wholly of the Lord), and provides unshakable assurance (whom He predestinated, He also glorified—past tense certainty).",
        "verses": [
          {
            "reference": "Ephesians 1:4-5",
            "text": "According as he hath chosen us in him before the foundation of the world, that we should be holy and without blame before him in love: Having predestinated us unto the adoption of children by Jesus Christ to himself, according to the good pleasure of his will."
          },
          {
            "reference": "Romans 8:29-30",
            "text": "For whom he did foreknow, he also did predestinate to be conformed to the image of his Son, that he might be the firstborn among many brethren. Moreover whom he did predestinate, them he also called: and whom he called, them he also justified: and whom he justified, them he also glorified."
          },
          {
            "reference": "2 Timothy 1:9",
            "text": "Who hath saved us, and called us with an holy calling, not according to our works, but according to his own purpose and grace, which was given us in Christ Jesus before the world began."
          },
          {
            "reference": "Romans 9:11-13",
            "text": "For the children being not yet born, neither having done any good or evil, that the purpose of God according to election might stand, not of works, but of him that calleth; It was said unto her, The elder shall serve the younger. As it is written, Jacob have I loved, but Esau have I hated."
          },
          {
            "reference": "John 15:16",
            "text": "Ye have not chosen me, but I have chosen you, and ordained you, that ye should go and bring forth fruit, and that your fruit should remain."
          },
          {
            "reference": "Acts 13:48",
            "text": "And when the Gentiles heard this, they were glad, and glorified the word of the Lord: and as many as were ordained to eternal life believed."
          }
        ]
      },
      "The Atonement": {
        "title": "Christ's Substitutionary Work",
        "description": "At the cross, Jesus Christ accomplished the salvation of His people by offering Himself as a substitute, bearing the penalty they deserved. He was wounded for our transgressions, bruised for our iniquities; the chastisement of our peace was upon Him, and by His stripes we are healed. The Lord laid on Him the iniquity of us all. This is penal substitutionary atonement: Christ bore the penalty (penal) in our place (substitutionary). His sacrifice propitiated God's wrath, redeemed us from sin's slavery, and reconciled us to God. He ransomed us not with silver and gold but with His precious blood. The cross is the wisdom and power of God unto salvation.",
        "verses": [
          {
            "reference": "Isaiah 53:5-6",
            "text": "But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed. All we like sheep have gone astray; we have turned every one to his own way; and the LORD hath laid on him the iniquity of us all."
          },
          {
            "reference": "2 Corinthians 5:21",
            "text": "For he hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in him."
          },
          {
            "reference": "1 Peter 2:24",
            "text": "Who his own self bare our sins in his own body on the tree, that we, being dead to sins, should live unto righteousness: by whose stripes ye were healed."
          },
          {
            "reference": "Romans 3:25",
            "text": "Whom God hath set forth to be a propitiation through faith in his blood, to declare his righteousness for the remission of sins that are past, through the forbearance of God."
          },
          {
            "reference": "Galatians 3:13",
            "text": "Christ hath redeemed us from the curse of the law, being made a curse for us: for it is written, Cursed is every one that hangeth on a tree."
          },
          {
            "reference": "1 Peter 1:18-19",
            "text": "Forasmuch as ye know that ye were not redeemed with corruptible things, as silver and gold, from your vain conversation received by tradition from your fathers; But with the precious blood of Christ, as of a lamb without blemish and without spot."
          }
        ]
      },
      "Redemption Accomplished": {
        "title": "The Finished Work of Christ",
        "description": "When Christ cried 'It is finished,' He declared the completion of redemption. His work on the cross was not a potential salvation waiting for human acceptance but an actual redemption that accomplished its purpose. He obtained eternal redemption—not temporary or conditional, but eternal and complete. By one offering He perfected forever those who are sanctified. Nothing can be added to His finished work; nothing needs to be repeated. The sacrifice was offered once for all. Christ sat down at God's right hand because His priestly work of atonement was complete. We rest in a finished redemption, not in ongoing efforts to secure what Christ has already accomplished.",
        "verses": [
          {
            "reference": "John 19:30",
            "text": "When Jesus therefore had received the vinegar, he said, It is finished: and he bowed his head, and gave up the ghost."
          },
          {
            "reference": "Hebrews 9:12",
            "text": "Neither by the blood of goats and calves, but by his own blood he entered in once into the holy place, having obtained eternal redemption for us."
          },
          {
            "reference": "Hebrews 10:14",
            "text": "For by one offering he hath perfected for ever them that are sanctified."
          },
          {
            "reference": "Hebrews 10:12",
            "text": "But this man, after he had offered one sacrifice for sins for ever, sat down on the right hand of God."
          },
          {
            "reference": "Hebrews 7:27",
            "text": "Who needeth not daily, as those high priests, to offer up sacrifice, first for his own sins, and then for the people's: for this he did once, when he offered up himself."
          },
          {
            "reference": "Romans 5:9-10",
            "text": "Much more then, being now justified by his blood, we shall be saved from wrath through him. For if, when we were enemies, we were reconciled to God by the death of his Son, much more, being reconciled, we shall be saved by his life."
          }
        ]
      }
    },
    "The Application of Salvation": {
      "Effectual Calling": {
        "title": "Called Out of Darkness into Light",
        "description": "Effectual calling is the Holy Spirit's work of drawing sinners to Christ through the gospel. While the general call goes out to all who hear the gospel, the effectual call actually accomplishes its purpose—it brings the spiritually dead to life. God calls us out of darkness into His marvelous light. This call is irresistible not in the sense of coercion but of transformation: God changes the heart so that we willingly and joyfully come to Christ. Whom He predestinated, He called. The called ones are those who perceive Christ as the power and wisdom of God. This calling is according to His purpose, not our merit.",
        "verses": [
          {
            "reference": "1 Peter 2:9",
            "text": "But ye are a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of him who hath called you out of darkness into his marvellous light."
          },
          {
            "reference": "Romans 8:30",
            "text": "Moreover whom he did predestinate, them he also called: and whom he called, them he also justified: and whom he justified, them he also glorified."
          },
          {
            "reference": "1 Corinthians 1:23-24",
            "text": "But we preach Christ crucified, unto the Jews a stumblingblock, and unto the Greeks foolishness; But unto them which are called, both Jews and Greeks, Christ the power of God, and the wisdom of God."
          },
          {
            "reference": "2 Timothy 1:9",
            "text": "Who hath saved us, and called us with an holy calling, not according to our works, but according to his own purpose and grace, which was given us in Christ Jesus before the world began."
          },
          {
            "reference": "John 6:37",
            "text": "All that the Father giveth me shall come to me; and him that cometh to me I will in no wise cast out."
          },
          {
            "reference": "Romans 1:6-7",
            "text": "Among whom are ye also the called of Jesus Christ: To all that be in Rome, beloved of God, called to be saints."
          }
        ]
      },
      "Regeneration": {
        "title": "Born Again by the Spirit",
        "description": "Regeneration is the supernatural work of the Holy Spirit by which a spiritually dead sinner is made alive. It is being born again, born from above, born of the Spirit. This new birth is not of blood, nor of the will of the flesh, nor of the will of man, but of God. Regeneration precedes faith—we must be made alive before we can believe, just as Lazarus had to be made alive before he could respond to Christ's call. The wind blows where it wishes—regeneration is a sovereign act of God. In regeneration, God removes the heart of stone and gives a heart of flesh, writing His law on our hearts and causing us to walk in His statutes.",
        "verses": [
          {
            "reference": "John 3:3",
            "text": "Jesus answered and said unto him, Verily, verily, I say unto thee, Except a man be born again, he cannot see the kingdom of God."
          },
          {
            "reference": "John 3:5-6",
            "text": "Jesus answered, Verily, verily, I say unto thee, Except a man be born of water and of the Spirit, he cannot enter into the kingdom of God. That which is born of the flesh is flesh; and that which is born of the Spirit is spirit."
          },
          {
            "reference": "John 1:12-13",
            "text": "But as many as received him, to them gave he power to become the sons of God, even to them that believe on his name: Which were born, not of blood, nor of the will of the flesh, nor of the will of man, but of God."
          },
          {
            "reference": "Ezekiel 36:26-27",
            "text": "A new heart also will I give you, and a new spirit will I put within you: and I will take away the stony heart out of your flesh, and I will give you an heart of flesh. And I will put my spirit within you, and cause you to walk in my statutes."
          },
          {
            "reference": "Titus 3:5",
            "text": "Not by works of righteousness which we have done, but according to his mercy he saved us, by the washing of regeneration, and renewing of the Holy Ghost."
          },
          {
            "reference": "1 Peter 1:23",
            "text": "Being born again, not of corruptible seed, but of incorruptible, by the word of God, which liveth and abideth for ever."
          }
        ]
      },
      "Faith and Repentance": {
        "title": "The Response of the Renewed Heart",
        "description": "Faith and repentance are the twin graces by which we respond to the gospel. They are inseparable—there is no true faith without repentance, no genuine repentance without faith. Faith is not merely intellectual assent but wholehearted trust in Christ alone for salvation. It is the empty hand that receives the gift of righteousness. Repentance is a change of mind that leads to a change of life—turning from sin to God. Both faith and repentance are gifts of God, not human achievements. We are saved by grace through faith, and that not of ourselves; it is the gift of God. God grants repentance unto life. These graces flow from regeneration—the new heart believes and repents.",
        "verses": [
          {
            "reference": "Ephesians 2:8-9",
            "text": "For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast."
          },
          {
            "reference": "Acts 11:18",
            "text": "When they heard these things, they held their peace, and glorified God, saying, Then hath God also to the Gentiles granted repentance unto life."
          },
          {
            "reference": "Acts 20:21",
            "text": "Testifying both to the Jews, and also to the Greeks, repentance toward God, and faith toward our Lord Jesus Christ."
          },
          {
            "reference": "Philippians 1:29",
            "text": "For unto you it is given in the behalf of Christ, not only to believe on him, but also to suffer for his sake."
          },
          {
            "reference": "Mark 1:15",
            "text": "And saying, The time is fulfilled, and the kingdom of God is at hand: repent ye, and believe the gospel."
          },
          {
            "reference": "Hebrews 11:1",
            "text": "Now faith is the substance of things hoped for, the evidence of things not seen."
          },
          {
            "reference": "Romans 10:17",
            "text": "So then faith cometh by hearing, and hearing by the word of God."
          }
        ]
      },
      "Justification": {
        "title": "Declared Righteous in Christ",
        "description": "Justification is God's legal declaration that sinners are righteous in His sight. It is not making us righteous but declaring us righteous on the basis of Christ's righteousness imputed to us. This is the great exchange: our sins were imputed to Christ on the cross; His righteousness is imputed to us through faith. Justification is by grace alone, through faith alone, in Christ alone. We contribute nothing but the sin that made it necessary. Being justified by faith, we have peace with God. Justification is complete and irreversible—there is no condemnation for those in Christ Jesus. The justified cannot be unjustified; the verdict stands forever.",
        "verses": [
          {
            "reference": "Romans 3:24",
            "text": "Being justified freely by his grace through the redemption that is in Christ Jesus."
          },
          {
            "reference": "Romans 5:1",
            "text": "Therefore being justified by faith, we have peace with God through our Lord Jesus Christ."
          },
          {
            "reference": "Romans 4:5",
            "text": "But to him that worketh not, but believeth on him that justifieth the ungodly, his faith is counted for righteousness."
          },
          {
            "reference": "Romans 8:1",
            "text": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit."
          },
          {
            "reference": "2 Corinthians 5:21",
            "text": "For he hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in him."
          },
          {
            "reference": "Galatians 2:16",
            "text": "Knowing that a man is not justified by the works of the law, but by the faith of Jesus Christ, even we have believed in Jesus Christ, that we might be justified by the faith of Christ, and not by the works of the law: for by the works of the law shall no flesh be justified."
          },
          {
            "reference": "Romans 8:33-34",
            "text": "Who shall lay any thing to the charge of God's elect? It is God that justifieth. Who is he that condemneth?"
          }
        ]
      }
    },
    "The Progress of Salvation": {
      "Adoption": {
        "title": "Received as Sons and Daughters",
        "description": "Adoption is the act of grace by which God receives us into the number and privileges of His children. We were by nature children of wrath, but through Christ we become children of God with all the rights and privileges of sons. We receive the Spirit of adoption, by whom we cry 'Abba, Father.' Adoption means we are no longer strangers and foreigners but members of God's household. We are fellow heirs with Christ—if children, then heirs. The Father loves us as He loves His only-begotten Son. Adoption secures not only our present standing but our future inheritance—an inheritance incorruptible, undefiled, and unfading.",
        "verses": [
          {
            "reference": "Galatians 4:4-5",
            "text": "But when the fulness of the time was come, God sent forth his Son, made of a woman, made under the law, To redeem them that were under the law, that we might receive the adoption of sons."
          },
          {
            "reference": "Romans 8:15-16",
            "text": "For ye have not received the spirit of bondage again to fear; but ye have received the Spirit of adoption, whereby we cry, Abba, Father. The Spirit itself beareth witness with our spirit, that we are the children of God."
          },
          {
            "reference": "Romans 8:17",
            "text": "And if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with him, that we may be also glorified together."
          },
          {
            "reference": "Ephesians 1:5",
            "text": "Having predestinated us unto the adoption of children by Jesus Christ to himself, according to the good pleasure of his will."
          },
          {
            "reference": "John 1:12",
            "text": "But as many as received him, to them gave he power to become the sons of God, even to them that believe on his name."
          },
          {
            "reference": "1 John 3:1",
            "text": "Behold, what manner of love the Father hath bestowed upon us, that we should be called the sons of God: therefore the world knoweth us not, because it knew him not."
          }
        ]
      },
      "Sanctification": {
        "title": "Growing in Holiness",
        "description": "Sanctification is the ongoing work of God by which He makes us actually holy in heart and life. While justification is a legal declaration made once for all, sanctification is a process that continues throughout our earthly lives. It is God's work in us—He works in us both to will and to do His good pleasure. Yet we are also called to work out our salvation, to put off the old man and put on the new, to mortify the deeds of the body. Sanctification involves both dying to sin and living to righteousness. We are being transformed into Christ's image from glory to glory. This process will be completed only at glorification.",
        "verses": [
          {
            "reference": "1 Thessalonians 4:3",
            "text": "For this is the will of God, even your sanctification, that ye should abstain from fornication."
          },
          {
            "reference": "Philippians 2:12-13",
            "text": "Wherefore, my beloved, as ye have always obeyed, not as in my presence only, but now much more in my absence, work out your own salvation with fear and trembling. For it is God which worketh in you both to will and to do of his good pleasure."
          },
          {
            "reference": "2 Corinthians 3:18",
            "text": "But we all, with open face beholding as in a glass the glory of the Lord, are changed into the same image from glory to glory, even as by the Spirit of the Lord."
          },
          {
            "reference": "Hebrews 12:14",
            "text": "Follow peace with all men, and holiness, without which no man shall see the Lord."
          },
          {
            "reference": "Romans 6:22",
            "text": "But now being made free from sin, and become servants to God, ye have your fruit unto holiness, and the end everlasting life."
          },
          {
            "reference": "1 Peter 1:15-16",
            "text": "But as he which hath called you is holy, so be ye holy in all manner of conversation; Because it is written, Be ye holy; for I am holy."
          }
        ]
      },
      "Perseverance of the Saints": {
        "title": "Kept by the Power of God",
        "description": "Those whom God effectually calls and justifies He also preserves to the end. True believers cannot finally and totally fall away from grace but will certainly persevere to salvation. This perseverance is not due to our own strength but to God's faithfulness. He who began a good work will complete it. We are kept by the power of God through faith. Christ loses none of those the Father gives Him. Nothing can separate us from the love of God in Christ Jesus. Our perseverance is grounded in God's electing purpose, Christ's intercession, and the Spirit's indwelling. The saints persevere because God preserves.",
        "verses": [
          {
            "reference": "Philippians 1:6",
            "text": "Being confident of this very thing, that he which hath begun a good work in you will perform it until the day of Jesus Christ."
          },
          {
            "reference": "1 Peter 1:5",
            "text": "Who are kept by the power of God through faith unto salvation ready to be revealed in the last time."
          },
          {
            "reference": "John 10:28-29",
            "text": "And I give unto them eternal life; and they shall never perish, neither shall any man pluck them out of my hand. My Father, which gave them me, is greater than all; and no man is able to pluck them out of my Father's hand."
          },
          {
            "reference": "Romans 8:38-39",
            "text": "For I am persuaded, that neither death, nor life, nor angels, nor principalities, nor powers, nor things present, nor things to come, Nor height, nor depth, nor any other creature, shall be able to separate us from the love of God, which is in Christ Jesus our Lord."
          },
          {
            "reference": "Jude 24",
            "text": "Now unto him that is able to keep you from falling, and to present you faultless before the presence of his glory with exceeding joy."
          },
          {
            "reference": "John 6:39",
            "text": "And this is the Father's will which hath sent me, that of all which he hath given me I should lose nothing, but should raise it up again at the last day."
          }
        ]
      }
    },
    "The Consummation of Salvation": {
      "Glorification": {
        "title": "The Final Transformation",
        "description": "Glorification is the final step in salvation's golden chain—whom He justified, them He also glorified. It is the completion of our redemption when, at Christ's return or our death, we are made perfectly holy in body and soul. We shall be like Him, for we shall see Him as He is. Our lowly bodies will be transformed to be like His glorious body. Mortality will put on immortality; corruption will put on incorruption. Death, the last enemy, will be swallowed up in victory. Glorification is the resurrection hope—we groan within ourselves, waiting for the adoption, the redemption of our body. What we shall be has not yet appeared, but it will be glorious beyond imagination.",
        "verses": [
          {
            "reference": "Romans 8:30",
            "text": "Moreover whom he did predestinate, them he also called: and whom he called, them he also justified: and whom he justified, them he also glorified."
          },
          {
            "reference": "1 John 3:2",
            "text": "Beloved, now are we the sons of God, and it doth not yet appear what we shall be: but we know that, when he shall appear, we shall be like him; for we shall see him as he is."
          },
          {
            "reference": "Philippians 3:21",
            "text": "Who shall change our vile body, that it may be fashioned like unto his glorious body, according to the working whereby he is able even to subdue all things unto himself."
          },
          {
            "reference": "1 Corinthians 15:53-54",
            "text": "For this corruptible must put on incorruption, and this mortal must put on immortality. So when this corruptible shall have put on incorruption, and this mortal shall have put on immortality, then shall be brought to pass the saying that is written, Death is swallowed up in victory."
          },
          {
            "reference": "Romans 8:23",
            "text": "And not only they, but ourselves also, which have the firstfruits of the Spirit, even we ourselves groan within ourselves, waiting for the adoption, to wit, the redemption of our body."
          },
          {
            "reference": "2 Corinthians 5:4",
            "text": "For we that are in this tabernacle do groan, being burdened: not for that we would be unclothed, but clothed upon, that mortality might be swallowed up of life."
          }
        ]
      },
      "Eternal Life": {
        "title": "Life Forevermore with God",
        "description": "Eternal life is not merely endless existence but the quality of life belonging to the age to come—knowing the only true God and Jesus Christ whom He has sent. This life is a present possession (he that believes has eternal life) and a future hope (in the world to come, life everlasting). It is abundant life, overflowing life, the water of life springing up into everlasting life. This life is in Christ—he who has the Son has life. The gift of God is eternal life through Jesus Christ our Lord. This life can never be lost, for it is eternal by nature. It is the consummation of salvation—to dwell in the house of the Lord forever.",
        "verses": [
          {
            "reference": "John 17:3",
            "text": "And this is life eternal, that they might know thee the only true God, and Jesus Christ, whom thou hast sent."
          },
          {
            "reference": "John 3:36",
            "text": "He that believeth on the Son hath everlasting life: and he that believeth not the Son shall not see life; but the wrath of God abideth on him."
          },
          {
            "reference": "John 10:28",
            "text": "And I give unto them eternal life; and they shall never perish, neither shall any man pluck them out of my hand."
          },
          {
            "reference": "Romans 6:23",
            "text": "For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord."
          },
          {
            "reference": "1 John 5:11-12",
            "text": "And this is the record, that God hath given to us eternal life, and this life is in his Son. He that hath the Son hath life; and he that hath not the Son of God hath not life."
          },
          {
            "reference": "John 4:14",
            "text": "But whosoever drinketh of the water that I shall give him shall never thirst; but the water that I shall give him shall be in him a well of water springing up into everlasting life."
          }
        ]
      }
    }
  }
}