{
  "ten_commandments": {
    "Duties Toward God": {
      "The First Commandment": {
        "title": "Thou Shalt Have No Other Gods Before Me",
        "description": "The first commandment establishes monotheism as the foundation of true religion—there is one God, and He alone deserves worship. This prohibits not only the worship of false deities but also any rival that occupies the place belonging to God alone: money, pleasure, self, career, or any created thing. The commandment flows from God's self-revelation: 'I am the LORD thy God'—the covenant name declaring His eternal, self-existent nature. Israel's God had demonstrated His supremacy by delivering them from Egypt; all other gods are nothing.",
        "verses": [
          {
            "reference": "Exodus 20:2-3",
            "text": "I am the LORD thy God, which have brought thee out of the land of Egypt, out of the house of bondage. Thou shalt have no other gods before me."
          },
          {
            "reference": "Deuteronomy 6:4-5",
            "text": "Hear, O Israel: The LORD our God is one LORD: And thou shalt love the LORD thy God with all thine heart, and with all thy soul, and with all thy might."
          },
          {
            "reference": "Isaiah 45:5",
            "text": "I am the LORD, and there is none else, there is no God beside me."
          }
        ]
      },
      "The Second Commandment": {
        "title": "Thou Shalt Not Make Unto Thee Any Graven Image",
        "description": "The second commandment prohibits idolatry—making or worshiping any representation of God or false deity. While the first commandment addresses whom we worship, the second addresses how we worship. God cannot be reduced to any created form; all images inevitably diminish and distort His infinite being. This commandment protects both God's honor and humanity's good, for idolatry degrades the worshiper. God describes Himself as 'jealous'—not with petty envy but with the righteous zeal of a husband protecting the marriage covenant.",
        "verses": [
          {
            "reference": "Exodus 20:4-6",
            "text": "Thou shalt not make unto thee any graven image, or any likeness of any thing that is in heaven above, or that is in the earth beneath, or that is in the water under the earth: Thou shalt not bow down thyself to them, nor serve them: for I the LORD thy God am a jealous God, visiting the iniquity of the fathers upon the children unto the third and fourth generation of them that hate me; And shewing mercy unto thousands of them that love me, and keep my commandments."
          },
          {
            "reference": "Deuteronomy 4:15-16",
            "text": "Take ye therefore good heed unto yourselves; for ye saw no manner of similitude on the day that the LORD spake unto you in Horeb out of the midst of the fire: Lest ye corrupt yourselves, and make you a graven image, the similitude of any figure."
          },
          {
            "reference": "Romans 1:22-23",
            "text": "Professing themselves to be wise, they became fools, And changed the glory of the uncorruptible God into an image made like to corruptible man, and to birds, and fourfooted beasts, and creeping things."
          }
        ]
      },
      "The Third Commandment": {
        "title": "Thou Shalt Not Take the Name of the LORD Thy God in Vain",
        "description": "The third commandment protects God's name—His revealed character and reputation—from misuse and dishonor. This prohibits profanity and blasphemy but extends further: using God's name in false oaths, empty religious formulas, or hypocritical worship. To invoke God's name while living contrary to His character takes His name in vain. The commandment calls for reverence in all references to God, integrity in oaths sworn by His name, and consistency between profession and practice.",
        "verses": [
          {
            "reference": "Exodus 20:7",
            "text": "Thou shalt not take the name of the LORD thy God in vain; for the LORD will not hold him guiltless that taketh his name in vain."
          },
          {
            "reference": "Leviticus 19:12",
            "text": "And ye shall not swear by my name falsely, neither shalt thou profane the name of thy God: I am the LORD."
          },
          {
            "reference": "Matthew 6:9",
            "text": "After this manner therefore pray ye: Our Father which art in heaven, Hallowed be thy name."
          }
        ]
      },
      "The Fourth Commandment": {
        "title": "Remember the Sabbath Day, to Keep It Holy",
        "description": "The fourth commandment establishes a sacred rhythm of work and rest, setting apart one day in seven for holy purposes. The Sabbath commemorates creation—God rested on the seventh day—and in Deuteronomy, redemption from Egypt. This commandment benefits humanity: providing physical rest, spiritual renewal, and time for worship. The principle of Sabbath rest points ultimately to the eternal rest that remains for God's people, the ceasing from works-righteousness and resting in Christ's finished work.",
        "verses": [
          {
            "reference": "Exodus 20:8-11",
            "text": "Remember the sabbath day, to keep it holy. Six days shalt thou labour, and do all thy work: But the seventh day is the sabbath of the LORD thy God: in it thou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thy stranger that is within thy gates: For in six days the LORD made heaven and earth, the sea, and all that in them is, and rested the seventh day: wherefore the LORD blessed the sabbath day, and hallowed it."
          },
          {
            "reference": "Isaiah 58:13-14",
            "text": "If thou turn away thy foot from the sabbath, from doing thy pleasure on my holy day; and call the sabbath a delight, the holy of the LORD, honourable; and shalt honour him, not doing thine own ways, nor finding thine own pleasure, nor speaking thine own words: Then shalt thou delight thyself in the LORD."
          },
          {
            "reference": "Hebrews 4:9-10",
            "text": "There remaineth therefore a rest to the people of God. For he that is entered into his rest, he also hath ceased from his own works, as God did from his."
          }
        ]
      }
    },
    "Duties Toward Others": {
      "The Fifth Commandment": {
        "title": "Honour Thy Father and Thy Mother",
        "description": "The fifth commandment transitions from duties to God to duties toward others, beginning with the family—the foundational institution of human society. Honoring parents involves respect, obedience (for children), care (for aged parents), and gratitude. This commandment carries a promise: long life in the land. Honoring parents teaches submission to authority generally and ultimately to God Himself. The family structure reflects divine order; rebellion against parental authority often precedes rebellion against all authority.",
        "verses": [
          {
            "reference": "Exodus 20:12",
            "text": "Honour thy father and thy mother: that thy days may be long upon the land which the LORD thy God giveth thee."
          },
          {
            "reference": "Ephesians 6:1-3",
            "text": "Children, obey your parents in the Lord: for this is right. Honour thy father and mother; which is the first commandment with promise; That it may be well with thee, and thou mayest live long on the earth."
          },
          {
            "reference": "Proverbs 23:22",
            "text": "Hearken unto thy father that begat thee, and despise not thy mother when she is old."
          }
        ]
      },
      "The Sixth Commandment": {
        "title": "Thou Shalt Not Kill",
        "description": "The sixth commandment protects human life, created in God's image. The Hebrew word specifically denotes unlawful killing—murder—rather than all taking of life. This prohibition encompasses not only the act of murder but its roots: hatred, anger, and contempt. Jesus taught that calling a brother 'fool' violates this commandment's spirit. Positively, the commandment requires preserving and protecting life, including our own bodies and the lives of others.",
        "verses": [
          {
            "reference": "Exodus 20:13",
            "text": "Thou shalt not kill."
          },
          {
            "reference": "Matthew 5:21-22",
            "text": "Ye have heard that it was said by them of old time, Thou shalt not kill; and whosoever shall kill shall be in danger of the judgment: But I say unto you, That whosoever is angry with his brother without a cause shall be in danger of the judgment."
          },
          {
            "reference": "Genesis 9:6",
            "text": "Whoso sheddeth man's blood, by man shall his blood be shed: for in the image of God made he man."
          },
          {
            "reference": "1 John 3:15",
            "text": "Whosoever hateth his brother is a murderer: and ye know that no murderer hath eternal life abiding in him."
          }
        ]
      },
      "The Seventh Commandment": {
        "title": "Thou Shalt Not Commit Adultery",
        "description": "The seventh commandment protects the marriage covenant and sexual purity. Adultery violates the sacred bond between husband and wife, breaking faith and destroying trust. Jesus extended this commandment to include lustful thoughts: whoever looks upon another with desire has already committed adultery in the heart. This commandment safeguards the family, protects children, and honors the divine design for human sexuality within the covenant of marriage.",
        "verses": [
          {
            "reference": "Exodus 20:14",
            "text": "Thou shalt not commit adultery."
          },
          {
            "reference": "Matthew 5:27-28",
            "text": "Ye have heard that it was said by them of old time, Thou shalt not commit adultery: But I say unto you, That whosoever looketh on a woman to lust after her hath committed adultery with her already in his heart."
          },
          {
            "reference": "Hebrews 13:4",
            "text": "Marriage is honourable in all, and the bed undefiled: but whoremongers and adulterers God will judge."
          },
          {
            "reference": "Proverbs 6:32",
            "text": "But whoso committeth adultery with a woman lacketh understanding: he that doeth it destroyeth his own soul."
          }
        ]
      },
      "The Eighth Commandment": {
        "title": "Thou Shalt Not Steal",
        "description": "The eighth commandment protects property rights—the fruit of one's labor belongs to the laborer. Stealing encompasses not only outright theft but fraud, deception, failure to pay just wages, and unjust business practices. Positively, this commandment requires honest work, fair dealing, contentment with one's possessions, and generosity toward those in need. The thief must steal no more but labor honestly to have something to give to others.",
        "verses": [
          {
            "reference": "Exodus 20:15",
            "text": "Thou shalt not steal."
          },
          {
            "reference": "Ephesians 4:28",
            "text": "Let him that stole steal no more: but rather let him labour, working with his hands the thing which is good, that he may have to give to him that needeth."
          },
          {
            "reference": "Leviticus 19:13",
            "text": "Thou shalt not defraud thy neighbour, neither rob him: the wages of him that is hired shall not abide with thee all night until the morning."
          },
          {
            "reference": "Proverbs 11:1",
            "text": "A false balance is abomination to the LORD: but a just weight is his delight."
          }
        ]
      },
      "The Ninth Commandment": {
        "title": "Thou Shalt Not Bear False Witness",
        "description": "The ninth commandment protects truth and reputation. Originally addressing testimony in legal proceedings, it extends to all communication: lying, slander, gossip, and deception of any kind. False witness destroys reputations, perverts justice, and undermines social trust. Positively, this commandment requires truthfulness in all speech, defending others' good names, and speaking the truth in love. Satan is the father of lies; God's people must be children of truth.",
        "verses": [
          {
            "reference": "Exodus 20:16",
            "text": "Thou shalt not bear false witness against thy neighbour."
          },
          {
            "reference": "Proverbs 19:5",
            "text": "A false witness shall not be unpunished, and he that speaketh lies shall not escape."
          },
          {
            "reference": "Colossians 3:9",
            "text": "Lie not one to another, seeing that ye have put off the old man with his deeds."
          },
          {
            "reference": "Ephesians 4:25",
            "text": "Wherefore putting away lying, speak every man truth with his neighbour: for we are members one of another."
          }
        ]
      },
      "The Tenth Commandment": {
        "title": "Thou Shalt Not Covet",
        "description": "The tenth commandment addresses the heart—the internal desires from which all external sins flow. Covetousness is discontentment with God's provision and desire for what belongs to another. This commandment reveals that sin originates within, not merely in outward actions. No one can perfectly keep even the external commandments while harboring covetous hearts. Paul testified that this commandment convicted him of sin, showing him the depth of his depravity and his need for grace.",
        "verses": [
          {
            "reference": "Exodus 20:17",
            "text": "Thou shalt not covet thy neighbour's house, thou shalt not covet thy neighbour's wife, nor his manservant, nor his maidservant, nor his ox, nor his ass, nor any thing that is thy neighbour's."
          },
          {
            "reference": "Romans 7:7",
            "text": "What shall we say then? Is the law sin? God forbid. Nay, I had not known sin, but by the law: for I had not known lust, except the law had said, Thou shalt not covet."
          },
          {
            "reference": "Hebrews 13:5",
            "text": "Let your conversation be without covetousness; and be content with such things as ye have: for he hath said, I will never leave thee, nor forsake thee."
          },
          {
            "reference": "1 Timothy 6:6",
            "text": "But godliness with contentment is great gain."
          }
        ]
      }
    }
  }
}