{
  "women": {
    "Matriarchs and Mothers": {
      "Eve": {
        "title": "Mother of All Living",
        "description": "The first woman, fashioned from Adam's rib in the garden of Eden, Eve stood as the crown of God's creative work—the suitable helper designed for Adam, completing the divine image in humanity's male and female expression. Created without sin in a state of original righteousness, she enjoyed unhindered fellowship with God and her husband until the serpent's subtle deception led her to question God's goodness and wisdom. When she saw that the forbidden tree was good for food, pleasant to the eyes, and desirable for gaining wisdom, she took its fruit and gave it to Adam, thereby introducing sin and death into the human race.<br><br>\nYet even in pronouncing judgment, God demonstrated mercy—the protevangelium of Genesis 3:15 promised that the woman's seed would bruise the serpent's head, offering hope of ultimate redemption. Adam's naming her Eve (Hebrew חַוָּה, <em>Chavvah</em>, meaning 'life' or 'living') after the Fall demonstrated remarkable faith, believing that despite the curse of death, she would indeed become the mother of all living.<br><br>\nThrough her painful childbearing would come both Cain the murderer and Seth, through whose line the Messiah would eventually be born.<label for=\"sn-eve\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-eve\" class=\"margin-toggle\"/><span class=\"sidenote\">The creation account emphasizes Eve's derivation from Adam's side rather than from the dust, signifying both her essential equality (same substance) and functional distinction (created as helper). Paul's application of this order to church leadership (1 Timothy 2:13) grounds sexual complementarity in creation, not culture. The serpent's approach to Eve rather than Adam has occasioned much theological reflection—whether it represented craftiness in attacking the physically weaker, an attempt to reverse God's appointed order, or simple circumstance is debated among commentators.</span>",
        "family_tree_link": "/family-tree/person/i2",
        "verses": [
          {
            "reference": "Genesis 1:27",
            "text": "So God created man in his own image, in the image of God created he him; male and female created he them."
          },
          {
            "reference": "Genesis 2:18",
            "text": "And the LORD God said, It is not good that the man should be alone; I will make him an help meet for him."
          },
          {
            "reference": "Genesis 2:23",
            "text": "And Adam said, This is now bone of my bones, and flesh of my flesh: she shall be called Woman, because she was taken out of Man."
          },
          {
            "reference": "Genesis 3:6",
            "text": "And when the woman saw that the tree was good for food, and that it was pleasant to the eyes, and a tree to be desired to make one wise, she took of the fruit thereof, and did eat, and gave also unto her husband with her; and he did eat."
          },
          {
            "reference": "Genesis 3:15",
            "text": "And I will put enmity between thee and the woman, and between thy seed and her seed; it shall bruise thy head, and thou shalt bruise his heel."
          },
          {
            "reference": "Genesis 3:20",
            "text": "And Adam called his wife's name Eve; because she was the mother of all living."
          }
        ]
      },
      "Sarah": {
        "title": "Princess, Mother of Nations",
        "description": "Originally named Sarai, Abraham's wife walked beside him through his journey of faith from Ur of the Chaldees to Canaan, enduring both the trials of nomadic life and the peculiar burden of God's promise that she would bear the child of covenant despite her barrenness. For twenty-five years she waited for the promised seed, her womb remaining closed while God tested and refined the faith of both husband and wife. In her impatience, she gave her Egyptian handmaid Hagar to Abraham, producing Ishmael—a work of the flesh that introduced lasting strife.<br><br>\nWhen God appeared to Abraham and renewed His covenant, He changed her name from Sarai ('my princess') to Sarah ('princess'), signifying her elevation from being merely Abraham's princess to mother of nations and kings. At ninety years old, long past natural childbearing, she laughed at the angel's announcement that she would conceive, questioning how pleasure could come to one so old. Yet God's power overcame nature's impossibility, and Isaac ('laughter') was born, transforming her incredulous laughter into the joy of fulfillment.<br><br>\nPeter commends her submission to Abraham, noting that she called him 'lord,' while Hebrews celebrates her faith in judging God faithful to His promise. She died at 127 years and was buried in the cave of Machpelah, the first possession Abraham owned in the Promised Land.<label for=\"sn-sarah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-sarah\" class=\"margin-toggle\"/><span class=\"sidenote\">Sarah's beauty remained remarkable even in old age, twice endangering her through Abraham's deceptive 'sister' scheme (Genesis 12, 20). These episodes demonstrate both human weakness and divine faithfulness—God protected the promised seed despite Abraham's failures. The name change from Sarai to Sarah parallels Abram to Abraham, both receiving covenant names. Her 127 years made her the only woman whose age at death Scripture records, emphasizing her significance in redemptive history.</span>",
        "family_tree_link": "/family-tree/person/i159",
        "verses": [
          {
            "reference": "Genesis 17:15",
            "text": "And God said unto Abraham, As for Sarai thy wife, thou shalt not call her name Sarai, but Sarah shall her name be."
          },
          {
            "reference": "Genesis 17:16",
            "text": "And I will bless her, and give thee a son also of her: yea, I will bless her, and she shall be a mother of nations; kings of people shall be of her."
          },
          {
            "reference": "Genesis 18:12",
            "text": "Therefore Sarah laughed within herself, saying, After I am waxed old shall I have pleasure, my lord being old also?"
          },
          {
            "reference": "Genesis 21:6",
            "text": "And Sarah said, God hath made me to laugh, so that all that hear will laugh with me."
          },
          {
            "reference": "Hebrews 11:11",
            "text": "Through faith also Sara herself received strength to conceive seed, and was delivered of a child when she was past age, because she judged him faithful who had promised."
          },
          {
            "reference": "1 Peter 3:6",
            "text": "Even as Sara obeyed Abraham, calling him lord: whose daughters ye are, as long as ye do well, and are not afraid with any amazement."
          }
        ]
      },
      "Rebekah": {
        "title": "Chosen Bride of Isaac",
        "description": "Selected by divine providence to be Isaac's wife, Rebekah's kindness at the well revealed her character.<label for=\"sn-rebekah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-rebekah\" class=\"margin-toggle\"/><span class=\"sidenote\">Wells served as crucial community gathering places in ancient Near Eastern culture, making them natural settings for significant encounters. Abraham's servant sought God's guidance through a specific sign involving hospitality at the well—Rebekah's willingness to water not only him but also his ten camels (requiring drawing perhaps 25-30 gallons of water) demonstrated extraordinary kindness and industriousness, confirming God's providential selection.</span> Her favoritism toward Jacob and complicity in deceiving Isaac demonstrated human weakness, yet God's purposes prevailed.",
        "family_tree_link": "/family-tree/person/i170",
        "verses": [
          {
            "reference": "Genesis 24:16",
            "text": "And the damsel was very fair to look upon, a virgin, neither had any man known her: and she went down to the well, and filled her pitcher, and came up."
          },
          {
            "reference": "Genesis 24:19",
            "text": "And when she had done giving him drink, she said, I will draw water for thy camels also, until they have done drinking."
          },
          {
            "reference": "Genesis 24:58",
            "text": "And they called Rebekah, and said unto her, Wilt thou go with this man? And she said, I will go."
          },
          {
            "reference": "Genesis 24:67",
            "text": "And Isaac brought her into his mother Sarah's tent, and took Rebekah, and she became his wife; and he loved her: and Isaac was comforted after his mother's death."
          },
          {
            "reference": "Genesis 25:23",
            "text": "And the LORD said unto her, The two nations are in thy womb, and two manner of people shall be separated from thy bowels; and the one people shall be stronger than the other people; and the elder shall serve the younger."
          }
        ]
      },
      "Rachel": {
        "title": "Beloved of Jacob",
        "description": "Jacob's beloved wife, for whom he labored fourteen years, Rachel endured barrenness before bearing Joseph and Benjamin. Her death in childbirth brought sorrow, yet her sons became pivotal to Israel's history.<label for=\"sn-rachel\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-rachel\" class=\"margin-toggle\"/><span class=\"sidenote\">Jeremiah's prophecy of 'Rachel weeping for her children' (Jeremiah 31:15) found fulfillment in Herod's slaughter of Bethlehem's infants (Matthew 2:18). Rachel's tomb near Bethlehem made her an apt symbol of maternal grief over Israel's suffering.</span>",
        "family_tree_link": "/family-tree/person/i214",
        "verses": [
          {
            "reference": "Genesis 29:17",
            "text": "Leah was tender eyed; but Rachel was beautiful and well favoured."
          },
          {
            "reference": "Genesis 29:20",
            "text": "And Jacob served seven years for Rachel; and they seemed unto him but a few days, for the love he had to her."
          },
          {
            "reference": "Genesis 30:22",
            "text": "And God remembered Rachel, and God hearkened to her, and opened her womb."
          },
          {
            "reference": "Genesis 35:19",
            "text": "And Rachel died, and was buried in the way to Ephrath, which is Bethlehem."
          },
          {
            "reference": "Jeremiah 31:15",
            "text": "Thus saith the LORD; A voice was heard in Ramah, lamentation, and bitter weeping; Rahel weeping for her children refused to be comforted for her children, because they were not."
          }
        ]
      },
      "Leah": {
        "title": "The Unloved Wife, Mother of Judah",
        "description": "Though unloved by Jacob, Leah bore him six sons and a daughter, becoming the mother of Judah through whom the Messianic line would come. Her painful experience of rejection demonstrates God's compassion for the afflicted and His sovereign purposes in using the despised.<label for=\"sn-leah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-leah\" class=\"margin-toggle\"/><span class=\"sidenote\">The names Leah gave her sons reveal her emotional journey—from longing for Jacob's love ('Reuben'—'see, a son') to praising God regardless ('Judah'—'praise'). Christ descended from Leah's son Judah, not Rachel's more favored line, demonstrating God's grace to the overlooked.</span>",
        "verses": [
          {
            "reference": "Genesis 29:31",
            "text": "And when the LORD saw that Leah was hated, he opened her womb: but Rachel was barren."
          },
          {
            "reference": "Genesis 29:32",
            "text": "And Leah conceived, and bare a son, and she called his name Reuben: for she said, Surely the LORD hath looked upon my affliction; now therefore my husband will love me."
          },
          {
            "reference": "Genesis 29:35",
            "text": "And she conceived again, and bare a son: and she said, Now will I praise the LORD: therefore she called his name Judah; and left bearing."
          },
          {
            "reference": "Genesis 49:31",
            "text": "There they buried Abraham and Sarah his wife; there they buried Isaac and Rebekah his wife; and there I buried Leah."
          },
          {
            "reference": "Ruth 4:11",
            "text": "And all the people that were in the gate, and the elders, said, We are witnesses. The LORD make the woman that is come into thine house like Rachel and like Leah, which two did build the house of Israel:"
          }
        ]
      },
      "Hannah": {
        "title": "Woman of Prayer, Mother of Samuel",
        "description": "Barren and provoked by her rival, Hannah's anguished prayer for a son demonstrates fervent faith. Her subsequent dedication of Samuel to the LORD's service and her prophetic song of thanksgiving reveal profound spiritual depth. Her faithful intercession produced one of Israel's greatest prophets.<label for=\"sn-hannah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-hannah\" class=\"margin-toggle\"/><span class=\"sidenote\">Hannah's prayer (1 Samuel 2:1-10) prefigures Mary's Magnificat, sharing themes of God's sovereignty, His exaltation of the humble, and His anointed King. Her vow and its fulfillment model sacrificial devotion—returning to God the gift He had given.</span>",
        "verses": [
          {
            "reference": "1 Samuel 1:10",
            "text": "And she was in bitterness of soul, and prayed unto the LORD, and wept sore."
          },
          {
            "reference": "1 Samuel 1:11",
            "text": "And she vowed a vow, and said, O LORD of hosts, if thou wilt indeed look on the affliction of thine handmaid, and remember me, and not forget thine handmaid, but wilt give unto thine handmaid a man child, then I will give him unto the LORD all the days of his life, and there shall no razor come upon his head."
          },
          {
            "reference": "1 Samuel 1:27",
            "text": "For this child I prayed; and the LORD hath given me my petition which I asked of him:"
          },
          {
            "reference": "1 Samuel 2:1",
            "text": "And Hannah prayed, and said, My heart rejoiceth in the LORD, mine horn is exalted in the LORD: my mouth is enlarged over mine enemies; because I rejoice in thy salvation."
          },
          {
            "reference": "1 Samuel 2:21",
            "text": "And the LORD visited Hannah, so that she conceived, and bare three sons and two daughters. And the child Samuel grew before the LORD."
          }
        ]
      }
    },
    "Women of Faith and Courage": {
      "Ruth": {
        "title": "The Moabite Convert, Great-Grandmother of David",
        "description": "A Moabite widow who chose Israel's God over her own people and homeland, Ruth's account stands as one of Scripture's most beautiful demonstrations of covenant love and sovereign providence. Born in Moab—a nation excluded from Israel's assembly due to their opposition during the Exodus—she married an Israelite during the time of the judges when \"every man did that which was right in his own eyes.\" After her husband's death left her childless, she faced the choice of returning to her people and gods or following her mother-in-law Naomi back to Bethlehem in poverty and uncertainty.<br><br>\nHer declaration of loyalty—\"Intreat me not to leave thee... thy people shall be my people, and thy God my God\"—represents one of Scripture's clearest expressions of genuine conversion, choosing covenant faithfulness over ease and security. Arriving in Bethlehem at barley harvest, she providentially gleaned in the field of Boaz, a kinsman of her deceased father-in-law. Through Naomi's guidance and Boaz's redemptive kindness, Ruth's faith and virtue led to her marriage to Boaz, producing Obed, grandfather of King David.<br><br>\nThus a Moabite woman entered Christ's genealogy (Matthew 1:5), demonstrating that God's grace transcends ethnic boundaries and that faith, not bloodline, determines inclusion in His purposes. The book bearing her name reveals God's tender care for the afflicted and His sovereign orchestration of seemingly random events to accomplish His redemptive plan.<label for=\"sn-ruth\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-ruth\" class=\"margin-toggle\"/><span class=\"sidenote\">The Hebrew word <em>hesed</em> (covenant love/lovingkindness) appears prominently in Ruth's account, describing Ruth's loyalty to Naomi, Boaz's kindness to Ruth, and ultimately God's faithfulness to all. Boaz's role as kinsman-redeemer (<em>goel</em>) typologically prefigures Christ's redemptive work. The timing—harvest season, threshing floor, midnight—creates a carefully structured narrative demonstrating divine providence in life's ordinary details.</span>",
        "family_tree_link": "/family-tree/person/i520",
        "verses": [
          {
            "reference": "Ruth 1:16",
            "text": "And Ruth said, Intreat me not to leave thee, or to return from following after thee: for whither thou goest, I will go; and where thou lodgest, I will lodge: thy people shall be my people, and thy God my God:"
          },
          {
            "reference": "Ruth 2:12",
            "text": "The LORD recompense thy work, and a full reward be given thee of the LORD God of Israel, under whose wings thou art come to trust."
          },
          {
            "reference": "Ruth 3:11",
            "text": "And now, my daughter, fear not; I will do to thee all that thou requirest: for all the city of my people doth know that thou art a virtuous woman."
          },
          {
            "reference": "Ruth 4:13",
            "text": "So Boaz took Ruth, and she was his wife: and when he went in unto her, the LORD gave her conception, and she bare a son."
          },
          {
            "reference": "Matthew 1:5",
            "text": "And Salmon begat Booz of Rachab; and Booz begat Obed of Ruth; and Obed begat Jesse;"
          }
        ]
      },
      "Esther": {
        "title": "Queen of Persia, Deliverer of Israel",
        "description": "A Jewish orphan who became queen of Persia, Esther risked her life to save her people from genocide. Her courage, guided by Mordecai's wisdom and undergirded by fasting, thwarted Haman's plot and secured Israel's preservation.<label for=\"sn-esther\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-esther\" class=\"margin-toggle\"/><span class=\"sidenote\">Though God's name never appears in Esther, His providence permeates the narrative. Mordecai's words—'who knoweth whether thou art come to the kingdom for such a time as this?'—express the doctrine of divine sovereignty working through human agency.</span>",
        "verses": [
          {
            "reference": "Esther 2:7",
            "text": "And he brought up Hadassah, that is, Esther, his uncle's daughter: for she had neither father nor mother, and the maid was fair and beautiful; whom Mordecai, when her father and mother were dead, took for his own daughter."
          },
          {
            "reference": "Esther 2:17",
            "text": "And the king loved Esther above all the women, and she obtained grace and favour in his sight more than all the virgins; so that he set the royal crown upon her head, and made her queen instead of Vashti."
          },
          {
            "reference": "Esther 4:14",
            "text": "For if thou altogether holdest thy peace at this time, then shall there enlargement and deliverance arise to the Jews from another place; but thou and thy father's house shall be destroyed: and who knoweth whether thou art come to the kingdom for such a time as this?"
          },
          {
            "reference": "Esther 4:16",
            "text": "Go, gather together all the Jews that are present in Shushan, and fast ye for me, and neither eat nor drink three days, night or day: I also and my maidens will fast likewise; and so will I go in unto the king, which is not according to the law: and if I perish, I perish."
          },
          {
            "reference": "Esther 7:3",
            "text": "Then Esther the queen answered and said, If I have found favour in thy sight, O king, and if it please the king, let my life be given me at my petition, and my people at my request:"
          }
        ]
      },
      "Deborah": {
        "title": "Prophetess and Judge of Israel",
        "description": "The only female judge, Deborah led Israel with wisdom and faith. Her prophetic authority, demonstrated in summoning Barak and predicting victory over Sisera, shows God raises leaders according to His purposes, not human conventions.<label for=\"sn-deborah\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-deborah\" class=\"margin-toggle\"/><span class=\"sidenote\">Deborah's leadership during the period of the judges demonstrates that God sometimes raises women to positions of authority, particularly when men fail to lead. Her song of victory (Judges 5) ranks among Scripture's finest poetry, celebrating God's deliverance of His people.</span>",
        "verses": [
          {
            "reference": "Judges 4:4",
            "text": "And Deborah, a prophetess, the wife of Lapidoth, she judged Israel at that time."
          },
          {
            "reference": "Judges 4:9",
            "text": "And she said, I will surely go with thee: notwithstanding the journey that thou takest shall not be for thine honour; for the LORD shall sell Sisera into the hand of a woman. And Deborah arose, and went with Barak to Kedesh."
          },
          {
            "reference": "Judges 5:3",
            "text": "Hear, O ye kings; give ear, O ye princes; I, even I, will sing unto the LORD; I will sing praise to the LORD God of Israel."
          },
          {
            "reference": "Judges 5:7",
            "text": "The inhabitants of the villages ceased, they ceased in Israel, until that I Deborah arose, that I arose a mother in Israel."
          },
          {
            "reference": "Judges 5:31",
            "text": "So let all thine enemies perish, O LORD: but let them that love him be as the sun when he goeth forth in his might. And the land had rest forty years."
          }
        ]
      },
      "Rahab": {
        "title": "The Harlot of Jericho Who Sheltered the Spies",
        "description": "A Canaanite prostitute living in Jericho when Joshua's spies entered to survey the land, Rahab demonstrated remarkable faith in Israel's God despite her pagan upbringing and sinful profession. Having heard of the LORD's mighty works—the parting of the Red Sea and victories over Amorite kings—she acknowledged that \"the LORD your God, he is God in heaven above, and in earth beneath.\" When the king of Jericho sought the Israelite spies, she hid them on her roof under stalks of flax, sending their pursuers on a false trail. In exchange for her protection, she requested safety for herself and her family when Israel attacked, receiving the scarlet cord to hang from her window as a sign of covenant protection.<br><br>\nWhen Jericho's walls fell, Joshua commanded the spies to bring out Rahab and all her household, and \"she dwelleth in Israel even unto this day.\" She married Salmon of the tribe of Judah, bore Boaz, and thus entered the Messianic line—one of only four women mentioned in Matthew's genealogy of Christ.<br><br>\nThe author of Hebrews celebrates her faith (11:31), while James cites her works as evidence of living faith (2:25), demonstrating that saving faith produces obedient action.<label for=\"sn-rahab\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-rahab\" class=\"margin-toggle\"/><span class=\"sidenote\">Rahab's scarlet cord has prompted typological interpretation as symbolizing Christ's blood providing salvation. Her inclusion in Christ's genealogy alongside Tamar, Ruth, and Bathsheba emphasizes God's grace to Gentiles and sinners. The transformation from 'Rahab the harlot' to ancestress of David and Christ illustrates the gospel's power to redeem the most unlikely candidates. Her faith, though imperfect (she lied to protect the spies), proved genuine through costly action—risking her life to align with Israel's God against her own people.</span>",
        "verses": [
          {
            "reference": "Joshua 2:9",
            "text": "And she said unto the men, I know that the LORD hath given you the land, and that your terror is fallen upon us, and that all the inhabitants of the land faint because of you."
          },
          {
            "reference": "Joshua 2:11",
            "text": "And as soon as we had heard these things, our hearts did melt, neither did there remain any more courage in any man, because of you: for the LORD your God, he is God in heaven above, and in earth beneath."
          },
          {
            "reference": "Joshua 6:25",
            "text": "And Joshua saved Rahab the harlot alive, and her father's household, and all that she had; and she dwelleth in Israel even unto this day; because she hid the messengers, which Joshua sent to spy out Jericho."
          },
          {
            "reference": "Matthew 1:5",
            "text": "And Salmon begat Booz of Rachab; and Booz begat Obed of Ruth; and Obed begat Jesse;"
          },
          {
            "reference": "Hebrews 11:31",
            "text": "By faith the harlot Rahab perished not with them that believed not, when she had received the spies with peace."
          }
        ]
      },
      "Abigail": {
        "title": "Woman of Wisdom, Wife of David",
        "description": "Described as a woman of good understanding and beautiful countenance, Abigail was married to Nabal, a wealthy but churlish and evil man of Maon whose flocks grazed near Carmel. When David and his men, who had protected Nabal's shepherds in the wilderness, requested provisions, Nabal insulted David with contemptuous refusal—\"Who is David? and who is the son of Jesse?\" Enraged, David gathered four hundred men to destroy Nabal's household. One of Nabal's servants urgently informed Abigail of the impending disaster, recognizing that \"evil is determined against our master.\"<br><br>\nAbigail acted swiftly and wisely, gathering substantial provisions and riding to meet David without informing her fool husband. Falling before David, she took responsibility for Nabal's offense, appealed to David's better nature, and prophetically acknowledged his divine calling as Israel's future king. Her gracious wisdom turned David from bloodshed, causing him to bless God for her discernment.<br><br>\nWhen she informed Nabal the next morning (after his drunken feast), \"his heart died within him, and he became as a stone,\" dying ten days later. David then sent for Abigail to become his wife, and she humbly accepted, becoming mother to his second son Chileab. Her account demonstrates godly wisdom in crisis, respectful appeals that turn away wrath, and God's vindication of the righteous.<label for=\"sn-abigail\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-abigail\" class=\"margin-toggle\"/><span class=\"sidenote\">Abigail's name means 'my father's joy,' while Nabal means 'fool'—a fitting description of his character. Her prophetic speech to David (1 Samuel 25:28-31) displays remarkable theological insight, referring to the 'bundle of life' with the LORD and predicting David's dynasty. Her swift action (preparing provisions, riding to David) combined prudence with courage. The text's contrast between her wisdom and Nabal's folly serves didactic purposes, illustrating Proverbs' teachings about wise and foolish conduct.</span>",
        "verses": [
          {
            "reference": "1 Samuel 25:3",
            "text": "Now the name of the man was Nabal; and the name of his wife Abigail: and she was a woman of good understanding, and of a beautiful countenance: but the man was churlish and evil in his doings; and he was of the house of Caleb."
          },
          {
            "reference": "1 Samuel 25:24",
            "text": "And fell at his feet, and said, Upon me, my lord, upon me let this iniquity be: and let thine handmaid, I pray thee, speak in thine audience, and hear the words of thine handmaid."
          },
          {
            "reference": "1 Samuel 25:33",
            "text": "And blessed be thy advice, and blessed be thou, which hast kept me this day from coming to shed blood, and from avenging myself with mine own hand."
          },
          {
            "reference": "1 Samuel 25:39",
            "text": "And when David heard that Nabal was dead, he said, Blessed be the LORD, that hath pleaded the cause of my reproach from the hand of Nabal, and hath kept his servant from evil: for the LORD hath returned the wickedness of Nabal upon his own head. And David sent and communed with Abigail, to take her to him to wife."
          },
          {
            "reference": "1 Samuel 25:42",
            "text": "And Abigail hasted, and arose, and rode upon an ass, with five damsels of hers that went after her; and she went after the messengers of David, and became his wife."
          }
        ]
      }
    },
    "Women in Christ's Ministry": {
      "Mary, Mother of Jesus": {
        "title": "The Virgin, Bearer of the Messiah",
        "description": "Chosen to bear the Son of God, Mary's humble submission ('Behold the handmaid of the Lord') exemplifies godly surrender to divine will. Her Magnificat displays deep knowledge of Scripture and understanding of God's redemptive purposes.<label for=\"sn-mary\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-mary\" class=\"margin-toggle\"/><span class=\"sidenote\">Mary's perpetual virginity, venerated in some traditions, finds no biblical support. Scripture mentions Christ's brothers and sisters (Matthew 13:55-56). While worthy of honor as the Messiah's mother, Mary herself acknowledged her need for a Savior (Luke 1:47).</span>",
        "family_tree_link": "/family-tree/person/i277",
        "verses": [
          {
            "reference": "Luke 1:30",
            "text": "And the angel said unto her, Fear not, Mary: for thou hast found favour with God."
          },
          {
            "reference": "Luke 1:38",
            "text": "And Mary said, Behold the handmaid of the Lord; be it unto me according to thy word. And the angel departed from her."
          },
          {
            "reference": "Luke 1:46",
            "text": "And Mary said, My soul doth magnify the Lord,"
          },
          {
            "reference": "Luke 1:48",
            "text": "For he hath regarded the low estate of his handmaiden: for, behold, from henceforth all generations shall call me blessed."
          },
          {
            "reference": "Luke 2:19",
            "text": "But Mary kept all these things, and pondered them in her heart."
          },
          {
            "reference": "John 19:25",
            "text": "Now there stood by the cross of Jesus his mother, and his mother's sister, Mary the wife of Cleophas, and Mary Magdalene."
          }
        ]
      },
      "Mary Magdalene": {
        "title": "First Witness of the Resurrection",
        "description": "Delivered from seven demons, Mary Magdalene became a devoted follower of Christ. Her presence at the crucifixion and her encounter with the risen Lord at the tomb established her as the first resurrection witness—an apostle to the apostles.<label for=\"sn-magdalene\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-magdalene\" class=\"margin-toggle\"/><span class=\"sidenote\">Later tradition erroneously identified Mary Magdalene with the sinful woman who anointed Jesus (Luke 7) and with Mary of Bethany. Scripture gives no warrant for these identifications. Her epithet 'Magdalene' simply indicates her hometown of Magdala.</span>",
        "verses": [
          {
            "reference": "Luke 8:2",
            "text": "And certain women, which had been healed of evil spirits and infirmities, Mary called Magdalene, out of whom went seven devils,"
          },
          {
            "reference": "Mark 15:40",
            "text": "There were also women looking on afar off: among whom was Mary Magdalene, and Mary the mother of James the less and of Joses, and Salome;"
          },
          {
            "reference": "John 20:11",
            "text": "But Mary stood without at the sepulchre weeping: and as she wept, she stooped down, and looked into the sepulchre,"
          },
          {
            "reference": "John 20:16",
            "text": "Jesus saith unto her, Mary. She turned herself, and saith unto him, Rabboni; which is to say, Master."
          },
          {
            "reference": "John 20:18",
            "text": "Mary Magdalene came and told the disciples that she had seen the Lord, and that he had spoken these things unto her."
          }
        ]
      },
      "Martha and Mary": {
        "title": "Sisters of Bethany, Friends of Jesus",
        "description": "These sisters, with their brother Lazarus, provided Christ with friendship and hospitality. Martha's service and Mary's contemplation at Jesus' feet both express devotion, though Christ commended Mary's choice of the 'good part' that would not be taken away.<label for=\"sn-sisters\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-sisters\" class=\"margin-toggle\"/><span class=\"sidenote\">Martha's confession—'I believe that thou art the Christ, the Son of God'—parallels Peter's great confession. Both Martha's active service and Mary's contemplative worship find place in godly living, though Jesus prioritized spiritual devotion over anxious activity.</span>",
        "verses": [
          {
            "reference": "Luke 10:38",
            "text": "Now it came to pass, as they went, that he entered into a certain village: and a certain woman named Martha received him into her house."
          },
          {
            "reference": "Luke 10:39",
            "text": "And she had a sister called Mary, which also sat at Jesus' feet, and heard his word."
          },
          {
            "reference": "Luke 10:42",
            "text": "But one thing is needful: and Mary hath chosen that good part, which shall not be taken away from her."
          },
          {
            "reference": "John 11:27",
            "text": "She saith unto him, Yea, Lord: I believe that thou art the Christ, the Son of God, which should come into the world."
          },
          {
            "reference": "John 12:3",
            "text": "Then took Mary a pound of ointment of spikenard, very costly, and anointed the feet of Jesus, and wiped his feet with her hair: and the house was filled with the odour of the ointment."
          }
        ]
      }
    }
  }
}