{
  "biographies": {
    "Adam": {
      "summary": "The first human created by God, Adam was formed from the dust of the ground and placed in the Garden of Eden. He named all the animals and was given Eve as his companion. After disobeying God by eating from the tree of knowledge of good and evil, Adam and Eve were expelled from Eden. Despite his fall, Adam is remembered as the father of all humanity.",
      "significance": "Adam represents humanity's original state and fall into sin, establishing the need for redemption that would come through Jesus Christ, often called the 'last Adam'.",
      "key_events": [
        {
          "age": 0,
          "event": "Created by God from the dust of the ground",
          "verse": "Genesis 2:7"
        },
        {
          "age": 0,
          "event": "Placed in the Garden of Eden",
          "verse": "Genesis 2:15"
        },
        {
          "age": 0,
          "event": "Eve created as his companion",
          "verse": "Genesis 2:21-22"
        },
        {
          "age": 130,
          "event": "Birth of Seth",
          "verse": "Genesis 5:3"
        },
        {
          "age": 930,
          "event": "Death",
          "verse": "Genesis 5:5"
        }
      ]
    },
    "Noah": {
      "summary": "A righteous man in a corrupt generation, Noah found grace in the eyes of the LORD. When God decided to flood the earth due to humanity's wickedness, Noah was chosen to build an ark to preserve his family and representatives of all animal kinds. After the flood, God established a covenant with Noah, promising never again to destroy the earth by water, signified by the rainbow.",
      "significance": "Noah demonstrates God's mercy in judgment and His faithfulness to preserve a remnant. The flood narrative foreshadows baptism and salvation through Christ.",
      "key_events": [
        {
          "age": 500,
          "event": "Birth of Shem, Ham, and Japheth",
          "verse": "Genesis 5:32"
        },
        {
          "age": 600,
          "event": "The Flood begins",
          "verse": "Genesis 7:6"
        },
        {
          "age": 601,
          "event": "Leaves the ark",
          "verse": "Genesis 8:13-19"
        },
        {
          "age": 950,
          "event": "Death",
          "verse": "Genesis 9:29"
        }
      ]
    },
    "Nehemiah": {
      "summary": "A Jewish cupbearer to the Persian king Artaxerxes who received permission to return to Jerusalem and rebuild its walls (445 BC). Despite fierce opposition from neighboring peoples, Nehemiah organized the Jews to complete the wall in just 52 days. He served as governor, instituted religious reforms, and worked alongside Ezra to restore proper worship and obedience to God's Law. His prayers and dependence on God throughout the rebuilding project demonstrate exemplary leadership.",
      "significance": "Nehemiah shows how God works through committed leaders who combine prayer with practical action. His rebuilding of Jerusalem's walls demonstrates God's faithfulness to restore His people and prefigures the spiritual restoration brought by Christ.",
      "key_events": [
        {
          "age": 0,
          "event": "Heard about Jerusalem's broken walls",
          "verse": "Nehemiah 1:1-4"
        },
        {
          "age": 0,
          "event": "King Artaxerxes granted permission to rebuild",
          "verse": "Nehemiah 2:1-8"
        },
        {
          "age": 0,
          "event": "Surveyed Jerusalem's walls at night",
          "verse": "Nehemiah 2:11-16"
        },
        {
          "age": 0,
          "event": "Led rebuilding despite opposition",
          "verse": "Nehemiah 4:1-23"
        },
        {
          "age": 0,
          "event": "Walls completed in 52 days",
          "verse": "Nehemiah 6:15"
        },
        {
          "age": 0,
          "event": "Covenant renewal ceremony",
          "verse": "Nehemiah 9-10"
        }
      ]
    },
    "Abraham": {
      "summary": "Originally named Abram, Abraham was called by God to leave his homeland and journey to Canaan, where God promised to make him into a great nation. Despite his and Sarah's old age, God gave them a son, Isaac, through whom the promise would continue. Abraham demonstrated remarkable faith when willing to sacrifice Isaac at God's command, though God provided a ram instead. He is called the 'father of faith' and the physical ancestor of Israel.",
      "significance": "Abraham is the father of the Hebrew nation and an example of faith for all believers. God's covenant with Abraham established the foundation for Israel and ultimately for the coming of the Messiah.",
      "key_events": [
        {
          "age": 75,
          "event": "Called by God to leave Ur",
          "verse": "Genesis 12:1-4"
        },
        {
          "age": 86,
          "event": "Birth of Ishmael through Hagar",
          "verse": "Genesis 16:16"
        },
        {
          "age": 99,
          "event": "Covenant of circumcision established",
          "verse": "Genesis 17:1-14"
        },
        {
          "age": 100,
          "event": "Birth of Isaac",
          "verse": "Genesis 21:5"
        },
        {
          "age": 137,
          "event": "Death of Sarah",
          "verse": "Genesis 23:1"
        },
        {
          "age": 175,
          "event": "Death",
          "verse": "Genesis 25:7"
        }
      ]
    },
    "Moses": {
      "summary": "Born during a time when Pharaoh ordered all Hebrew male babies to be killed, Moses was hidden by his mother and eventually raised in Pharaoh's household. After killing an Egyptian and fleeing to Midian, God called Moses from a burning bush to lead Israel out of Egyptian bondage. Through Moses, God gave the Ten Commandments and the Law, establishing Israel's covenant relationship with Him. Though he led Israel for forty years in the wilderness, Moses was not permitted to enter the Promised Land.",
      "significance": "Moses is the great lawgiver and prophet who mediated God's covenant with Israel. He prefigures Christ as a prophet, deliverer, and mediator between God and His people.",
      "key_events": [
        {
          "age": 0,
          "event": "Born in Egypt during oppression",
          "verse": "Exodus 2:1-2"
        },
        {
          "age": 40,
          "event": "Fled to Midian after killing an Egyptian",
          "verse": "Acts 7:23-29"
        },
        {
          "age": 80,
          "event": "Called by God at the burning bush",
          "verse": "Exodus 3:1-10"
        },
        {
          "age": 80,
          "event": "The Exodus from Egypt",
          "verse": "Exodus 12:31-42"
        },
        {
          "age": 80,
          "event": "Received the Ten Commandments",
          "verse": "Exodus 20:1-17"
        },
        {
          "age": 120,
          "event": "Death on Mount Nebo",
          "verse": "Deuteronomy 34:5-7"
        }
      ]
    },
    "David": {
      "summary": "The youngest son of Jesse, David was anointed as king while still a shepherd boy. He gained fame by defeating the Philistine giant Goliath and became a skilled warrior and musician in King Saul's court. After Saul's death, David united Israel and established Jerusalem as its capital. Despite his sins (notably with Bathsheba), David was called 'a man after God's own heart' and received God's promise that the Messiah would come from his lineage.",
      "significance": "David established Jerusalem and the monarchy that would culminate in Jesus Christ, the 'Son of David.' His psalms have been the prayer book of God's people for millennia.",
      "key_events": [
        {
          "age": 15,
          "event": "Anointed by Samuel as future king",
          "verse": "1 Samuel 16:13"
        },
        {
          "age": 17,
          "event": "Defeated Goliath",
          "verse": "1 Samuel 17:49-51"
        },
        {
          "age": 30,
          "event": "Became king of Judah",
          "verse": "2 Samuel 5:4"
        },
        {
          "age": 37,
          "event": "Became king over all Israel",
          "verse": "2 Samuel 5:4-5"
        },
        {
          "age": 37,
          "event": "Conquered Jerusalem",
          "verse": "2 Samuel 5:6-9"
        },
        {
          "age": 50,
          "event": "Sin with Bathsheba",
          "verse": "2 Samuel 11"
        },
        {
          "age": 70,
          "event": "Death",
          "verse": "1 Kings 2:10-11"
        }
      ]
    },
    "Jesus": {
      "summary": "Born of the Virgin Mary in Bethlehem, Jesus is the promised Messiah and the Son of God. He began His public ministry around age 30, teaching about the Kingdom of God, performing miracles, and calling disciples. He was crucified under Pontius Pilate as an atonement for sin, rose from the dead on the third day, and ascended to heaven forty days later. Jesus is both fully God and fully man, the perfect sacrifice for humanity's redemption.",
      "significance": "Jesus Christ is the central figure of all Scripture and human history. He is the promised seed who crushes the serpent's head, the fulfillment of all Old Testament prophecy, and the only way of salvation.",
      "key_events": [
        {
          "age": 0,
          "event": "Born in Bethlehem",
          "verse": "Luke 2:7"
        },
        {
          "age": 12,
          "event": "Taught in the temple",
          "verse": "Luke 2:42-52"
        },
        {
          "age": 30,
          "event": "Baptized by John",
          "verse": "Luke 3:21-23"
        },
        {
          "age": 30,
          "event": "Tempted in the wilderness",
          "verse": "Matthew 4:1-11"
        },
        {
          "age": 30,
          "event": "Began public ministry",
          "verse": "Luke 4:14-21"
        },
        {
          "age": 33,
          "event": "Transfiguration",
          "verse": "Matthew 17:1-9"
        },
        {
          "age": 33,
          "event": "Crucifixion and resurrection",
          "verse": "Matthew 27-28"
        },
        {
          "age": 33,
          "event": "Ascension",
          "verse": "Acts 1:9-11"
        }
      ]
    },
    "Eve": {
      "summary": "The first woman, created by God from Adam's rib to be his companion and helper. Eve was deceived by the serpent and ate the forbidden fruit, then gave some to Adam. Despite her role in the fall, Eve is the mother of all living and received the promise that her seed would one day crush the serpent's head.",
      "significance": "Eve represents humanity's susceptibility to temptation but also the promise of redemption through her offspring, ultimately fulfilled in Christ.",
      "key_events": [
        {
          "age": 0,
          "event": "Created from Adam's rib",
          "verse": "Genesis 2:21-22"
        },
        {
          "age": 0,
          "event": "Tempted by the serpent",
          "verse": "Genesis 3:1-6"
        },
        {
          "age": 0,
          "event": "Expelled from Eden",
          "verse": "Genesis 3:23-24"
        },
        {
          "age": 130,
          "event": "Birth of Seth",
          "verse": "Genesis 4:25"
        }
      ]
    },
    "Ezra": {
      "summary": "A priest and scribe who led the second wave of exiles returning from Babylon to Jerusalem (458 BC). Ezra was deeply devoted to God's Law and brought religious reform to the post-exilic Jewish community. He discovered that many Jews had intermarried with pagan peoples and led them in repentance and covenant renewal. Ezra's reading of the Law to the assembled people brought revival and restoration of proper worship.",
      "significance": "Ezra reestablished the centrality of God's Word in Jewish life after the exile. His devotion to Scripture and religious reform prefigures the New Testament emphasis on God's Word and spiritual purity. He helped preserve Jewish identity during a critical period.",
      "key_events": [
        {
          "age": 0,
          "event": "King Artaxerxes commissions Ezra",
          "verse": "Ezra 7:11-26"
        },
        {
          "age": 0,
          "event": "Led exiles from Babylon to Jerusalem",
          "verse": "Ezra 7:6-10"
        },
        {
          "age": 0,
          "event": "Discovered widespread intermarriage",
          "verse": "Ezra 9:1-4"
        },
        {
          "age": 0,
          "event": "Led the people in confession and repentance",
          "verse": "Ezra 10:1-17"
        },
        {
          "age": 0,
          "event": "Read the Law to the assembled people",
          "verse": "Nehemiah 8:1-12"
        }
      ]
    },
    "Isaac": {
      "summary": "The son of promise born to Abraham and Sarah in their old age. Isaac was nearly sacrificed by his father in the ultimate test of faith but was spared when God provided a ram. He married Rebekah and fathered twin sons, Esau and Jacob. Isaac was more passive than his father but faithfully continued the covenant line.",
      "significance": "Isaac represents the fulfillment of God's promise and prefigures Christ as the obedient son offered in sacrifice.",
      "key_events": [
        {
          "age": 0,
          "event": "Born to Abraham and Sarah",
          "verse": "Genesis 21:1-3"
        },
        {
          "age": 37,
          "event": "Offered as a sacrifice (averted)",
          "verse": "Genesis 22:1-19"
        },
        {
          "age": 40,
          "event": "Married Rebekah",
          "verse": "Genesis 25:20"
        },
        {
          "age": 60,
          "event": "Birth of Esau and Jacob",
          "verse": "Genesis 25:26"
        },
        {
          "age": 180,
          "event": "Death",
          "verse": "Genesis 35:28-29"
        }
      ]
    },
    "Jacob": {
      "summary": "The younger twin son of Isaac, Jacob obtained Esau's birthright and stole his blessing through deception. Fleeing his brother's anger, Jacob encountered God at Bethel and later wrestled with God, receiving the name Israel. He fathered twelve sons who became the twelve tribes of Israel. Despite his flawed character, God chose Jacob to continue the covenant line.",
      "significance": "Jacob (Israel) is the father of the twelve tribes and represents God's electing grace despite human unworthiness.",
      "key_events": [
        {
          "age": 0,
          "event": "Born grasping Esau's heel",
          "verse": "Genesis 25:24-26"
        },
        {
          "age": 77,
          "event": "Obtained Esau's blessing",
          "verse": "Genesis 27:1-40"
        },
        {
          "age": 77,
          "event": "Vision at Bethel",
          "verse": "Genesis 28:10-22"
        },
        {
          "age": 84,
          "event": "Married Leah and Rachel",
          "verse": "Genesis 29:21-30"
        },
        {
          "age": 97,
          "event": "Wrestled with God, renamed Israel",
          "verse": "Genesis 32:24-32"
        },
        {
          "age": 130,
          "event": "Moved to Egypt",
          "verse": "Genesis 47:9"
        },
        {
          "age": 147,
          "event": "Death",
          "verse": "Genesis 47:28"
        }
      ]
    },
    "Job": {
      "summary": "A righteous and wealthy man from the land of Uz, Job experienced catastrophic loss when Satan was permitted to test his faithfulness to God. Despite losing his children, possessions, and health, and enduring the misguided counsel of his friends, Job maintained his integrity and faith. God ultimately vindicated Job, restored his fortunes doubly, and gave him a new family.",
      "significance": "Job's story addresses the problem of suffering and demonstrates that righteousness is not always rewarded with prosperity in this life, yet faith in God's sovereignty remains essential. Job points forward to Christ, the ultimate innocent sufferer.",
      "key_events": [
        {
          "age": 0,
          "event": "Described as blameless and upright",
          "verse": "Job 1:1"
        },
        {
          "age": 0,
          "event": "Lost all his children and possessions",
          "verse": "Job 1:13-19"
        },
        {
          "age": 0,
          "event": "Afflicted with painful sores",
          "verse": "Job 2:7"
        },
        {
          "age": 0,
          "event": "Dialogues with three friends",
          "verse": "Job 3-31"
        },
        {
          "age": 0,
          "event": "God speaks from the whirlwind",
          "verse": "Job 38-41"
        },
        {
          "age": 0,
          "event": "Restoration and blessing",
          "verse": "Job 42:10-17"
        },
        {
          "age": 140,
          "event": "Death after seeing four generations",
          "verse": "Job 42:16-17"
        }
      ]
    },
    "Joseph": {
      "summary": "The favored son of Jacob, Joseph was sold into slavery by his jealous brothers but rose to become second-in-command in Egypt through God's providence. His interpretation of Pharaoh's dreams saved Egypt and his own family from famine. Joseph's forgiveness of his brothers demonstrates remarkable grace and faith in God's sovereign plan.",
      "significance": "Joseph's life prefigures Christ in his suffering, exaltation, and role as savior of his people.",
      "key_events": [
        {
          "age": 17,
          "event": "Sold into slavery by his brothers",
          "verse": "Genesis 37:28"
        },
        {
          "age": 28,
          "event": "Imprisoned in Egypt",
          "verse": "Genesis 39:20"
        },
        {
          "age": 30,
          "event": "Became second-in-command of Egypt",
          "verse": "Genesis 41:46"
        },
        {
          "age": 39,
          "event": "Reunited with his brothers",
          "verse": "Genesis 45:1-15"
        },
        {
          "age": 110,
          "event": "Death",
          "verse": "Genesis 50:26"
        }
      ]
    },
    "Solomon": {
      "summary": "The son of David and Bathsheba, Solomon became Israel's third king and was granted great wisdom by God. He built the magnificent temple in Jerusalem and authored much of Proverbs, Ecclesiastes, and Song of Solomon. Despite his wisdom, Solomon's many foreign wives led him into idolatry in his later years, setting the stage for the kingdom's division.",
      "significance": "Solomon's wisdom and the temple he built point to Christ, the wisdom of God and the true temple.",
      "key_events": [
        {
          "age": 20,
          "event": "Became king of Israel",
          "verse": "1 Kings 2:12"
        },
        {
          "age": 20,
          "event": "Asked God for wisdom",
          "verse": "1 Kings 3:5-14"
        },
        {
          "age": 24,
          "event": "Began building the temple",
          "verse": "1 Kings 6:1"
        },
        {
          "age": 31,
          "event": "Dedicated the temple",
          "verse": "1 Kings 8:1-66"
        },
        {
          "age": 60,
          "event": "Death",
          "verse": "1 Kings 11:42-43"
        }
      ]
    },
    "Cain": {
      "summary": "The firstborn son of Adam and Eve, Cain was a farmer who brought an offering of the fruit of the ground to the Lord. When God rejected his offering but accepted Abel's, Cain became angry and murdered his brother in a field. God confronted Cain and cursed him to be a wanderer on the earth, marking him for protection. Cain built the first city, named after his son Enoch.",
      "significance": "Cain represents humanity's first murder and the escalation of sin after the Fall. His jealousy and violence demonstrate the depths of human depravity without God's grace.",
      "key_events": [
        {
          "age": 0,
          "event": "Born to Adam and Eve",
          "verse": "Genesis 4:1"
        },
        {
          "age": 0,
          "event": "Brought offering to God (rejected)",
          "verse": "Genesis 4:3-5"
        },
        {
          "age": 0,
          "event": "Murdered his brother Abel",
          "verse": "Genesis 4:8"
        },
        {
          "age": 0,
          "event": "Cursed and marked by God",
          "verse": "Genesis 4:11-15"
        },
        {
          "age": 0,
          "event": "Built the city of Enoch",
          "verse": "Genesis 4:17"
        }
      ]
    },
    "Abel": {
      "summary": "The second son of Adam and Eve, Abel was a shepherd who brought the firstborn of his flock as an offering to the Lord. God respected Abel's offering, which was given in faith. His brother Cain, consumed with jealousy, murdered him in the field. Abel's blood cried out from the ground, and he became the first martyr. The New Testament commends his faith.",
      "significance": "Abel represents righteous suffering and is the first martyr. His acceptable sacrifice by faith prefigures Christ's perfect sacrifice and demonstrates that God looks at the heart.",
      "key_events": [
        {
          "age": 0,
          "event": "Born to Adam and Eve",
          "verse": "Genesis 4:2"
        },
        {
          "age": 0,
          "event": "Brought acceptable offering to God",
          "verse": "Genesis 4:4"
        },
        {
          "age": 0,
          "event": "Murdered by Cain",
          "verse": "Genesis 4:8"
        },
        {
          "age": 0,
          "event": "His blood cries out from the ground",
          "verse": "Genesis 4:10"
        }
      ]
    },
    "Enoch": {
      "summary": "A descendant of Seth, Enoch walked with God for 300 years after the birth of his son Methuselah. In a unique act, God took Enoch directly to heaven without experiencing death at age 365. Enoch prophesied about the Lord's coming with His holy ones to execute judgment. He stands as one of only two people in Scripture taken directly to heaven.",
      "significance": "Enoch demonstrates that intimate fellowship with God leads to life. His translation to heaven without death prefigures the rapture of the church and eternal life for believers.",
      "key_events": [
        {
          "age": 65,
          "event": "Birth of Methuselah",
          "verse": "Genesis 5:21"
        },
        {
          "age": 65,
          "event": "Began to walk with God",
          "verse": "Genesis 5:22"
        },
        {
          "age": 365,
          "event": "Taken by God (did not see death)",
          "verse": "Genesis 5:24"
        }
      ]
    },
    "Methuselah": {
      "summary": "The son of Enoch and grandfather of Noah, Methuselah lived longer than any other person recorded in Scripture: 969 years. His name possibly means 'when he dies, it shall come,' and indeed, the Flood came in the year of his death. He represents God's patience and longsuffering before judgment.",
      "significance": "Methuselah's extraordinary lifespan demonstrates God's patience in delaying judgment. His death in the year of the Flood shows God's mercy in waiting.",
      "key_events": [
        {
          "age": 0,
          "event": "Born to Enoch",
          "verse": "Genesis 5:21"
        },
        {
          "age": 187,
          "event": "Birth of Lamech",
          "verse": "Genesis 5:25"
        },
        {
          "age": 969,
          "event": "Death (year of the Flood)",
          "verse": "Genesis 5:27"
        }
      ]
    },
    "Shem": {
      "summary": "One of Noah's three sons, Shem was on the ark during the Flood and received his father's blessing. From Shem's line came Abraham and the Semitic peoples. After the Flood, Shem and his brothers covered their father's nakedness with respect. Shem lived 600 years and saw ten generations of his descendants.",
      "significance": "Shem's line was chosen for the covenant and the Messiah. The Semitic peoples, including the Israelites, descended from him.",
      "key_events": [
        {
          "age": 98,
          "event": "Entered the ark",
          "verse": "Genesis 7:13"
        },
        {
          "age": 100,
          "event": "Birth of Arphaxad (after the Flood)",
          "verse": "Genesis 11:10"
        },
        {
          "age": 0,
          "event": "Covered Noah's nakedness",
          "verse": "Genesis 9:23"
        },
        {
          "age": 600,
          "event": "Death",
          "verse": "Genesis 11:11"
        }
      ]
    },
    "Lot": {
      "summary": "Abraham's nephew who traveled with him to Canaan. Lot chose to live in the well-watered plain near Sodom despite its wickedness. When God destroyed Sodom and Gomorrah, angels rescued Lot and his family, though his wife looked back and became a pillar of salt. Peter calls Lot a righteous man tormented by the wickedness around him.",
      "significance": "Lot demonstrates the danger of choosing worldly prosperity over spiritual separation. His rescue from Sodom prefigures God's deliverance of believers from judgment.",
      "key_events": [
        {
          "age": 0,
          "event": "Traveled to Canaan with Abraham",
          "verse": "Genesis 12:4-5"
        },
        {
          "age": 0,
          "event": "Chose to live near Sodom",
          "verse": "Genesis 13:10-12"
        },
        {
          "age": 0,
          "event": "Captured and rescued by Abraham",
          "verse": "Genesis 14:12-16"
        },
        {
          "age": 0,
          "event": "Escaped destruction of Sodom",
          "verse": "Genesis 19:15-29"
        }
      ]
    },
    "Ishmael": {
      "summary": "The son of Abraham through Hagar, Sarah's Egyptian maidservant. Born when Abraham was 86, Ishmael was not the child of promise. After Isaac's birth, Sarah demanded Hagar and Ishmael be sent away. God promised to make Ishmael a great nation, and he became the father of twelve princes. Ishmael lived 137 years.",
      "significance": "Ishmael represents works of the flesh and human effort to fulfill God's promises. His conflict with Isaac illustrates the opposition between the flesh and the Spirit.",
      "key_events": [
        {
          "age": 0,
          "event": "Born to Abraham and Hagar",
          "verse": "Genesis 16:15-16"
        },
        {
          "age": 13,
          "event": "Circumcised with Abraham",
          "verse": "Genesis 17:25"
        },
        {
          "age": 14,
          "event": "Sent away with Hagar",
          "verse": "Genesis 21:14-21"
        },
        {
          "age": 0,
          "event": "God's promise to make him a great nation",
          "verse": "Genesis 21:18"
        },
        {
          "age": 137,
          "event": "Death",
          "verse": "Genesis 25:17"
        }
      ]
    },
    "Isaiah": {
      "summary": "One of the greatest Old Testament prophets, Isaiah ministered in Judah during the reigns of four kings. His prophecies addressed both immediate political crises and the distant messianic future. Isaiah's vision of God's holiness in the temple transformed his life and ministry. He prophesied extensively about the coming Messiah, the suffering servant, and the restoration of Israel. His book contains some of Scripture's most beautiful passages about salvation and God's glory.",
      "significance": "Isaiah is the 'evangelical prophet' whose detailed messianic prophecies (virgin birth, suffering servant, government on His shoulders) are quoted more in the New Testament than any other prophet. He presents the most comprehensive Old Testament picture of Christ's first and second comings.",
      "key_events": [
        {
          "age": 0,
          "event": "Vision of God's holiness in the temple",
          "verse": "Isaiah 6:1-8"
        },
        {
          "age": 0,
          "event": "Prophecy of Immanuel to King Ahaz",
          "verse": "Isaiah 7:14"
        },
        {
          "age": 0,
          "event": "Prophecy to King Hezekiah about deliverance",
          "verse": "Isaiah 37:6-7"
        },
        {
          "age": 0,
          "event": "Prophecy of the suffering servant",
          "verse": "Isaiah 53"
        },
        {
          "age": 0,
          "event": "Prophecy of new heavens and new earth",
          "verse": "Isaiah 65:17"
        }
      ]
    },
    "Esau": {
      "summary": "The firstborn twin son of Isaac and Rebekah, Esau was a skillful hunter and his father's favorite. In a moment of weakness, he sold his birthright to Jacob for a bowl of stew, despising his inheritance. Later, Jacob stole the blessing intended for Esau. Though Esau vowed revenge, the brothers eventually reconciled. Esau became the father of the Edomites.",
      "significance": "Esau represents those who despise spiritual blessings for temporary earthly pleasures. The New Testament uses him as a warning against godlessness and refusing God's grace.",
      "key_events": [
        {
          "age": 0,
          "event": "Born second, grasping Jacob's heel",
          "verse": "Genesis 25:24-26"
        },
        {
          "age": 0,
          "event": "Sold birthright for stew",
          "verse": "Genesis 25:29-34"
        },
        {
          "age": 40,
          "event": "Married Hittite women",
          "verse": "Genesis 26:34"
        },
        {
          "age": 77,
          "event": "Lost his father's blessing to Jacob",
          "verse": "Genesis 27:30-41"
        },
        {
          "age": 97,
          "event": "Reconciled with Jacob",
          "verse": "Genesis 33:4"
        }
      ]
    },
    "Aaron": {
      "summary": "Moses' older brother and Israel's first high priest. Aaron served as Moses' spokesman before Pharaoh and performed miracles with his staff. He was consecrated as high priest and his descendants continued the priestly line. Despite witnessing God's power, Aaron made the golden calf and later challenged Moses' authority with Miriam. He died on Mount Hor at age 123.",
      "significance": "Aaron established the Levitical priesthood that prefigures Christ's perfect high priesthood. His role as mediator between God and Israel points to Christ's mediatorial work.",
      "key_events": [
        {
          "age": 83,
          "event": "Called by God to join Moses",
          "verse": "Exodus 4:27-28"
        },
        {
          "age": 83,
          "event": "Confronted Pharaoh with Moses",
          "verse": "Exodus 7:1-7"
        },
        {
          "age": 0,
          "event": "Made the golden calf",
          "verse": "Exodus 32:1-6"
        },
        {
          "age": 0,
          "event": "Consecrated as high priest",
          "verse": "Leviticus 8:1-36"
        },
        {
          "age": 123,
          "event": "Death on Mount Hor",
          "verse": "Numbers 33:38-39"
        }
      ]
    },
    "Joshua": {
      "summary": "Moses' assistant and successor, Joshua led Israel into the Promised Land after Moses' death. As a young man, he was one of twelve spies who explored Canaan, and only he and Caleb trusted God to give them victory. Joshua led the conquest of Canaan, including the miraculous fall of Jericho. He challenged Israel to choose whom they would serve, declaring his household would serve the Lord.",
      "significance": "Joshua (whose name means 'the Lord saves') prefigures Jesus Christ as the one who leads God's people into their inheritance and rest.",
      "key_events": [
        {
          "age": 0,
          "event": "Led Israel in battle against Amalek",
          "verse": "Exodus 17:9-13"
        },
        {
          "age": 40,
          "event": "Spied out Canaan with Caleb",
          "verse": "Numbers 14:6-9"
        },
        {
          "age": 80,
          "event": "Appointed as Moses' successor",
          "verse": "Deuteronomy 31:23"
        },
        {
          "age": 80,
          "event": "Crossed the Jordan River",
          "verse": "Joshua 3:14-17"
        },
        {
          "age": 80,
          "event": "Conquest of Jericho",
          "verse": "Joshua 6:1-27"
        },
        {
          "age": 110,
          "event": "Death",
          "verse": "Joshua 24:29"
        }
      ]
    },
    "Samson": {
      "summary": "A Nazirite judge of Israel who possessed extraordinary strength from the Lord. Samson judged Israel for twenty years during Philistine oppression. Despite his strength, he struggled with moral weakness, particularly regarding women. His relationship with Delilah led to the revelation of his strength's source, resulting in his capture. In his death, Samson killed more Philistines than during his life.",
      "significance": "Samson demonstrates that God's calling and gifts don't depend on human perfection, yet sin has consequences. His final act shows that God can use even our failures for His purposes.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth announced by angel",
          "verse": "Judges 13:3-5"
        },
        {
          "age": 0,
          "event": "Killed a lion with bare hands",
          "verse": "Judges 14:5-6"
        },
        {
          "age": 0,
          "event": "Killed 1000 Philistines with jawbone",
          "verse": "Judges 15:15"
        },
        {
          "age": 0,
          "event": "Betrayed by Delilah",
          "verse": "Judges 16:18-21"
        },
        {
          "age": 0,
          "event": "Death destroying Philistine temple",
          "verse": "Judges 16:28-30"
        }
      ]
    },
    "Samuel": {
      "summary": "The last judge of Israel and a prophet who anointed Israel's first two kings. Born to Hannah in answer to prayer, Samuel was dedicated to God's service from childhood. He served in the tabernacle under Eli and received God's word as a young boy. Samuel judged Israel faithfully and established the monarchy by anointing Saul and later David. He represents the transition from judges to kings.",
      "significance": "Samuel bridges the period between judges and kings, demonstrating godly leadership and obedience to God's word. His life shows the importance of hearing and obeying God's voice.",
      "key_events": [
        {
          "age": 0,
          "event": "Born in answer to Hannah's prayer",
          "verse": "1 Samuel 1:20"
        },
        {
          "age": 3,
          "event": "Dedicated to service at the tabernacle",
          "verse": "1 Samuel 1:24-28"
        },
        {
          "age": 12,
          "event": "Called by God in the night",
          "verse": "1 Samuel 3:1-10"
        },
        {
          "age": 0,
          "event": "Anointed Saul as king",
          "verse": "1 Samuel 10:1"
        },
        {
          "age": 0,
          "event": "Anointed David as king",
          "verse": "1 Samuel 16:13"
        }
      ]
    },
    "Saul": {
      "summary": "Israel's first king, chosen for his impressive physical stature. Initially humble, Saul began well but disobeyed God's commands, offering unauthorized sacrifice and sparing King Agag when commanded to destroy the Amalekites. God rejected Saul as king and chose David to replace him. Consumed by jealousy of David, Saul's later years were marked by madness and pursuit of David. He died by suicide after defeat in battle.",
      "significance": "Saul's reign demonstrates the danger of partial obedience and the priority of obeying God rather than fearing man. His rejection shows that God looks at the heart, not outward appearance.",
      "key_events": [
        {
          "age": 30,
          "event": "Anointed as Israel's first king",
          "verse": "1 Samuel 10:1"
        },
        {
          "age": 30,
          "event": "Publicly chosen as king",
          "verse": "1 Samuel 10:24"
        },
        {
          "age": 0,
          "event": "Disobeyed by offering unauthorized sacrifice",
          "verse": "1 Samuel 13:8-14"
        },
        {
          "age": 0,
          "event": "Rejected as king for sparing Agag",
          "verse": "1 Samuel 15:22-23"
        },
        {
          "age": 0,
          "event": "Attempted to kill David",
          "verse": "1 Samuel 18:10-11"
        },
        {
          "age": 72,
          "event": "Suicide after defeat by Philistines",
          "verse": "1 Samuel 31:4"
        }
      ]
    },
    "Elijah": {
      "summary": "A powerful prophet during Israel's apostasy under King Ahab and Queen Jezebel. Elijah confronted Baal worship, called down fire from heaven on Mount Carmel, and pronounced drought upon the land. He was fed by ravens and multiplied a widow's food. After defeating the prophets of Baal, Jezebel's threats sent him fleeing, but God met him in a still small voice. Elijah did not die but was taken to heaven in a whirlwind.",
      "significance": "Elijah represents bold prophetic ministry and appears with Moses at Jesus' transfiguration. His return is prophesied before the great day of the Lord, associated with John the Baptist and future end-times ministry.",
      "key_events": [
        {
          "age": 0,
          "event": "Pronounced drought on Israel",
          "verse": "1 Kings 17:1"
        },
        {
          "age": 0,
          "event": "Fed by ravens at Cherith",
          "verse": "1 Kings 17:4-6"
        },
        {
          "age": 0,
          "event": "Multiplied widow's oil and flour",
          "verse": "1 Kings 17:14-16"
        },
        {
          "age": 0,
          "event": "Defeated prophets of Baal on Carmel",
          "verse": "1 Kings 18:38-40"
        },
        {
          "age": 0,
          "event": "Heard God's still small voice",
          "verse": "1 Kings 19:12"
        },
        {
          "age": 0,
          "event": "Taken to heaven in a whirlwind",
          "verse": "2 Kings 2:11"
        }
      ]
    },
    "Elisha": {
      "summary": "The prophet who succeeded Elijah after receiving a double portion of his spirit. Elisha performed many miracles including purifying water, multiplying oil, raising a dead boy, healing Naaman's leprosy, and making an axe head float. He advised kings and demonstrated God's power through numerous signs and wonders. His ministry lasted over fifty years, touching both rich and poor.",
      "significance": "Elisha's double portion and numerous miracles demonstrate God's power and compassion. His healings and provisions prefigure Christ's ministry of mercy and power.",
      "key_events": [
        {
          "age": 0,
          "event": "Called by Elijah",
          "verse": "1 Kings 19:19-21"
        },
        {
          "age": 0,
          "event": "Received double portion of Elijah's spirit",
          "verse": "2 Kings 2:9-14"
        },
        {
          "age": 0,
          "event": "Purified poisoned water",
          "verse": "2 Kings 2:21-22"
        },
        {
          "age": 0,
          "event": "Multiplied widow's oil",
          "verse": "2 Kings 4:1-7"
        },
        {
          "age": 0,
          "event": "Raised Shunammite's son",
          "verse": "2 Kings 4:32-37"
        },
        {
          "age": 0,
          "event": "Healed Naaman of leprosy",
          "verse": "2 Kings 5:10-14"
        }
      ]
    },
    "Jonah": {
      "summary": "The prophet called to preach to Nineveh but who fled to Tarshish instead. God sent a great storm, and Jonah was thrown overboard and swallowed by a great fish for three days. After being vomited onto dry land, Jonah obeyed and preached to Nineveh, which repented. Jonah's anger at God's mercy revealed his hard heart. His experience in the fish prefigures Christ's resurrection.",
      "significance": "Jonah's three days in the fish prefigure Christ's death and resurrection. His reluctant ministry to Gentiles foreshadows the gospel going to all nations and reveals God's compassion for all people.",
      "key_events": [
        {
          "age": 0,
          "event": "Called to preach to Nineveh",
          "verse": "Jonah 1:1-2"
        },
        {
          "age": 0,
          "event": "Fled to Tarshish",
          "verse": "Jonah 1:3"
        },
        {
          "age": 0,
          "event": "Thrown into sea during storm",
          "verse": "Jonah 1:15"
        },
        {
          "age": 0,
          "event": "Swallowed by great fish",
          "verse": "Jonah 1:17"
        },
        {
          "age": 0,
          "event": "Vomited onto dry land",
          "verse": "Jonah 2:10"
        },
        {
          "age": 0,
          "event": "Preached to Nineveh (city repented)",
          "verse": "Jonah 3:4-10"
        }
      ]
    },
    "Jonathan": {
      "summary": "The eldest son of King Saul and close friend of David. Despite being heir to the throne, Jonathan recognized God's anointing on David and protected him from Saul's murderous jealousy. Their covenant friendship is one of the Bible's most beautiful examples of sacrificial love and loyalty. Jonathan died alongside his father in battle against the Philistines at Mount Gilboa.",
      "significance": "Jonathan's selfless friendship with David demonstrates covenant loyalty that transcends personal ambition. His willingness to set aside his claim to the throne for God's chosen king prefigures Christ's humility and self-sacrifice.",
      "key_events": [
        {
          "age": 0,
          "event": "Victory over Philistine garrison",
          "verse": "1 Samuel 14:1-15"
        },
        {
          "age": 0,
          "event": "Nearly executed by Saul for breaking fast",
          "verse": "1 Samuel 14:43-45"
        },
        {
          "age": 0,
          "event": "Made covenant with David",
          "verse": "1 Samuel 18:1-4"
        },
        {
          "age": 0,
          "event": "Defended David before Saul",
          "verse": "1 Samuel 19:4-7"
        },
        {
          "age": 0,
          "event": "Warned David to flee from Saul",
          "verse": "1 Samuel 20:1-42"
        },
        {
          "age": 0,
          "event": "Met David in the wilderness",
          "verse": "1 Samuel 23:16-18"
        },
        {
          "age": 0,
          "event": "Killed in battle at Mount Gilboa",
          "verse": "1 Samuel 31:2"
        }
      ]
    },
    "John the Baptist": {
      "summary": "The forerunner of Jesus Christ, born to Zechariah and Elizabeth in their old age. John lived in the wilderness, wore camel's hair, and ate locusts and wild honey. He preached repentance and baptized in the Jordan River, preparing the way for the Messiah. John baptized Jesus and declared Him the Lamb of God. He was imprisoned by Herod and beheaded for denouncing Herod's unlawful marriage.",
      "significance": "John fulfilled Isaiah's prophecy as the voice crying in the wilderness. He represents the last of the Old Testament prophets and the bridge to the New Covenant, pointing people to Jesus.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth announced to Zechariah",
          "verse": "Luke 1:13"
        },
        {
          "age": 30,
          "event": "Began ministry in wilderness",
          "verse": "Luke 3:1-3"
        },
        {
          "age": 30,
          "event": "Baptized Jesus",
          "verse": "Matthew 3:13-17"
        },
        {
          "age": 30,
          "event": "Declared Jesus the Lamb of God",
          "verse": "John 1:29"
        },
        {
          "age": 32,
          "event": "Imprisoned by Herod",
          "verse": "Matthew 14:3-4"
        },
        {
          "age": 32,
          "event": "Beheaded by Herod",
          "verse": "Matthew 14:10"
        }
      ]
    },
    "Mary": {
      "summary": "The virgin chosen by God to be the mother of Jesus Christ. A young woman from Nazareth, betrothed to Joseph, Mary received the angel Gabriel's announcement with humble submission. She gave birth to Jesus in Bethlehem and raised Him with Joseph. Mary witnessed Jesus' ministry, His crucifixion, and was present with the disciples after His ascension. She is called blessed among women.",
      "significance": "Mary's obedient faith demonstrates true discipleship. Her role as the mother of Jesus fulfills prophecy and shows God's ability to work through humble, faithful servants.",
      "key_events": [
        {
          "age": 14,
          "event": "Angel announced Jesus' birth",
          "verse": "Luke 1:26-38"
        },
        {
          "age": 14,
          "event": "Visited Elizabeth",
          "verse": "Luke 1:39-45"
        },
        {
          "age": 15,
          "event": "Gave birth to Jesus",
          "verse": "Luke 2:7"
        },
        {
          "age": 15,
          "event": "Presented Jesus at the temple",
          "verse": "Luke 2:22-38"
        },
        {
          "age": 27,
          "event": "Found Jesus teaching in temple",
          "verse": "Luke 2:46-50"
        },
        {
          "age": 48,
          "event": "At wedding in Cana",
          "verse": "John 2:1-5"
        },
        {
          "age": 51,
          "event": "Witnessed Jesus' crucifixion",
          "verse": "John 19:25-27"
        }
      ]
    },
    "Peter": {
      "summary": "Originally named Simon, a fisherman called by Jesus to be a fisher of men. Peter was part of Jesus' inner circle and often served as spokesman for the disciples. Despite his bold confession of Jesus as Christ, Peter denied Jesus three times during His trial. After Jesus' resurrection, Peter was restored and became a pillar of the early church, preaching at Pentecost and writing two epistles.",
      "significance": "Peter demonstrates both human weakness and divine restoration. His transformation from denier to church leader shows the power of Christ's grace and forgiveness.",
      "key_events": [
        {
          "age": 30,
          "event": "Called by Jesus",
          "verse": "Matthew 4:18-20"
        },
        {
          "age": 33,
          "event": "Walked on water",
          "verse": "Matthew 14:28-31"
        },
        {
          "age": 33,
          "event": "Confessed Jesus as the Christ",
          "verse": "Matthew 16:16"
        },
        {
          "age": 33,
          "event": "Witnessed the Transfiguration",
          "verse": "Matthew 17:1-8"
        },
        {
          "age": 33,
          "event": "Denied Jesus three times",
          "verse": "Matthew 26:69-75"
        },
        {
          "age": 33,
          "event": "Restored by Jesus",
          "verse": "John 21:15-19"
        },
        {
          "age": 33,
          "event": "Preached at Pentecost",
          "verse": "Acts 2:14-41"
        }
      ]
    },
    "Paul": {
      "summary": "Originally Saul of Tarsus, a Pharisee who persecuted Christians. Converted dramatically on the road to Damascus when confronted by the risen Christ. Paul became the greatest missionary of the early church, making three missionary journeys and writing much of the New Testament. He suffered imprisonment, beatings, shipwreck, and eventual martyrdom for the gospel. Paul's theology shaped Christian doctrine.",
      "significance": "Paul's conversion demonstrates the transforming power of Christ's grace. His missionary work and writings established churches and doctrine throughout the Gentile world.",
      "key_events": [
        {
          "age": 33,
          "event": "Conversion on Damascus road",
          "verse": "Acts 9:3-6"
        },
        {
          "age": 36,
          "event": "Began preaching Christ",
          "verse": "Acts 9:20"
        },
        {
          "age": 46,
          "event": "First missionary journey",
          "verse": "Acts 13:2-3"
        },
        {
          "age": 49,
          "event": "Jerusalem Council",
          "verse": "Acts 15:2"
        },
        {
          "age": 51,
          "event": "Second missionary journey",
          "verse": "Acts 15:36"
        },
        {
          "age": 54,
          "event": "Third missionary journey",
          "verse": "Acts 18:23"
        },
        {
          "age": 58,
          "event": "Arrested in Jerusalem",
          "verse": "Acts 21:33"
        },
        {
          "age": 68,
          "event": "Martyrdom in Rome (tradition)",
          "verse": "2 Timothy 4:6-8"
        }
      ]
    },
    "Rebekah": {
      "summary": "Isaac's wife, chosen by Abraham's servant through God's providence. Rebekah left her homeland to marry Isaac, whom she had never met. She was barren for twenty years before giving birth to twin sons, Esau and Jacob. Rebekah favored Jacob and helped him deceive Isaac to receive the blessing intended for Esau. Her actions, though deceptive, aligned with God's sovereign choice.",
      "significance": "Rebekah demonstrates faith in God's providence and calling, though her methods were flawed. She shows how God works through imperfect people to accomplish His purposes.",
      "key_events": [
        {
          "age": 0,
          "event": "Met Abraham's servant at the well",
          "verse": "Genesis 24:15-27"
        },
        {
          "age": 0,
          "event": "Agreed to marry Isaac",
          "verse": "Genesis 24:58"
        },
        {
          "age": 0,
          "event": "Married Isaac",
          "verse": "Genesis 24:67"
        },
        {
          "age": 20,
          "event": "Gave birth to Esau and Jacob",
          "verse": "Genesis 25:24-26"
        },
        {
          "age": 97,
          "event": "Helped Jacob deceive Isaac",
          "verse": "Genesis 27:5-17"
        }
      ]
    },
    "Rachel": {
      "summary": "Jacob's beloved wife for whom he worked fourteen years. Beautiful and loved, Rachel was barren for many years while her sister Leah bore children. This caused great rivalry and heartache. God eventually remembered Rachel, and she bore Joseph and later Benjamin, dying in childbirth with Benjamin. Her tomb near Bethlehem became a memorial.",
      "significance": "Rachel represents the pain of barrenness and God's faithfulness in answering prayer. Her sons Joseph and Benjamin became two important tribes of Israel.",
      "key_events": [
        {
          "age": 0,
          "event": "Met Jacob at the well",
          "verse": "Genesis 29:9-11"
        },
        {
          "age": 7,
          "event": "Jacob worked seven years for her",
          "verse": "Genesis 29:20"
        },
        {
          "age": 7,
          "event": "Laban deceived Jacob with Leah",
          "verse": "Genesis 29:23-25"
        },
        {
          "age": 7,
          "event": "Married Jacob",
          "verse": "Genesis 29:28"
        },
        {
          "age": 0,
          "event": "Birth of Joseph",
          "verse": "Genesis 30:22-24"
        },
        {
          "age": 0,
          "event": "Died giving birth to Benjamin",
          "verse": "Genesis 35:16-19"
        }
      ]
    },
    "Judah": {
      "summary": "The fourth son of Jacob and Leah, Judah became the leader among his brothers. He proposed selling Joseph into slavery rather than killing him. After failures with his own sons and daughter-in-law Tamar, Judah demonstrated repentance and growth in character, offering himself as a slave in Benjamin's place. From Judah's line came King David and ultimately Jesus Christ.",
      "significance": "Judah's line was chosen for the Messiah. His transformation from selling Joseph to offering himself for Benjamin shows redemption and change. The 'Lion of Judah' is Christ.",
      "key_events": [
        {
          "age": 0,
          "event": "Born to Jacob and Leah",
          "verse": "Genesis 29:35"
        },
        {
          "age": 0,
          "event": "Proposed selling Joseph",
          "verse": "Genesis 37:26-27"
        },
        {
          "age": 0,
          "event": "Affair with Tamar (unknowingly)",
          "verse": "Genesis 38:13-26"
        },
        {
          "age": 0,
          "event": "Offered himself for Benjamin",
          "verse": "Genesis 44:33"
        },
        {
          "age": 0,
          "event": "Blessed by Jacob as ruler",
          "verse": "Genesis 49:8-10"
        }
      ]
    },
    "Caleb": {
      "summary": "One of twelve spies who explored Canaan, Caleb and Joshua were the only two who trusted God to give Israel victory. For his faith, Caleb was promised he would enter the Promised Land. At age 85, he requested the hill country of Hebron with its fortified cities and giants, saying he was as strong as when Moses sent him. He conquered Hebron and received it as his inheritance.",
      "significance": "Caleb exemplifies wholehearted devotion to God and enduring faith. His confidence in God's promises even in old age demonstrates that spiritual vitality is more important than physical age.",
      "key_events": [
        {
          "age": 40,
          "event": "Spied out Canaan",
          "verse": "Numbers 13:6"
        },
        {
          "age": 40,
          "event": "Gave good report with Joshua",
          "verse": "Numbers 14:6-9"
        },
        {
          "age": 40,
          "event": "Promised the land by God",
          "verse": "Numbers 14:24"
        },
        {
          "age": 85,
          "event": "Claimed his inheritance at Hebron",
          "verse": "Joshua 14:10-12"
        },
        {
          "age": 85,
          "event": "Drove out the giants",
          "verse": "Joshua 15:13-14"
        }
      ]
    },
    "Ruth": {
      "summary": "A Moabite woman who married into an Israelite family. After her husband died, Ruth chose to stay with her mother-in-law Naomi, returning to Bethlehem and declaring Naomi's God as her own. Through God's providence, Ruth married Boaz, a kinsman-redeemer, and became the great-grandmother of King David. Her story demonstrates covenant loyalty and God's inclusion of Gentiles.",
      "significance": "Ruth, a Gentile, is in the Messianic line, showing God's grace extends to all nations. Her loyalty and faith demonstrate true conversion, and she prefigures the church as the Bride of Christ.",
      "key_events": [
        {
          "age": 0,
          "event": "Married Mahlon in Moab",
          "verse": "Ruth 1:4"
        },
        {
          "age": 10,
          "event": "Death of her husband",
          "verse": "Ruth 1:5"
        },
        {
          "age": 10,
          "event": "Chose to follow Naomi and her God",
          "verse": "Ruth 1:16-17"
        },
        {
          "age": 10,
          "event": "Gleaned in Boaz's field",
          "verse": "Ruth 2:2-3"
        },
        {
          "age": 10,
          "event": "Married Boaz",
          "verse": "Ruth 4:13"
        },
        {
          "age": 11,
          "event": "Birth of Obed (David's grandfather)",
          "verse": "Ruth 4:17"
        }
      ]
    },
    "Hannah": {
      "summary": "The mother of Samuel, Hannah suffered the pain of barrenness and provocation from her husband's other wife. In deep anguish, she prayed fervently at the tabernacle, vowing to dedicate her son to God's service if He would grant her a child. God answered her prayer, and she faithfully fulfilled her vow, bringing young Samuel to serve under Eli. She then had five more children.",
      "significance": "Hannah's prayer demonstrates persevering faith and sacrificial dedication. Her song of praise prefigures Mary's Magnificat and shows God's concern for the humble and afflicted.",
      "key_events": [
        {
          "age": 0,
          "event": "Provoked by Peninnah for barrenness",
          "verse": "1 Samuel 1:6-7"
        },
        {
          "age": 0,
          "event": "Prayed desperately for a son",
          "verse": "1 Samuel 1:10-11"
        },
        {
          "age": 0,
          "event": "Eli blessed her prayer",
          "verse": "1 Samuel 1:17"
        },
        {
          "age": 0,
          "event": "Birth of Samuel",
          "verse": "1 Samuel 1:20"
        },
        {
          "age": 3,
          "event": "Dedicated Samuel to the Lord",
          "verse": "1 Samuel 1:24-28"
        },
        {
          "age": 3,
          "event": "Prayed her song of thanksgiving",
          "verse": "1 Samuel 2:1-10"
        }
      ]
    },
    "Daniel": {
      "summary": "A young Jewish nobleman taken captive to Babylon, Daniel purposed not to defile himself with the king's food. God gave him wisdom exceeding all the Babylonian wise men. Daniel interpreted dreams for kings and received visions of future kingdoms. Despite threats and a lion's den, Daniel remained faithful to God. He prophesied the seventy weeks and saw visions of the end times.",
      "significance": "Daniel demonstrates unwavering faithfulness in exile and hostile culture. His prophecies reveal God's sovereign plan for history and the coming Messiah. He prefigures believers living faithfully in ungodly societies.",
      "key_events": [
        {
          "age": 15,
          "event": "Taken captive to Babylon",
          "verse": "Daniel 1:3-6"
        },
        {
          "age": 18,
          "event": "Interpreted Nebuchadnezzar's dream",
          "verse": "Daniel 2:31-45"
        },
        {
          "age": 81,
          "event": "Interpreted handwriting on wall",
          "verse": "Daniel 5:25-28"
        },
        {
          "age": 82,
          "event": "Thrown into lion's den",
          "verse": "Daniel 6:16"
        },
        {
          "age": 82,
          "event": "Delivered from the lions",
          "verse": "Daniel 6:22"
        },
        {
          "age": 85,
          "event": "Vision of seventy weeks",
          "verse": "Daniel 9:24-27"
        }
      ]
    },
    "Esther": {
      "summary": "A Jewish orphan raised by her cousin Mordecai, Esther became queen of Persia through God's providence. When Haman plotted to destroy all Jews, Mordecai challenged Esther to use her position to save her people. Despite the risk, Esther approached the king unbidden, saying 'If I perish, I perish.' Her courage saved the Jewish people from genocide.",
      "significance": "Esther shows God's providence working through unlikely means to preserve His people. Her courage and Mordecai's faith demonstrate trusting God in crisis. The Feast of Purim celebrates this deliverance.",
      "key_events": [
        {
          "age": 0,
          "event": "Chosen as queen",
          "verse": "Esther 2:17"
        },
        {
          "age": 5,
          "event": "Learned of Haman's plot",
          "verse": "Esther 3:13-4:8"
        },
        {
          "age": 5,
          "event": "Decided to approach the king",
          "verse": "Esther 4:15-16"
        },
        {
          "age": 5,
          "event": "Revealed Haman's plot",
          "verse": "Esther 7:3-6"
        },
        {
          "age": 5,
          "event": "Jews delivered, Purim established",
          "verse": "Esther 9:20-22"
        }
      ]
    },
    "Jeremiah": {
      "summary": "The weeping prophet called by God as a youth to prophesy Judah's destruction. Jeremiah faithfully proclaimed God's word for over forty years despite fierce opposition, imprisonment, and rejection. He witnessed Jerusalem's fall to Babylon and was forced to Egypt. His prophecies include the New Covenant written on hearts and the promise of restoration after seventy years of exile.",
      "significance": "Jeremiah demonstrates faithful ministry despite rejection and suffering. His New Covenant prophecy points to Christ and the gospel. His Lamentations express godly sorrow over sin's consequences.",
      "key_events": [
        {
          "age": 0,
          "event": "Called by God as a youth",
          "verse": "Jeremiah 1:4-10"
        },
        {
          "age": 0,
          "event": "Prophesied seventy years captivity",
          "verse": "Jeremiah 25:11-12"
        },
        {
          "age": 0,
          "event": "Imprisoned for his prophecies",
          "verse": "Jeremiah 37:15"
        },
        {
          "age": 0,
          "event": "Thrown into a muddy cistern",
          "verse": "Jeremiah 38:6"
        },
        {
          "age": 0,
          "event": "Prophesied the New Covenant",
          "verse": "Jeremiah 31:31-34"
        },
        {
          "age": 0,
          "event": "Witnessed fall of Jerusalem",
          "verse": "Jeremiah 39:1-10"
        }
      ]
    },
    "Ezekiel": {
      "summary": "A priest taken into Babylonian exile, Ezekiel received dramatic visions by the Chebar River. God called him to be a watchman to Israel, warning them of judgment. His prophecies include the vision of dry bones coming to life, the departure and return of God's glory, and detailed plans for a future temple. Despite being among the exiles, Ezekiel proclaimed both judgment and future restoration.",
      "significance": "Ezekiel shows God's presence with His people even in exile. His visions of resurrection and restoration prefigure spiritual rebirth and the coming Kingdom. His ministry sustained hope during darkest days.",
      "key_events": [
        {
          "age": 30,
          "event": "Vision of God's glory",
          "verse": "Ezekiel 1:1-28"
        },
        {
          "age": 30,
          "event": "Called as watchman to Israel",
          "verse": "Ezekiel 3:17-21"
        },
        {
          "age": 31,
          "event": "Wife died as a sign",
          "verse": "Ezekiel 24:15-18"
        },
        {
          "age": 37,
          "event": "Vision of dry bones",
          "verse": "Ezekiel 37:1-14"
        },
        {
          "age": 50,
          "event": "Vision of the new temple",
          "verse": "Ezekiel 40-48"
        }
      ]
    },
    "John": {
      "summary": "The beloved disciple, son of Zebedee and brother of James. John was part of Jesus' inner circle and present at the Transfiguration. He leaned on Jesus at the Last Supper and was entrusted with caring for Mary at the crucifixion. John wrote the Gospel of John, three epistles, and Revelation. He emphasized love and abiding in Christ, outliving all other apostles.",
      "significance": "John reveals Jesus as the Word made flesh and emphasizes intimate relationship with Christ. His writings provide deep theological insight into Jesus' deity and the nature of love and truth.",
      "key_events": [
        {
          "age": 25,
          "event": "Called by Jesus",
          "verse": "Mark 1:19-20"
        },
        {
          "age": 28,
          "event": "At the Transfiguration",
          "verse": "Mark 9:2"
        },
        {
          "age": 28,
          "event": "Leaned on Jesus at Last Supper",
          "verse": "John 13:23"
        },
        {
          "age": 28,
          "event": "At the crucifixion, given care of Mary",
          "verse": "John 19:26-27"
        },
        {
          "age": 28,
          "event": "First to believe at empty tomb",
          "verse": "John 20:8"
        },
        {
          "age": 90,
          "event": "Received Revelation on Patmos",
          "verse": "Revelation 1:9"
        }
      ]
    },
    "James": {
      "summary": "The half-brother of Jesus who did not believe during Jesus' earthly ministry but was converted after the resurrection. James became a pillar of the Jerusalem church and presided over the Jerusalem Council. Known for his devotion to prayer, he wrote the epistle emphasizing practical faith and good works. Tradition says he was martyred by being thrown from the temple.",
      "significance": "James shows that even family members must come to faith individually. His epistle balances Paul's emphasis on faith by showing that genuine faith produces works.",
      "key_events": [
        {
          "age": 0,
          "event": "Did not believe in Jesus initially",
          "verse": "John 7:5"
        },
        {
          "age": 33,
          "event": "Jesus appeared to him after resurrection",
          "verse": "1 Corinthians 15:7"
        },
        {
          "age": 33,
          "event": "Present at Pentecost",
          "verse": "Acts 1:14"
        },
        {
          "age": 46,
          "event": "Led Jerusalem Council",
          "verse": "Acts 15:13-21"
        },
        {
          "age": 59,
          "event": "Met with Paul in Jerusalem",
          "verse": "Acts 21:18"
        },
        {
          "age": 62,
          "event": "Martyred (tradition)",
          "verse": ""
        }
      ]
    },
    "Stephen": {
      "summary": "The first Christian martyr, Stephen was one of seven men chosen to serve tables in the early church. Full of faith and the Holy Spirit, he performed great wonders and signs. When accused by the Jewish council, Stephen delivered a powerful sermon recounting Israel's history of rejecting God's messengers. As he was stoned, Stephen saw heaven opened and Jesus standing at God's right hand.",
      "significance": "Stephen's martyrdom marks the beginning of great persecution and the spread of the gospel beyond Jerusalem. His death influenced Saul's conversion. His vision of Jesus standing shows Christ's advocacy for His witnesses.",
      "key_events": [
        {
          "age": 0,
          "event": "Chosen as first deacon",
          "verse": "Acts 6:5"
        },
        {
          "age": 0,
          "event": "Performed signs and wonders",
          "verse": "Acts 6:8"
        },
        {
          "age": 0,
          "event": "Accused before the Sanhedrin",
          "verse": "Acts 6:12-15"
        },
        {
          "age": 0,
          "event": "Delivered defense sermon",
          "verse": "Acts 7:2-53"
        },
        {
          "age": 0,
          "event": "Saw Jesus standing at God's right hand",
          "verse": "Acts 7:55-56"
        },
        {
          "age": 0,
          "event": "Stoned to death",
          "verse": "Acts 7:58-60"
        }
      ]
    },
    "Timothy": {
      "summary": "Paul's beloved spiritual son and ministry companion. The son of a Greek father and Jewish mother Eunice, Timothy was trained in Scripture from childhood. Paul circumcised him for ministry among Jews and took him on missionary journeys. Despite being young and perhaps timid, Timothy pastored the church at Ephesus. Paul wrote two letters instructing him in ministry and doctrine.",
      "significance": "Timothy exemplifies faithful discipleship and spiritual mentorship. His genuine faith passed down through generations shows the importance of faithful spiritual training.",
      "key_events": [
        {
          "age": 16,
          "event": "Well spoken of by believers",
          "verse": "Acts 16:1-2"
        },
        {
          "age": 16,
          "event": "Joined Paul's missionary team",
          "verse": "Acts 16:3"
        },
        {
          "age": 33,
          "event": "Sent to strengthen Thessalonians",
          "verse": "1 Thessalonians 3:1-2"
        },
        {
          "age": 34,
          "event": "Pastored church at Ephesus",
          "verse": "1 Timothy 1:3"
        },
        {
          "age": 34,
          "event": "Received Paul's first letter",
          "verse": "1 Timothy 1:1"
        },
        {
          "age": 36,
          "event": "Received Paul's final letter",
          "verse": "2 Timothy 1:1"
        }
      ]
    },
    "Barnabas": {
      "summary": "A Levite from Cyprus whose name means 'son of encouragement.' Barnabas sold his land to help the early church and vouched for newly converted Saul when others feared him. He brought Paul to Antioch and traveled with him on the first missionary journey. Though he and Paul separated over taking John Mark, Barnabas's encouragement restored Mark to useful ministry.",
      "significance": "Barnabas exemplifies the gift of encouragement and generosity. His willingness to give second chances shows grace and wisdom in ministry. He demonstrates the importance of restoring fallen believers.",
      "key_events": [
        {
          "age": 0,
          "event": "Sold land to help the church",
          "verse": "Acts 4:36-37"
        },
        {
          "age": 0,
          "event": "Vouched for Saul in Jerusalem",
          "verse": "Acts 9:27"
        },
        {
          "age": 0,
          "event": "Sent to Antioch, brought Paul",
          "verse": "Acts 11:22-26"
        },
        {
          "age": 0,
          "event": "First missionary journey with Paul",
          "verse": "Acts 13:2-3"
        },
        {
          "age": 0,
          "event": "Separated from Paul over Mark",
          "verse": "Acts 15:36-40"
        },
        {
          "age": 0,
          "event": "Took Mark, sailed to Cyprus",
          "verse": "Acts 15:39"
        }
      ]
    },
    "Sarah": {
      "summary": "Originally named Sarai, Sarah was Abraham's wife who accompanied him from Ur to Canaan. Despite her barrenness and old age, God promised she would bear a son. At age 90, she gave birth to Isaac, the child of promise. Sarah is remembered for her faith and is mentioned in the New Testament as an example for godly women.",
      "significance": "Sarah's miraculous conception of Isaac demonstrates God's power and faithfulness to His promises, even when circumstances seem impossible.",
      "key_events": [
        {
          "age": 65,
          "event": "Left Ur with Abraham",
          "verse": "Genesis 12:4-5"
        },
        {
          "age": 90,
          "event": "God promised her a son",
          "verse": "Genesis 17:15-19"
        },
        {
          "age": 90,
          "event": "Birth of Isaac",
          "verse": "Genesis 21:1-7"
        },
        {
          "age": 127,
          "event": "Death",
          "verse": "Genesis 23:1-2"
        }
      ]
    },
    "Leah": {
      "summary": "The older daughter of Laban, Leah was given to Jacob through deception on his wedding night when he expected Rachel. Though unloved by Jacob, God blessed her with six sons and a daughter. Despite the pain of being second choice, Leah became the mother of Judah, through whom the Messiah would come.",
      "significance": "Leah's story shows God's compassion for the unloved and rejected. Despite human rejection, God chose her line for the Messiah.",
      "key_events": [
        {
          "age": 0,
          "event": "Married Jacob through Laban's deception",
          "verse": "Genesis 29:23-25"
        },
        {
          "age": 0,
          "event": "Birth of Reuben",
          "verse": "Genesis 29:32"
        },
        {
          "age": 0,
          "event": "Birth of Judah",
          "verse": "Genesis 29:35"
        },
        {
          "age": 0,
          "event": "Birth of Dinah",
          "verse": "Genesis 30:21"
        }
      ]
    },
    "Boaz": {
      "summary": "A wealthy landowner in Bethlehem, Boaz became the kinsman-redeemer of Ruth the Moabitess. He showed kindness to Ruth when she gleaned in his fields, protected her, and ultimately married her according to the levirate custom. Through their son Obed, Boaz became the great-grandfather of King David.",
      "significance": "Boaz exemplifies the kinsman-redeemer role, prefiguring Christ who redeems His people. His inclusion of a Gentile in the Messianic line shows God's plan for all nations.",
      "key_events": [
        {
          "age": 0,
          "event": "Ruth gleaned in his field",
          "verse": "Ruth 2:3"
        },
        {
          "age": 0,
          "event": "Showed kindness to Ruth",
          "verse": "Ruth 2:8-16"
        },
        {
          "age": 0,
          "event": "Became her kinsman-redeemer",
          "verse": "Ruth 4:9-10"
        },
        {
          "age": 0,
          "event": "Married Ruth",
          "verse": "Ruth 4:13"
        },
        {
          "age": 0,
          "event": "Birth of Obed",
          "verse": "Ruth 4:17"
        }
      ]
    },
    "Bathsheba": {
      "summary": "The wife of Uriah the Hittite, Bathsheba was seen bathing by King David, who committed adultery with her. After David arranged Uriah's death, Bathsheba became David's wife. Their first child died as judgment, but their second son was Solomon, who became king and built the temple.",
      "significance": "Despite being involved in David's greatest sin, Bathsheba became the mother of Solomon and is in the lineage of Christ, showing God's redemptive grace.",
      "key_events": [
        {
          "age": 0,
          "event": "Adultery with David",
          "verse": "2 Samuel 11:4"
        },
        {
          "age": 0,
          "event": "Death of Uriah",
          "verse": "2 Samuel 11:17"
        },
        {
          "age": 0,
          "event": "Married David",
          "verse": "2 Samuel 11:27"
        },
        {
          "age": 0,
          "event": "First child died",
          "verse": "2 Samuel 12:18"
        },
        {
          "age": 0,
          "event": "Birth of Solomon",
          "verse": "2 Samuel 12:24"
        }
      ]
    },
    "Mark": {
      "summary": "Also called John Mark, he was a companion of Paul and Barnabas on their first missionary journey but left them at Pamphylia. This caused a sharp disagreement between Paul and Barnabas. Later, Mark was restored and became useful to Paul. He authored the Gospel of Mark and tradition says he recorded Peter's teachings.",
      "significance": "Mark's restoration shows that failure is not final. His Gospel is the shortest and fastest-paced, emphasizing Jesus as the suffering servant.",
      "key_events": [
        {
          "age": 0,
          "event": "Traveled with Paul and Barnabas",
          "verse": "Acts 12:25"
        },
        {
          "age": 0,
          "event": "Left them at Pamphylia",
          "verse": "Acts 13:13"
        },
        {
          "age": 0,
          "event": "Cause of Paul-Barnabas split",
          "verse": "Acts 15:36-40"
        },
        {
          "age": 0,
          "event": "Restored and useful to Paul",
          "verse": "2 Timothy 4:11"
        }
      ]
    },
    "Luke": {
      "summary": "A physician and companion of Paul, Luke was a Gentile believer who carefully researched and wrote the Gospel of Luke and the book of Acts. He accompanied Paul on missionary journeys and was with him during his imprisonment. His writings provide detailed historical accounts of Jesus' life and the early church.",
      "significance": "Luke's Gospel emphasizes Jesus' compassion for the poor and outcasts. As a Gentile, he shows Christianity's universal appeal. His historical accuracy validates the gospel accounts.",
      "key_events": [
        {
          "age": 0,
          "event": "Joined Paul's missionary team",
          "verse": "Acts 16:10"
        },
        {
          "age": 0,
          "event": "Accompanied Paul to Rome",
          "verse": "Acts 27-28"
        },
        {
          "age": 0,
          "event": "With Paul in prison",
          "verse": "2 Timothy 4:11"
        },
        {
          "age": 0,
          "event": "Wrote Gospel of Luke and Acts",
          "verse": "Luke 1:1-4"
        }
      ]
    },
    "Miriam": {
      "summary": "The sister of Moses and Aaron, Miriam watched over baby Moses in the Nile and suggested her mother as a nurse. She led the women in worship after the Red Sea crossing and is called a prophetess. Later, she and Aaron challenged Moses' authority and she was struck with leprosy but healed after Moses interceded.",
      "significance": "Miriam demonstrates both faithful service and the danger of pride. She was a worship leader and prophet who served God's purposes in Israel's deliverance.",
      "key_events": [
        {
          "age": 0,
          "event": "Watched over baby Moses",
          "verse": "Exodus 2:4-8"
        },
        {
          "age": 0,
          "event": "Led worship after Red Sea crossing",
          "verse": "Exodus 15:20-21"
        },
        {
          "age": 0,
          "event": "Challenged Moses with Aaron",
          "verse": "Numbers 12:1-2"
        },
        {
          "age": 0,
          "event": "Struck with leprosy",
          "verse": "Numbers 12:10"
        },
        {
          "age": 0,
          "event": "Healed after Moses' intercession",
          "verse": "Numbers 12:13-15"
        }
      ]
    },
    "Deborah": {
      "summary": "A prophetess and judge of Israel, Deborah led Israel during a time of Canaanite oppression. She summoned Barak to lead Israel's army against Sisera, and accompanied him into battle. Through her leadership, Israel defeated their oppressors and had peace for forty years.",
      "significance": "Deborah shows that God can use women in leadership when men fail to step up. Her wisdom and courage brought deliverance to Israel.",
      "key_events": [
        {
          "age": 0,
          "event": "Judged Israel as prophetess",
          "verse": "Judges 4:4-5"
        },
        {
          "age": 0,
          "event": "Summoned Barak to battle",
          "verse": "Judges 4:6-7"
        },
        {
          "age": 0,
          "event": "Went with Barak to battle",
          "verse": "Judges 4:9"
        },
        {
          "age": 0,
          "event": "Sang song of victory",
          "verse": "Judges 5:1"
        },
        {
          "age": 0,
          "event": "Land had peace 40 years",
          "verse": "Judges 5:31"
        }
      ]
    },
    "Gideon": {
      "summary": "Called by God while threshing wheat in hiding, Gideon led Israel against the Midianites despite his doubts and fear. God reduced his army from 32,000 to 300 to show that victory came from God alone. Using trumpets and torches, Gideon's small band routed the Midianite army.",
      "significance": "Gideon demonstrates that God uses weak instruments to accomplish His purposes, ensuring glory goes to Him alone. His story shows God's patience with doubters.",
      "key_events": [
        {
          "age": 0,
          "event": "Called by angel while threshing",
          "verse": "Judges 6:11-12"
        },
        {
          "age": 0,
          "event": "Fleece test for God's will",
          "verse": "Judges 6:36-40"
        },
        {
          "age": 0,
          "event": "Army reduced to 300 men",
          "verse": "Judges 7:2-7"
        },
        {
          "age": 0,
          "event": "Defeated Midianites",
          "verse": "Judges 7:19-23"
        },
        {
          "age": 0,
          "event": "Refused to be king",
          "verse": "Judges 8:22-23"
        }
      ]
    },
    "Hezekiah": {
      "summary": "A righteous king of Judah who removed idolatry and restored temple worship. When Assyria threatened Jerusalem, Hezekiah prayed and God destroyed 185,000 Assyrian soldiers in one night. He was granted 15 additional years of life after deadly illness.",
      "significance": "Hezekiah exemplifies trust in God during crisis. His reforms brought revival to Judah. His Passover celebration reunited the people in worship.",
      "key_events": [
        {
          "age": 25,
          "event": "Became king of Judah",
          "verse": "2 Kings 18:1-2"
        },
        {
          "age": 0,
          "event": "Restored temple worship",
          "verse": "2 Chronicles 29:3-11"
        },
        {
          "age": 0,
          "event": "Celebrated Passover",
          "verse": "2 Chronicles 30:1-27"
        },
        {
          "age": 39,
          "event": "Healed from deadly illness",
          "verse": "2 Kings 20:1-6"
        },
        {
          "age": 0,
          "event": "Delivered from Assyria",
          "verse": "2 Kings 19:35"
        }
      ]
    },
    "Josiah": {
      "summary": "Became king at age 8, Josiah led the greatest reformation in Judah's history. During temple repairs, the Book of the Law was discovered. Upon hearing it, Josiah tore his clothes in repentance and led the nation in covenant renewal. He destroyed idols and high places throughout the land.",
      "significance": "Josiah shows the power of God's Word to bring repentance and reform. His devotion to God delayed Judah's judgment.",
      "key_events": [
        {
          "age": 8,
          "event": "Became king",
          "verse": "2 Kings 22:1"
        },
        {
          "age": 16,
          "event": "Began to seek God",
          "verse": "2 Chronicles 34:3"
        },
        {
          "age": 20,
          "event": "Began purging idolatry",
          "verse": "2 Chronicles 34:3-7"
        },
        {
          "age": 26,
          "event": "Book of Law discovered",
          "verse": "2 Kings 22:8"
        },
        {
          "age": 26,
          "event": "Covenant renewal",
          "verse": "2 Kings 23:1-3"
        },
        {
          "age": 39,
          "event": "Death in battle",
          "verse": "2 Kings 23:29"
        }
      ]
    },
    "Mary Magdalene": {
      "summary": "Delivered from seven demons by Jesus, Mary Magdalene became a devoted follower who supported His ministry. She witnessed the crucifixion when most disciples fled, and was the first to see the risen Christ. She announced His resurrection to the disciples.",
      "significance": "Mary Magdalene exemplifies grateful devotion after deliverance. Her testimony as first resurrection witness highlights Jesus' inclusion of women.",
      "key_events": [
        {
          "age": 0,
          "event": "Delivered from seven demons",
          "verse": "Luke 8:2"
        },
        {
          "age": 0,
          "event": "Supported Jesus' ministry",
          "verse": "Luke 8:3"
        },
        {
          "age": 0,
          "event": "Witnessed the crucifixion",
          "verse": "Matthew 27:56"
        },
        {
          "age": 0,
          "event": "First to see risen Christ",
          "verse": "John 20:14-18"
        },
        {
          "age": 0,
          "event": "Announced resurrection to disciples",
          "verse": "John 20:18"
        }
      ]
    },
    "Martha": {
      "summary": "Sister of Mary and Lazarus, Martha welcomed Jesus into their Bethany home. She is known for being worried and upset about serving while Mary sat at Jesus' feet. When Lazarus died, Martha's confession of Jesus as Messiah preceded His greatest miracle.",
      "significance": "Martha represents the tension between service and devotion. Her confession shows mature faith. She teaches the importance of choosing the better part.",
      "key_events": [
        {
          "age": 0,
          "event": "Welcomed Jesus to her home",
          "verse": "Luke 10:38"
        },
        {
          "age": 0,
          "event": "Worried about serving",
          "verse": "Luke 10:40-42"
        },
        {
          "age": 0,
          "event": "Confessed Jesus as Christ",
          "verse": "John 11:27"
        },
        {
          "age": 0,
          "event": "Witnessed Lazarus raised",
          "verse": "John 11:43-44"
        },
        {
          "age": 0,
          "event": "Served at dinner for Jesus",
          "verse": "John 12:2"
        }
      ]
    },
    "Lazarus": {
      "summary": "Brother of Mary and Martha, Lazarus was a friend of Jesus from Bethany. When he died of illness, Jesus waited two days before coming, then raised him after four days in the tomb. This miracle led many to believe in Jesus but also intensified the plot to kill Jesus.",
      "significance": "Lazarus' resurrection was Jesus' greatest sign before His own resurrection, demonstrating power over death and prefiguring Christ's victory.",
      "key_events": [
        {
          "age": 0,
          "event": "Became sick",
          "verse": "John 11:1-3"
        },
        {
          "age": 0,
          "event": "Died and was buried",
          "verse": "John 11:14-17"
        },
        {
          "age": 0,
          "event": "Raised by Jesus after 4 days",
          "verse": "John 11:43-44"
        },
        {
          "age": 0,
          "event": "Reclined with Jesus at dinner",
          "verse": "John 12:2"
        },
        {
          "age": 0,
          "event": "Priests plotted to kill him",
          "verse": "John 12:10-11"
        }
      ]
    },
    "Zacchaeus": {
      "summary": "A wealthy chief tax collector in Jericho, Zacchaeus climbed a sycamore tree to see Jesus over the crowd. Jesus called him down and invited Himself to Zacchaeus' house. The encounter transformed Zacchaeus, who repented and pledged to restore fourfold what he had taken dishonestly.",
      "significance": "Zacchaeus demonstrates that salvation brings true repentance and restitution. Jesus seeks and saves the lost, even despised tax collectors.",
      "key_events": [
        {
          "age": 0,
          "event": "Climbed tree to see Jesus",
          "verse": "Luke 19:3-4"
        },
        {
          "age": 0,
          "event": "Jesus invited Himself to his house",
          "verse": "Luke 19:5"
        },
        {
          "age": 0,
          "event": "Pledged to restore fourfold",
          "verse": "Luke 19:8"
        },
        {
          "age": 0,
          "event": "Jesus declared salvation came",
          "verse": "Luke 19:9-10"
        }
      ]
    },
    "Nicodemus": {
      "summary": "A Pharisee and member of the Jewish ruling council, Nicodemus came to Jesus by night seeking truth. Jesus taught him about being born again. Later, Nicodemus defended Jesus before the council and helped Joseph of Arimathea bury Jesus, bringing expensive spices.",
      "significance": "Nicodemus represents those who come to faith gradually. His nighttime visit shows the cost of discipleship for religious leaders. His actions at the burial show growing faith.",
      "key_events": [
        {
          "age": 0,
          "event": "Came to Jesus by night",
          "verse": "John 3:1-2"
        },
        {
          "age": 0,
          "event": "Taught about new birth",
          "verse": "John 3:3-7"
        },
        {
          "age": 0,
          "event": "Defended Jesus before council",
          "verse": "John 7:50-51"
        },
        {
          "age": 0,
          "event": "Helped bury Jesus",
          "verse": "John 19:39-40"
        }
      ]
    },
    "Silas": {
      "summary": "A prophet and leader in the Jerusalem church, Silas was chosen to accompany Paul on his second missionary journey after Paul's split with Barnabas. He and Paul were beaten and imprisoned in Philippi but praised God at midnight, leading to the jailer's conversion. Silas helped write Paul's letters to the Thessalonians.",
      "significance": "Silas demonstrates faithful partnership in ministry and joy in suffering. His prophetic gift and leadership strengthened the early churches.",
      "key_events": [
        {
          "age": 0,
          "event": "Chosen to deliver Jerusalem letter",
          "verse": "Acts 15:22"
        },
        {
          "age": 0,
          "event": "Joined Paul's second journey",
          "verse": "Acts 15:40"
        },
        {
          "age": 0,
          "event": "Beaten and imprisoned in Philippi",
          "verse": "Acts 16:22-24"
        },
        {
          "age": 0,
          "event": "Praised God at midnight",
          "verse": "Acts 16:25"
        },
        {
          "age": 0,
          "event": "Witnessed jailer's conversion",
          "verse": "Acts 16:29-34"
        }
      ]
    },
    "Absalom": {
      "summary": "The third son of King David, known for his exceptional beauty and his tragic rebellion against his father. Absalom killed his half-brother Amnon to avenge the rape of his sister Tamar, then fled to Geshur. After returning to Jerusalem, he conspired to usurp David's throne, forcing his father to flee. He was killed by Joab while caught in an oak tree during the battle.",
      "significance": "Absalom's rebellion illustrates the devastating consequences of family dysfunction and unchecked ambition, as well as the depths of a father's love despite betrayal.",
      "key_events": [
        {
          "age": null,
          "event": "Birth to David and Maacah",
          "verse": "2 Samuel 3:3"
        },
        {
          "age": null,
          "event": "Killed Amnon for raping Tamar",
          "verse": "2 Samuel 13:28-29"
        },
        {
          "age": null,
          "event": "Fled to Geshur for three years",
          "verse": "2 Samuel 13:37-38"
        },
        {
          "age": null,
          "event": "Returned to Jerusalem",
          "verse": "2 Samuel 14:23"
        },
        {
          "age": null,
          "event": "Began conspiracy against David",
          "verse": "2 Samuel 15:10"
        },
        {
          "age": null,
          "event": "Death caught in oak tree",
          "verse": "2 Samuel 18:9-15"
        }
      ]
    },
    "Nathan": {
      "summary": "A prophet during the reign of King David who fearlessly confronted the king about his sin with Bathsheba. Nathan also brought David God's covenant promise of an eternal dynasty. He played a key role in ensuring Solomon's succession to the throne and was involved in organizing temple worship.",
      "significance": "Nathan exemplifies the prophetic role of speaking truth to power and demonstrates God's willingness to forgive even grievous sins when met with genuine repentance.",
      "key_events": [
        {
          "age": null,
          "event": "Brought God's covenant to David",
          "verse": "2 Samuel 7:4-17"
        },
        {
          "age": null,
          "event": "Confronted David about Bathsheba",
          "verse": "2 Samuel 12:1-15"
        },
        {
          "age": null,
          "event": "Named Solomon 'Jedidiah'",
          "verse": "2 Samuel 12:25"
        },
        {
          "age": null,
          "event": "Helped secure Solomon's succession",
          "verse": "1 Kings 1:11-45"
        }
      ]
    },
    "Tamar": {
      "summary": "The daughter of King David and sister of Absalom, Tamar was raped by her half-brother Amnon. After the assault, Amnon rejected her cruelly, compounding her trauma. Her brother Absalom sheltered her and later avenged her by killing Amnon, which set in motion events leading to Absalom's rebellion.",
      "significance": "Tamar's tragic story exposes the devastating impact of sexual violence and the failure of family and authority to provide justice, foreshadowing the dysfunction that would plague David's house.",
      "key_events": [
        {
          "age": null,
          "event": "Raped by half-brother Amnon",
          "verse": "2 Samuel 13:14"
        },
        {
          "age": null,
          "event": "Rejected and humiliated by Amnon",
          "verse": "2 Samuel 13:15-17"
        },
        {
          "age": null,
          "event": "Lived desolate in Absalom's house",
          "verse": "2 Samuel 13:20"
        }
      ]
    },
    "Laban": {
      "summary": "The brother of Rebekah and father of Leah and Rachel, Laban was a shrewd Aramean who lived in Haran. When Jacob fled from Esau, he worked for Laban for twenty years, during which Laban repeatedly deceived him, changing his wages ten times. Despite the conflicts, Laban's daughters became the mothers of the twelve tribes of Israel.",
      "significance": "Laban represents God's sovereignty in using even difficult circumstances to fulfill His covenant promises, as through Laban's daughters came the twelve tribes of Israel.",
      "key_events": [
        {
          "age": null,
          "event": "Met Abraham's servant",
          "verse": "Genesis 24:29-31"
        },
        {
          "age": null,
          "event": "Jacob arrived to work for him",
          "verse": "Genesis 29:13"
        },
        {
          "age": null,
          "event": "Deceived Jacob with Leah instead of Rachel",
          "verse": "Genesis 29:23-25"
        },
        {
          "age": null,
          "event": "Made covenant with Jacob at Mizpah",
          "verse": "Genesis 31:44-55"
        }
      ]
    },
    "Benjamin": {
      "summary": "The youngest son of Jacob and Rachel, born as his mother died in childbirth. Rachel named him Ben-oni ('son of my sorrow'), but Jacob renamed him Benjamin ('son of my right hand'). He was the only son of Jacob born in Canaan and was deeply loved by his father. He became the father of the tribe of Benjamin.",
      "significance": "Benjamin's tribe produced Israel's first king (Saul) and the apostle Paul, and remained loyal to Judah when the kingdom divided.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth near Bethlehem; Rachel died",
          "verse": "Genesis 35:16-18"
        },
        {
          "age": null,
          "event": "Traveled to Egypt with brothers",
          "verse": "Genesis 43:15"
        },
        {
          "age": null,
          "event": "Joseph's cup found in his sack",
          "verse": "Genesis 44:12"
        },
        {
          "age": null,
          "event": "Reunited with Joseph",
          "verse": "Genesis 45:14"
        }
      ]
    },
    "Bilhah": {
      "summary": "Rachel's handmaid, given to Jacob as a concubine to bear children on Rachel's behalf. Through Bilhah, Rachel obtained two sons: Dan and Naphtali. Later, Reuben, Jacob's firstborn, violated her, which resulted in Reuben losing his birthright.",
      "significance": "Bilhah's sons Dan and Naphtali became two of the twelve tribes of Israel, demonstrating God's inclusion of all Jacob's sons in His covenant promises.",
      "key_events": [
        {
          "age": null,
          "event": "Given to Jacob by Rachel",
          "verse": "Genesis 30:3-4"
        },
        {
          "age": null,
          "event": "Bore Dan to Jacob",
          "verse": "Genesis 30:5-6"
        },
        {
          "age": null,
          "event": "Bore Naphtali to Jacob",
          "verse": "Genesis 30:7-8"
        },
        {
          "age": null,
          "event": "Violated by Reuben",
          "verse": "Genesis 35:22"
        }
      ]
    },
    "Zilpah": {
      "summary": "Leah's handmaid, given to Jacob as a concubine when Leah stopped bearing children. Through Zilpah, Leah obtained two more sons: Gad and Asher, adding to her children by Jacob.",
      "significance": "Zilpah's sons Gad and Asher became two of the twelve tribes of Israel, their descendants receiving tribal inheritances in the Promised Land.",
      "key_events": [
        {
          "age": null,
          "event": "Given to Jacob by Leah",
          "verse": "Genesis 30:9"
        },
        {
          "age": null,
          "event": "Bore Gad to Jacob",
          "verse": "Genesis 30:10-11"
        },
        {
          "age": null,
          "event": "Bore Asher to Jacob",
          "verse": "Genesis 30:12-13"
        }
      ]
    },
    "Reuben": {
      "summary": "The firstborn son of Jacob and Leah, Reuben should have received the birthright and double portion. However, he lost these privileges after sleeping with his father's concubine Bilhah. Despite this, he later tried to save Joseph from his brothers and offered his own sons as guarantee for Benjamin's safety.",
      "significance": "Reuben's loss of the birthright demonstrates that God's choices are not determined by human birth order but by His sovereign will and human character.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth to Jacob and Leah",
          "verse": "Genesis 29:32"
        },
        {
          "age": null,
          "event": "Found mandrakes in the field",
          "verse": "Genesis 30:14"
        },
        {
          "age": null,
          "event": "Tried to save Joseph",
          "verse": "Genesis 37:21-22"
        },
        {
          "age": null,
          "event": "Violated Bilhah, lost birthright",
          "verse": "Genesis 35:22"
        },
        {
          "age": null,
          "event": "Offered his sons as surety for Benjamin",
          "verse": "Genesis 42:37"
        }
      ]
    },
    "Simeon": {
      "summary": "The second son of Jacob and Leah, Simeon joined with his brother Levi in the violent massacre of Shechem to avenge their sister Dinah's rape. This act of vengeance was condemned by Jacob on his deathbed. Simeon was later held hostage in Egypt by Joseph until the brothers returned with Benjamin.",
      "significance": "Simeon's tribe was later absorbed into Judah's territory, and his descendants' fierce nature found positive expression in defending Israel.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth to Jacob and Leah",
          "verse": "Genesis 29:33"
        },
        {
          "age": null,
          "event": "Massacred men of Shechem with Levi",
          "verse": "Genesis 34:25-26"
        },
        {
          "age": null,
          "event": "Held hostage in Egypt by Joseph",
          "verse": "Genesis 42:24"
        }
      ]
    },
    "Dan": {
      "summary": "The first son born to Jacob through Rachel's handmaid Bilhah, Dan's name means 'judge' or 'he has vindicated.' Rachel considered his birth a vindication from God. Dan became the father of the tribe that would later be associated with idolatry but also produced the judge Samson.",
      "significance": "The tribe of Dan later struggled with idolatry and is notably absent from the 144,000 in Revelation, yet produced mighty deliverers like Samson.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth to Jacob through Bilhah",
          "verse": "Genesis 30:5-6"
        },
        {
          "age": null,
          "event": "Traveled to Egypt with family",
          "verse": "Genesis 46:23"
        }
      ]
    },
    "Naphtali": {
      "summary": "The second son born to Jacob through Rachel's handmaid Bilhah, Naphtali's name means 'my wrestling.' Rachel saw his birth as evidence of her struggle with her sister Leah. The tribe of Naphtali later settled in northern Galilee.",
      "significance": "The territory of Naphtali was where Jesus conducted much of His ministry, fulfilling Isaiah's prophecy about light coming to this region.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth to Jacob through Bilhah",
          "verse": "Genesis 30:7-8"
        },
        {
          "age": null,
          "event": "Traveled to Egypt with family",
          "verse": "Genesis 46:24"
        }
      ]
    },
    "Gad": {
      "summary": "The first son born to Jacob through Leah's handmaid Zilpah, Gad's name means 'good fortune' or 'a troop comes.' His descendants formed a warrior tribe that settled east of the Jordan River in fertile pasturelands.",
      "significance": "The tribe of Gad was known for its fierce warriors and remained faithful to Israel, though their separation by the Jordan sometimes caused concern.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth to Jacob through Zilpah",
          "verse": "Genesis 30:10-11"
        },
        {
          "age": null,
          "event": "Traveled to Egypt with family",
          "verse": "Genesis 46:16"
        }
      ]
    },
    "Asher": {
      "summary": "The second son born to Jacob through Leah's handmaid Zilpah, Asher's name means 'happy' or 'blessed.' Leah declared that women would call her blessed because of him. His descendants inherited rich coastal territory known for its abundance.",
      "significance": "The tribe of Asher was blessed with material prosperity, and the prophetess Anna who witnessed Jesus's presentation came from this tribe.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth to Jacob through Zilpah",
          "verse": "Genesis 30:12-13"
        },
        {
          "age": null,
          "event": "Traveled to Egypt with family",
          "verse": "Genesis 46:17"
        }
      ]
    },
    "Issachar": {
      "summary": "The ninth son of Jacob and the fifth son of Leah, Issachar was born after the incident with the mandrakes. His name relates to 'reward' or 'wages.' His descendants became a large tribe known for understanding the times and seasons.",
      "significance": "The tribe of Issachar was noted for wisdom and understanding, with men who 'had understanding of the times, to know what Israel ought to do.'",
      "key_events": [
        {
          "age": 0,
          "event": "Birth to Jacob and Leah",
          "verse": "Genesis 30:17-18"
        },
        {
          "age": null,
          "event": "Traveled to Egypt with family",
          "verse": "Genesis 46:13"
        }
      ]
    },
    "Zebulun": {
      "summary": "The tenth son of Jacob and the sixth son of Leah, Zebulun was the last son Leah bore to Jacob. His name means 'dwelling' or 'honor.' Leah hoped that Jacob would honor her for bearing six sons. His descendants settled in a territory that included important trade routes.",
      "significance": "The tribe of Zebulun's territory was blessed with commerce and included the region where Jesus grew up and began His ministry.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth to Jacob and Leah",
          "verse": "Genesis 30:19-20"
        },
        {
          "age": null,
          "event": "Traveled to Egypt with family",
          "verse": "Genesis 46:14"
        }
      ]
    },
    "Dinah": {
      "summary": "The daughter of Jacob and Leah, Dinah was raped by Shechem, a Hivite prince, who then wanted to marry her. Her brothers Simeon and Levi tricked the men of Shechem into being circumcised, then massacred them while they were incapacitated, taking vengeance for their sister.",
      "significance": "Dinah's story reveals the violence and dysfunction that marked Jacob's family and the serious consequences of compromising with pagan cultures.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth to Jacob and Leah",
          "verse": "Genesis 30:21"
        },
        {
          "age": null,
          "event": "Raped by Shechem",
          "verse": "Genesis 34:2"
        },
        {
          "age": null,
          "event": "Brothers' revenge on Shechem",
          "verse": "Genesis 34:25-26"
        }
      ]
    },
    "Manasseh": {
      "summary": "The firstborn son of Joseph and Asenath, born in Egypt before the famine. Though the firstborn, Jacob crossed his hands to give the greater blessing to Ephraim. Manasseh's descendants formed a large tribe that settled on both sides of the Jordan River.",
      "significance": "Manasseh's tribe became powerful and numerous, though his receiving the lesser blessing demonstrates God's sovereign choice over human customs.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth in Egypt to Joseph",
          "verse": "Genesis 41:50-51"
        },
        {
          "age": null,
          "event": "Blessed by Jacob, received left hand",
          "verse": "Genesis 48:13-14"
        },
        {
          "age": null,
          "event": "Half tribe settled east of Jordan",
          "verse": "Numbers 32:33"
        }
      ]
    },
    "Ephraim": {
      "summary": "The second son of Joseph and Asenath, born in Egypt, Ephraim received the greater blessing from Jacob despite being younger than Manasseh. His descendants became the dominant tribe in northern Israel, and 'Ephraim' often became synonymous with the northern kingdom.",
      "significance": "Ephraim's prominence fulfills Jacob's blessing and demonstrates God's choice of the younger over the elder, but the tribe later led Israel into idolatry.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth in Egypt to Joseph",
          "verse": "Genesis 41:52"
        },
        {
          "age": null,
          "event": "Blessed by Jacob, received right hand",
          "verse": "Genesis 48:17-20"
        },
        {
          "age": null,
          "event": "Tribe became prominent in north",
          "verse": "Joshua 16:5"
        }
      ]
    },
    "Amnon": {
      "summary": "The firstborn son of King David, Amnon raped his half-sister Tamar despite her pleas and resistance. Afterward, he rejected her cruelly. Two years later, her brother Absalom killed Amnon in revenge, eliminating David's heir apparent.",
      "significance": "Amnon's sin of rape and the violent response it provoked illustrate the consequences of uncontrolled lust and the dysfunction in David's house following his sin with Bathsheba.",
      "key_events": [
        {
          "age": null,
          "event": "Birth to David and Ahinoam",
          "verse": "2 Samuel 3:2"
        },
        {
          "age": null,
          "event": "Raped his half-sister Tamar",
          "verse": "2 Samuel 13:14"
        },
        {
          "age": null,
          "event": "Killed by Absalom's servants",
          "verse": "2 Samuel 13:28-29"
        }
      ]
    },
    "Adonijah": {
      "summary": "The fourth son of David and Haggith, Adonijah attempted to seize the throne as David aged, despite knowing that Solomon was chosen as heir. He held a coronation feast but was stopped when Nathan and Bathsheba alerted David, who immediately had Solomon crowned. Later, Adonijah's request for David's concubine led Solomon to have him executed.",
      "significance": "Adonijah's failed coup demonstrates the importance of submitting to God's chosen leader and the dangers of ambition and presumption.",
      "key_events": [
        {
          "age": null,
          "event": "Birth to David and Haggith",
          "verse": "2 Samuel 3:4"
        },
        {
          "age": null,
          "event": "Attempted to seize throne",
          "verse": "1 Kings 1:5-9"
        },
        {
          "age": null,
          "event": "Pardoned by Solomon",
          "verse": "1 Kings 1:52-53"
        },
        {
          "age": null,
          "event": "Executed for requesting Abishag",
          "verse": "1 Kings 2:13-25"
        }
      ]
    },
    "Joab": {
      "summary": "The son of David's sister Zeruiah and commander of David's army for most of his reign. Joab was a brilliant military strategist but also ruthless, killing Abner, Absalom, and Amasa against David's wishes. Despite his loyalty to David in many battles, his violent actions eventually led Solomon to execute him.",
      "significance": "Joab exemplifies the complexity of flawed leadershipimmensely capable and loyal yet prone to violence and insubordination, showing that even great service doesn't excuse deliberate disobedience.",
      "key_events": [
        {
          "age": null,
          "event": "Led capture of Jerusalem",
          "verse": "2 Samuel 5:8"
        },
        {
          "age": null,
          "event": "Murdered Abner",
          "verse": "2 Samuel 3:27"
        },
        {
          "age": null,
          "event": "Killed Absalom against David's order",
          "verse": "2 Samuel 18:14"
        },
        {
          "age": null,
          "event": "Murdered Amasa",
          "verse": "2 Samuel 20:10"
        },
        {
          "age": null,
          "event": "Executed by Benaiah",
          "verse": "1 Kings 2:28-34"
        }
      ]
    },
    "Abishai": {
      "summary": "The son of Zeruiah and brother of Joab, Abishai was one of David's mighty men and a fierce warrior. He saved David's life in battle against a Philistine giant, wanted to kill Saul when they found him sleeping, and led various military campaigns. He remained loyal to David during Absalom's rebellion.",
      "significance": "Abishai represents fierce loyalty and courage, though like his brother Joab, his zeal sometimes needed to be restrained by wiser counsel.",
      "key_events": [
        {
          "age": null,
          "event": "Accompanied David to Saul's camp",
          "verse": "1 Samuel 26:6-9"
        },
        {
          "age": null,
          "event": "Defeated 18,000 Edomites",
          "verse": "1 Chronicles 18:12"
        },
        {
          "age": null,
          "event": "Saved David from Philistine giant",
          "verse": "2 Samuel 21:16-17"
        },
        {
          "age": null,
          "event": "Remained loyal during Absalom's rebellion",
          "verse": "2 Samuel 16:9"
        }
      ]
    },
    "Abinadab": {
      "summary": "One of the sons of Jesse and brother of David. When Samuel came to anoint the next king, Abinadab was presented but not chosen. Later, another Abinadab was the son of Saul who died with his father at Mount Gilboa. The ark of the covenant was also housed in the home of an Abinadab in Kiriath Jearim.",
      "significance": "Abinadab represents those passed over in God's sovereign choices, reminding us that God's selection is not based on human appearance or expectations.",
      "key_events": [
        {
          "age": null,
          "event": "Presented to Samuel but not chosen",
          "verse": "1 Samuel 16:8"
        }
      ]
    },
    "Eliab": {
      "summary": "The firstborn son of Jesse and oldest brother of David. When Samuel came to Jesse's house to anoint a king, Eliab's impressive appearance made Samuel think he was the chosen one, but God rejected him. Later, Eliab angrily accused David of presumption when David came to the battle against Goliath.",
      "significance": "Eliab's rejection teaches that God looks on the heart, not outward appearance, and that being firstborn or most impressive does not guarantee God's selection.",
      "key_events": [
        {
          "age": null,
          "event": "Presented to Samuel but rejected",
          "verse": "1 Samuel 16:6-7"
        },
        {
          "age": null,
          "event": "Rebuked David at Goliath battle",
          "verse": "1 Samuel 17:28"
        }
      ]
    },
    "Shimma": {
      "summary": "The third son of Jesse and brother of David, also called Shammah. He was among the brothers presented to Samuel but not chosen as king. Little else is recorded about him in Scripture.",
      "significance": "Shimma, like his other brothers, represents those who supported God's chosen king even when they themselves were passed over.",
      "key_events": [
        {
          "age": null,
          "event": "Presented to Samuel but not chosen",
          "verse": "1 Samuel 16:9"
        }
      ]
    },
    "Jehoshaphat": {
      "summary": "The fourth king of Judah and son of Asa, Jehoshaphat was one of the righteous kings who sought the Lord and removed high places and Asherim from Judah. He strengthened Judah's defenses, sent teachers throughout the land to instruct the people in God's law, and won a great victory when he led the people in worship before battle. However, he made unwise alliances with the wicked kings of Israel.",
      "significance": "Jehoshaphat demonstrates the importance of seeking God and teaching His word, but also warns against compromising alliances with those who reject God.",
      "key_events": [
        {
          "age": 35,
          "event": "Became king of Judah",
          "verse": "1 Kings 22:42"
        },
        {
          "age": null,
          "event": "Sent teachers to instruct people",
          "verse": "2 Chronicles 17:7-9"
        },
        {
          "age": null,
          "event": "Allied with Ahab against Ramoth Gilead",
          "verse": "1 Kings 22:4"
        },
        {
          "age": null,
          "event": "Won battle through worship",
          "verse": "2 Chronicles 20:20-23"
        },
        {
          "age": 60,
          "event": "Death after 25-year reign",
          "verse": "1 Kings 22:50"
        }
      ]
    },
    "Joram": {
      "summary": "The son of Jehoshaphat who became king of Judah, Joram walked in the evil ways of the kings of Israel because he married Athaliah, daughter of Ahab. He killed all his brothers to secure his throne, established high places, and led Judah into idolatry. He died of a horrible intestinal disease with no one mourning him.",
      "significance": "Joram's reign illustrates the destructive impact of ungodly marriages and the swift spiritual decline that can occur in a single generation when God's ways are abandoned.",
      "key_events": [
        {
          "age": 32,
          "event": "Became king of Judah",
          "verse": "2 Kings 8:17"
        },
        {
          "age": null,
          "event": "Murdered his brothers",
          "verse": "2 Chronicles 21:4"
        },
        {
          "age": null,
          "event": "Led Judah into idolatry",
          "verse": "2 Chronicles 21:11"
        },
        {
          "age": null,
          "event": "Received letter from Elijah",
          "verse": "2 Chronicles 21:12-15"
        },
        {
          "age": 40,
          "event": "Died of intestinal disease",
          "verse": "2 Chronicles 21:18-20"
        }
      ]
    },
    "Ahaziah": {
      "summary": "The son of Joram and Athaliah who became king of Judah at age 22, Ahaziah reigned only one year. Under his mother's evil influence, he walked in the ways of the house of Ahab. He allied with Joram of Israel against Syria and was killed by Jehu during God's judgment on Ahab's house.",
      "significance": "Ahaziah's brief, wicked reign shows how quickly evil influence can corrupt, and how association with the ungodly can lead to sharing in their judgment.",
      "key_events": [
        {
          "age": 22,
          "event": "Became king of Judah",
          "verse": "2 Kings 8:26"
        },
        {
          "age": null,
          "event": "Allied with Joram of Israel",
          "verse": "2 Kings 8:28-29"
        },
        {
          "age": 23,
          "event": "Killed by Jehu",
          "verse": "2 Kings 9:27-28"
        }
      ]
    },
    "Amaziah": {
      "summary": "The son of Joash who became king of Judah, Amaziah did what was right in the eyes of the Lord, but not wholeheartedly. He executed his father's murderers but spared their children, obeying God's law. After defeating Edom, he foolishly brought back their gods to worship. He challenged Israel's king to battle and was defeated and captured.",
      "significance": "Amaziah exemplifies the danger of incomplete devotion to God and the folly of pride, showing that past victories don't guarantee future success when God is abandoned.",
      "key_events": [
        {
          "age": 25,
          "event": "Became king of Judah",
          "verse": "2 Kings 14:2"
        },
        {
          "age": null,
          "event": "Defeated Edom",
          "verse": "2 Kings 14:7"
        },
        {
          "age": null,
          "event": "Worshiped Edomite gods",
          "verse": "2 Chronicles 25:14"
        },
        {
          "age": null,
          "event": "Defeated by Israel's king Jehoash",
          "verse": "2 Kings 14:11-14"
        },
        {
          "age": 54,
          "event": "Assassinated in Lachish",
          "verse": "2 Kings 14:19"
        }
      ]
    },
    "Azariah": {
      "summary": "Also known as Uzziah, the son of Amaziah who became king of Judah at age 16, Azariah sought God and prospered greatly. He strengthened Judah's military, built towers, and developed agriculture. However, in his pride, he unlawfully entered the temple to burn incense, and God struck him with leprosy. He remained leprous until his death, while his son Jotham governed.",
      "significance": "Azariah's life demonstrates that great success can lead to pride, and that God's holiness and priestly regulations must be respected regardless of one's position or past faithfulness.",
      "key_events": [
        {
          "age": 16,
          "event": "Became king of Judah",
          "verse": "2 Kings 15:2"
        },
        {
          "age": null,
          "event": "Built Elath and restored it to Judah",
          "verse": "2 Kings 14:22"
        },
        {
          "age": null,
          "event": "Sought God and prospered",
          "verse": "2 Chronicles 26:4-5"
        },
        {
          "age": null,
          "event": "Unlawfully burned incense, struck with leprosy",
          "verse": "2 Chronicles 26:16-21"
        },
        {
          "age": 68,
          "event": "Death",
          "verse": "2 Kings 15:7"
        }
      ]
    },
    "Jotham": {
      "summary": "The son of Uzziah (Azariah) who became king of Judah, Jotham did what was right in the Lord's eyes like his father, except he did not enter the temple unlawfully. He built extensively, including the Upper Gate of the temple, and defeated the Ammonites. However, the people continued in corrupt practices during his reign.",
      "significance": "Jotham represents faithful leadership that nevertheless cannot force righteousness upon an unwilling people, showing the limits of even good leadership when hearts are hard.",
      "key_events": [
        {
          "age": 25,
          "event": "Became king of Judah",
          "verse": "2 Kings 15:33"
        },
        {
          "age": null,
          "event": "Built the Upper Gate of temple",
          "verse": "2 Kings 15:35"
        },
        {
          "age": null,
          "event": "Defeated the Ammonites",
          "verse": "2 Chronicles 27:5"
        },
        {
          "age": 41,
          "event": "Death after 16-year reign",
          "verse": "2 Kings 15:38"
        }
      ]
    },
    "Ahaz": {
      "summary": "The son of Jotham who became king of Judah, Ahaz was one of the most wicked kings of Judah. He practiced idolatry, burned his sons as offerings, and desecrated the temple. When threatened by Syria and Israel, he appealed to Assyria rather than God, bringing Judah under Assyrian domination. He even made a replica of a pagan altar and placed it in God's temple.",
      "significance": "Ahaz exemplifies spiritual apostasy and the consequences of trusting in political alliances rather than God, demonstrating how far a leader can fall from his godly heritage.",
      "key_events": [
        {
          "age": 20,
          "event": "Became king of Judah",
          "verse": "2 Kings 16:2"
        },
        {
          "age": null,
          "event": "Sacrificed his sons to idols",
          "verse": "2 Kings 16:3"
        },
        {
          "age": null,
          "event": "Asked Assyria for help instead of God",
          "verse": "2 Kings 16:7-9"
        },
        {
          "age": null,
          "event": "Replaced temple altar with pagan copy",
          "verse": "2 Kings 16:10-16"
        },
        {
          "age": 36,
          "event": "Death",
          "verse": "2 Kings 16:2"
        }
      ]
    },
    "Amon": {
      "summary": "The son of Manasseh who became king of Judah at age 22, Amon did evil like his father but without Manasseh's later repentance. He worshiped idols, increased his guilt, and reigned only two years before his own servants assassinated him. His young son Josiah succeeded him and reversed his evil policies.",
      "significance": "Amon's brief, wicked reign demonstrates that evil patterns can be inherited but also that God can raise up righteous leaders from ungodly fathers.",
      "key_events": [
        {
          "age": 22,
          "event": "Became king of Judah",
          "verse": "2 Kings 21:19"
        },
        {
          "age": null,
          "event": "Worshiped idols like his father",
          "verse": "2 Kings 21:21"
        },
        {
          "age": 24,
          "event": "Assassinated by his servants",
          "verse": "2 Kings 21:23"
        }
      ]
    },
    "Jehoiakim": {
      "summary": "Originally named Eliakim, the son of Josiah who was placed on Judah's throne by Pharaoh Neco and renamed Jehoiakim. He was a wicked king who oppressed the people, built extravagant palaces with forced labor, and burned Jeremiah's scroll. He rebelled against Babylon, leading to Jerusalem's first deportation. He died in disgrace.",
      "significance": "Jehoiakim exemplifies arrogant rejection of God's word and the futility of resisting God's judgment, as his defiance only hastened Judah's destruction.",
      "key_events": [
        {
          "age": 25,
          "event": "Made king by Pharaoh Neco",
          "verse": "2 Kings 23:34"
        },
        {
          "age": null,
          "event": "Became Babylon's vassal",
          "verse": "2 Kings 24:1"
        },
        {
          "age": null,
          "event": "Burned Jeremiah's scroll",
          "verse": "Jeremiah 36:23"
        },
        {
          "age": null,
          "event": "Rebelled against Babylon",
          "verse": "2 Kings 24:1"
        },
        {
          "age": 36,
          "event": "Death",
          "verse": "2 Kings 23:36"
        }
      ]
    },
    "Jeconiah": {
      "summary": "Also known as Jehoiachin, the son of Jehoiakim who became king of Judah at age 18, Jeconiah reigned only three months before Nebuchadnezzar besieged Jerusalem and took him captive to Babylon. He was imprisoned for 37 years until Evil-Merodach released him and gave him honor. He appears in Matthew's genealogy of Jesus.",
      "significance": "Jeconiah represents God's judgment on David's line, yet God's faithfulness continues through him to bring the Messiah, showing grace even in judgment.",
      "key_events": [
        {
          "age": 18,
          "event": "Became king of Judah",
          "verse": "2 Kings 24:8"
        },
        {
          "age": 18,
          "event": "Surrendered to Nebuchadnezzar",
          "verse": "2 Kings 24:12"
        },
        {
          "age": 18,
          "event": "Taken captive to Babylon",
          "verse": "2 Kings 24:15"
        },
        {
          "age": 55,
          "event": "Released from prison by Evil-Merodach",
          "verse": "2 Kings 25:27-30"
        }
      ]
    },
    "Zedekiah": {
      "summary": "Originally named Mattaniah, the son of Josiah who was placed on Judah's throne by Nebuchadnezzar and renamed Zedekiah. Though warned repeatedly by Jeremiah, he was a weak king who vacillated between heeding the prophet and fearing his officials. His rebellion against Babylon led to Jerusalem's destruction, and he witnessed the execution of his sons before being blinded and taken to Babylon.",
      "significance": "Zedekiah exemplifies the tragedy of weak leadership and the severe consequences of refusing to heed God's warnings through His prophets.",
      "key_events": [
        {
          "age": 21,
          "event": "Made king by Nebuchadnezzar",
          "verse": "2 Kings 24:17-18"
        },
        {
          "age": null,
          "event": "Rebelled against Babylon",
          "verse": "2 Kings 24:20"
        },
        {
          "age": null,
          "event": "Jerusalem besieged",
          "verse": "2 Kings 25:1-2"
        },
        {
          "age": null,
          "event": "Sons killed, eyes blinded, taken to Babylon",
          "verse": "2 Kings 25:6-7"
        }
      ]
    },
    "Naamah": {
      "summary": "An Ammonitess who became the wife of King Solomon and mother of Rehoboam, who succeeded Solomon as king. As one of Solomon's many foreign wives, she represented the kind of marriage alliance that the law forbade and that eventually led Solomon's heart away from exclusive devotion to the Lord.",
      "significance": "Naamah exemplifies the foreign influences that corrupted Solomon's reign and contributed to the division of the kingdom under her son Rehoboam.",
      "key_events": [
        {
          "age": null,
          "event": "Became wife of Solomon",
          "verse": "1 Kings 14:21"
        },
        {
          "age": null,
          "event": "Mother of Rehoboam",
          "verse": "1 Kings 14:31"
        }
      ]
    },
    "Asenath": {
      "summary": "The daughter of Potipherah, priest of On, given to Joseph as his wife by Pharaoh. Though an Egyptian, she became the mother of Manasseh and Ephraim, who were adopted by Jacob and became two of the twelve tribes of Israel. Her marriage to Joseph represents God's plan extending beyond Israel's borders.",
      "significance": "Asenath's sons became full tribes of Israel, demonstrating that God's covenant blessings can extend to those who join themselves to His people, foreshadowing the inclusion of Gentiles.",
      "key_events": [
        {
          "age": null,
          "event": "Given to Joseph as wife by Pharaoh",
          "verse": "Genesis 41:45"
        },
        {
          "age": null,
          "event": "Bore Manasseh to Joseph",
          "verse": "Genesis 41:50-51"
        },
        {
          "age": null,
          "event": "Bore Ephraim to Joseph",
          "verse": "Genesis 41:52"
        }
      ]
    },
    "Ahinoam": {
      "summary": "A woman from Jezreel who became one of David's wives while he was fleeing from Saul. She bore David his firstborn son Amnon. Ahinoam accompanied David during his time with the Philistines and was among those captured by the Amalekites at Ziklag and subsequently rescued.",
      "significance": "As mother of Amnon, David's firstborn and heir apparent, Ahinoam's son became central to the tragic family conflicts that plagued David's house.",
      "key_events": [
        {
          "age": null,
          "event": "Became David's wife",
          "verse": "1 Samuel 25:43"
        },
        {
          "age": null,
          "event": "Captured by Amalekites at Ziklag",
          "verse": "1 Samuel 30:5"
        },
        {
          "age": null,
          "event": "Rescued by David",
          "verse": "1 Samuel 30:18"
        },
        {
          "age": null,
          "event": "Bore Amnon to David",
          "verse": "2 Samuel 3:2"
        }
      ]
    },
    "Abigail": {
      "summary": "The intelligent and beautiful wife of the wealthy but foolish Nabal. When Nabal refused to help David and his men, Abigail wisely intervened with generous provisions, preventing David from taking vengeance. After Nabal's sudden death, she became David's wife and bore him a son, Chileab.",
      "significance": "Abigail exemplifies godly wisdom, discernment, and courage in crisis. Her intervention saved her household and kept David from sinning, demonstrating how a wise woman builds her house.",
      "key_events": [
        {
          "age": null,
          "event": "Intervened to prevent David's vengeance",
          "verse": "1 Samuel 25:18-35"
        },
        {
          "age": null,
          "event": "Nabal died after hearing of her actions",
          "verse": "1 Samuel 25:37-38"
        },
        {
          "age": null,
          "event": "Became David's wife",
          "verse": "1 Samuel 25:39-42"
        },
        {
          "age": null,
          "event": "Bore Chileab to David",
          "verse": "2 Samuel 3:3"
        }
      ]
    },
    "Abital": {
      "summary": "One of David's wives, mentioned in the lists of David's sons born in Hebron. She was the mother of Shephatiah, David's fifth son. Little else is recorded about her in Scripture.",
      "significance": "Abital represents one of David's multiple marriages during his reign in Hebron, before he moved the capital to Jerusalem.",
      "key_events": [
        {
          "age": null,
          "event": "Bore Shephatiah to David in Hebron",
          "verse": "2 Samuel 3:4"
        }
      ]
    },
    "Eglah": {
      "summary": "One of David's wives, described as 'David's wife' in an unusual way that has led some to speculate she might be another name for Michal. She was the mother of Ithream, David's sixth son born in Hebron.",
      "significance": "Eglah was among David's wives during his reign in Hebron, contributing to the expansion of his household and dynasty.",
      "key_events": [
        {
          "age": null,
          "event": "Bore Ithream to David in Hebron",
          "verse": "2 Samuel 3:5"
        }
      ]
    },
    "Haggith": {
      "summary": "One of David's wives and the mother of Adonijah, David's fourth son. Her son Adonijah was known for his good looks and later attempted to seize the throne as David aged, leading to his eventual execution by Solomon.",
      "significance": "As Adonijah's mother, Haggith witnessed her son's ambition and failed coup attempt, illustrating the family strife that marked David's later years.",
      "key_events": [
        {
          "age": null,
          "event": "Bore Adonijah to David in Hebron",
          "verse": "2 Samuel 3:4"
        },
        {
          "age": null,
          "event": "Her son attempted to seize throne",
          "verse": "1 Kings 1:5-11"
        }
      ]
    },
    "Adah": {
      "summary": "One of the two wives of Lamech, a descendant of Cain. Adah was the mother of Jabal, who became the father of those who dwell in tents and have livestock, and Jubal, the father of those who play the harp and flute. She represents the early development of human civilization and culture.",
      "significance": "Through her sons, Adah's family pioneered pastoral life and music, showing early human development of culture and the arts despite living under the curse of sin.",
      "key_events": [
        {
          "age": null,
          "event": "Bore Jabal, father of tent-dwellers",
          "verse": "Genesis 4:20"
        },
        {
          "age": null,
          "event": "Bore Jubal, father of musicians",
          "verse": "Genesis 4:21"
        }
      ]
    },
    "Zillah": {
      "summary": "The second wife of Lamech and mother of Tubal-cain, who forged implements of bronze and iron, and his sister Naamah. Zillah's family represents the advancement of metalworking technology in the pre-flood world.",
      "significance": "Through Tubal-cain, Zillah's lineage contributed to technological advancement in metalworking, demonstrating human ingenuity even in a fallen world.",
      "key_events": [
        {
          "age": null,
          "event": "Bore Tubal-cain, forger of bronze and iron",
          "verse": "Genesis 4:22"
        },
        {
          "age": null,
          "event": "Bore Naamah",
          "verse": "Genesis 4:22"
        }
      ]
    },
    "Hagar": {
      "summary": "Sarah's Egyptian maidservant who became Abraham's concubine at Sarah's suggestion when Sarah was barren. Hagar bore Abraham his first son, Ishmael. After mistreating her, Sarah drove her away, but God met Hagar in the wilderness and promised to make Ishmael into a great nation. Years later, after Isaac's birth, Hagar and Ishmael were sent away permanently but received God's provision and promise.",
      "significance": "Hagar's story demonstrates God's care for the outcast and oppressed, and Paul uses her story as an allegory of the difference between law and promise, slavery and freedom.",
      "key_events": [
        {
          "age": null,
          "event": "Given to Abraham by Sarah",
          "verse": "Genesis 16:3"
        },
        {
          "age": null,
          "event": "Fled from Sarah's harsh treatment",
          "verse": "Genesis 16:6"
        },
        {
          "age": null,
          "event": "Angel found her and sent her back",
          "verse": "Genesis 16:7-9"
        },
        {
          "age": null,
          "event": "Bore Ishmael to Abraham",
          "verse": "Genesis 16:15"
        },
        {
          "age": null,
          "event": "Sent away with Ishmael",
          "verse": "Genesis 21:14"
        },
        {
          "age": null,
          "event": "God provided water and renewed promise",
          "verse": "Genesis 21:17-20"
        }
      ]
    },
    "Keturah": {
      "summary": "A woman who became Abraham's wife after Sarah's death. She bore Abraham six sons: Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. Abraham gave gifts to these sons but sent them away from Isaac to the east country, ensuring Isaac would be his sole heir of the covenant promise.",
      "significance": "Keturah's sons became the ancestors of various Arabian tribes, including the Midianites, demonstrating the fulfillment of God's promise to make Abraham a father of many nations beyond the covenant line through Isaac.",
      "key_events": [
        {
          "age": null,
          "event": "Became Abraham's wife",
          "verse": "Genesis 25:1"
        },
        {
          "age": null,
          "event": "Bore six sons to Abraham",
          "verse": "Genesis 25:2"
        },
        {
          "age": null,
          "event": "Sons sent away from Isaac",
          "verse": "Genesis 25:6"
        }
      ]
    },
    "Terah": {
      "summary": "The father of Abram (Abraham), Nahor, and Haran, Terah lived in Ur of the Chaldeans. After Haran died, Terah took his family including Abram and Sarai and set out for Canaan but settled in Haran instead. He died there at age 205 before Abraham continued to Canaan at God's call.",
      "significance": "Terah represents the transition from idolatry to faith, as his family came from a pagan background but through Abraham became the line through which God would bless all nations.",
      "key_events": [
        {
          "age": 70,
          "event": "Became father of Abram, Nahor, and Haran",
          "verse": "Genesis 11:26"
        },
        {
          "age": null,
          "event": "Left Ur of the Chaldeans",
          "verse": "Genesis 11:31"
        },
        {
          "age": null,
          "event": "Settled in Haran",
          "verse": "Genesis 11:31"
        },
        {
          "age": 205,
          "event": "Death in Haran",
          "verse": "Genesis 11:32"
        }
      ]
    },
    "Nahor": {
      "summary": "The brother of Abraham and son of Terah, Nahor married Milcah and remained in Mesopotamia when Abraham left for Canaan. His descendants included Bethuel (father of Rebekah) and Laban, making him the grandfather of both Rebekah and Rachel, who married into Abraham's line.",
      "significance": "Nahor's family remained in Mesopotamia and became the source of wives for Isaac and Jacob, maintaining family ties while preserving separation from Canaanite influences.",
      "key_events": [
        {
          "age": null,
          "event": "Married Milcah",
          "verse": "Genesis 11:29"
        },
        {
          "age": null,
          "event": "Father of Bethuel",
          "verse": "Genesis 22:23"
        },
        {
          "age": null,
          "event": "Grandfather of Rebekah",
          "verse": "Genesis 24:15"
        }
      ]
    },
    "Eber": {
      "summary": "A descendant of Shem and ancestor of Abraham, Eber lived 464 years and was the great-grandson of Shem. The Hebrews were named after him, as 'Hebrew' (Ibri) derives from his name. He was the father of Peleg, in whose days the earth was divided, likely referring to the division at Babel.",
      "significance": "Eber gave his name to the Hebrew people and represents a key link in the line from Noah to Abraham, preserving the godly line through the post-flood world.",
      "key_events": [
        {
          "age": 34,
          "event": "Became father of Peleg",
          "verse": "Genesis 11:16"
        },
        {
          "age": 464,
          "event": "Death",
          "verse": "Genesis 11:17"
        }
      ]
    },
    "Peleg": {
      "summary": "The son of Eber, Peleg's name means 'division' because 'in his days the earth was divided,' likely referring to the division of languages and scattering of peoples at the Tower of Babel. He lived 239 years and was an ancestor of Abraham.",
      "significance": "Peleg's lifetime marks the crucial moment when humanity was divided by language and scattered across the earth, ending the unified rebellion at Babel.",
      "key_events": [
        {
          "age": 0,
          "event": "Birth; earth divided in his days",
          "verse": "Genesis 10:25"
        },
        {
          "age": 30,
          "event": "Became father of Reu",
          "verse": "Genesis 11:18"
        },
        {
          "age": 239,
          "event": "Death",
          "verse": "Genesis 11:19"
        }
      ]
    },
    "Cainan": {
      "summary": "Also spelled Kenan, the son of Enosh and great-grandson of Adam, Cainan lived 910 years. He was the father of Mahalaleel and an ancestor of Noah and Abraham. His name means 'possession' or 'acquired.'",
      "significance": "Cainan represents the continuation of the godly line from Seth through the antediluvian patriarchs, preserving the knowledge of God before the flood.",
      "key_events": [
        {
          "age": 70,
          "event": "Became father of Mahalaleel",
          "verse": "Genesis 5:12"
        },
        {
          "age": 910,
          "event": "Death",
          "verse": "Genesis 5:14"
        }
      ]
    },
    "Jared": {
      "summary": "The father of Enoch who walked with God, Jared lived 962 years, making him one of the longest-lived patriarchs. His name may mean 'descent' or 'one who descends.' He was part of the godly line from Adam through Seth to Noah.",
      "significance": "Jared represents the faithful preservation of the godly line and was the father of Enoch, who was taken by God without seeing death.",
      "key_events": [
        {
          "age": 162,
          "event": "Became father of Enoch",
          "verse": "Genesis 5:18"
        },
        {
          "age": 962,
          "event": "Death",
          "verse": "Genesis 5:20"
        }
      ]
    },
    "Ham": {
      "summary": "One of Noah's three sons, Ham survived the flood with his family in the ark. After the flood, Ham saw his father Noah's nakedness and told his brothers rather than covering him, leading to a curse on his son Canaan. Ham became the father of Cush, Mizraim (Egypt), Put, and Canaan.",
      "significance": "Ham's descendants populated Africa and Canaan, and his disrespect toward his father led to the curse on Canaan, explaining the later conflict between Israel and the Canaanites.",
      "key_events": [
        {
          "age": null,
          "event": "Born to Noah",
          "verse": "Genesis 5:32"
        },
        {
          "age": null,
          "event": "Entered the ark",
          "verse": "Genesis 7:13"
        },
        {
          "age": null,
          "event": "Survived the flood",
          "verse": "Genesis 8:18"
        },
        {
          "age": null,
          "event": "Saw Noah's nakedness; Canaan cursed",
          "verse": "Genesis 9:22-25"
        }
      ]
    },
    "Japheth": {
      "summary": "One of Noah's three sons and apparently the oldest, Japheth survived the flood in the ark. When his father Noah was drunk and uncovered, Japheth and Shem respectfully covered him without looking. Japheth became the father of seven sons who populated the coastal lands and islands, including much of Europe and Asia Minor.",
      "significance": "Japheth's descendants spread throughout Europe and parts of Asia, and Noah's blessing on him that he would 'dwell in the tents of Shem' suggests future inclusion of Gentiles in God's covenant blessings.",
      "key_events": [
        {
          "age": null,
          "event": "Born to Noah",
          "verse": "Genesis 5:32"
        },
        {
          "age": null,
          "event": "Entered the ark",
          "verse": "Genesis 7:13"
        },
        {
          "age": null,
          "event": "Survived the flood",
          "verse": "Genesis 8:18"
        },
        {
          "age": null,
          "event": "Covered Noah with Shem",
          "verse": "Genesis 9:23"
        },
        {
          "age": null,
          "event": "Received Noah's blessing",
          "verse": "Genesis 9:27"
        }
      ]
    },
    "Lamech": {
      "summary": "The father of Noah and son of Methuselah, Lamech lived 777 years. When Noah was born, Lamech prophesied that his son would bring comfort from the curse on the ground, naming him Noah (meaning 'rest' or 'comfort'). Lamech died five years before the flood.",
      "significance": "Lamech's prophecy about Noah reveals faith in God's eventual relief from the curse, which was partially fulfilled through the flood's judgment and the new beginning after.",
      "key_events": [
        {
          "age": 182,
          "event": "Became father of Noah",
          "verse": "Genesis 5:28-29"
        },
        {
          "age": null,
          "event": "Prophesied comfort through Noah",
          "verse": "Genesis 5:29"
        },
        {
          "age": 777,
          "event": "Death (5 years before the flood)",
          "verse": "Genesis 5:31"
        }
      ]
    },
    "Rehoboam": {
      "summary": "The son of Solomon and Naamah, Rehoboam became king of Israel at age 41 after his father's death. When the people asked him to lighten the heavy burdens Solomon had imposed, Rehoboam foolishly rejected the counsel of elders and followed young advisors, threatening even harsher treatment. This led to the rebellion of the ten northern tribes, leaving Rehoboam ruling only Judah and Benjamin. His reign saw invasions and continued idolatry.",
      "significance": "Rehoboam's foolish pride divided the united kingdom of Israel, fulfilling God's judgment on Solomon's idolatry and creating the separate kingdoms of Israel and Judah.",
      "key_events": [
        {
          "age": 41,
          "event": "Became king after Solomon",
          "verse": "1 Kings 14:21"
        },
        {
          "age": 41,
          "event": "Rejected elders' wise counsel",
          "verse": "1 Kings 12:8"
        },
        {
          "age": 41,
          "event": "Ten tribes rebelled; kingdom divided",
          "verse": "1 Kings 12:16-17"
        },
        {
          "age": 46,
          "event": "Shishak of Egypt invaded Judah",
          "verse": "1 Kings 14:25"
        },
        {
          "age": 58,
          "event": "Death after 17-year reign",
          "verse": "1 Kings 14:21"
        }
      ]
    },
    "Asa": {
      "summary": "The third king of Judah and son of Abijah, Asa did what was right in the Lord's eyes like his ancestor David. He removed male cult prostitutes, destroyed idols, and even removed his grandmother Maacah from being queen mother because of her Asherah pole. Asa defeated the Ethiopian army through faith in God, and Judah enjoyed peace for much of his reign. However, later he relied on Syria instead of God and imprisoned the prophet who rebuked him.",
      "significance": "Asa exemplifies a king who began well with wholehearted devotion to God but ended poorly by trusting in human alliances rather than God, showing the importance of finishing well.",
      "key_events": [
        {
          "age": null,
          "event": "Became king of Judah",
          "verse": "1 Kings 15:9"
        },
        {
          "age": null,
          "event": "Removed idols and cult prostitutes",
          "verse": "1 Kings 15:12"
        },
        {
          "age": null,
          "event": "Deposed grandmother for idolatry",
          "verse": "1 Kings 15:13"
        },
        {
          "age": null,
          "event": "Defeated Ethiopian army",
          "verse": "2 Chronicles 14:9-15"
        },
        {
          "age": null,
          "event": "Made covenant to seek the Lord",
          "verse": "2 Chronicles 15:12"
        },
        {
          "age": null,
          "event": "Allied with Syria instead of trusting God",
          "verse": "2 Chronicles 16:2-7"
        },
        {
          "age": null,
          "event": "Imprisoned prophet Hanani",
          "verse": "2 Chronicles 16:10"
        },
        {
          "age": null,
          "event": "Death after 41-year reign",
          "verse": "1 Kings 15:10"
        }
      ]
    },
    "Korah": {
      "summary": "A Levite who led a rebellion against Moses and Aaron, challenging their leadership and the priestly authority God had established. Along with Dathan, Abiram, and 250 leaders of Israel, Korah claimed that all the congregation was holy and questioned why Moses and Aaron exalted themselves. God vindicated His chosen leaders by causing the earth to open and swallow Korah and his followers, and fire consumed the 250 who offered incense.",
      "significance": "Korah's rebellion demonstrates the serious consequences of challenging God's appointed authority and the priesthood He established, serving as a warning against presumption and envy.",
      "key_events": [
        {
          "age": null,
          "event": "Led rebellion against Moses and Aaron",
          "verse": "Numbers 16:1-3"
        },
        {
          "age": null,
          "event": "Challenged priestly authority",
          "verse": "Numbers 16:8-11"
        },
        {
          "age": null,
          "event": "Earth opened and swallowed him",
          "verse": "Numbers 16:31-33"
        },
        {
          "age": null,
          "event": "Fire consumed the 250 offering incense",
          "verse": "Numbers 16:35"
        }
      ]
    }
  },
  "aliases": {
    "Noah or Noe": "Noah",
    "Noe": "Noah",
    "Sarai or Sarah": "Sarah",
    "Sarai": "Sarah",
    "Abraham's wife Sarah": "Sarah",
    "Jacob or Israel": "Jacob",
    "Israel": "Jacob",
    "Abram or Abraham": "Abraham",
    "Abram": "Abraham",
    "Bashemath (I) or Adah": "Adah",
    "Bashemath (I)": "Adah",
    "Bathshua or Bathsheba": "Bathsheba",
    "Bathshua": "Bathsheba",
    "Booz or Boaz": "Boaz",
    "Booz": "Boaz",
    "Cainan or Kenan": "Cainan",
    "Kenan": "Cainan",
    "Chelubai or Caleb": "Caleb",
    "Chelubai": "Caleb",
    "Eber or Heber": "Eber",
    "Heber": "Eber",
    "Enoch or Henoch": "Enoch",
    "Henoch": "Enoch",
    "Jared or Jered": "Jared",
    "Jered": "Jared",
    "Jehoshaphat or Josaphat": "Jehoshaphat",
    "Josaphat": "Jehoshaphat",
    "Joram or Jehoram": "Joram",
    "Jehoram": "Joram",
    "Juda or Judah or Judas": "Judah",
    "Juda": "Judah",
    "Judas": "Judah",
    "Mathusala or Methuselah": "Methuselah",
    "Mathusala": "Methuselah",
    "Nahor or Nachor": "Nahor",
    "Nachor": "Nahor",
    "Peleg or Phalec": "Peleg",
    "Phalec": "Peleg",
    "Rehoboam or Roboam": "Rehoboam",
    "Roboam": "Rehoboam",
    "Shem or Sem": "Shem",
    "Sem": "Shem",
    "Tamar or Thamar": "Tamar",
    "Thamar": "Tamar",
    "Terah or Thara": "Terah",
    "Thara": "Terah"
  }
}