{
  "category": "Ruth & Redemption",
  "slug": "ruth-and-redemption",
  "description": "The beautiful story of Ruth's loyalty, Boaz's redemption, and God's providence—showing how a Moabite widow became part of the lineage of Christ.",
  "stories": [
    {
      "title": "Naomi's Loss and Return",
      "slug": "naomis-loss-and-return",
      "description": "A famine drives Naomi's family to Moab, where tragedy strikes. Years later, she returns to Bethlehem empty—but not alone.",
      "verses": [
        "Ruth 1:1-22"
      ],
      "themes": [
        "Loss",
        "Providence",
        "Loyalty",
        "Faith",
        "Bitterness"
      ],
      "characters": [
        "Naomi",
        "Elimelech",
        "Mahlon",
        "Chilion",
        "Ruth",
        "Orpah"
      ],
      "narrative": "In the days when the judges ruled, a famine struck the land of Israel. A man named Elimelech from Bethlehem—ironically, 'house of bread'—took his wife Naomi and their two sons, Mahlon and Chilion, to sojourn in the fields of Moab. It was meant to be temporary, a survival strategy during hardship.\n\nBut sojourning turned to settling. In Moab, Elimelech died, leaving Naomi widowed in a foreign land. Her two sons married Moabite women—Orpah and Ruth. For ten years they lived there, but then tragedy struck again. Both Mahlon and Chilion died, leaving three widows with no husbands, no children, no protection, and no future.\n\nNaomi heard that the Lord had come to the aid of His people by providing food for them in Judah. The famine had ended. So she prepared to return from Moab with her two daughters-in-law. They set out on the road that would take them back to Judah.\n\nBut on the journey, Naomi stopped. 'Go back, each of you, to your mother's home,' she urged them. 'May the Lord show you kindness, as you have shown kindness to your dead husbands and to me. May the Lord grant that each of you will find rest in the home of another husband.'\n\nShe kissed them goodbye, and they wept aloud. Both initially insisted, 'We will go back with you to your people.' But Naomi pressed them. 'Return home, my daughters. Why would you come with me? Am I going to have any more sons who could become your husbands? Even if I thought there was still hope for me—even if I had a husband tonight and then gave birth to sons—would you wait until they grew up? No, my daughters. It is more bitter for me than for you, because the Lord's hand has turned against me!'\n\nThis was the ancient law of levirate marriage—a brother-in-law could marry his brother's widow to preserve the family line. But Naomi had no more sons. She had nothing to offer.\n\nAt this they wept aloud again. Then Orpah kissed her mother-in-law goodbye, turned, and went back to her people and her gods. It was a reasonable choice, a practical choice. But Ruth clung to Naomi.\n\n'Look,' said Naomi, 'your sister-in-law is going back to her people and her gods. Go back with her.'\n\nBut Ruth spoke words that have echoed through the centuries: 'Don't urge me to leave you or to turn back from you. Where you go I will go, and where you stay I will stay. Your people will be my people and your God my God. Where you die I will die, and there I will be buried. May the Lord deal with me, be it ever so severely, if even death separates you and me.'\n\nThis was covenant language, a vow of complete and permanent loyalty. Ruth was not merely accompanying Naomi out of duty; she was embracing Naomi's people and Naomi's God. A Moabite woman was choosing the God of Israel, abandoning her homeland, her family, her security, and her future prospects.\n\nWhen Naomi realized that Ruth was determined to go with her, she stopped urging her. So the two of them went on until they came to Bethlehem.\n\nWhen they arrived, the whole town was stirred. The women exclaimed, 'Can this be Naomi?'\n\n'Don't call me Naomi,' she told them. Naomi means 'pleasant.' 'Call me Mara, because the Almighty has made my life very bitter. I went away full, but the Lord has brought me back empty. Why call me Naomi? The Lord has afflicted me; the Almighty has brought misfortune upon me.'\n\nSo Naomi returned from Moab accompanied by Ruth the Moabite, her daughter-in-law, arriving in Bethlehem as the barley harvest was beginning.\n\nNaomi saw herself as empty, but she was wrong. The faithful God was already at work. The harvest was beginning—both in the fields and in the purposes of God. And Ruth, the foreigner who clung to Naomi and to Naomi's God, would prove to be the key to redemption that Naomi could not yet see.",
      "kids_title": "Ruth Stays with Naomi",
      "kids_description": "Naomi's family moved to a different country, but sad things happened and Naomi's husband and sons died. When Naomi went back home, her daughter-in-law Ruth wouldn't leave her.",
      "kids_narrative": "Naomi lived in a town called Bethlehem with her husband and two sons. But there was no food growing, so they moved to a different country called Moab.\n\nIn Moab, Naomi's sons grew up and got married. One son married a woman named Ruth. But then very sad things happened. Naomi's husband died. Then both her sons died too.\n\nNow Naomi was so sad. She had no husband and no sons. She heard that back home in Bethlehem, food was growing again. 'I should go home,' she thought.\n\nNaomi's two daughters-in-law started walking with her. But Naomi said, 'You should go back to your own families. You've been so kind to me, but I can't help you anymore. Go find new husbands in your own country.'\n\nOrpah, one daughter-in-law, hugged Naomi goodbye and went home. But Ruth said, 'NO! I won't leave you!'\n\nNaomi said, 'Your sister went back. You should too.'\n\nBut Ruth said something beautiful: 'Don't ask me to leave you! Where you go, I'll go. Where you live, I'll live. Your people will be my people. Your God will be MY God. I will stay with you forever!'\n\nRuth loved Naomi SO much. And Ruth wanted to worship Naomi's God—the one true God.\n\nSo Naomi and Ruth walked all the way to Bethlehem together. When they got there, people were surprised. 'Is that Naomi?'\n\nNaomi was sad. 'I left with my whole family. Now I'm coming back with nothing.'\n\nBut Naomi was wrong! She had Ruth, who loved her and loved God. And they arrived just when the harvest was starting. Good things were about to happen!"
    },
    {
      "title": "Ruth Meets Boaz",
      "slug": "ruth-meets-boaz",
      "description": "Ruth gleans in the fields to provide for Naomi, and 'happens' to work in the field of Boaz, a wealthy relative who shows her extraordinary kindness.",
      "verses": [
        "Ruth 2:1-23"
      ],
      "themes": [
        "Providence",
        "Hard work",
        "Kindness",
        "Redemption",
        "God's care for the poor"
      ],
      "characters": [
        "Ruth",
        "Boaz",
        "Naomi",
        "The harvesters"
      ],
      "narrative": "Now Naomi had a relative on her husband's side, a man of standing from the clan of Elimelech, whose name was Boaz. His name meant 'in him is strength,' and he was a man of noble character, a man of wealth and position.\n\nRuth the Moabite said to Naomi, 'Let me go to the fields and pick up the leftover grain behind anyone in whose eyes I find favor.' Naomi said to her, 'Go ahead, my daughter.' This was the provision of the Mosaic law—the poor, the widow, the orphan, and the foreigner could glean the edges of fields and gather what the harvesters left behind. It was backbreaking work, and it identified Ruth as destitute.\n\nSo Ruth went out, entered a field, and began to glean behind the harvesters. As it turned out, she was working in a field belonging to Boaz, who was from the clan of Elimelech.\n\n'As it turned out'—Scripture uses this casual phrase to describe what was actually divine providence. Ruth didn't know whose field it was. She couldn't have planned this. But the sovereign God was orchestrating events.\n\nJust then Boaz arrived from Bethlehem and greeted the harvesters, 'The Lord be with you!' 'The Lord bless you!' they answered. Here was a godly man who spoke blessings over his workers.\n\nBoaz noticed Ruth and asked the overseer, 'Who does that young woman belong to?' The overseer replied, 'She is the Moabite who came back from Moab with Naomi. She said, \"Please let me glean and gather among the sheaves behind the harvesters.\" She came into the field and has remained here from morning till now, except for a short rest in the shelter.'\n\nBoaz had already heard about Ruth. He went to her and said, 'My daughter, listen to me. Don't go and glean in another field and don't go away from here. Stay here with the women who work for me. Watch the field where the men are harvesting, and follow along after the women. I have told the men not to lay a hand on you. And whenever you are thirsty, go and get a drink from the water jars the men have filled.'\n\nAt this, Ruth bowed down with her face to the ground. 'Why have I found such favor in your eyes that you notice me—a foreigner?'\n\nBoaz replied, 'I've been told all about what you have done for your mother-in-law since the death of your husband—how you left your father and mother and your homeland and came to live with a people you did not know before. May the Lord repay you for what you have done. May you be richly rewarded by the Lord, the God of Israel, under whose wings you have come to take refuge.'\n\nBeautiful imagery—Ruth, the foreigner, had come under the wings of the God of Israel. Like a baby bird finding shelter, she had sought refuge in the one true God. And Boaz was asking the Lord to reward her faithfulness.\n\n'May I continue to find favor in your eyes, my lord,' Ruth said. 'You have put me at ease by speaking kindly to your servant—though I do not have the standing of one of your servants.'\n\nAt mealtime Boaz invited her, 'Come over here. Have some bread and dip it in the wine vinegar.' When she sat down with the harvesters, he offered her roasted grain. She ate all she wanted and had some left over.\n\nAs she got up to glean, Boaz gave orders to his men, 'Let her gather among the sheaves and don't reprimand her. Even pull out some stalks for her from the bundles and leave them for her to pick up, and don't rebuke her.'\n\nSo Ruth gleaned in the field until evening. When she beat out what she had gathered, she had about an ephah of barley—over half a bushel, far more than a gleaner could normally collect. She carried it back to town, and her mother-in-law saw how much she had gathered.\n\nNaomi asked her, 'Where did you glean today? Where did you work? Blessed be the man who took notice of you!'\n\nRuth told her about Boaz. Then Naomi said to her daughter-in-law, 'The Lord bless him! He has not stopped showing his kindness to the living and the dead.' She added, 'That man is our close relative; he is one of our guardian-redeemers.'\n\nA kinsman-redeemer—a go'el in Hebrew. This was a relative who could buy back family land that had been sold due to poverty, who could redeem a relative sold into slavery, who could marry a widow to preserve the family line and inheritance. The kinsman-redeemer was both able and willing to pay the price of redemption.\n\nRuth stayed close to the women of Boaz to glean until the barley and wheat harvests were finished. And she lived with her mother-in-law. For about three months, she worked faithfully, and Boaz watched and showed her favor. The stage was set for redemption.",
      "kids_title": "Ruth Works Hard and Meets Boaz",
      "kids_description": "Ruth worked hard picking up leftover grain in the fields so she and Naomi could eat. A kind man named Boaz owned the field and helped her in special ways.",
      "kids_narrative": "Ruth and Naomi were in Bethlehem, but they had no food and no money. Ruth said, 'Let me go to the fields. I can pick up the leftover grain that the workers drop. That way we'll have food!'\n\nNaomi said, 'Okay, go ahead.'\n\nRuth went to a field and started picking up grain. It was hot, hard work. She bent down again and again, picking up pieces of grain from the ground.\n\nShe didn't know it, but the field belonged to a nice man named Boaz. And Boaz was part of Naomi's family!\n\nBoaz came to check on his workers. He saw Ruth. 'Who is that?' he asked.\n\n'That's Ruth. She came from Moab to take care of Naomi. She's been working hard all day!'\n\nBoaz went over to Ruth. 'Stay in my field,' he said kindly. 'Don't go anywhere else. Stay with my workers. They'll keep you safe. When you're thirsty, drink from our water jars.'\n\nRuth was so surprised! She bowed down. 'Why are you being so kind to me? I'm from a different country!'\n\nBoaz said, 'I heard about you! I heard how you left everything to take care of Naomi. I heard how you chose to follow the true God. May God bless you for being so good!'\n\n'Thank you!' said Ruth. 'You're so kind!'\n\nAt lunch time, Boaz invited Ruth to eat with him! He gave her bread and grain. She ate until she was full and even had extra to take home.\n\nThen Boaz told his workers secretly, 'Drop extra grain for Ruth to find. Make it easy for her to pick up lots of grain.'\n\nRuth worked until evening. When she measured the grain she'd picked up, she had SO much! Way more than she expected!\n\nShe carried it home to Naomi. Naomi's eyes got big. 'Where did you work? Who helped you?'\n\n'A man named Boaz!' said Ruth.\n\nNaomi smiled for the first time in a long time. 'Boaz! He's part of our family! God is being so good to us!'\n\nRuth kept working in Boaz's field all summer long. Boaz was always kind to her. God was taking care of Ruth and Naomi!"
    },
    {
      "title": "Ruth at the Threshing Floor",
      "slug": "ruth-at-the-threshing-floor",
      "description": "Naomi devises a plan for Ruth to appeal to Boaz as her kinsman-redeemer. In an act of faith and courage, Ruth asks Boaz to spread his covering over her.",
      "verses": [
        "Ruth 3:1-18"
      ],
      "themes": [
        "Redemption",
        "Boldness",
        "Purity",
        "Trust",
        "Marriage"
      ],
      "characters": [
        "Ruth",
        "Naomi",
        "Boaz"
      ],
      "narrative": "One day Ruth's mother-in-law Naomi said to her, 'My daughter, I must find a home for you, where you will be well provided for. Now Boaz, with whose women you have worked, is a relative of ours. Tonight he will be winnowing barley on the threshing floor.'\n\nThe harvest was complete. At the threshing floor, grain would be separated from chaff by throwing it into the air so the wind could blow away the lighter chaff. It was celebratory work, often done in the cool of evening. Boaz would sleep there to guard the grain.\n\nNaomi gave Ruth careful instructions: 'Wash, put on perfume, and get dressed in your best clothes. Then go down to the threshing floor, but don't let him know you are there until he has finished eating and drinking. When he lies down, note the place where he is lying. Then go and uncover his feet and lie down. He will tell you what to do.'\n\nThis was not a seduction but a symbolic request for marriage. To lie at someone's feet was a position of humility and submission. To uncover his feet was to make him vulnerable—he would feel the cold and wake. Ruth would be asking Boaz to cover her as her kinsman-redeemer, using the same Hebrew word for 'covering' that described taking a wife.\n\n'I will do whatever you say,' Ruth answered. She trusted both Naomi and God's providence.\n\nSo she went down to the threshing floor and did everything her mother-in-law told her to do. When Boaz had finished eating and drinking and was in good spirits, he went over to lie down at the far end of the grain pile. Ruth approached quietly, uncovered his feet, and lay down.\n\nIn the middle of the night something startled the man; he turned—and there was a woman lying at his feet! 'Who are you?' he asked.\n\n'I am your servant Ruth,' she said. 'Spread the corner of your garment over me, since you are a guardian-redeemer of our family.'\n\nShe was asking him to marry her, to be her kinsman-redeemer, to fulfill the law and preserve the family line. It was bold, unconventional, and completely proper. Ruth had proven her character through months of faithful work. Boaz had shown his godly character through months of faithful protection and provision.\n\n'The Lord bless you, my daughter,' he replied. 'This kindness is greater than that which you showed earlier: You have not run after the younger men, whether rich or poor. And now, my daughter, don't be afraid. I will do for you all you ask. All the people of my town know that you are a woman of noble character.'\n\nBoaz recognized the hesed, the covenant loyalty, Ruth was showing. She could have pursued younger men. She was choosing to preserve her deceased husband's family line. She was acting in accordance with God's law and for the blessing of Naomi.\n\n'Although it is true that I am a guardian-redeemer of our family, there is another who is more closely related than I. Stay here for the night, and in the morning if he wants to do his duty as your guardian-redeemer, good; let him redeem you. But if he is not willing, as surely as the Lord lives I will do it. Lie here until morning.'\n\nBoaz would follow the law properly. There was a nearer kinsman with first right of redemption. Boaz would give him the opportunity. But if that man declined, Boaz was ready and willing to redeem Ruth.\n\nSo she lay at his feet until morning, but got up before anyone could be recognized; and he said, 'No one must know that a woman came to the threshing floor.' The meeting was proper, but Boaz wanted to protect Ruth's reputation.\n\nHe also said, 'Bring me the shawl you are wearing and hold it out.' When she did so, he poured into it six measures of barley and placed the bundle on her. Then he went back to town. Ruth returned to Naomi carrying the generous gift—a sign of Boaz's commitment and provision.\n\nWhen Ruth came to her mother-in-law, Naomi asked, 'How did it go, my daughter?' Ruth told her everything Boaz had done for her and added, 'He gave me these six measures of barley, saying, \"Don't go back to your mother-in-law empty-handed.\"'\n\nNaomi had called herself 'empty' when she first returned. Now Boaz was ensuring she would not be empty.\n\nThen Naomi said, 'Wait, my daughter, until you find out what happens. For the man will not rest until the matter is settled today.'\n\nBoaz was a man of action and integrity. He would settle this matter quickly and properly. The kinsman-redeemer was ready to redeem.",
      "kids_title": "Ruth Asks Boaz for Help",
      "kids_description": "Naomi had an idea to help Ruth. Ruth went to see Boaz and asked if he would marry her and take care of her and Naomi. Boaz said yes!",
      "kids_narrative": "Naomi wanted to help Ruth. She wanted Ruth to have a husband and a home. And she knew that Boaz was part of their family.\n\nNaomi had a plan. She told Ruth, 'Tonight, put on your nicest clothes. Go to where Boaz is working. Wait until he goes to sleep, then go lie down by his feet. He'll know what you're asking.'\n\nThis sounds strange to us, but back then it was a special way to ask someone to marry you and take care of you.\n\nRuth trusted Naomi. She did exactly what Naomi said. She went to where Boaz was sleeping after his work. She lay down by his feet.\n\nIn the middle of the night, Boaz woke up. 'Who's there?' he asked.\n\n'It's me, Ruth,' she said. 'You're part of my family. Will you take care of me? Will you marry me?'\n\nBoaz was SO happy! 'God bless you, Ruth!' he said. 'You're such a good person! Everyone in town knows it. I will definitely help you!'\n\n'But,' Boaz said, 'there's someone else in the family who might need to help you first. In the morning, I'll ask him. If he says no, then I'll marry you. I promise!'\n\nRuth stayed until morning. Before it got light, Boaz said, 'Here, take this grain home to Naomi.' He gave her a BIG gift of grain to carry.\n\nRuth went home. Naomi asked, 'What happened?'\n\nRuth told her everything! 'And look at all this grain Boaz gave me! He said you shouldn't be empty-handed.'\n\nNaomi smiled. 'Boaz is a good man. He won't wait. He'll fix everything today!'\n\nRuth and Naomi felt hopeful. Good things were about to happen!"
    },
    {
      "title": "Boaz Redeems Ruth",
      "slug": "boaz-redeems-ruth",
      "description": "At the city gate, Boaz confronts the nearer kinsman and secures the right to redeem Ruth. Their marriage produces Obed, grandfather of King David.",
      "verses": [
        "Ruth 4:1-22"
      ],
      "themes": [
        "Redemption",
        "Marriage",
        "God's sovereignty",
        "Ancestry of Christ",
        "Restoration"
      ],
      "characters": [
        "Boaz",
        "Ruth",
        "Naomi",
        "The nearer kinsman",
        "The elders",
        "Obed"
      ],
      "narrative": "Meanwhile Boaz went up to the town gate and sat down there just as the guardian-redeemer he had mentioned came along. The gate was the place of legal transactions, where elders sat and witnessed important business.\n\nBoaz said, 'Come over here, my friend, and sit down.' So he went over and sat down. Boaz took ten of the elders of the town and said, 'Sit here,' and they did so. This was a formal legal proceeding with witnesses.\n\nThen he said to the guardian-redeemer, 'Naomi, who has come back from Moab, is selling the piece of land that belonged to our relative Elimelech. I thought I should bring the matter to your attention and suggest that you buy it in the presence of these seated here and in the presence of the elders of my people. If you will redeem it, do so. But if you will not, tell me, so I will know. For no one has the right to do it except you, and I am next in line.'\n\n'I will redeem it,' he said.\n\nBoaz had presented the opportunity in the most attractive light—land for sale, a straightforward redemption. The nearer kinsman quickly agreed. But Boaz had more to say.\n\nThen Boaz said, 'On the day you buy the land from Naomi, you also acquire Ruth the Moabite, the dead man's widow, in order to maintain the name of the dead with his property.'\n\nHere was the catch. The redeemer would have to marry Ruth—a Moabite, a foreigner. Any son born to them would be considered the son of Mahlon, Ruth's first husband, and would inherit the redeemed property. The redeemer would pay the price but his own children wouldn't inherit the benefit.\n\nAt this, the guardian-redeemer said, 'Then I cannot redeem it because I might endanger my own estate. You redeem it yourself. I cannot do it.'\n\nThe man was unwilling to risk his own inheritance. He wanted the benefits of redemption without the cost. He made a practical, selfish choice—and lost his opportunity to be part of God's redemptive story. Scripture doesn't even record his name.\n\nSo the guardian-redeemer said to Boaz, 'Buy it yourself.' And he removed his sandal. This was the custom—the sandal was given as confirmation of the transaction, symbolizing the right to walk on the property.\n\nThen Boaz announced to the elders and all the people, 'Today you are witnesses that I have bought from Naomi all the property of Elimelech, Kilion and Mahlon. I have also acquired Ruth the Moabite, Mahlon's widow, as my wife, in order to maintain the name of the dead with his property, so that his name will not disappear from among his family or from his hometown. Today you are witnesses!'\n\nBoaz didn't say 'I have to take Ruth' but 'I have acquired Ruth.' She was the prize, not the burden. He was both able and willing to redeem.\n\nThen the elders and all the people at the gate said, 'We are witnesses. May the Lord make the woman who is coming into your home like Rachel and Leah, who together built up the family of Israel. May you have standing in Ephrathah and be famous in Bethlehem. Through the offspring the Lord gives you by this young woman, may your family be like that of Perez, whom Tamar bore to Judah.'\n\nThey blessed them with the greatest mothers in Israel's history and prophesied a great lineage. They spoke better than they knew.\n\nSo Boaz took Ruth and she became his wife. When he made love to her, the Lord enabled her to conceive, and she gave birth to a son.\n\nThe women said to Naomi: 'Praise be to the Lord, who this day has not left you without a guardian-redeemer. May he become famous throughout Israel! He will renew your life and sustain you in your old age. For your daughter-in-law, who loves you and who is better to you than seven sons, has given him birth.'\n\nSeven sons was the ideal number, the perfect blessing. But Ruth, the foreign daughter-in-law who chose covenant loyalty, was worth more than seven sons.\n\nThen Naomi took the child in her arms and cared for him. The women living there said, 'Naomi has a son!' And they named him Obed. He was the father of Jesse, the father of David.\n\nThe genealogy makes the point explicit: Perez was the father of Hezron, Hezron the father of Ram, Ram the father of Amminadab, Amminadab the father of Nahshon, Nahshon the father of Salmon, Salmon the father of Boaz, Boaz the father of Obed, Obed the father of Jesse, and Jesse the father of David.\n\nThe Moabite widow became the great-grandmother of Israel's greatest king. And through David's line, she became an ancestor of Jesus Christ, the ultimate Kinsman-Redeemer who was both willing and able to pay the price for our redemption.\n\nNaomi had returned to Bethlehem 'empty.' Now she held the future king's grandfather in her arms. Ruth had left everything to follow the God of Israel. Now she had more than she could have imagined. And the faithful kinsman-redeemer Boaz had risked his inheritance to do what was right. Now his name would be remembered forever.\n\nThe book of Ruth reveals the beauty of God's providence, working through ordinary people doing extraordinary acts of faithfulness. It shows that God's covenant family includes those who choose Him by faith, regardless of their ancestry. And it points forward to the greater Boaz, Jesus Christ, who saw us in our desperate need and said, 'I will redeem you. I am both willing and able.' He paid the ultimate price, took us as His bride, and secured our eternal inheritance.",
      "kids_title": "Boaz Marries Ruth",
      "kids_description": "Boaz asked another man if he wanted to marry Ruth first. The man said no. So Boaz married Ruth! They had a baby, and everyone was happy. That baby's great-grandson was King David!",
      "kids_narrative": "Remember, Boaz had to ask someone else first if they wanted to marry Ruth and help Naomi. So Boaz went to the city gate where important meetings happened.\n\nThe other man came by. Boaz said, 'Hey! Come sit down. I need to talk to you.' He also asked ten important leaders to sit and listen.\n\nBoaz said, 'Naomi is selling some land that belonged to her husband. You're part of the family. Do you want to buy it?'\n\n'Sure!' the man said. That sounded good to him.\n\nBut then Boaz said, 'If you buy the land, you also have to marry Ruth and take care of her and Naomi.'\n\nThe man thought about it. 'Oh... no, I can't do that. You do it instead.' And he gave Boaz his sandal to show everyone that Boaz could have the land instead. (That was a funny custom they had!)\n\nBoaz stood up and told everyone, 'Today I'm buying the land! And I'm marrying Ruth! Everyone here is my witness!'\n\nAll the people cheered! 'Congratulations! May God bless you with lots of children! May you become famous!'\n\nSo Boaz married Ruth! They were so happy! And God blessed them with a baby boy named Obed.\n\nThe ladies in town came to Naomi. 'Isn't God wonderful? You have a grandson! Ruth loves you so much—she's better than seven sons!'\n\nNaomi held baby Obed in her arms. She smiled and smiled. She wasn't sad anymore! She wasn't empty anymore!\n\nBaby Obed grew up. He had a son named Jesse. And Jesse had a son named David—who became the greatest king of Israel!\n\nAnd many, many years later, Jesus was born from this same family! Ruth, Boaz, Naomi, and little Obed were part of Jesus' family tree!\n\nGod took care of Ruth when she was kind and loyal. God took care of Naomi when she felt all alone. And God used them to bring the greatest King of all—Jesus—into the world!\n\nGod always has a plan, even when we can't see it!"
    }
  ]
}
