{
  "category": "Elijah & Elisha",
  "slug": "elijah-and-elisha",
  "description": "The dramatic ministries of Israel's greatest prophets—calling down fire, parting waters, raising the dead, and confronting wicked kings.",
  "stories": [
    {
      "title": "Elijah and the Ravens",
      "slug": "elijah-and-the-ravens",
      "description": "During a devastating drought, God miraculously provides for the prophet Elijah through ravens that bring him food by a brook.",
      "verses": [
        "1 Kings 17:1-7"
      ],
      "themes": [
        "God's provision",
        "Faith",
        "Obedience",
        "Divine care"
      ],
      "characters": [
        "Elijah",
        "God",
        "The ravens"
      ],
      "narrative": "Elijah the Tishbite, from Tishbe in Gilead, appeared suddenly on the stage of Israel's history with a bold proclamation to wicked King Ahab: 'As the Lord, the God of Israel, lives, whom I serve, there will be neither dew nor rain in the next few years except at my word.'\n\nThis was no idle threat. Ahab and his Phoenician queen Jezebel had led Israel into Baal worship. Baal was supposedly the god of storms and rain. Now the true God would demonstrate His power by shutting up the heavens.\n\nThen the word of the Lord came to Elijah: 'Leave here, turn eastward and hide in the Kerith Ravine, east of the Jordan. You will drink from the brook, and I have directed the ravens to supply you with food there.'\n\nElijah did what the Lord had told him. He went to the Kerith Ravine and stayed there. The ravens brought him bread and meat in the morning and bread and meat in the evening, and he drank from the brook.\n\nRavens—unclean birds, scavengers known for their greed—became God's delivery service. Morning and evening, faithfully, they brought provisions to the prophet. The brook provided water. God sustained His servant through the very drought he had announced.\n\nSometime later the brook dried up because there had been no rain in the land. But God was not done providing. He would send Elijah next to a widow in Zarephath, in the heart of Jezebel's homeland, where another miracle of provision awaited.\n\nGod's servants may find themselves in wilderness places, but they will never find themselves beyond His care.",
      "kids_title": "Birds Bring Elijah Food",
      "kids_description": "God told Elijah to hide by a stream. How would he eat? God sent birds to bring him breakfast and dinner every single day!",
      "kids_narrative": "Elijah was a special messenger for God called a prophet. He had to tell the mean king some bad news: 'Because you worship fake gods, God says there will be no rain!'\n\nNo rain meant no food would grow. It was going to be a hard time.\n\nGod told Elijah, 'Go hide by a little stream. You can drink the water there. And guess what? I'm going to send birds to bring you food!'\n\nElijah went to the stream and waited. And sure enough, every morning—FLAP FLAP FLAP—birds called ravens flew down with bread and meat for Elijah!\n\nEvery evening—FLAP FLAP FLAP—the birds came again with more food!\n\nRavens are birds that usually keep food for themselves. But God told them to share with Elijah, and they obeyed!\n\nEvery day Elijah had water from the stream to drink. Every day the birds brought breakfast and dinner. God took care of Elijah in a special, surprising way.\n\nAfter a while, the stream dried up because there was no rain. But God had another plan to take care of Elijah.\n\nWhen we trust God, He always takes care of us—sometimes in surprising ways!"
    },
    {
      "title": "Elijah and the Widow's Oil",
      "slug": "elijah-and-the-widows-oil",
      "description": "When the brook dries up, God sends Elijah to a starving widow. Through faith, her handful of flour and small jar of oil miraculously never run out.",
      "verses": [
        "1 Kings 17:8-16"
      ],
      "themes": [
        "Faith",
        "Provision",
        "Obedience",
        "Miracles",
        "Caring for prophets"
      ],
      "characters": [
        "Elijah",
        "The widow of Zarephath",
        "Her son",
        "God"
      ],
      "narrative": "When the brook Kerith dried up, the word of the Lord came to Elijah: 'Go at once to Zarephath in the region of Sidon and stay there. I have directed a widow there to supply you with food.'\n\nZarephath was in Phoenicia—Jezebel's homeland, the very center of Baal worship. Yet there God had prepared a provider.\n\nWhen Elijah arrived at the town gate, a widow was there gathering sticks. He called to her, 'Would you bring me a little water in a jar so I may have a drink?' As she was going, he called, 'And bring me, please, a piece of bread.'\n\n'As surely as the Lord your God lives,' she replied, 'I don't have any bread—only a handful of flour in a jar and a little olive oil in a jug. I am gathering a few sticks to take home and make a meal for myself and my son, that we may eat it—and die.'\n\nShe was preparing her last meal. The famine had brought her to the end.\n\nElijah said to her, 'Don't be afraid. Go home and do as you have said. But first make a small loaf of bread for me from what you have and bring it to me, and then make something for yourself and your son. For this is what the Lord, the God of Israel, says: \"The jar of flour will not be used up and the jug of oil will not run dry until the day the Lord sends rain on the land.\"'\n\nShe went away and did as Elijah had told her. It required enormous faith—to give her last food to a stranger on nothing but his word and a promise from a foreign God.\n\nBut God proved faithful. There was food every day for Elijah and for the woman and her family. The jar of flour was not used up, and the jug of oil did not run dry, in keeping with the word of the Lord spoken by Elijah.\n\nIn the darkest place, among a people who didn't know Him, God provided for a widow who dared to believe.",
      "kids_title": "The Jar That Never Got Empty",
      "kids_description": "A poor woman had only a tiny bit of flour and oil—her very last food. But when she shared with Elijah, God made sure her jars never got empty!",
      "kids_narrative": "God told Elijah to go to a town and find a woman who would give him food. But when Elijah found her, she was very poor.\n\n'Could I have some water and bread?' Elijah asked.\n\nThe woman looked sad. 'I only have a tiny bit of flour and a tiny bit of oil. I was going to make one last little meal for me and my son. After that, we have nothing left.'\n\nThis woman was about to eat her very last food!\n\nBut Elijah said, 'Don't be scared. Make me a little bread first. Then make some for you and your son. God promises that your flour jar and oil jar won't get empty until the rain comes back!'\n\nThe woman had to decide: Should she trust this man and his God?\n\nShe decided to believe! She made bread for Elijah first, just like he asked.\n\nAnd guess what happened? The next day, she looked in her flour jar—there was still flour! She looked in her oil jar—there was still oil!\n\nThe next day—still flour! Still oil!\n\nEvery single day, for a long, long time, those jars never got empty. The woman and her son and Elijah had food every day, even though there was no rain and no food growing anywhere!\n\nGod kept His promise. When the woman shared what little she had, God gave her more than she could imagine!"
    },
    {
      "title": "Elijah on Mount Carmel",
      "slug": "fire-from-heaven",
      "description": "Elijah challenges the 450 prophets of Baal to a contest on Mount Carmel. When Baal fails to answer, the God of Israel sends fire from heaven.",
      "verses": [
        "1 Kings 18:16-46"
      ],
      "themes": [
        "God's power",
        "True vs. false gods",
        "Faith",
        "Prayer",
        "Revival"
      ],
      "characters": [
        "Elijah",
        "King Ahab",
        "The prophets of Baal",
        "The people of Israel",
        "God"
      ],
      "narrative": "After three years of drought, Elijah sent word to King Ahab and arranged a confrontation on Mount Carmel. All Israel gathered there, along with the 450 prophets of Baal.\n\nElijah stood before the people. 'How long will you waver between two opinions? If the Lord is God, follow Him; but if Baal is God, follow him.'\n\nThe people said nothing.\n\nElijah proposed a test. Two bulls would be prepared as sacrifices—one for the prophets of Baal, one for Elijah. But no fire would be set. 'You call on the name of your god, and I will call on the name of the Lord. The god who answers by fire—He is God.'\n\nThe people agreed.\n\nThe prophets of Baal went first. From morning till noon they called on Baal. 'Baal, answer us!' But there was no response. They danced around the altar they had made.\n\nAt noon Elijah began to mock them. 'Shout louder! Surely he is a god! Perhaps he is deep in thought, or busy, or traveling. Maybe he is sleeping and must be awakened.'\n\nThey shouted louder and slashed themselves with swords and spears, as was their custom, until their blood flowed. They continued their frantic prophesying until evening. But there was no response, no one answered, no one paid attention.\n\nThen Elijah called the people to him. He repaired the altar of the Lord using twelve stones, one for each tribe. He dug a trench around it. He arranged the wood and the bull.\n\nThen he did something remarkable. 'Fill four large jars with water and pour it on the offering and on the wood.' He had them do it three times—twelve jars in all—until the water ran down around the altar and filled the trench. In the middle of a drought, he soaked everything.\n\nAt the time of the evening sacrifice, Elijah prayed: 'Lord, the God of Abraham, Isaac, and Israel, let it be known today that you are God in Israel and that I am your servant. Answer me, Lord, so these people will know that you are God and that you are turning their hearts back again.'\n\nThen the fire of the Lord fell. It burned up the sacrifice, the wood, the stones, the soil, and licked up the water in the trench.\n\nWhen all the people saw this, they fell on their faces and cried, 'The Lord—He is God! The Lord—He is God!'\n\nThe prophets of Baal were seized and executed. And soon, after Elijah prayed again, the sky grew black with clouds, the wind rose, and a heavy rain came. The drought was over. The true God had answered.",
      "kids_title": "Fire from Heaven",
      "kids_description": "Elijah challenged the prophets of a fake god to a contest. Their god did nothing. But when Elijah prayed, God sent fire from the sky!",
      "kids_narrative": "It hadn't rained for three whole years because the people were worshiping a fake god named Baal. Elijah told King Ahab, 'Let's have a contest!'\n\nOn top of a mountain, Elijah stood on one side. On the other side were 450 prophets of Baal. All the people came to watch.\n\n'Let's see whose god is real!' Elijah said. 'Make an altar and put a sacrifice on it. Don't light it on fire. Ask your god to send fire. Then I'll do the same. The REAL God will send fire!'\n\nThe Baal prophets went first. 'Baal! Answer us!' they shouted. Nothing happened.\n\nThey yelled louder. They danced around. They jumped up and down. STILL nothing happened.\n\n'Maybe your god is sleeping!' Elijah joked. 'Yell louder!'\n\nThey yelled ALL day. But Baal never answered. Because Baal wasn't real.\n\nThen it was Elijah's turn. He fixed God's altar with twelve stones. He put wood and the sacrifice on top.\n\nThen he did something crazy. 'Pour water all over it!' he said. They poured water. 'Pour more!' More water. 'MORE!' They poured so much water that it filled a ditch around the altar!\n\nHow could wet wood catch fire?\n\nElijah prayed a simple prayer: 'Lord, show everyone that YOU are the real God!'\n\nWHOOOOSH! Fire came down from heaven! It burned up EVERYTHING—the sacrifice, the wood, the stones, and even all the water!\n\nAll the people fell on their faces. 'The LORD—He is God! The LORD—He is God!'\n\nThat day everyone learned who the REAL God was. And soon after, the rain finally came. God showed His power in an amazing way!"
    },
    {
      "title": "Elijah Taken to Heaven",
      "slug": "elijah-taken-to-heaven",
      "description": "In a whirlwind with chariots of fire, Elijah is taken up to heaven without dying. His successor Elisha receives a double portion of his spirit.",
      "verses": [
        "2 Kings 2:1-14"
      ],
      "themes": [
        "Translation",
        "Succession",
        "Double portion",
        "Persistence",
        "Mentorship"
      ],
      "characters": [
        "Elijah",
        "Elisha",
        "The company of prophets"
      ],
      "narrative": "When the Lord was about to take Elijah up to heaven in a whirlwind, Elijah and Elisha were on their way from Gilgal. Elijah said to Elisha, 'Stay here; the Lord has sent me to Bethel.'\n\nBut Elisha said, 'As surely as the Lord lives and as you live, I will not leave you.' So they went down to Bethel.\n\nThe company of the prophets at Bethel came out to Elisha. 'Do you know that the Lord is going to take your master from you today?'\n\n'Yes, I know,' Elisha replied. 'So be quiet.'\n\nAgain Elijah tried to send Elisha away at Jericho. Again Elisha refused to leave. Fifty men from the company of prophets followed at a distance as they walked to the Jordan River.\n\nElijah took his cloak, rolled it up, and struck the water. The water divided to the right and to the left, and the two of them crossed over on dry ground.\n\nWhen they had crossed, Elijah said to Elisha, 'Tell me, what can I do for you before I am taken from you?'\n\n'Let me inherit a double portion of your spirit,' Elisha replied. This was not greed but the inheritance of the firstborn son, the one who carries on the father's work.\n\n'You have asked a difficult thing,' Elijah said. 'Yet if you see me when I am taken from you, it will be yours. Otherwise, it will not.'\n\nAs they were walking along and talking together, suddenly a chariot of fire and horses of fire appeared and separated the two of them, and Elijah went up to heaven in a whirlwind.\n\nElisha saw this and cried out, 'My father! My father! The chariots and horsemen of Israel!' And Elisha saw him no more. He took hold of his garment and tore it in two.\n\nElisha then picked up Elijah's cloak that had fallen from him and went back and stood on the bank of the Jordan. He struck the water with the cloak. 'Where now is the Lord, the God of Elijah?' he asked. When he struck the water, it divided to the right and to the left, and he crossed over.\n\nThe company of prophets from Jericho were watching. 'The spirit of Elijah is resting on Elisha,' they said. And they came to meet him and bowed to the ground before him.\n\nElijah never died. He was taken directly into God's presence. And the one who followed faithfully received what he asked for—the power to continue the work.",
      "kids_title": "Elijah Rides to Heaven",
      "kids_description": "God took Elijah straight to heaven in a chariot of fire! His helper Elisha saw it happen and received special power to do great things for God too.",
      "kids_narrative": "Elijah had been serving God for a long time. Now it was almost time for him to go to heaven. His helper Elisha knew it was coming.\n\n'You should stay here,' Elijah said to Elisha.\n\n'No way!' said Elisha. 'I'm staying with you!'\n\nThey walked together. Other people who loved God came to Elisha and whispered, 'You know Elijah is leaving today, right?'\n\n'I know,' said Elisha. 'Shh!'\n\nElijah kept trying to send Elisha home. But Elisha wouldn't leave. He loved Elijah and wanted to be with him until the very end.\n\nThey came to a river. Elijah rolled up his coat and hit the water—SPLASH! The water split in two and they walked across on dry ground!\n\n'What do you want me to do for you before I go?' Elijah asked.\n\n'I want to be twice as powerful as you for God!' said Elisha.\n\n'That's a big thing to ask,' said Elijah. 'If you SEE me go to heaven, you'll get it.'\n\nThey kept walking and talking. Then suddenly—WHOOOOSH! A chariot made of FIRE with horses made of FIRE came down from the sky! A big whirlwind picked Elijah up, and he went UP, UP, UP to heaven!\n\nElisha saw it all! 'My father! My father!' he cried.\n\nElijah's coat fell down. Elisha picked it up. He walked back to the river and hit the water with the coat—SPLASH! The water split just like before!\n\nNow everyone knew: Elisha had received power from God. He was ready to serve God just like Elijah had.\n\nElijah didn't die—he went straight to heaven! And Elisha carried on his important work."
    },
    {
      "title": "Elisha and the Widow's Oil",
      "slug": "elisha-and-the-widows-oil",
      "description": "A poor widow cries to Elisha for help. With just one jar of oil and borrowed empty containers, God provides enough to pay all her debts.",
      "verses": [
        "2 Kings 4:1-7"
      ],
      "themes": [
        "Provision",
        "Faith",
        "Miracles",
        "Debt",
        "Abundance"
      ],
      "characters": [
        "Elisha",
        "The widow",
        "Her sons"
      ],
      "narrative": "The wife of a man from the company of the prophets cried out to Elisha, 'Your servant my husband is dead, and you know that he revered the Lord. But now his creditor is coming to take my two boys as his slaves.'\n\nIn ancient Israel, debts that couldn't be paid could result in family members being sold into slavery. This widow faced losing her children.\n\nElisha replied to her, 'How can I help you? Tell me, what do you have in your house?'\n\n'Your servant has nothing there at all,' she said, 'except a small jar of olive oil.'\n\nOne small jar—nearly nothing. But it was something.\n\nElisha said, 'Go around and ask all your neighbors for empty jars. Don't ask for just a few. Then go inside and shut the door behind you and your sons. Pour oil into all the jars, and as each is filled, put it to one side.'\n\nShe left him and shut the door behind her and her sons. They brought the jars to her, and she kept pouring. One jar filled. Another. Another. The oil kept coming.\n\nWhen all the jars were full, she said to her son, 'Bring me another one.' But he replied, 'There is not a jar left.' Then the oil stopped flowing.\n\nShe went and told the man of God, and he said, 'Go, sell the oil and pay your debts. You and your sons can live on what is left.'\n\nGod's provision matched her faith and obedience. Had she gathered more jars, there would have been more oil. The limit was not God's power but the containers she had prepared. Her sons were saved, her debts were paid, and she had enough to live on—all from one small jar of oil and a God who multiplies what we bring Him.",
      "kids_title": "The Oil That Kept Pouring",
      "kids_description": "A poor woman only had one tiny jar of oil. But when she trusted God and did what Elisha said, that oil filled up EVERY jar she could find!",
      "kids_narrative": "A woman came crying to Elisha. 'My husband died, and we owe money! The people we owe are going to take my two boys away!'\n\nIn those days, if you couldn't pay what you owed, your kids might have to go work for the other person. This poor mom was about to lose her sons!\n\n'What do you have?' Elisha asked.\n\n'Just one tiny jar of oil,' she said. 'That's it.'\n\nElisha had an idea. 'Go ask all your neighbors for empty jars. Get as many as you can! Then go home, close the door, and start pouring your oil into those jars.'\n\nThe woman and her sons went all around the neighborhood. 'Can we borrow your empty jars?' They collected lots and lots of jars!\n\nThey went home and closed the door. The woman picked up her tiny jar of oil and started pouring into an empty jar. The jar filled up!\n\nShe kept pouring. Another jar filled up. And another! And another!\n\n'Bring me another jar!' she said to her son.\n\n'That's the last one, Mom. There aren't any more!'\n\nAs soon as there were no more empty jars, the oil stopped coming.\n\nThe woman ran to tell Elisha. He said, 'Now sell all that oil! Pay back what you owe. And you'll have plenty left over to live on!'\n\nGod took her tiny jar of oil and made it fill every jar she had! Her boys were safe, her bills were paid, and she had enough to live. All because she trusted God and obeyed."
    },
    {
      "title": "Naaman Is Healed",
      "slug": "naaman-is-healed",
      "description": "A powerful Syrian general with leprosy humbles himself to follow Elisha's strange instructions—and is completely healed in the Jordan River.",
      "verses": [
        "2 Kings 5:1-19"
      ],
      "themes": [
        "Humility",
        "Obedience",
        "Healing",
        "Faith",
        "Pride"
      ],
      "characters": [
        "Naaman",
        "Elisha",
        "The Israelite servant girl",
        "Naaman's servants",
        "Gehazi"
      ],
      "narrative": "Naaman was commander of the army of the king of Aram. He was a great man in the sight of his master and highly regarded, because through him the Lord had given victory to Aram. He was a valiant soldier, but he had leprosy.\n\nNow bands from Aram had taken captive a young girl from Israel, and she served Naaman's wife. She said to her mistress, 'If only my master would see the prophet who is in Samaria! He would cure him of his leprosy.'\n\nNaaman went to his king, who sent him to Israel with gifts of silver, gold, and fine clothing. But when the king of Israel read the letter from Aram's king, he tore his robes. 'Am I God? Can I kill and bring back to life? Why does this fellow send someone to me to be cured of leprosy?'\n\nWhen Elisha heard that the king had torn his robes, he sent this message: 'Have the man come to me and he will know that there is a prophet in Israel.'\n\nSo Naaman went with his horses and chariots and stopped at the door of Elisha's house. Elisha sent a messenger to say, 'Go, wash yourself seven times in the Jordan, and your flesh will be restored and you will be cleansed.'\n\nBut Naaman went away angry. 'I thought he would surely come out to me and stand and call on the name of the Lord his God, wave his hand over the spot and cure me of my leprosy. Are not Abana and Pharpar, the rivers of Damascus, better than all the waters of Israel? Couldn't I wash in them and be cleansed?'\n\nNaaman's servants approached him. 'My father, if the prophet had told you to do some great thing, would you not have done it? How much more, then, when he tells you, \"Wash and be cleansed\"!'\n\nSo Naaman went down and dipped himself in the Jordan seven times, as the man of God had told him. And his flesh was restored and became clean like that of a young boy.\n\nThen Naaman and all his attendants went back to the man of God. He stood before him and said, 'Now I know that there is no God in all the world except in Israel.'\n\nThe great general had to humble himself, follow strange instructions, and dip in a muddy river. Pride nearly kept him from healing. But when he obeyed, the leprosy vanished, and he found not just cleansing but the true God.",
      "kids_title": "The General Who Got Clean",
      "kids_description": "Naaman was an important army leader, but he had a terrible skin disease. When he followed Elisha's simple instructions and dipped in a river seven times, God healed him completely!",
      "kids_narrative": "Naaman was a VERY important man. He was the leader of a whole army! Everyone respected him.\n\nBut Naaman had a big problem. He had a bad skin disease called leprosy. Nothing could fix it.\n\nA little girl who worked in his house said, 'There's a prophet in Israel named Elisha. God could heal you through him!'\n\nSo Naaman traveled to Israel with lots of gifts. He went to Elisha's house with his horses and fancy chariots.\n\nBut Elisha didn't even come outside! He just sent a message: 'Go dip yourself in the Jordan River seven times, and you'll be healed.'\n\nNaaman was MAD! 'That's it? Just go swim in a river? The rivers back home are WAY nicer than this muddy Jordan River! Why should I do this?'\n\nHe started to leave. But his servants said, 'Sir, if Elisha had told you to do something hard, you would have done it. Why not try something easy?'\n\nNaaman thought about it. Then he went to the Jordan River.\n\nDip one. Nothing.\nDip two. Nothing.\nDip three, four, five. Still nothing.\nDip six. Nothing.\nDip SEVEN...\n\nWhen Naaman came up from the water, his skin was PERFECT! Clean and healthy like a little kid's skin! The leprosy was completely gone!\n\nNaaman rushed back to Elisha. 'Now I know—YOUR God is the only real God in the whole world!'\n\nNaaman had to stop being proud and just obey. When he did, God healed him. Sometimes God asks us to do simple things. The important part is obeying!"
    },
    {
      "title": "Elisha and the Floating Axe Head",
      "slug": "elisha-floating-axe-head",
      "description": "When a borrowed axe head falls into the river, Elisha performs a miracle, causing the iron to float to the surface.",
      "verses": ["2 Kings 6:1-7"],
      "themes": ["God's Care for Small Things", "Faith", "Divine Provision", "Miracles"],
      "characters": ["Elisha", "The Company of Prophets"],
      "narrative": "The company of the prophets said to Elisha, 'Look, the place where we meet with you is too small for us. Let us go to the Jordan, where each of us can get a pole; and let us build a place there for us to meet.' Elisha agreed and went with them.\n\nAs one of them was cutting down a tree, the iron axe head fell into the water. 'Oh no, my lord!' he cried out. 'It was borrowed!'\n\nIn those days, iron was expensive and valuable. To lose a borrowed tool was a serious matter—the man would owe a debt he likely could not repay. His distress was real.\n\nThe man of God asked, 'Where did it fall?' When he showed him the place, Elisha cut a stick and threw it into the water at that spot. The iron floated to the surface.\n\n'Lift it out,' said Elisha. And the man reached out his hand and took it.\n\nThis small miracle reveals something profound about God's character. He cares about the everyday concerns of His people. A lost tool, a financial worry, a moment of distress—none of these are beneath His notice. The God who parts seas and calls down fire also makes iron float for a worried student.\n\nElisha's miracle demonstrated that no problem is too small for God. He is the Lord of both the great and the ordinary, the cosmic and the commonplace.",
      "kids_title": "The Axe Head That Floated",
      "kids_description": "A man was chopping wood when his axe head flew off and sank in the river! Elisha threw a stick in the water, and the heavy iron floated up!",
      "kids_narrative": "Some men who were learning to be prophets needed a bigger building. They asked Elisha, 'Can we go build a new place by the river?' Elisha said yes and went with them.\n\nThe men started cutting down trees to build with. One man was swinging his axe—CHOP! CHOP! CHOP!—when suddenly the metal part flew off the handle and—SPLASH!—it sank into the river!\n\n'Oh no!' the man cried. 'That axe wasn't even mine! I borrowed it!'\n\nThis was a big problem. Iron tools were very expensive back then. The man didn't have enough money to buy a new one. He was really worried!\n\nElisha asked, 'Where did it fall in?'\n\nThe man pointed to the spot in the river.\n\nElisha cut a stick from a tree and threw it into the water right where the axe head had sunk.\n\nAnd then something IMPOSSIBLE happened—the heavy iron axe head floated up to the top of the water! Iron doesn't float! But this iron did!\n\n'Grab it!' Elisha said.\n\nThe man reached out and picked up his axe head. Problem solved!\n\nThis story shows us that God cares about even the little things in our lives. The man's lost axe head might seem like a small problem, but it was a big deal to HIM. And God cared about it.\n\nNo problem is too small to pray about. God loves to help His children, even with everyday worries!"
    },
    {
      "title": "Elisha Raises the Shunammite's Son",
      "slug": "elisha-raises-shunammite-son",
      "description": "After Elisha prophesies that a kind, childless woman will have a son, the boy dies years later. Elisha prays and God miraculously restores the child to life.",
      "verses": ["2 Kings 4:8-37"],
      "themes": ["Hospitality rewarded", "God's power over death", "Persistence in faith", "Prophetic ministry"],
      "characters": ["Elisha", "Shunammite woman", "Gehazi", "The woman's husband", "The woman's son"],
      "narrative": "As Elisha passed through Shunem, a prominent woman constrained him to eat bread. Thereafter, whenever he passed by, he turned in for a meal. This woman recognized Elisha as a holy man of God and said to her husband, 'Let us make a little chamber, I pray thee, on the wall; and let us set for him there a bed, and a table, and a stool, and a candlestick.' Her hospitality was generous and thoughtful, requiring nothing in return. One day, Elisha asked his servant Gehazi what might be done for her. She needed nothing—she dwelt among her own people, content. But Gehazi observed, 'Verily she hath no child, and her husband is old.' Elisha called her and stood in the doorway, prophesying, 'About this season, according to the time of life, thou shalt embrace a son.' She could hardly believe it: 'Nay, my lord, thou man of God, do not lie unto thine handmaid.' Yet the word proved true—she conceived and bore a son. Years passed. The child grew, going out to his father among the reapers one day. Suddenly, he cried, 'My head, my head!' A servant carried him to his mother, where he sat on her knees until noon, then died. The Shunammite woman demonstrated remarkable faith. She laid the child on Elisha's bed, shut the door, and immediately journeyed to Mount Carmel to find the prophet. When Elisha saw her coming, he sent Gehazi, but she would not leave without Elisha himself: 'As the LORD liveth, and as thy soul liveth, I will not leave thee.' Arriving at the house, Elisha found the child dead upon his bed. He shut the door, prayed unto the LORD, then lay upon the child—mouth to mouth, eyes to eyes, hands to hands. The child's flesh grew warm. After pacing the room, Elisha stretched himself upon the boy again. The child sneezed seven times and opened his eyes. 'Take up thy son,' Elisha told the mother. She fell at his feet in overwhelming gratitude, then took up her son. The God of Elijah and Elisha was the God of resurrection life.",
      "kids_title": "A Little Boy Comes Back to Life",
      "kids_description": "When a kind woman's son dies, the prophet Elisha prays, and God does an amazing miracle—He brings the boy back to life!",
      "kids_narrative": "There was a kind woman who lived in a town called Shunem. Whenever God's prophet Elisha traveled through her town, she would invite him to her house for dinner. She told her husband, 'Elisha is a man of God. Let's make a special little room for him with a bed, a table, a chair, and a lamp. Then he can stay with us whenever he comes through town!' Elisha was so grateful for her kindness. He asked his helper Gehazi, 'What can we do for this woman to thank her?' Gehazi said, 'Well, she doesn't have any children, and her husband is old.' Elisha called the woman and told her, 'Next year at this time, you're going to have a baby son!' The woman could hardly believe it—she had wanted a child for so long! But it was true! She had a baby boy, just like Elisha said. The boy grew up healthy and happy. One day, when he was older, he went out to the field where his father was working. Suddenly, the boy cried out, 'My head! My head hurts!' A servant carried him home to his mother, but the boy got sicker and sicker. At noon, he died in his mother's arms. The woman didn't panic. She gently laid her son on the bed in Elisha's room and closed the door. Then she quickly traveled to find Elisha. When Elisha saw her coming, he knew something was terribly wrong. The woman said, 'I need you to come with me right now!' Elisha hurried to her house. He went into the room, closed the door, and prayed to God. Then he lay down on top of the little boy—face to face, hands to hands. The boy's body started getting warm! Elisha walked around the room, then lay on the boy again. Suddenly, the boy sneezed seven times and opened his eyes! He was alive! The mother was so happy she could hardly stand. She bowed down to thank Elisha, then scooped up her son and hugged him tight. God had brought her boy back to life!"
    }
  ]
}