{
  "category": "Prophets & Exile",
  "slug": "prophets-and-exile",
  "description": "God's messengers proclaim truth to rebellious nations, and faithful servants endure persecution in foreign lands.",
  "stories": [
    {
      "title": "Jonah and the Great Fish",
      "slug": "jonah-and-the-great-fish",
      "description": "God tells Jonah to preach to Nineveh, but Jonah runs away. A great storm and a great fish teach him that he cannot flee from God.",
      "verses": ["Jonah 1:1-17", "Jonah 2:1-10"],
      "themes": ["Obedience", "God's sovereignty", "Repentance", "Second chances"],
      "characters": ["Jonah", "God", "Sailors"],
      "narrative": "The word of the Lord came to Jonah son of Amittai: 'Go to the great city of Nineveh and preach against it, because its wickedness has come up before me.'\n\nBut Jonah ran away from the Lord. He went down to Joppa, found a ship bound for Tarshish—the opposite direction from Nineveh—paid the fare, and went aboard to flee from the Lord.\n\nThen the Lord sent a great wind on the sea, and such a violent storm arose that the ship threatened to break up. The sailors were terrified, and each cried out to his own god. They threw the cargo overboard to lighten the ship.\n\nBut Jonah had gone below deck, where he lay down and fell into a deep sleep. The captain found him. 'How can you sleep? Get up and call on your god! Maybe he will take notice of us so that we will not perish.'\n\nThe sailors cast lots to find out who was responsible for the calamity. The lot fell on Jonah. 'Tell us, what have you done?'\n\nJonah admitted he was running from the Lord, the God of heaven who made the sea and the dry land. The sailors were terrified. 'What should we do to you to make the sea calm down?'\n\n'Pick me up and throw me into the sea,' Jonah replied, 'and it will become calm. I know that it is my fault this storm has come upon you.'\n\nInstead, the men did their best to row back to land. But they could not. Finally, they cried to the Lord, 'Please, Lord, do not let us die for taking this man's life. Do not hold us accountable for killing an innocent man, for you, Lord, have done as you pleased.'\n\nThey took Jonah and threw him overboard, and the raging sea grew calm. At this the men greatly feared the Lord, and they made vows to Him.\n\nNow the Lord provided a huge fish to swallow Jonah, and Jonah was in the belly of the fish three days and three nights. From inside the fish, Jonah prayed to the Lord his God. He acknowledged his distress, remembered the Lord, and vowed to do what he had promised.\n\nAnd the Lord commanded the fish, and it vomited Jonah onto dry land.",
      "kids_title": "Jonah Runs from God",
      "kids_description": "God told Jonah to go to Nineveh, but Jonah said 'No way!' and sailed the opposite direction. A big storm and a HUGE fish showed Jonah he couldn't hide from God!",
      "kids_narrative": "God had a job for Jonah. 'Go to the big city of Nineveh and tell them to stop being bad!'\n\nBut Jonah didn't want to go. Nineveh was scary! The people there were mean! So Jonah ran away. He found a boat going FAR in the other direction and hopped on board.\n\nJonah thought he could hide from God. Silly Jonah!\n\nGod sent a HUGE storm. The waves crashed! The wind howled! The sailors were terrified! They threw stuff overboard to make the boat lighter.\n\nAnd Jonah? He was sleeping down below!\n\nThe captain woke him up. 'How can you sleep?! Pray to your god!'\n\nThe sailors figured out the storm was Jonah's fault. 'What did you DO?!'\n\n'I'm running away from God,' Jonah admitted. 'Throw me in the ocean and the storm will stop.'\n\nThe sailors didn't want to, but finally they threw Jonah overboard. SPLASH! Right away, the storm stopped. The sailors were amazed at God's power.\n\nBut what about Jonah? GULP! A gigantic fish swallowed him whole!\n\nJonah was inside that fish for THREE days and THREE nights. It was dark and smelly and gross. Jonah had lots of time to think.\n\nHe prayed, 'God, I'm sorry! I should have listened to You. Thank You for saving me. I'll do what You asked!'\n\nGod told the fish to spit Jonah out. BLECH! There was Jonah on the beach—slimy but safe.\n\nYou can't hide from God. But here's the good news: God gives second chances!"
    },
    {
      "title": "Jonah and Nineveh",
      "slug": "jonah-and-nineveh",
      "description": "Given a second chance, Jonah preaches to Nineveh. The entire city repents—but Jonah is angry that God shows mercy to his enemies.",
      "verses": ["Jonah 3:1-10", "Jonah 4:1-11"],
      "themes": ["Second chances", "Repentance", "God's mercy", "Compassion for enemies"],
      "characters": ["Jonah", "God", "King of Nineveh", "People of Nineveh"],
      "narrative": "Then the word of the Lord came to Jonah a second time: 'Go to the great city of Nineveh and proclaim to it the message I give you.'\n\nThis time Jonah obeyed. He went to Nineveh, a city so large it took three days to go through it. Jonah began by going a day's journey into the city, proclaiming, 'Forty more days and Nineveh will be overthrown.'\n\nThe Ninevites believed God. A fast was proclaimed, and all of them, from the greatest to the least, put on sackcloth. When the news reached the king of Nineveh, he rose from his throne, took off his royal robes, covered himself with sackcloth, and sat down in the dust.\n\nThe king issued a proclamation: 'Let everyone call urgently on God. Let them give up their evil ways and their violence. Who knows? God may yet relent and with compassion turn from his fierce anger so that we will not perish.'\n\nWhen God saw what they did and how they turned from their evil ways, He relented and did not bring on them the destruction He had threatened.\n\nBut to Jonah this seemed very wrong, and he became angry. He prayed, 'Isn't this what I said when I was still at home? That is why I was so quick to flee to Tarshish. I knew that you are a gracious and compassionate God, slow to anger and abounding in love, a God who relents from sending calamity. Now, Lord, take away my life, for it is better for me to die than to live.'\n\n'Is it right for you to be angry?' the Lord asked.\n\nJonah went out and sat down east of the city, waiting to see what would happen. The Lord provided a plant to grow up and give Jonah shade. Jonah was very happy about the plant. But at dawn the next day, God provided a worm that chewed the plant so it withered. When the sun blazed, God provided a scorching wind, and Jonah grew faint and wanted to die.\n\n'Is it right for you to be angry about the plant?'\n\n'It is,' Jonah said. 'And I'm angry enough to die.'\n\nThe Lord said, 'You have been concerned about this plant, though you did not tend it or make it grow. It sprang up overnight and died overnight. And should I not have concern for the great city of Nineveh, in which there are more than a hundred and twenty thousand people who cannot tell their right hand from their left—and also many animals?'",
      "kids_title": "Nineveh Says Sorry",
      "kids_description": "Jonah finally went to Nineveh and told them God was upset. Guess what? The WHOLE city said sorry to God! But Jonah was grumpy about it. God taught Jonah an important lesson about loving others.",
      "kids_narrative": "After the big fish spit Jonah out, God said again, 'Go to Nineveh!'\n\nThis time, Jonah went. Nineveh was HUGE—it took three days to walk through! Jonah walked around shouting, 'In forty days, Nineveh will be destroyed!'\n\nSomething amazing happened. The people listened! They believed God! Everyone—from the poorest person to the king himself—said sorry for the bad things they'd done. They stopped eating to show how serious they were. Even the king took off his fancy robes and put on scratchy clothes.\n\nThe king announced, 'Everyone pray to God! Stop doing bad things! Maybe God will forgive us!'\n\nGod saw that they really meant it. He forgave them! He didn't destroy the city!\n\nHooray! Right? Well... not for Jonah.\n\nJonah was ANGRY. 'I KNEW You'd forgive them!' he complained to God. 'That's why I ran away! You're too nice! Just let me die!'\n\nGod asked, 'Is it right for you to be so angry?'\n\nJonah sat outside the city, pouting. God made a plant grow to give Jonah shade. Jonah liked the plant.\n\nBut the next day, the plant died. Jonah got even angrier!\n\nGod said, 'You're upset about a plant that you didn't even grow. But there are thousands and thousands of people in Nineveh—plus animals! Shouldn't I care about them?'\n\nGod loves EVERYONE—even people we might think are our enemies. He wants everyone to say sorry and be saved. We should want that too!"
    },
    {
      "title": "The Fiery Furnace",
      "slug": "the-fiery-furnace",
      "description": "Three young Hebrews refuse to bow to King Nebuchadnezzar's golden image. Thrown into a blazing furnace, they are joined by a fourth figure—and emerge unharmed.",
      "verses": ["Daniel 3:1-30"],
      "themes": ["Faithfulness under pressure", "God's protection", "Courage"],
      "characters": ["Shadrach", "Meshach", "Abednego", "Nebuchadnezzar", "The Son of God"],
      "narrative": "King Nebuchadnezzar made an image of gold, ninety feet high and nine feet wide, and set it up on the plain of Dura in the province of Babylon. He summoned all the officials to come to the dedication. A herald cried aloud: 'When you hear the sound of the horn, flute, zither, lyre, harp, pipe and all kinds of music, you must fall down and worship the image of gold. Whoever does not fall down and worship will immediately be thrown into a blazing furnace.'\n\nTherefore, when the music played, all the peoples fell down and worshiped the image of gold.\n\nAt this time some astrologers came forward and denounced the Jews. They reminded the king of his decree and then accused Shadrach, Meshach and Abednego: 'These men pay no attention to you, Your Majesty. They do not serve your gods or worship the image of gold you have set up.'\n\nFurious with rage, Nebuchadnezzar summoned the three men. 'Is it true that you do not serve my gods or worship the image of gold? If you do not worship it, you will be thrown immediately into a blazing furnace. Then what god will be able to rescue you from my hand?'\n\nShadrach, Meshach and Abednego replied, 'King Nebuchadnezzar, we do not need to defend ourselves before you in this matter. If we are thrown into the blazing furnace, the God we serve is able to deliver us from it, and he will deliver us from Your Majesty's hand. But even if he does not, we want you to know, Your Majesty, that we will not serve your gods or worship the image of gold you have set up.'\n\nNebuchadnezzar was furious. He ordered the furnace heated seven times hotter than usual and commanded some of the strongest soldiers to tie up the three men and throw them in. The furnace was so hot that the flames killed the soldiers who threw them in.\n\nThen Nebuchadnezzar leaped to his feet in amazement. 'Weren't there three men that we tied up and threw into the fire? Look! I see four men walking around in the fire, unbound and unharmed, and the fourth looks like a son of the gods.'\n\nNebuchadnezzar approached the opening of the blazing furnace and shouted, 'Shadrach, Meshach and Abednego, servants of the Most High God, come out!'\n\nThey came out, and everyone crowded around them. The fire had not harmed their bodies, nor was a hair of their heads singed; their robes were not scorched, and there was no smell of fire on them.\n\nThen Nebuchadnezzar said, 'Praise be to the God of Shadrach, Meshach and Abednego, who has sent his angel and rescued his servants! They trusted in him and defied the king's command and were willing to give up their lives rather than serve or worship any god except their own God.'",
      "kids_title": "Three Brave Friends",
      "kids_description": "King Nebuchadnezzar built a giant gold statue and told everyone to bow down to it. But three friends—Shadrach, Meshach, and Abednego—said 'No! We only bow to God!' Even when thrown into a fire, God kept them safe!",
      "kids_narrative": "King Nebuchadnezzar built a GINORMOUS gold statue—as tall as a nine-story building! He told everyone, 'When the music plays, bow down and worship my statue. If you don't... you'll be thrown into a fire!'\n\nThe music played. Everyone bowed down.\n\nWell, almost everyone.\n\nThree young men named Shadrach, Meshach, and Abednego stayed standing. They only bowed to GOD, not statues!\n\nSome tattletales told the king. Nebuchadnezzar was FURIOUS!\n\n'Is it TRUE?!' he roared. 'Bow down now, or into the fire you go! What god can save you from ME?'\n\nThe three friends answered bravely, 'O King, our God CAN save us from the fire. But even if He doesn't, we still won't bow to your statue. We only worship the true God!'\n\nNow Nebuchadnezzar was REALLY mad. 'Heat the furnace SEVEN times hotter!' The soldiers tied up the three friends and threw them in. The fire was SO hot that the soldiers died just from being near it!\n\nBut then the king jumped up, eyes wide. 'Wait... didn't we throw THREE men in? I see FOUR people walking around in there! And one of them looks like... a son of the gods!'\n\nGod had sent someone special to protect them!\n\n'Shadrach, Meshach, and Abednego! Come out!'\n\nThey walked out. Everyone stared. Not one hair was burned. Their clothes weren't scorched. They didn't even SMELL like smoke!\n\nThe king was amazed. 'Praise the God of Shadrach, Meshach, and Abednego! No other god can save like this!'\n\nGod is with us even in the scariest times—and His power is greater than any fire!"
    },
    {
      "title": "Daniel in the Lions' Den",
      "slug": "daniel-in-the-lions-den",
      "description": "Daniel's enemies trick the king into making a law against prayer. Daniel continues to pray, is thrown to the lions, and is miraculously preserved.",
      "verses": ["Daniel 6:1-28"],
      "themes": ["Faithfulness in prayer", "God's protection", "Integrity"],
      "characters": ["Daniel", "King Darius", "Jealous officials", "Lions"],
      "narrative": "It pleased Darius to appoint 120 satraps to rule throughout the kingdom, with three administrators over them, one of whom was Daniel. Daniel so distinguished himself by his exceptional qualities that the king planned to set him over the whole kingdom.\n\nAt this, the other administrators and satraps tried to find grounds for charges against Daniel in his conduct of government affairs, but they could find no corruption in him. Finally they said, 'We will never find any basis for charges against this man Daniel unless it has something to do with the law of his God.'\n\nSo they went to the king and said, 'May King Darius live forever! The royal administrators have all agreed that the king should issue an edict that anyone who prays to any god or human being during the next thirty days, except to you, Your Majesty, shall be thrown into the lions' den. Now, Your Majesty, issue the decree and put it in writing so that it cannot be altered.'\n\nKing Darius put the decree in writing.\n\nNow when Daniel learned that the decree had been published, he went home to his upstairs room where the windows opened toward Jerusalem. Three times a day he got down on his knees and prayed, giving thanks to his God, just as he had done before.\n\nThe men went as a group and found Daniel praying. They went to the king and spoke to him about his decree. 'Daniel pays no attention to you, Your Majesty. He still prays three times a day.'\n\nWhen the king heard this, he was greatly distressed; he was determined to rescue Daniel and made every effort until sundown to save him. But the men reminded him that no decree issued by the king could be changed.\n\nSo the king gave the order, and they brought Daniel and threw him into the lions' den. The king said to Daniel, 'May your God, whom you serve continually, rescue you!'\n\nA stone was brought and placed over the mouth of the den, and the king sealed it. Then the king returned to his palace and spent the night without eating. He could not sleep.\n\nAt the first light of dawn, the king hurried to the lions' den. 'Daniel, servant of the living God, has your God been able to rescue you from the lions?'\n\nDaniel answered, 'May the king live forever! My God sent his angel, and he shut the mouths of the lions. They have not hurt me, because I was found innocent in his sight. Nor have I ever done any wrong before you, Your Majesty.'\n\nThe king was overjoyed and gave orders to lift Daniel out of the den. No wound was found on him, because he had trusted in his God.\n\nThen King Darius wrote to all nations: 'I issue a decree that in every part of my kingdom people must fear and reverence the God of Daniel. For he is the living God and he endures forever. He rescues and he saves; he performs signs and wonders in the heavens and on the earth. He has rescued Daniel from the power of the lions.'",
      "kids_title": "Daniel and the Lions",
      "kids_description": "Bad men tricked the king into making a law against praying to God. But Daniel kept praying anyway! He was thrown into a den of hungry lions—but God sent an angel to shut the lions' mouths!",
      "kids_narrative": "Daniel loved God and prayed to Him three times every day. He was also REALLY good at his job working for King Darius. So good that the king wanted to put Daniel in charge of everything!\n\nThis made some other men JEALOUS. They wanted to get Daniel in trouble. But Daniel never did anything wrong!\n\n'The only way to trap Daniel,' they said, 'is to make a rule about his God.'\n\nThey went to the king with a sneaky plan. 'O King, make a new law! For thirty days, no one can pray to anyone except YOU. If they do, throw them to the LIONS!'\n\nThe king thought this sounded like a good idea and signed the law.\n\nWhen Daniel heard about the law, what do you think he did? He went home, opened his window toward Jerusalem, and prayed—just like always! Three times a day, on his knees, thanking God.\n\nThe jealous men peeked through the window. 'Gotcha!'\n\nThey ran to tell the king. 'Daniel broke your law!'\n\nKing Darius was SO sad. He liked Daniel! He tried everything to save him. But the law couldn't be changed.\n\nSoldiers threw Daniel into a pit full of hungry lions. ROAR! The king called down, 'May YOUR God rescue you!'\n\nA big stone covered the opening. The king went home but couldn't eat or sleep. He was too worried about Daniel.\n\nAt sunrise, the king RAN to the lions' den. 'Daniel! Did your God save you?!'\n\n'Yes!' Daniel called back. 'God sent an angel who shut the lions' mouths! They didn't hurt me at all!'\n\nThe king was SO happy! He pulled Daniel out—not a scratch on him!\n\nKing Darius made a NEW law: 'Everyone must respect Daniel's God! He is the living God who rescues and saves!'\n\nDaniel kept praying. And God kept taking care of him."
    },
    {
      "title": "Isaiah's Vision",
      "slug": "isaiahs-vision",
      "description": "In the year King Uzziah died, Isaiah sees the Lord seated on His throne, surrounded by seraphim crying 'Holy, holy, holy.' Isaiah is cleansed and commissioned.",
      "verses": ["Isaiah 6:1-13"],
      "themes": ["God's holiness", "Human sinfulness", "Cleansing", "Calling"],
      "characters": ["Isaiah", "God", "Seraphim"],
      "narrative": "In the year that King Uzziah died, I saw the Lord, high and exalted, seated on a throne; and the train of his robe filled the temple. Above him were seraphim, each with six wings: With two wings they covered their faces, with two they covered their feet, and with two they were flying.\n\nAnd they were calling to one another: 'Holy, holy, holy is the Lord Almighty; the whole earth is full of his glory.'\n\nAt the sound of their voices the doorposts and thresholds shook and the temple was filled with smoke.\n\n'Woe to me!' I cried. 'I am ruined! For I am a man of unclean lips, and I live among a people of unclean lips, and my eyes have seen the King, the Lord Almighty.'\n\nThen one of the seraphim flew to me with a live coal in his hand, which he had taken with tongs from the altar. With it he touched my mouth and said, 'See, this has touched your lips; your guilt is taken away and your sin atoned for.'\n\nThen I heard the voice of the Lord saying, 'Whom shall I send? And who will go for us?'\n\nAnd I said, 'Here am I. Send me!'\n\nHe said, 'Go and tell this people: \"Be ever hearing, but never understanding; be ever seeing, but never perceiving.\" Make the heart of this people calloused; make their ears dull and close their eyes. Otherwise they might see with their eyes, hear with their ears, understand with their hearts, and turn and be healed.'\n\nThen I said, 'For how long, Lord?'\n\nAnd he answered: 'Until the cities lie ruined and without inhabitant, until the houses are left deserted and the fields ruined and ravaged, until the Lord has sent everyone far away and the land is utterly forsaken. And though a tenth remains in the land, it will again be laid waste. But as the terebinth and oak leave stumps when they are cut down, so the holy seed will be the stump in the land.'\n\nIsaiah's vision of God's transcendent holiness became the foundation for his prophetic ministry—a ministry that would span the reigns of four kings and produce the most extensive messianic prophecies in the Old Testament.",
      "kids_title": "Isaiah Sees God",
      "kids_description": "Isaiah had an amazing vision! He saw God sitting on a throne with angels flying around singing 'Holy, holy, holy!' Isaiah felt scared because of his sins, but God cleaned him and gave him an important job.",
      "kids_narrative": "Isaiah was a prophet—someone who spoke messages from God. One day, he had the most AMAZING vision!\n\nIsaiah saw the Lord sitting on a high throne. God was so big and glorious that just the bottom of His robe filled the whole temple!\n\nFlying above God were special angels called seraphim. They had six wings each! Two wings covered their faces, two covered their feet, and two were for flying.\n\nThe angels called to each other: 'HOLY, HOLY, HOLY is the Lord! The whole earth is full of His glory!'\n\nTheir voices were so powerful that the building shook! Smoke filled the temple!\n\nIsaiah was terrified. 'Oh no! I'm ruined! My words are not pure. The people around me are not pure. And now I've seen GOD, the King of everything!'\n\nIsaiah felt so small and sinful next to the perfectly holy God.\n\nBut then one of the angels flew to Isaiah. The angel carried a burning coal from the altar. He touched Isaiah's lips with it and said, 'Look! This has touched your lips. Your guilt is gone. Your sin is forgiven!'\n\nThen Isaiah heard God's voice: 'Who can I send? Who will go for us?'\n\nIsaiah answered right away: 'Here I am! Send ME!'\n\nGod gave Isaiah his mission—to speak God's words to the people, even though many wouldn't listen.\n\nIsaiah spent the rest of his life telling people about God. He wrote about how a special Savior would come—and hundreds of years later, Jesus fulfilled everything Isaiah said!\n\nWhen we see how holy and amazing God is, we realize we need His forgiveness. And when He forgives us, we can say, 'Here I am—send me!'"
    },
    {
      "title": "Ezekiel and the Valley of Dry Bones",
      "slug": "ezekiel-valley-of-dry-bones",
      "description": "God shows Ezekiel a valley full of dry bones and commands him to prophesy. The bones come together, receive flesh, and live—a promise of Israel's restoration.",
      "verses": ["Ezekiel 37:1-14"],
      "themes": ["Resurrection", "Hope", "God's power to restore", "The Holy Spirit"],
      "characters": ["Ezekiel", "God"],
      "narrative": "The hand of the Lord was on me, and he brought me out by the Spirit of the Lord and set me in the middle of a valley; it was full of bones. He led me back and forth among them, and I saw a great many bones on the floor of the valley, bones that were very dry.\n\nHe asked me, 'Son of man, can these bones live?'\n\nI said, 'Sovereign Lord, you alone know.'\n\nThen he said to me, 'Prophesy to these bones and say to them, \"Dry bones, hear the word of the Lord! This is what the Sovereign Lord says to these bones: I will make breath enter you, and you will come to life. I will attach tendons to you and make flesh come upon you and cover you with skin; I will put breath in you, and you will come to life. Then you will know that I am the Lord.\"'\n\nSo I prophesied as I was commanded. And as I was prophesying, there was a noise, a rattling sound, and the bones came together, bone to bone. I looked, and tendons and flesh appeared on them and skin covered them, but there was no breath in them.\n\nThen he said to me, 'Prophesy to the breath; prophesy, son of man, and say to it, \"This is what the Sovereign Lord says: Come, breath, from the four winds and breathe into these slain, that they may live.\"'\n\nSo I prophesied as he commanded me, and breath entered them; they came to life and stood up on their feet—a vast army.\n\nThen he said to me: 'Son of man, these bones are the people of Israel. They say, \"Our bones are dried up and our hope is gone; we are cut off.\" Therefore prophesy and say to them: \"This is what the Sovereign Lord says: My people, I am going to open your graves and bring you up from them; I will bring you back to the land of Israel. Then you, my people, will know that I am the Lord, when I open your graves and bring you up from them. I will put my Spirit in you and you will live, and I will settle you in your own land. Then you will know that I the Lord have spoken, and I have done it, declares the Lord.\"'",
      "kids_title": "The Valley of Bones",
      "kids_description": "God showed Ezekiel a valley full of dry, dead bones. 'Can these bones live?' God asked. Ezekiel said, 'Only You know!' Then God made the bones come back to life! It was a picture of how God can bring hope to hopeless situations.",
      "kids_narrative": "Ezekiel was a prophet who lived far from home. God's people had been captured and taken to a foreign land. They were sad and hopeless.\n\nOne day, God's Spirit brought Ezekiel to a strange place—a valley filled with bones. Old, dry, dead bones. Everywhere he looked... bones, bones, bones.\n\nGod asked Ezekiel a surprising question: 'Son of man, can these bones live again?'\n\nEzekiel thought carefully. Those bones looked VERY dead. But he knew God could do anything!\n\n'Lord, only YOU know,' Ezekiel answered.\n\nGod said, 'Speak to the bones! Tell them to hear My word!'\n\nSo Ezekiel spoke to the bones. He said, 'Dry bones, listen! God says He will put breath in you and make you LIVE!'\n\nAs Ezekiel spoke, something amazing happened.\n\nRATTLE, RATTLE, RATTLE!\n\nThe bones started moving! They came together—leg bones connected to hip bones, arm bones connected to shoulder bones. Then muscles appeared on the bones. Then skin covered the muscles.\n\nBut the bodies weren't breathing yet.\n\nGod said, 'Now speak to the wind! Tell the breath to come!'\n\nEzekiel obeyed. And WHOOOOSH! Breath entered the bodies. They stood up—a huge army of living people!\n\nGod explained what this meant. 'My people Israel feel like dead bones. They say, \"We have no hope.\" But tell them this: I will bring them back to life! I will put My Spirit in them! I will bring them home!'\n\nThis vision showed that God can bring life to ANYTHING—even dry, dead bones! No situation is too hopeless for God. He can bring life, hope, and new beginnings."
    },
    {
      "title": "Jeremiah in the Cistern",
      "slug": "jeremiah-in-the-cistern",
      "description": "For speaking God's truth during the siege of Jerusalem, Jeremiah is thrown into a muddy cistern to die. An Ethiopian official bravely rescues him.",
      "verses": ["Jeremiah 38:1-13"],
      "themes": ["Persecution", "Courage", "Faithfulness", "Rescue"],
      "characters": ["Jeremiah", "King Zedekiah", "Ebed-Melech", "The Officials"],
      "narrative": "Jeremiah had been prophesying for decades, warning Judah that judgment was coming because of their sins. Now Babylon's army surrounded Jerusalem, and Jeremiah continued to speak God's message: 'Whoever stays in this city will die by the sword, famine, or plague. But whoever goes out and surrenders to the Babylonians will live.'\n\nThe officials came to King Zedekiah. 'This man should be put to death! He is discouraging the soldiers who are left in this city, as well as all the people. This man is not seeking the good of these people but their ruin.'\n\nKing Zedekiah was weak and feared these powerful men. 'He is in your hands,' the king said. 'The king can do nothing to oppose you.'\n\nSo they took Jeremiah and lowered him by ropes into the cistern of Malkijah, the king's son, which was in the courtyard of the guard. There was no water in the cistern—only mud—and Jeremiah sank down into the mud. They left him there to die.\n\nBut Ebed-Melech, a Cushite official in the royal palace, heard what they had done to Jeremiah. He went to the king, who was sitting in the Benjamin Gate. 'My lord the king, these men have acted wickedly in all they have done to Jeremiah the prophet. They have thrown him into a cistern, where he will starve to death.'\n\nThe king commanded Ebed-Melech, 'Take thirty men from here with you and lift Jeremiah the prophet out of the cistern before he dies.'\n\nEbed-Melech took the men and went to the palace to get old rags and worn-out clothes. He lowered them by ropes to Jeremiah in the cistern. He told Jeremiah, 'Put these old rags and worn-out clothes under your arms to pad the ropes.' Jeremiah did so.\n\nThey pulled him up with the ropes and lifted him out of the cistern. And Jeremiah remained in the courtyard of the guard, continuing his ministry until Jerusalem fell to Babylon.\n\nEbed-Melech's courage saved a prophet's life. Later, God sent a special message through Jeremiah promising that Ebed-Melech would survive Jerusalem's fall because he trusted in the Lord.",
      "kids_title": "Jeremiah Rescued from the Mud",
      "kids_description": "Jeremiah told people God's message, but they didn't like what he said. Angry leaders threw him into a deep muddy pit to die. But a brave man named Ebed-Melech rescued him!",
      "kids_narrative": "Jeremiah was a prophet with a very hard job. God told him to warn the people of Jerusalem that their city would be captured because they had disobeyed God. Nobody wanted to hear this! The soldiers fighting to protect Jerusalem especially didn't like it.\n\nSome angry leaders went to the king. 'Jeremiah is making our soldiers give up! He keeps saying we'll lose! He should be killed!'\n\nKing Zedekiah was afraid of these powerful men. 'Fine,' he said. 'Do what you want.'\n\nThe men grabbed Jeremiah and took him to a deep pit called a cistern. It was used to collect rainwater, but now it just had thick, sticky mud at the bottom. They lowered Jeremiah down with ropes and left him there!\n\nPoor Jeremiah! He sank into the cold, gooey mud. There was no water, no food, and no way to climb out. He was left there to die.\n\nBut someone heard what happened. His name was Ebed-Melech, and he was from a country called Cush, far away in Africa. He worked in the king's palace, and he was BRAVE.\n\nEbed-Melech went straight to the king. 'Those men did a wicked thing! Jeremiah will starve to death in that pit!'\n\nThe king listened to Ebed-Melech. 'Take thirty men and pull Jeremiah out before he dies!'\n\nEbed-Melech was smart and kind. He found old rags and worn-out clothes. He lowered them down to Jeremiah and said, 'Put these under your arms so the ropes won't hurt you!'\n\nThen they pulled Jeremiah up, up, up out of the mud!\n\nJeremiah was saved! He kept speaking God's message until the city fell, just as God said it would. And God blessed Ebed-Melech for his courage. When Jerusalem was destroyed, Ebed-Melech was kept safe because he trusted in God.\n\nSometimes doing the right thing takes courage. Ebed-Melech wasn't afraid to help God's prophet, and God rewarded his bravery!"
    },
    {
      "title": "Daniel's Faithfulness with Food",
      "slug": "daniels-faithfulness-with-food",
      "description": "Daniel and his three friends refuse the king's rich food and wine, choosing vegetables instead, and God honors their faithfulness by making them healthier and wiser than all others.",
      "verses": ["Daniel 1:1-21"],
      "themes": ["Faithfulness", "Obedience to God", "Wisdom", "Integrity"],
      "characters": ["Daniel", "Hananiah", "Mishael", "Azariah", "Nebuchadnezzar", "Ashpenaz", "Melzar"],
      "narrative": "In the third year of the reign of Jehoiakim king of Judah, Nebuchadnezzar king of Babylon besieged Jerusalem and carried away some of the vessels of the house of God, along with certain children of Israel, including those of the king's seed and of the princes. These young men were to be taught the learning and tongue of the Chaldeans, prepared to stand in the king's palace. Among them were Daniel, Hananiah, Mishael, and Azariah, who were given Babylonian names: Belteshazzar, Shadrach, Meshach, and Abednego.\n\nThe king appointed them a daily provision of his own meat and wine, intending to nourish them for three years before they entered his service. However, Daniel purposed in his heart that he would not defile himself with the portion of the king's meat, nor with the wine which he drank. These foods likely violated the dietary laws God had given to Israel, and Daniel sought to remain faithful to the covenant even in captivity.\n\nDaniel requested of the prince of the eunuchs that he might not defile himself, and God had brought Daniel into favor and tender love with this official. Yet the prince feared the king's wrath if these young men appeared worse than their peers. Daniel then proposed a test to Melzar, the steward: 'Prove thy servants, I beseech thee, ten days; and let them give us pulse to eat, and water to drink. Then let our countenances be looked upon before thee, and the countenance of the children that eat of the portion of the king's meat.'\n\nMelzar consented to the test. At the end of ten days, Daniel and his companions appeared fairer and fatter in flesh than all the young men who ate the king's provisions. Melzar therefore removed their appointed meat and wine, giving them pulse instead. God gave these four young men knowledge and skill in all learning and wisdom, and Daniel had understanding in all visions and dreams. When their three years concluded and they stood before Nebuchadnezzar, the king found none like them in all his realm. In all matters of wisdom and understanding, they were ten times better than all the magicians and astrologers in his kingdom. Thus God honored their faithful obedience.",
      "kids_title": "Daniel Chooses God's Food",
      "kids_description": "When Daniel and his friends are taken to the king's palace, they choose to eat vegetables instead of the king's fancy food, and God makes them the healthiest of all!",
      "kids_narrative": "Long ago, a powerful king named Nebuchadnezzar conquered Jerusalem and took many people to his kingdom of Babylon. Among them were four young men: Daniel, Hananiah, Mishael, and Azariah. The king's servants gave them new names—Belteshazzar, Shadrach, Meshach, and Abednego—and planned to teach them everything about Babylon so they could work in the king's palace.\n\nThe king wanted these young men to eat the same rich food and wine that he ate every day. But Daniel knew that some of this food was not right for God's people to eat. He didn't want to disobey God, even though he was far from home. So Daniel made a brave decision: he would not eat the king's food.\n\nDaniel kindly asked the man in charge if he and his three friends could eat only vegetables and drink only water instead. The man was worried. 'What if you look skinny and sick?' he said. 'The king will be angry with me!'\n\nDaniel had an idea. 'Let's try it for just ten days,' he suggested. 'Then see if we look worse than the other young men who eat the king's food.'\n\nThe man agreed to the test. For ten days, Daniel and his friends ate vegetables and drank water while the others ate the king's fancy meals. And guess what happened? At the end of ten days, Daniel and his friends looked healthier and stronger than everyone else! Their faces were bright and they felt wonderful.\n\nSo the man let them keep eating vegetables. God blessed Daniel and his friends for choosing to obey Him. He made them very smart and wise—even wiser than all the king's magicians and advisors! When they stood before King Nebuchadnezzar, he was amazed. He had never met anyone as wise as these four young men. Daniel and his friends learned that when you obey God, He takes care of you."
    }
  ]
}
