{
  "category": "Esther & Deliverance",
  "slug": "esther-and-deliverance",
  "description": "The story of Queen Esther's courage and God's providence in delivering His people from destruction in Persia.",
  "stories": [
    {
      "title": "Esther Becomes Queen",
      "slug": "esther-becomes-queen",
      "description": "A Jewish orphan rises from obscurity to become queen of Persia, positioned by God's providence for a crucial moment in history.",
      "verses": ["Esther 1:1-22", "Esther 2:1-23"],
      "themes": ["Providence", "Preparation", "God's sovereignty", "Divine positioning"],
      "characters": ["Esther", "Mordecai", "King Ahasuerus", "Queen Vashti", "Hegai"],
      "narrative": "King Ahasuerus ruled over 127 provinces stretching from India to Ethiopia, his throne established in Shushan the palace. In the third year of his reign, he held a lavish feast displaying his magnificent wealth and power for 180 days. When Queen Vashti refused his command to display her beauty before his drunken nobles, the king's anger burned hot. His counselors advised him to depose her, lest all wives despise their husbands, and Ahasuerus agreed. The decree went forth: Vashti would be queen no more.\n\nAfter his anger subsided, the king's servants proposed a plan: gather beautiful young virgins from all provinces to find a new queen. Among those brought to the palace was Hadassah, called Esther, a Jewish orphan raised by her cousin Mordecai. Her parents had died, and Mordecai had taken her as his own daughter. She was lovely in form and beautiful to behold.\n\nMordecai had warned Esther not to reveal her Jewish identity. She found favor with Hegai, keeper of the women, who gave her the best place in the house and seven maidens to serve her. For twelve months she underwent beauty treatments—six months with oil of myrrh and six with sweet spices—before her turn to go before the king.\n\nWhen Esther's turn came, she required nothing but what Hegai advised. She obtained favor in the sight of all who saw her. In the tenth month of the seventh year of his reign, King Ahasuerus loved Esther above all the women. He set the royal crown upon her head and made her queen instead of Vashti. He proclaimed a holiday throughout the provinces and gave gifts with royal liberality.\n\nMeanwhile, Mordecai sat at the king's gate. There he overheard two chamberlains, Bigthan and Teresh, plotting to assassinate King Ahasuerus. Mordecai told Esther, who informed the king in Mordecai's name. When the matter was investigated and found true, both men were hanged. The deed was written in the book of chronicles before the king—a small act that would prove crucial in days to come.\n\nGod's hand was invisible but unmistakable. An orphaned Jewish girl was now queen of the greatest empire on earth. Her adoptive father sat at the gate, positioned to hear vital information. Her identity remained secret. Everything was being prepared, though no one yet knew for what purpose.",
      "kids_title": "The Brave Girl Who Became Queen",
      "kids_description": "Esther was a Jewish girl whose parents died. Her cousin Mordecai took care of her. When the king needed a new queen, God helped Esther become queen of the whole kingdom!",
      "kids_narrative": "Once upon a time, there was a girl named Esther. Her mommy and daddy had died when she was little, so her big cousin Mordecai took care of her. He loved her like she was his own daughter.\n\nEsther and Mordecai lived in a land called Persia, far from their homeland. A very powerful king named Ahasuerus ruled there. He lived in a beautiful palace with lots of gold and jewels.\n\nOne day, the king's wife, Queen Vashti, did something that made the king very angry. He said she couldn't be queen anymore.\n\nThe king's helpers said, 'Let's find you a new queen! We'll bring the most beautiful young women in the kingdom to the palace, and you can choose the best one!'\n\nEsther was one of the young women brought to the palace. She was very beautiful and very kind. Everyone who met her liked her! The man in charge of all the young women gave Esther the best room and the nicest helpers.\n\nFor a whole year, Esther got special beauty treatments and wore fancy clothes. Then it was time to meet the king.\n\nWhen King Ahasuerus saw Esther, he loved her more than anyone else! He put a royal crown on her head and made her the new queen! There was a big celebration throughout the whole kingdom.\n\nEsther kept a secret, though. Mordecai had told her not to tell anyone she was Jewish. She obeyed him.\n\nMordecai stayed nearby, working at the king's gate. One day, he heard two bad men planning to hurt the king! Mordecai quickly told Esther, and she told the king. The bad men were caught, and the king was safe. The king wrote down in his special book that Mordecai had saved his life.\n\nEsther didn't know it yet, but God had a very important job for her to do. He had made her queen for a special reason!"
    },
    {
      "title": "Haman's Plot",
      "slug": "hamans-plot",
      "description": "The wicked Haman, enraged by Mordecai's refusal to bow, plots to destroy all the Jews throughout the Persian Empire.",
      "verses": ["Esther 3:1-15"],
      "themes": ["Evil schemes", "Pride", "Hatred", "Persecution", "God's hidden hand"],
      "characters": ["Haman", "Mordecai", "King Ahasuerus", "The Jews"],
      "narrative": "After these things, King Ahasuerus promoted Haman the Agagite above all the princes, setting his seat above all who were with him. The king commanded that all servants at the gate should bow and reverence Haman. Every day they bowed—except one man. Mordecai the Jew refused to bow or pay homage.\n\nThe servants questioned Mordecai: 'Why do you transgress the king's commandment?' Day after day they asked, but Mordecai would not comply. He had told them he was a Jew, and Jews bowed to God alone. When they told Haman, he came to see for himself.\n\nHaman's fury burned when he saw Mordecai standing tall while all others prostrated themselves. But when he learned Mordecai was a Jew, killing one man seemed insufficient revenge. Haman sought to destroy all the Jews throughout the whole kingdom of Ahasuerus—all of Mordecai's people.\n\nIn the first month, Haman cast Pur (that is, the lot) before him from day to day and month to month, seeking the most auspicious time for his genocide. The lot fell on the thirteenth day of the twelfth month, the month of Adar—eleven months away.\n\nHaman approached King Ahasuerus with cunning words: 'There is a certain people scattered abroad and dispersed among the provinces of your kingdom. Their laws are different from all other people, and they do not keep the king's laws. It is not profitable for the king to tolerate them. If it please the king, let it be written that they be destroyed, and I will pay ten thousand talents of silver into the king's treasuries.'\n\nThe king, perhaps distracted or unconcerned, took his signet ring from his hand and gave it to Haman. 'The silver is given to you,' the king said, 'the people also, to do with them as it seems good to you.' With the king's seal, Haman's decree would be irrevocable.\n\nHaman called the king's scribes. They wrote according to all that Haman commanded—to the king's lieutenants, governors, and rulers of every province in their own script and language. It was written in King Ahasuerus's name and sealed with his ring. Letters went by couriers into all the provinces to destroy, to kill, and to annihilate all Jews, both young and old, little children and women, in one day—on the thirteenth day of the twelfth month—and to take their possessions as plunder.\n\nThe decree was published in Shushan the palace. The king and Haman sat down to drink, but the city of Shushan was perplexed. An entire people—innocent men, women, and children—had been condemned to death. Yet God's name is never mentioned in the book of Esther. His hand worked in the shadows, unseen but not absent.",
      "kids_title": "The Bad Man's Mean Plan",
      "kids_description": "A proud man named Haman got angry because Mordecai wouldn't bow down to him. Haman made an evil plan to hurt all of God's people, the Jews. But God was watching.",
      "kids_narrative": "After Esther became queen, the king chose a man named Haman to be his most important helper. Haman was very proud and mean.\n\nThe king made a rule: 'Everyone must bow down to Haman!' So whenever Haman walked by, everyone would bow way down low.\n\nEveryone except Mordecai.\n\nMordecai would stand up straight. He wouldn't bow. The other workers asked him, 'Why won't you bow? It's the rule!'\n\nMordecai said, 'I am a Jew. I only bow to God.'\n\nWhen Haman saw Mordecai standing while everyone else bowed, he got SO angry! His face turned red. He was furious!\n\n'How dare Mordecai not bow to me!' Haman thought. But then he got an even meaner idea. 'Mordecai is a Jew? Then I'll hurt ALL the Jews! I'll get rid of every single one of them!'\n\nHaman was very wicked. He rolled special dice to pick a day for his terrible plan. The dice said the thirteenth day of the twelfth month—almost a whole year away.\n\nHaman went to the king and told lies. 'There's a group of people in your kingdom who don't obey your rules. They're dangerous! You should make a law to destroy them all!'\n\nThe king wasn't paying attention. He gave Haman his special ring. 'Do whatever you think is best,' the king said.\n\nHaman wrote a mean, terrible law. It said that on one day, all the Jewish people everywhere in the kingdom would be killed—even children and babies! The law was sent to every city and town.\n\nPeople in the city were very confused and upset when they heard about the law. How could this happen to innocent people?\n\nBut Haman and the king just sat down and had a party. Haman thought he had won.\n\nWhat Haman didn't know was that God was watching. And God had a plan to save His people."
    },
    {
      "title": "For Such a Time as This",
      "slug": "for-such-a-time-as-this",
      "description": "Mordecai calls Esther to risk her life by approaching the king uninvited, reminding her that she may have come to the kingdom for such a time as this.",
      "verses": ["Esther 4:1-17"],
      "themes": ["Calling", "Courage", "Faith", "Purpose", "Divine timing"],
      "characters": ["Mordecai", "Esther", "Hatach", "The Jews"],
      "narrative": "When Mordecai learned all that had been done, he tore his clothes, put on sackcloth with ashes, and went into the midst of the city, crying out with a loud and bitter cry. He came before the king's gate, for no one could enter wearing sackcloth. Throughout every province where the decree arrived, there was great mourning among the Jews—fasting, weeping, wailing, with many lying in sackcloth and ashes.\n\nEsther's maidens and chamberlains came and told her. The queen was deeply distressed. She sent garments to clothe Mordecai and remove his sackcloth, but he refused them. So Esther called for Hatach, one of the king's chamberlains appointed to attend her, and commanded him to learn what troubled Mordecai and why.\n\nHatach went to Mordecai in the street before the king's gate. Mordecai told him everything—all that had happened, the exact sum of money Haman had promised to pay into the treasuries for the destruction of the Jews. He gave Hatach a copy of the written decree issued in Shushan, charging him to show it to Esther, declare it to her, and command her to go before the king to make supplication and petition for her people.\n\nHatach returned and told Esther Mordecai's words. She sent this reply: 'All the king's servants and the people of the provinces know that any man or woman who comes to the king into the inner court without being called faces one law—to be put to death, except those to whom the king holds out the golden scepter, that they may live. And I have not been called to come to the king these thirty days.'\n\nWhen Mordecai received Esther's words, he sent back this response: 'Do not think in your heart that you will escape in the king's palace any more than all the other Jews. For if you remain completely silent at this time, relief and deliverance will arise for the Jews from another place, but you and your father's house will perish. Yet who knows whether you have come to the kingdom for such a time as this?'\n\nThese words pierced Esther's heart. Her position of safety was an illusion—Haman's decree condemned her too. Her silence would not save her. But more than that, Mordecai suggested divine purpose in her elevation. God had positioned her precisely here, precisely now, for this very crisis.\n\nEsther sent her answer: 'Go, gather all the Jews present in Shushan, and fast for me. Neither eat nor drink for three days, night or day. My maidens and I will fast likewise. And so I will go to the king, which is not according to the law. And if I perish, I perish.'\n\nMordecai went his way and did according to all that Esther had commanded. The orphan girl had become a woman of extraordinary courage, willing to lay down her life for her people.",
      "kids_title": "Esther's Big Choice",
      "kids_description": "When Mordecai heard about Haman's plan, he asked Esther to help save God's people. It was dangerous, but Esther was brave. She said, 'If I die trying to help, then I die.'",
      "kids_narrative": "When Mordecai heard about Haman's terrible law, he was so sad! He tore his clothes and cried and cried. All the Jewish people everywhere were crying too.\n\nQueen Esther heard that Mordecai was very upset. She sent her helper to ask him, 'What's wrong?'\n\nMordecai sent back a message with a copy of Haman's mean law. 'You have to help!' he told Esther. 'Go talk to the king! Ask him to save our people!'\n\nEsther was scared. She sent a message back: 'There's a big problem. If anyone goes to see the king without being invited, they could be killed! The only way to be safe is if the king holds out his golden stick to you. And he hasn't asked to see me for a whole month!'\n\nMordecai sent another message. This one was very serious: 'Don't think you'll be safe just because you're the queen. You're Jewish too! Haman's law will hurt you also. If you stay quiet now, God will save the Jewish people some other way—but you and your family will be in trouble. Maybe God made you queen for exactly this reason—to save us right now!'\n\nEsther thought hard. Mordecai was right! Maybe this was why God let her become queen—to help her people at just the right time!\n\nEsther was scared, but she was also brave. She sent this message back: 'Tell all the Jewish people in the city not to eat or drink for three days. Pray for me! My helpers and I will do the same. Then I will go to the king, even though it's against the law. And if I die trying to help, then I die.'\n\nWow! Esther was willing to risk her life to save God's people! That takes a LOT of courage!\n\nSo all the Jewish people fasted and prayed for three days. They asked God to protect Esther and help her be brave."
    },
    {
      "title": "Esther's Brave Plan",
      "slug": "esthers-brave-plan",
      "description": "Esther approaches the king and invites him and Haman to banquets, while God orchestrates events—including a sleepless night—to bring about Haman's downfall.",
      "verses": ["Esther 5:1-14", "Esther 6:1-14", "Esther 7:1-10"],
      "themes": ["Courage", "Wisdom", "God's timing", "Justice", "Reversal of fortunes"],
      "characters": ["Esther", "King Ahasuerus", "Haman", "Mordecai", "Zeresh", "Harbonah"],
      "narrative": "On the third day, Esther put on her royal apparel and stood in the inner court of the king's house, opposite his hall. The king sat upon his throne in the royal house, facing the entrance. When he saw Queen Esther standing in the court, she obtained favor in his sight. He held out the golden scepter in his hand, and Esther approached and touched its top.\n\n'What is your wish, Queen Esther?' the king asked. 'What is your request? It shall be given you, even to half of the kingdom.'\n\nEsther answered wisely, 'If it seem good to the king, let the king and Haman come today to the banquet that I have prepared for him.' The king commanded Haman to come quickly, and they attended Esther's feast.\n\nAt the banquet, the king again asked, 'What is your petition? It shall be granted you. What is your request? Even to half the kingdom, it shall be performed.'\n\nEsther replied, 'If I have found favor in the king's sight, let the king and Haman come tomorrow to the banquet I shall prepare for them, and tomorrow I will do as the king has said.'\n\nHaman left that day joyful and glad of heart. But when he saw Mordecai at the gate, who neither stood nor moved for him, he was filled with indignation. Yet he restrained himself and went home. He called for his friends and Zeresh his wife, boasting of his riches, his many sons, his promotions, and his invitation to the queen's exclusive banquet. 'Yet all this avails me nothing,' Haman said, 'so long as I see Mordecai the Jew sitting at the king's gate.'\n\nZeresh and his friends counseled him, 'Let a gallows be made, fifty cubits high, and tomorrow speak to the king that Mordecai may be hanged on it. Then go merrily with the king to the banquet.' The idea pleased Haman, and he had the gallows made.\n\nThat night, the king could not sleep. He commanded the book of records, the chronicles, to be brought and read to him. There it was found written that Mordecai had exposed the plot of Bigthan and Teresh to assassinate the king.\n\n'What honor or dignity has been bestowed on Mordecai for this?' the king asked.\n\n'Nothing has been done for him,' his servants answered.\n\nAt that moment, Haman entered the outer court to speak about hanging Mordecai. The king called him in and asked, 'What shall be done for the man whom the king delights to honor?'\n\nHaman, thinking the king meant to honor him, described an elaborate ceremony—royal robes, the king's horse, a crown, a public proclamation. 'Let this be done to the man the king delights to honor!'\n\n'Make haste,' the king commanded, 'take the robes and the horse, as you have said, and do so to Mordecai the Jew who sits at the king's gate. Let nothing fail of all you have spoken.'\n\nHumiliated, Haman obeyed, leading Mordecai through the city and proclaiming his honor. Afterwards, Haman rushed home mourning, his head covered. His wife and wise men said ominously, 'If Mordecai is of the seed of the Jews, you will not prevail against him, but will surely fall before him.'\n\nBefore they finished speaking, the king's chamberlains arrived to bring Haman to Esther's banquet. At the feast, the king asked again, 'What is your petition, Queen Esther?'\n\nEsther answered, 'If I have found favor in your sight, O king, let my life be given me at my petition, and my people at my request. For we are sold, I and my people, to be destroyed, to be slain, and to perish.'\n\n'Who is he, and where is he, who dares presume in his heart to do so?' the king demanded.\n\nEsther said, 'The adversary and enemy is this wicked Haman!' \n\nHaman stood terrified before the king and queen. The king rose in his wrath and went into the palace garden. Haman, seeing that evil was determined against him, stayed to beg Queen Esther for his life. He fell upon the couch where Esther was.\n\nThe king returned and exclaimed, 'Will he even assault the queen while I am in the house?' As the words left the king's mouth, they covered Haman's face—the sign of condemnation.\n\nHarbonah, one of the chamberlains, said, 'Behold, the gallows fifty cubits high, which Haman made for Mordecai, who spoke good for the king, stands in Haman's house.'\n\nThe king said, 'Hang him on it.' So they hanged Haman on the gallows he had prepared for Mordecai. Then the king's wrath was pacified.",
      "kids_title": "The Queen's Dinner Party",
      "kids_description": "Esther invited the king to dinner and bravely told him about Haman's plan. The king was angry at Haman! The trap Haman made for Mordecai caught Haman instead!",
      "kids_narrative": "After three days of fasting and praying, Esther put on her most beautiful queen dress. She walked to the throne room, even though she hadn't been invited. Her heart was beating fast!\n\nThe king looked up and saw her. Would he be angry? Would he send her away?\n\nNo! The king smiled! He held out his golden stick to her. Esther was safe!\n\n'What do you want, Queen Esther?' the king asked. 'I'll give you anything you ask for—even half my kingdom!'\n\nEsther had a smart plan. 'Would you and Haman come to a special dinner I made for you?'\n\nThe king said yes! At the dinner, he asked again what she wanted. Esther said, 'Come to another dinner tomorrow, and I'll tell you then.'\n\nHaman left feeling very important. But when he saw Mordecai not bowing, he got angry again. At home, he bragged to his wife and friends. 'The queen invited only me and the king to her dinner! But I still hate that Mordecai!'\n\nHis wife said, 'Build a super tall tower to hang Mordecai on it. Then you can enjoy the party!' Haman thought that was a great idea.\n\nThat night, something important happened. The king couldn't sleep! He asked his helpers to read him his history book.\n\nThey read about how Mordecai saved the king's life from bad guys. 'Did we ever thank Mordecai?' the king asked.\n\n'No, we didn't do anything for him,' they answered.\n\nJust then, Haman came to ask about hanging Mordecai. But the king asked him first: 'What should I do for someone I want to honor?'\n\nHaman thought the king meant HIM! 'Dress him in royal robes! Put him on your horse! Have someone lead him through town shouting how great he is!'\n\n'Perfect!' said the king. 'Go do that for Mordecai!'\n\nOh no! Haman had to honor the man he hated! He was so embarrassed!\n\nThat evening at Esther's second dinner, the king asked again, 'What do you want, Esther?'\n\nEsther took a deep breath and said, 'Please save my life and my people's lives! Someone has made a plan to kill all of us!'\n\n'WHO would do such a thing?' the king shouted.\n\nEsther pointed at Haman. 'This wicked man!'\n\nThe king was SO angry! Haman fell down begging Esther to save him. The king thought Haman was attacking the queen!\n\nA helper said, 'Haman built a tall tower to hang Mordecai—the man who saved your life!'\n\nThe king ordered, 'Hang Haman on it instead!'\n\nAnd that's exactly what happened. The trap Haman made for someone else caught him instead! God protected His people!"
    },
    {
      "title": "The Jews Are Delivered",
      "slug": "the-jews-are-delivered",
      "description": "Esther and Mordecai secure a new decree allowing the Jews to defend themselves, turning mourning into celebration and establishing the feast of Purim.",
      "verses": ["Esther 8:1-17", "Esther 9:1-32", "Esther 10:1-3"],
      "themes": ["Deliverance", "God's providence", "Celebration", "Reversal", "Remembrance"],
      "characters": ["Esther", "Mordecai", "King Ahasuerus", "The Jews", "The enemies of the Jews"],
      "narrative": "On that day, King Ahasuerus gave Queen Esther the house of Haman, the Jews' enemy. Mordecai came before the king, for Esther had revealed their relationship. The king took off his ring, which he had taken from Haman, and gave it to Mordecai. Esther set Mordecai over the house of Haman.\n\nBut one problem remained—Haman's decree still stood. Esther fell at the king's feet, weeping, and besought him to reverse the evil plan Haman had devised against the Jews. The king held out the golden scepter to Esther, and she arose and stood before him.\n\n'If it please the king,' she said, 'and if I have found favor in his sight, let it be written to reverse the letters devised by Haman to destroy the Jews in all the king's provinces.'\n\nThe king explained, 'A decree written in the king's name and sealed with the king's ring cannot be revoked. But write as you please concerning the Jews, in the king's name, and seal it with the king's ring.'\n\nThe king's scribes were called on the twenty-third day of the third month. Mordecai wrote in King Ahasuerus's name and sealed it with the king's ring. Letters went by swift couriers on horseback to all 127 provinces: the king granted the Jews in every city the right to assemble and defend their lives—to destroy, kill, and annihilate any armed force that might attack them, their little ones, and women, and to plunder their goods. The appointed day was the thirteenth day of the twelfth month—the same day Haman had chosen for their destruction.\n\nA copy of the decree was published as law in every province. Mordecai went out from the king's presence in royal robes of blue and white, with a great crown of gold and a garment of fine linen and purple. The city of Shushan rejoiced and was glad. For the Jews there was light and gladness, joy and honor. In every province and city where the decree came, there was joy and feasting among the Jews. Many people of the land became Jews, for the fear of the Jews fell upon them.\n\nOn the thirteenth day of the twelfth month, the day the king's command and decree were to be executed—the day the enemies of the Jews hoped to overpower them—it was reversed. The Jews gained mastery over those who hated them. They assembled in their cities throughout all provinces to attack those who sought their harm. No one could withstand them, for the fear of them fell upon all people. The princes, lieutenants, governors, and the king's officials helped the Jews, for the fear of Mordecai had fallen upon them.\n\nIn Shushan, the Jews slew 500 men, including Haman's ten sons, but they laid no hand on the plunder. The king asked Esther, 'What more is your petition?'\n\nShe answered, 'Let it be granted to the Jews in Shushan to act tomorrow also according to this day's decree, and let Haman's ten sons be hanged upon the gallows.'\n\nThe king commanded it to be done. On the fourteenth day, the Jews in Shushan slew 300 more men. Throughout the provinces, the Jews slew 75,000 of their enemies but took no plunder. On the fourteenth day they rested and made it a day of feasting and gladness.\n\nMordecai recorded these things and sent letters to all the Jews in all provinces, ordaining that they should keep the fourteenth and fifteenth days of Adar yearly as days when the Jews got rest from their enemies, and the month which was turned for them from sorrow to joy and from mourning to a holiday. They should make them days of feasting and joy, of sending portions to one another and gifts to the poor.\n\nThe Jews undertook to continue what they had begun and what Mordecai had written. For Haman had plotted to destroy them and had cast Pur (that is, the lot) to consume and destroy them. But when Esther came before the king, he commanded by letters that Haman's wicked device should return upon his own head, and that he and his sons should be hanged on the gallows. Therefore they called these days Purim, after the name Pur.\n\nMordecai the Jew was next to King Ahasuerus, great among the Jews and accepted by the multitude of his brethren, seeking the wealth of his people and speaking peace to all his seed. God's providence had turned certain destruction into glorious deliverance. Though His name appears nowhere in the book, His hand is visible on every page.",
      "kids_title": "God Saves His People",
      "kids_description": "Even though Haman's mean law couldn't be erased, the king made a new law letting the Jewish people protect themselves. God's people were saved! They celebrated with a special holiday called Purim.",
      "kids_narrative": "After Haman was gone, the king gave Esther all of Haman's houses and stuff. He gave Mordecai his special ring and made him very important.\n\nBut there was still a big problem. Remember Haman's mean law that said to hurt all the Jewish people? That law was still there! In Persian rules, once the king made a law, it couldn't be erased—not even by the king!\n\nEsther bravely went to the king again. 'Please help us!' she begged. 'Haman's law is still going to hurt my people!'\n\nThe king thought hard. 'I can't erase the old law,' he said. 'But I CAN make a NEW law!' He let Mordecai write a new law that said the Jewish people could protect themselves and fight back against anyone who tried to hurt them.\n\nFast horses carried the new law to every city and town. When the Jewish people heard it, they were SO happy! They had parties and celebrations! Even some people who weren't Jewish decided to follow God because they saw how amazing He was!\n\nMordecai wore beautiful royal robes—blue and white and purple—with a big gold crown. Everyone respected him.\n\nWhen the scary day finally came—the thirteenth day of the twelfth month—the Jewish people were ready! Instead of being hurt, they were able to protect themselves. God helped them be safe! Their enemies couldn't hurt them anymore.\n\nThe next day, they had a huge celebration! They were so thankful to be safe! They ate yummy food, gave presents to each other, and helped poor people.\n\nMordecai said, 'We should remember this day forever! Every year, we'll celebrate on this day. We'll remember how God turned our sadness into joy and our crying into celebrating!'\n\nThey called the holiday 'Purim' because of the 'Pur' (the dice) that Haman had rolled to pick the day.\n\nEven though God's name isn't written in this whole story, we can see Him working everywhere! He protected Esther when she went to the king. He made the king unable to sleep so he would remember Mordecai. He turned everything around so the bad guy's plan didn't work!\n\nGod always takes care of His people, even when we can't see Him. He had a special plan for Esther—to be queen at exactly the right time to save everyone. And His plan worked perfectly!"
    }
  ]
}
