{
  "category": "Ministry of Jesus",
  "slug": "jesus-ministry",
  "description": "The powerful works and teachings of Jesus—miracles that revealed His divine nature and compassion for all who came to Him.",
  "stories": [
    {
      "title": "Jesus Is Baptized",
      "slug": "jesus-baptized",
      "description": "Jesus is baptized by John in the Jordan River. The heavens open, the Spirit descends like a dove, and the Father speaks.",
      "verses": ["Matthew 3:13-17", "Mark 1:9-11", "Luke 3:21-22"],
      "themes": ["Trinity", "Obedience", "Identity", "Beginning of ministry"],
      "characters": ["Jesus", "John the Baptist", "God the Father", "Holy Spirit"],
      "narrative": "Then Jesus came from Galilee to the Jordan to be baptized by John. But John tried to deter him, saying, 'I need to be baptized by you, and do you come to me?'\n\nJesus replied, 'Let it be so now; it is proper for us to do this to fulfill all righteousness.' Then John consented.\n\nAs soon as Jesus was baptized, he went up out of the water. At that moment heaven was opened, and he saw the Spirit of God descending like a dove and alighting on him. And a voice from heaven said, 'This is my Son, whom I love; with him I am well pleased.'\n\nThis moment marked the beginning of Jesus' public ministry. All three persons of the Trinity were present—the Son being baptized, the Spirit descending, the Father speaking. Jesus had no sins to confess, yet He identified with sinful humanity, foreshadowing His ultimate identification with us at the cross.\n\nJohn had been preparing the way, calling people to repentance. Now the One he had announced was here. 'Look,' John would say, 'the Lamb of God, who takes away the sin of the world!'",
      "kids_title": "Jesus Gets Baptized",
      "kids_description": "Jesus was baptized by John in the Jordan River. God's voice came from heaven saying, 'This is My Son!' and the Holy Spirit came down like a dove.",
      "kids_narrative": "Before Jesus started teaching and doing miracles, He went to the Jordan River. A man named John the Baptist was there, baptizing people who wanted to turn away from their sins.\n\nJesus walked up to John. 'Will you baptize Me?'\n\nJohn was shocked! 'ME baptize YOU? It should be the other way around! You should baptize ME!'\n\nBut Jesus said, 'This is the right thing to do. Please.'\n\nSo John baptized Jesus in the river.\n\nWhen Jesus came up out of the water, something AMAZING happened!\n\nThe sky opened up! The Holy Spirit came down like a gentle dove and landed on Jesus.\n\nThen a voice boomed from heaven—GOD'S voice!\n\n'This is My SON! I LOVE Him! I am SO pleased with Him!'\n\nWow! God the Father spoke from heaven. God the Son stood in the water. God the Spirit came down like a dove. All three were there together!\n\nThis was the start of Jesus' ministry. Now everyone would see who He really was—the Son of God who came to save the world.\n\nWhen we get baptized, we're showing everyone that we belong to Jesus too!"
    },
    {
      "title": "Jesus Is Tempted",
      "slug": "jesus-tempted",
      "description": "After fasting forty days, Jesus is tempted by Satan in the wilderness. He defeats every temptation with Scripture.",
      "verses": ["Matthew 4:1-11", "Luke 4:1-13"],
      "themes": ["Temptation", "Scripture", "Victory", "Obedience"],
      "characters": ["Jesus", "Satan"],
      "narrative": "Then Jesus was led by the Spirit into the wilderness to be tempted by the devil. After fasting forty days and forty nights, he was hungry.\n\nThe tempter came to him and said, 'If you are the Son of God, tell these stones to become bread.'\n\nJesus answered, 'It is written: \"Man shall not live on bread alone, but on every word that comes from the mouth of God.\"'\n\nThen the devil took him to the holy city and had him stand on the highest point of the temple. 'If you are the Son of God,' he said, 'throw yourself down. For it is written: \"He will command his angels concerning you.\"'\n\nJesus answered him, 'It is also written: \"Do not put the Lord your God to the test.\"'\n\nAgain, the devil took him to a very high mountain and showed him all the kingdoms of the world and their splendor. 'All this I will give you,' he said, 'if you will bow down and worship me.'\n\nJesus said to him, 'Away from me, Satan! For it is written: \"Worship the Lord your God, and serve him only.\"'\n\nThen the devil left him, and angels came and attended him.\n\nJesus faced every category of temptation—physical desire, pride, and power—and defeated each with the Word of God. Where Adam failed in a garden of plenty, Jesus succeeded in a barren wilderness. He shows us that Scripture is our weapon against temptation.",
      "kids_title": "Jesus Fights Temptation",
      "kids_description": "Satan tried to trick Jesus three times in the desert. But Jesus used Bible verses to fight back and win!",
      "kids_narrative": "Right after Jesus was baptized, the Holy Spirit led Him into the desert. For FORTY days, Jesus didn't eat anything. He was very, very hungry.\n\nThen Satan showed up to try to trick Jesus.\n\nTemptation #1: Satan said, 'If You're really God's Son, turn these stones into bread!'\n\nJesus was SO hungry. But He answered with a Bible verse: 'The Scripture says people don't live by bread alone, but by every word from God!'\n\nTemptation #2: Satan took Jesus to the top of the temple—way up high! 'If You're God's Son, jump! The Bible says angels will catch You!'\n\nJesus answered with another verse: 'It also says don't test the Lord your God!'\n\nTemptation #3: Satan showed Jesus all the kingdoms of the world. 'I'll give You ALL of this—if You just bow down and worship me!'\n\nJesus said, 'Get away from Me, Satan! The Scripture says worship ONLY God!'\n\nSatan gave up and left. Angels came to take care of Jesus.\n\nJesus won! He beat every temptation by using God's Word!\n\nHere's the cool part: when YOU are tempted to do wrong, you can do the same thing! Learn Bible verses. When you're tempted, remember what God says. His Word is like a sword that fights off the enemy!"
    },
    {
      "title": "Water into Wine",
      "slug": "water-into-wine",
      "description": "At a wedding in Cana, Jesus performs His first miracle, turning water into the finest wine.",
      "verses": ["John 2:1-11"],
      "themes": ["Jesus' power over nature", "Joy", "Abundance", "Mary's faith"],
      "characters": ["Jesus", "Mary", "Disciples", "Servants", "Master of the banquet"],
      "narrative": "On the third day a wedding took place at Cana in Galilee. Jesus' mother was there, and Jesus and his disciples had also been invited to the wedding.\n\nWhen the wine was gone, Jesus' mother said to him, 'They have no more wine.'\n\n'Woman, why do you involve me?' Jesus replied. 'My hour has not yet come.'\n\nHis mother said to the servants, 'Do whatever he tells you.'\n\nNearby stood six stone water jars, the kind used by the Jews for ceremonial washing, each holding from twenty to thirty gallons.\n\nJesus said to the servants, 'Fill the jars with water'; so they filled them to the brim.\n\nThen he told them, 'Now draw some out and take it to the master of the banquet.'\n\nThey did so, and the master of the banquet tasted the water that had been turned into wine. He did not realize where it had come from, though the servants who had drawn the water knew. Then he called the bridegroom aside and said, 'Everyone brings out the choice wine first and then the cheaper wine after the guests have had too much to drink; but you have saved the best till now.'\n\nWhat Jesus did here in Cana of Galilee was the first of the signs through which he revealed his glory; and his disciples believed in him.\n\nThis first miracle revealed Jesus' power over creation and His care for human joy. Running out of wine would have brought shame on the family—Jesus prevented their embarrassment with abundance.",
      "kids_title": "Jesus Turns Water into Wine",
      "kids_description": "At a wedding party, they ran out of drinks! Jesus turned plain water into the best wine anyone had ever tasted. It was His very first miracle!",
      "kids_narrative": "Jesus and His friends were invited to a wedding party in a town called Cana. Jesus' mom Mary was there too.\n\nWeddings in those days were HUGE celebrations—they lasted for days! But something embarrassing happened. They ran out of wine to drink!\n\nMary came to Jesus. 'They don't have any more wine.'\n\nJesus said, 'Why are you telling Me? It's not time for Me to do miracles yet.'\n\nBut Mary just smiled. She told the servants, 'Do whatever He tells you.'\n\nThere were six HUGE stone jars nearby—each one could hold 20 or 30 gallons!\n\nJesus told the servants, 'Fill those jars with water.'\n\nThey filled them all the way to the tippy top.\n\n'Now,' Jesus said, 'take some to the man in charge of the party.'\n\nThe servants looked at each other. It was just water! But they obeyed.\n\nThe man in charge tasted it... and his eyes got BIG!\n\n'This is AMAZING!' he said to the groom. 'Most people serve the best stuff first. But you saved the BEST wine for last!'\n\nThe water had turned into the most delicious wine ever!\n\nThis was Jesus' very first miracle. He didn't do it to show off—He did it to help a family and make people happy. His disciples saw this and believed in Him even more.\n\nJesus cares about the little things in our lives, not just the big stuff!"
    },
    {
      "title": "Jesus Heals a Paralyzed Man",
      "slug": "heals-paralyzed-man",
      "description": "Four friends lower a paralyzed man through the roof. Jesus forgives his sins and then heals him, proving His authority.",
      "verses": ["Mark 2:1-12", "Luke 5:17-26"],
      "themes": ["Faith of friends", "Forgiveness", "Jesus' authority", "Healing"],
      "characters": ["Jesus", "Paralyzed man", "Four friends", "Pharisees"],
      "narrative": "A few days later, when Jesus again entered Capernaum, the people heard that he had come home. They gathered in such large numbers that there was no room left, not even outside the door, and he preached the word to them.\n\nSome men came, bringing to him a paralyzed man, carried by four of them. Since they could not get him to Jesus because of the crowd, they made an opening in the roof above Jesus by digging through it and then lowered the mat the man was lying on.\n\nWhen Jesus saw their faith, he said to the paralyzed man, 'Son, your sins are forgiven.'\n\nNow some teachers of the law were sitting there, thinking to themselves, 'Why does this fellow talk like that? He's blaspheming! Who can forgive sins but God alone?'\n\nImmediately Jesus knew in his spirit that this was what they were thinking in their hearts, and he said to them, 'Why are you thinking these things? Which is easier: to say to this paralyzed man, \"Your sins are forgiven,\" or to say, \"Get up, take your mat and walk\"? But I want you to know that the Son of Man has authority on earth to forgive sins.'\n\nSo he said to the man, 'I tell you, get up, take your mat and go home.'\n\nHe got up, took his mat and walked out in full view of them all. This amazed everyone and they praised God, saying, 'We have never seen anything like this!'",
      "kids_title": "Through the Roof!",
      "kids_description": "A man couldn't walk, so his four friends carried him to Jesus. The house was too crowded, so they dug a hole in the roof and lowered him down!",
      "kids_narrative": "Jesus was in a house teaching. SO many people came that the house was PACKED! People were even crowded outside the door!\n\nFour friends had a problem. Their friend couldn't walk at all—he was paralyzed. They wanted to bring him to Jesus, but they couldn't get through the crowd!\n\nDid they give up? NO WAY!\n\nThey carried their friend up to the ROOF. Then they started digging! They made a hole right through the ceiling! Dirt and pieces of roof fell down around Jesus.\n\nThen they lowered their friend down through the hole on his mat—right in front of Jesus!\n\nJesus looked up at those four determined friends. He loved their faith!\n\nThen Jesus said to the paralyzed man, 'Son, your sins are forgiven.'\n\nSome grumpy religious leaders got mad. 'Who does He think He is? Only GOD can forgive sins!'\n\nJesus knew what they were thinking. He said, 'You think it's easy to say \"your sins are forgiven\"? Watch this. So you'll know I have power to forgive sins...'\n\nHe turned to the man. 'Get up! Pick up your mat and go home!'\n\nImmediately, the man STOOD UP! He picked up his mat and walked out! Everyone was amazed!\n\nJesus showed that He has power to heal bodies AND forgive sins. And those four friends showed us that we should never give up bringing our friends to Jesus!"
    },
    {
      "title": "Jesus Calms the Storm",
      "slug": "calms-the-storm",
      "description": "A violent storm threatens to sink the disciples' boat. Jesus wakes from sleep and commands the wind and waves to be still.",
      "verses": ["Mark 4:35-41", "Matthew 8:23-27", "Luke 8:22-25"],
      "themes": ["Jesus' power over nature", "Faith", "Fear", "Peace"],
      "characters": ["Jesus", "Disciples"],
      "narrative": "That day when evening came, Jesus said to his disciples, 'Let us go over to the other side.' Leaving the crowd behind, they took him along, just as he was, in the boat.\n\nA furious squall came up, and the waves broke over the boat, so that it was nearly swamped. Jesus was in the stern, sleeping on a cushion.\n\nThe disciples woke him and said to him, 'Teacher, don't you care if we drown?'\n\nHe got up, rebuked the wind and said to the waves, 'Quiet! Be still!'\n\nThen the wind died down and it was completely calm.\n\nHe said to his disciples, 'Why are you so afraid? Do you still have no faith?'\n\nThey were terrified and asked each other, 'Who is this? Even the wind and the waves obey him!'\n\nThe disciples were experienced fishermen who knew the Sea of Galilee well. For them to be terrified meant this was no ordinary storm. Yet Jesus slept peacefully through it all—not because He didn't care, but because He was never in danger.\n\nWith a word, He silenced the storm. The same voice that spoke creation into existence now commanded the chaos to cease. The disciples began to understand: this was no ordinary teacher.",
      "kids_title": "Jesus Stops the Storm",
      "kids_description": "A huge storm hit while Jesus and His friends were in a boat. They were scared! But Jesus told the wind and waves to stop—and they did!",
      "kids_narrative": "Jesus and His disciples got in a boat to cross a big lake. Jesus was SO tired. He lay down in the back of the boat and fell asleep.\n\nThen—WHOOOOSH!—a terrible storm came! The wind howled! CRASH! Huge waves slammed into the boat! Water was splashing in everywhere!\n\nThe disciples were TERRIFIED! Some of them were fishermen who knew this lake well. They knew this was a really bad storm!\n\n'We're gonna sink! We're gonna drown!'\n\nBut Jesus was still sleeping! In the middle of all that noise and chaos!\n\nThe disciples shook Him awake. 'TEACHER! Don't You CARE if we drown?!'\n\nJesus stood up in the rocking boat. He looked at the wind. He looked at the waves.\n\n'QUIET!' Jesus commanded. 'BE STILL!'\n\nImmediately—the wind stopped. The waves calmed down. Everything was perfectly peaceful. Just like that!\n\nJesus turned to His disciples. 'Why were you so afraid? Don't you have faith?'\n\nThe disciples looked at each other with HUGE eyes. They weren't scared of the storm anymore—they were amazed at JESUS!\n\n'Who IS this?' they whispered. 'Even the wind and waves OBEY Him!'\n\nJesus has power over everything—even storms! When life feels scary and out of control, remember: Jesus can calm any storm."
    },
    {
      "title": "Jesus Feeds Five Thousand",
      "slug": "feeds-five-thousand",
      "description": "With just five loaves and two fish, Jesus feeds a crowd of over five thousand people, with twelve baskets left over.",
      "verses": ["John 6:1-15", "Matthew 14:13-21", "Mark 6:30-44", "Luke 9:10-17"],
      "themes": ["Provision", "Compassion", "Abundance", "Jesus as Bread of Life"],
      "characters": ["Jesus", "Disciples", "Andrew", "A boy", "The crowd"],
      "narrative": "When Jesus looked up and saw a great crowd coming toward him, he said to Philip, 'Where shall we buy bread for these people to eat?' He asked this only to test him, for he already had in mind what he was going to do.\n\nPhilip answered him, 'It would take more than half a year's wages to buy enough bread for each one to have a bite!'\n\nAnother of his disciples, Andrew, Simon Peter's brother, spoke up, 'Here is a boy with five small barley loaves and two small fish, but how far will they go among so many?'\n\nJesus said, 'Have the people sit down.' There was plenty of grass in that place, and they sat down, about five thousand men, besides women and children.\n\nJesus then took the loaves, gave thanks, and distributed to those who were seated as much as they wanted. He did the same with the fish.\n\nWhen they had all had enough to eat, he said to his disciples, 'Gather the pieces that are left over. Let nothing be wasted.' So they gathered them and filled twelve baskets with the pieces of the five barley loaves left over by those who had eaten.\n\nAfter the people saw the sign Jesus performed, they began to say, 'Surely this is the Prophet who is to come into the world.'\n\nThis is the only miracle (besides the resurrection) recorded in all four Gospels. Jesus took what was offered—a boy's small lunch—and multiplied it beyond imagination. He still takes our small offerings and does immeasurably more than we can ask or imagine.",
      "kids_title": "Lunch for Thousands",
      "kids_description": "A huge crowd was hungry, but there was no food—except one boy's tiny lunch. Jesus took five loaves and two fish and fed EVERYONE, with leftovers!",
      "kids_narrative": "THOUSANDS of people followed Jesus to hear Him teach. They stayed all day! But now it was getting late, and everyone was HUNGRY.\n\nJesus asked Philip, 'Where can we buy food for all these people?'\n\nPhilip's eyes got huge. 'It would take a YEAR'S worth of money to buy enough food for everyone to have even a tiny bite!'\n\nAndrew spoke up. 'There's a boy here with five little loaves of bread and two small fish. But... that's nothing for this huge crowd.'\n\nJesus smiled. 'Have everyone sit down.'\n\nThe people sat on the grassy hillside. There were 5,000 men—plus women and kids! Maybe 15,000 or 20,000 people total!\n\nJesus took the boy's little lunch. He looked up to heaven and thanked God for it.\n\nThen He started breaking the bread and fish into pieces. He gave the pieces to His disciples to pass out.\n\nAnd the food just kept coming! Break off a piece—more appears! Break off another—more appears! The disciples walked around giving food to EVERYONE!\n\nEvery single person ate until they were FULL!\n\n'Okay,' Jesus said, 'gather up the leftovers. Don't waste anything.'\n\nThe disciples collected TWELVE baskets full of leftover pieces!\n\nFrom one boy's tiny lunch, Jesus fed thousands—with food to spare!\n\nJesus can take whatever little bit we give Him and do something AMAZING with it. Never think what you have is too small for God to use!"
    },
    {
      "title": "Jesus Walks on Water",
      "slug": "walks-on-water",
      "description": "In the middle of a stormy night, Jesus walks on the sea to His disciples. Peter walks on water too—until he takes his eyes off Jesus.",
      "verses": ["Matthew 14:22-33", "Mark 6:45-52", "John 6:16-21"],
      "themes": ["Faith", "Fear", "Keeping eyes on Jesus", "Jesus' divine nature"],
      "characters": ["Jesus", "Peter", "Disciples"],
      "narrative": "Immediately Jesus made the disciples get into the boat and go on ahead of him to the other side, while he dismissed the crowd. After he had dismissed them, he went up on a mountainside by himself to pray.\n\nLater that night, the boat was already a considerable distance from land, buffeted by the waves because the wind was against it.\n\nShortly before dawn Jesus went out to them, walking on the lake. When the disciples saw him walking on the lake, they were terrified. 'It's a ghost,' they said, and cried out in fear.\n\nBut Jesus immediately said to them: 'Take courage! It is I. Don't be afraid.'\n\n'Lord, if it's you,' Peter replied, 'tell me to come to you on the water.'\n\n'Come,' he said.\n\nThen Peter got down out of the boat, walked on the water and came toward Jesus. But when he saw the wind, he was afraid and, beginning to sink, cried out, 'Lord, save me!'\n\nImmediately Jesus reached out his hand and caught him. 'You of little faith,' he said, 'why did you doubt?'\n\nAnd when they climbed into the boat, the wind died down. Then those who were in the boat worshiped him, saying, 'Truly you are the Son of God.'\n\nPeter walked on water! But when he focused on the wind and waves instead of Jesus, he sank. Jesus didn't let him drown—He immediately reached out. When we take our eyes off Jesus and focus on our problems, we sink too. But He is always ready to catch us.",
      "kids_title": "Walking on Water",
      "kids_description": "In the middle of a stormy night, Jesus walked on the water to His disciples! Peter walked on water too—until he got scared and started sinking!",
      "kids_narrative": "After feeding the huge crowd, Jesus told His disciples to take the boat across the lake. He stayed behind to pray alone on a mountain.\n\nThat night, the disciples were in trouble! The wind was blowing HARD against them. The waves were crashing. They were rowing and rowing but couldn't get anywhere.\n\nThen, in the early morning darkness, they saw something on the water. Someone was WALKING toward them—on TOP of the lake!\n\n'AHHH! A GHOST!' they screamed.\n\n'Don't be afraid!' Jesus called out. 'It's ME!'\n\nPeter squinted through the darkness. 'Lord, if it's really You, tell me to come to You on the water!'\n\n'Come!' Jesus said.\n\nPeter took a deep breath... and stepped out of the boat!\n\nHis foot landed ON the water. It held him up! Peter was WALKING ON WATER toward Jesus!\n\nBut then Peter noticed the strong wind. He looked at the big waves. He got scared.\n\nAnd he started to SINK!\n\n'LORD, SAVE ME!' Peter yelled.\n\nImmediately, Jesus grabbed his hand and pulled him up.\n\n'Why did you doubt?' Jesus asked gently. 'Your faith is so small.'\n\nThey climbed into the boat together. The wind stopped.\n\nThe disciples were amazed. They worshiped Jesus. 'You really ARE the Son of God!'\n\nPeter walked on water when he looked at Jesus. He sank when he looked at the storm. That's a lesson for us: keep your eyes on Jesus, not on your problems!"
    },
    {
      "title": "Jesus Heals a Blind Man",
      "slug": "heals-blind-man",
      "description": "Jesus gives sight to a man born blind, declaring Himself to be the Light of the World.",
      "verses": ["John 9:1-41"],
      "themes": ["Jesus as Light", "Spiritual blindness", "Faith", "Testimony"],
      "characters": ["Jesus", "Blind man", "Disciples", "Pharisees", "Parents"],
      "narrative": "As Jesus went along, he saw a man blind from birth. His disciples asked him, 'Rabbi, who sinned, this man or his parents, that he was born blind?'\n\n'Neither this man nor his parents sinned,' said Jesus, 'but this happened so that the works of God might be displayed in him. While I am in the world, I am the light of the world.'\n\nAfter saying this, he spit on the ground, made some mud with the saliva, and put it on the man's eyes. 'Go,' he told him, 'wash in the Pool of Siloam.' So the man went and washed, and came home seeing.\n\nHis neighbors and those who had seen him begging asked, 'Isn't this the same man who used to sit and beg?' Some claimed that he was, others said, 'No, he only looks like him.' But he insisted, 'I am the man.'\n\nThey brought him to the Pharisees, who questioned him repeatedly. The man answered simply: 'One thing I do know. I was blind but now I see!'\n\nThe Pharisees threw him out. Jesus found him and asked, 'Do you believe in the Son of Man?'\n\n'Who is he, sir? Tell me so that I may believe in him.'\n\nJesus said, 'You have now seen him; in fact, he is the one speaking with you.'\n\nThen the man said, 'Lord, I believe,' and he worshiped him.\n\nThe blind man's simple testimony—'I was blind but now I see'—could not be argued away. Physical blindness became a picture of spiritual blindness. The religious leaders who claimed to see were actually blind; the blind man who received sight truly saw.",
      "kids_title": "The Man Who Could Finally See",
      "kids_description": "A man had been blind his whole life. Jesus put mud on his eyes and told him to wash—and for the first time ever, he could SEE!",
      "kids_narrative": "There was a man who had been blind since the day he was born. He'd NEVER seen anything—not colors, not faces, not the sky. He sat by the road and begged for money.\n\nJesus and His disciples walked by. The disciples asked, 'Teacher, why was this man born blind? Did he sin? Did his parents sin?'\n\nJesus said, 'Neither! This happened so everyone can see God do something amazing. I am the Light of the World.'\n\nThen Jesus did something surprising. He spit on the ground and made mud. He put the mud right on the blind man's eyes!\n\n'Go wash in the Pool of Siloam,' Jesus told him.\n\nThe man went and washed his face...\n\nAnd he could SEE! For the first time in his entire life, he could SEE!\n\nCan you imagine? Colors! Faces! Trees! The sky! Everything was new and amazing!\n\nPeople couldn't believe it. 'Is that the blind beggar?'\n\n'It can't be!' 'Yes it is!' 'No way!'\n\nThe man kept saying, 'IT'S ME! I was blind, but now I SEE!'\n\nThe religious leaders didn't like this miracle. They asked questions over and over, trying to find something wrong.\n\nBut the man just said, 'I don't know everything. But I know this: I was blind, and now I can see!'\n\nLater, Jesus found the man. 'Do you believe in the Son of God?'\n\n'Who is He? I want to believe!'\n\n'You're looking at Him,' Jesus said. 'I'm the One.'\n\nThe man fell down and worshiped Jesus. He could see with his eyes AND with his heart!"
    },
    {
      "title": "Jesus Raises Lazarus",
      "slug": "raises-lazarus",
      "description": "Jesus arrives four days after His friend Lazarus has died. He weeps, then calls Lazarus out of the tomb.",
      "verses": ["John 11:1-44"],
      "themes": ["Jesus' power over death", "Resurrection", "Jesus' humanity", "Faith"],
      "characters": ["Jesus", "Lazarus", "Mary", "Martha", "Disciples"],
      "narrative": "Now a man named Lazarus was sick. He was from Bethany, the village of Mary and her sister Martha. So the sisters sent word to Jesus, 'Lord, the one you love is sick.'\n\nWhen he heard this, Jesus said, 'This sickness will not end in death. No, it is for God's glory so that God's Son may be glorified through it.' Yet when he heard that Lazarus was sick, he stayed where he was two more days.\n\nWhen Jesus finally arrived, he found that Lazarus had already been in the tomb for four days.\n\n'Lord,' Martha said to Jesus, 'if you had been here, my brother would not have died.'\n\nJesus said to her, 'Your brother will rise again... I am the resurrection and the life. The one who believes in me will live, even though they die; and whoever lives by believing in me will never die. Do you believe this?'\n\n'Yes, Lord,' she replied, 'I believe that you are the Messiah, the Son of God.'\n\nWhen Mary came to Jesus, she fell at his feet weeping. When Jesus saw her weeping, and the Jews who had come along with her also weeping, he was deeply moved in spirit and troubled.\n\n'Where have you laid him?' he asked.\n\n'Come and see, Lord,' they replied.\n\nJesus wept.\n\nJesus came to the tomb, a cave with a stone laid across the entrance. 'Take away the stone,' he said.\n\n'But, Lord,' said Martha, 'by this time there is a bad odor, for he has been there four days.'\n\nJesus said, 'Did I not tell you that if you believe, you will see the glory of God?'\n\nSo they took away the stone. Then Jesus called in a loud voice, 'Lazarus, come out!'\n\nThe dead man came out, his hands and feet wrapped with strips of linen, and a cloth around his face.\n\nJesus said to them, 'Take off the grave clothes and let him go.'",
      "kids_title": "Lazarus, Come Out!",
      "kids_description": "Jesus' friend Lazarus died. Everyone was so sad. But Jesus called out, 'Lazarus, come out!'—and Lazarus walked right out of the tomb, alive!",
      "kids_narrative": "Jesus had three special friends: Lazarus and his sisters, Mary and Martha. One day, Lazarus got very, very sick.\n\nMary and Martha sent a message to Jesus: 'Lord, Lazarus is sick! Please come!'\n\nBut Jesus waited. Two whole days passed. Then He told His disciples, 'Let's go. Lazarus has fallen asleep—I'm going to wake him up.'\n\nBy the time Jesus arrived in Bethany, Lazarus had been dead for FOUR DAYS.\n\nMartha ran to meet Jesus. 'Lord! If You had been here, my brother wouldn't have died!'\n\nJesus said, 'Your brother will rise again. I AM the resurrection and the life. Anyone who believes in Me will live, even if they die. Do you believe this?'\n\n'Yes, Lord,' Martha said. 'I believe You are the Messiah.'\n\nMary came out too, crying so hard. When Jesus saw everyone weeping, something amazing happened.\n\nJesus cried too. Two little words in the Bible say so much: 'Jesus wept.'\n\nJesus cares when we're sad. He cries with us!\n\nThey went to the tomb—a cave with a big stone in front. 'Move the stone,' Jesus said.\n\n'But Lord,' Martha said, 'he's been dead four days! It will smell terrible!'\n\n'Didn't I tell you that if you believe, you'll see God's glory?'\n\nThey rolled away the stone. Jesus prayed. Then He shouted:\n\n'LAZARUS, COME OUT!'\n\nAnd Lazarus walked out! Still wrapped in grave cloths, but ALIVE!\n\n'Unwrap him and let him go!' Jesus said.\n\nJesus has power over death itself. One day, everyone who believes in Him will rise too, just like Lazarus!"
    },
    {
      "title": "Jesus Heals Ten Lepers",
      "slug": "heals-ten-lepers",
      "description": "Jesus heals ten men with leprosy, but only one returns to thank Him—a Samaritan.",
      "verses": ["Luke 17:11-19"],
      "themes": ["Gratitude", "Faith", "Outsiders welcomed", "Healing"],
      "characters": ["Jesus", "Ten lepers", "The Samaritan"],
      "narrative": "Now on his way to Jerusalem, Jesus traveled along the border between Samaria and Galilee. As he was going into a village, ten men who had leprosy met him. They stood at a distance and called out in a loud voice, 'Jesus, Master, have pity on us!'\n\nWhen he saw them, he said, 'Go, show yourselves to the priests.' And as they went, they were cleansed.\n\nOne of them, when he saw he was healed, came back, praising God in a loud voice. He threw himself at Jesus' feet and thanked him—and he was a Samaritan.\n\nJesus asked, 'Were not all ten cleansed? Where are the other nine? Has no one returned to give praise to God except this foreigner?'\n\nThen he said to him, 'Rise and go; your faith has made you well.'\n\nLeprosy was a devastating disease that left people isolated from family and community. These ten men were outcasts, forced to live apart and cry 'Unclean!' to warn others away. Jesus healed them all.\n\nBut only one came back—and he was a Samaritan, doubly an outsider. The others received healing but missed something greater. The one who returned received not just physical healing but wholeness—'your faith has made you well' means literally 'your faith has saved you.'\n\nGratitude opens the door to deeper blessing.",
      "kids_title": "Only One Said Thanks",
      "kids_description": "Jesus healed ten men with a terrible skin disease. But only ONE came back to say thank you. Jesus noticed—and so should we!",
      "kids_narrative": "Jesus was walking to Jerusalem when He heard voices calling from far away.\n\n'JESUS! MASTER! PLEASE HELP US!'\n\nTen men stood far from the road. They had leprosy—a terrible skin disease. In those days, people with leprosy had to stay away from everyone else. They couldn't hug their families or go to church or walk through town. It was so lonely and sad.\n\nJesus saw them and called out, 'Go show yourselves to the priests!'\n\nIn Bible times, priests were the ones who could say, 'You're healed! You can go back to your normal life!'\n\nThe ten men started walking toward the priests. And as they walked... they looked at their hands. Their skin was clearing up! Their sores were disappearing! They were being HEALED!\n\n'WE'RE HEALED! WE'RE HEALED!' They ran to find their families!\n\nBut wait. One of the men stopped. He turned around. He ran back to Jesus as fast as he could!\n\nHe fell down at Jesus' feet, crying with joy. 'THANK YOU! THANK YOU! PRAISE GOD!'\n\nThis man was a Samaritan—someone Jewish people usually didn't like.\n\nJesus looked around. 'Weren't there TEN men healed? Where are the other nine? Only this foreigner came back to say thank you?'\n\nThen Jesus smiled at the man. 'Get up and go. Your faith has made you completely well.'\n\nAll ten were healed. But only ONE said thanks. Don't be like the nine! Always remember to thank God—and thank others—for the good things in your life!"
    },
    {
      "title": "Jesus and the Children",
      "slug": "jesus-and-children",
      "description": "People bring children to Jesus. The disciples try to stop them, but Jesus welcomes the children and blesses them.",
      "verses": ["Mark 10:13-16", "Matthew 19:13-15", "Luke 18:15-17"],
      "themes": ["Childlike faith", "Jesus' love for all", "Kingdom of God"],
      "characters": ["Jesus", "Children", "Parents", "Disciples"],
      "narrative": "People were bringing little children to Jesus for him to place his hands on them, but the disciples rebuked them.\n\nWhen Jesus saw this, he was indignant. He said to them, 'Let the little children come to me, and do not hinder them, for the kingdom of God belongs to such as these. Truly I tell you, anyone who does not receive the kingdom of God like a little child will never enter it.'\n\nAnd he took the children in his arms, placed his hands on them and blessed them.\n\nThe disciples thought Jesus was too busy and too important for children. They were wrong. Jesus was 'indignant'—one of the strongest words used for His emotions in the Gospels.\n\nChildren in that culture had little status, yet Jesus held them up as examples. What is it about children that opens the kingdom? They come with empty hands, trusting simply, not trying to earn or deserve. They know they are dependent.\n\nJesus didn't just tolerate the children—He took them in His arms and blessed them. He still welcomes all who come to Him with childlike faith.",
      "kids_title": "Jesus Loves the Little Children",
      "kids_description": "Some parents wanted Jesus to bless their kids. The disciples said no! But Jesus said, 'Let the children come to Me!' He hugged them and blessed them.",
      "kids_narrative": "Lots of parents brought their kids to see Jesus. They wanted Jesus to put His hands on their children and bless them.\n\nBut the disciples tried to stop them!\n\n'Go away! Jesus is too busy for kids! He has important things to do!'\n\nWhen Jesus saw this, He was NOT happy with His disciples.\n\n'STOP!' Jesus said. 'Let the children come to Me! Don't keep them away!'\n\nThen Jesus said something really important:\n\n'The kingdom of God belongs to people like these kids. I'm telling you the truth: if you don't come to God like a little child, you won't get into His kingdom at all!'\n\nWhat does that mean? Kids trust simply. They don't pretend to be all grown-up and important. They know they need help.\n\nThat's how we should come to God—not bragging about how good we are, but trusting Him like a little kid trusts their parents.\n\nThen Jesus did the sweetest thing. He picked up the children. He held them in His arms. He put His hands on them and BLESSED them.\n\nThe disciples thought kids weren't important enough. JESUS thought kids were perfect examples of faith!\n\nSo if you're a kid reading this: Jesus LOVES you. You're not too small or too young. You matter SO much to Him. He wants you to come to Him just as you are!"
    },
    {
      "title": "Jesus Heals on the Sabbath",
      "slug": "heals-on-sabbath",
      "description": "Jesus heals a man with a withered hand on the Sabbath, showing that doing good is always right.",
      "verses": ["Mark 3:1-6", "Matthew 12:9-14", "Luke 6:6-11"],
      "themes": ["Compassion over rules", "Jesus' authority", "Hypocrisy"],
      "characters": ["Jesus", "Man with withered hand", "Pharisees"],
      "narrative": "Another time Jesus went into the synagogue, and a man with a shriveled hand was there. Some of them were looking for a reason to accuse Jesus, so they watched him closely to see if he would heal him on the Sabbath.\n\nJesus said to the man with the shriveled hand, 'Stand up in front of everyone.'\n\nThen Jesus asked them, 'Which is lawful on the Sabbath: to do good or to do evil, to save life or to kill?' But they remained silent.\n\nHe looked around at them in anger and, deeply distressed at their stubborn hearts, said to the man, 'Stretch out your hand.' He stretched it out, and his hand was completely restored.\n\nThen the Pharisees went out and began to plot with the Herodians how they might kill Jesus.\n\nThe religious leaders had added so many rules to the Sabbath that they missed its purpose. God gave the Sabbath as a gift of rest and restoration—but they made it a burden.\n\nJesus' question silenced them: Is it lawful to do good or evil? To save life or destroy it? They wouldn't answer because any answer condemned them. They were so concerned with their rules that they would rather see a man suffer than see Jesus show compassion.\n\nJesus was angry at their hard hearts, yet still grieved for them. He healed the man anyway. And the religious leaders went out to plot His death—on the Sabbath. The irony is tragic.",
      "kids_title": "Jesus Heals on the Special Day",
      "kids_description": "A man had a hand that didn't work. The religious leaders said Jesus couldn't heal on the Sabbath. But Jesus showed that helping people is ALWAYS right!",
      "kids_narrative": "It was the Sabbath—the special day of rest. Jesus went to the synagogue, like a church.\n\nA man was there with a hand that didn't work. It was all shriveled up and useless.\n\nSome grumpy religious leaders were watching Jesus closely. They had a rule: no working on the Sabbath! They thought healing counted as 'work.' Would Jesus break their rule?\n\nJesus knew what they were thinking. He called the man to come stand in front of everyone.\n\nThen Jesus asked the leaders a question: 'Which is the right thing to do on the Sabbath—to do GOOD or to do EVIL? To help someone or to hurt them?'\n\nThey wouldn't answer. They just sat there with their arms crossed.\n\nJesus looked around at them. He was angry AND sad. Their hearts were so hard!\n\nThen Jesus turned to the man. 'Stretch out your hand.'\n\nThe man stretched it out... and it was COMPLETELY HEALED! Just like his other hand!\n\nYou'd think everyone would cheer! But no. The religious leaders stomped out of the synagogue. They were so mad that they started making plans to KILL Jesus.\n\nCan you believe it? They cared more about their rules than about a man getting healed!\n\nJesus taught us something important: doing good and helping people is ALWAYS right—even on the Sabbath, even if some grumpy people don't like it. Love for people matters more than following rules perfectly."
    },
    {
      "title": "Jesus Forgives a Sinful Woman",
      "slug": "forgives-sinful-woman",
      "description": "A sinful woman washes Jesus' feet with her tears. Jesus forgives her and teaches that those forgiven much love much.",
      "verses": ["Luke 7:36-50"],
      "themes": ["Forgiveness", "Love", "Grace", "Repentance"],
      "characters": ["Jesus", "Sinful woman", "Simon the Pharisee"],
      "narrative": "When one of the Pharisees invited Jesus to have dinner with him, Jesus went to his house and reclined at the table. A woman in that town who lived a sinful life learned that Jesus was eating at the Pharisee's house, so she came there with an alabaster jar of perfume.\n\nAs she stood behind him at his feet weeping, she began to wet his feet with her tears. Then she wiped them with her hair, kissed them and poured perfume on them.\n\nWhen the Pharisee who had invited him saw this, he said to himself, 'If this man were a prophet, he would know who is touching him and what kind of woman she is—that she is a sinner.'\n\nJesus answered him, 'Simon, I have something to tell you... Two people owed money to a certain moneylender. One owed him five hundred denarii, and the other fifty. Neither of them had the money to pay him back, so he forgave the debts of both. Now which of them will love him more?'\n\nSimon replied, 'I suppose the one who had the bigger debt forgiven.'\n\n'You have judged correctly,' Jesus said. Then he turned toward the woman and said to Simon, 'Do you see this woman? I came into your house. You did not give me any water for my feet, but she wet my feet with her tears and wiped them with her hair. You did not give me a kiss, but this woman has not stopped kissing my feet. You did not put oil on my head, but she has poured perfume on my feet. Therefore, I tell you, her many sins have been forgiven—as her great love has shown. But whoever has been forgiven little loves little.'\n\nThen Jesus said to her, 'Your sins are forgiven... Your faith has saved you; go in peace.'",
      "kids_title": "The Woman Who Cried at Jesus' Feet",
      "kids_description": "A woman who had done many bad things came to Jesus crying. She washed His feet with her tears. Jesus forgave all her sins!",
      "kids_narrative": "A religious leader named Simon invited Jesus to dinner at his house. While they were eating, something unexpected happened.\n\nA woman came in. Everyone knew her—she had done many bad things. People probably whispered and pointed at her.\n\nBut she didn't care. She walked right up to Jesus, crying SO hard that her tears fell on His feet!\n\nShe knelt down and wiped His feet with her HAIR. She kissed His feet. She poured expensive perfume on them.\n\nSimon thought, 'If Jesus were really special, He'd know what kind of woman this is! He wouldn't let her touch Him!'\n\nJesus knew what Simon was thinking. He said, 'Simon, let Me tell you a story. Two people owed money. One owed a LOT—500 coins. One owed a little—50 coins. Neither could pay. But the lender forgave BOTH debts. Which person do you think loved the lender more?'\n\n'The one who owed more, I guess,' Simon said.\n\n'Right!' Jesus said. Then He pointed to the woman. 'Simon, when I came to your house, you didn't wash My feet or welcome Me properly. But this woman hasn't stopped washing My feet with tears and kissing them! She's shown SO much love because she's been forgiven SO much. People who think they don't need much forgiveness don't love much.'\n\nThen Jesus looked at the woman with kind eyes. 'Your sins are forgiven. Your faith has saved you. Go in peace.'\n\nNo sin is too big for Jesus to forgive. When we understand how much we've been forgiven, we can't help but love Him back!"
    },
    {
      "title": "Jesus Heals Jairus's Daughter",
      "slug": "heals-jairus-daughter",
      "description": "A synagogue leader's daughter dies, but Jesus raises her back to life with the words, 'Little girl, get up!'",
      "verses": ["Mark 5:21-43", "Luke 8:40-56"],
      "themes": ["Faith", "Jesus' power over death", "Compassion"],
      "characters": ["Jesus", "Jairus", "Jairus's daughter", "Mourners"],
      "narrative": "Then one of the synagogue leaders, named Jairus, came, and when he saw Jesus, he fell at his feet. He pleaded earnestly with him, 'My little daughter is dying. Please come and put your hands on her so that she will be healed and live.' So Jesus went with him.\n\nWhile Jesus was still speaking, some people came from the house of Jairus. 'Your daughter is dead,' they said. 'Why bother the teacher anymore?'\n\nOverhearing what they said, Jesus told him, 'Don't be afraid; just believe.'\n\nHe did not let anyone follow him except Peter, James and John. When they came to the home, Jesus saw a commotion, with people crying and wailing loudly. He went in and said to them, 'Why all this commotion and wailing? The child is not dead but asleep.' But they laughed at him.\n\nAfter he put them all out, he took the child's father and mother and the disciples who were with him, and went in where the child was. He took her by the hand and said to her, 'Talitha koum!' (which means 'Little girl, I say to you, get up!').\n\nImmediately the girl stood up and began to walk around. She was twelve years old. At this they were completely astonished.\n\nHe gave strict orders not to let anyone know about this, and told them to give her something to eat.\n\nJairus was a respected leader, yet he humbled himself at Jesus' feet. When news came that his daughter had died, Jesus spoke words of faith into his despair: 'Don't be afraid; just believe.' And Jesus proved He had authority even over death.",
      "kids_title": "The Little Girl Wakes Up",
      "kids_description": "A man named Jairus begged Jesus to heal his sick daughter. But she died before Jesus got there! Jesus said, 'Little girl, get up!'—and she did!",
      "kids_narrative": "A man named Jairus ran up to Jesus and fell at His feet. Jairus was an important leader, but right now he was just a scared dad.\n\n'Please, Jesus!' he begged. 'My little girl is SO sick! She's only twelve years old! Please come heal her!'\n\nJesus started walking to Jairus's house. But there were crowds everywhere, and they kept slowing Jesus down.\n\nThen some people came from Jairus's house with terrible news.\n\n'Don't bother Jesus anymore,' they said sadly. 'Your daughter... she died.'\n\nJairus's heart broke. He was too late.\n\nBut Jesus looked at him. 'Don't be afraid. Just believe.'\n\nThey kept walking to the house. When they arrived, people were crying and making a huge commotion.\n\nJesus said, 'Why are you crying? The girl isn't dead—she's just sleeping.'\n\nThe people LAUGHED at Jesus. They knew she was dead!\n\nJesus put everyone outside except the girl's parents and three disciples. He went into the room where the little girl lay still and cold.\n\nJesus took her hand. He said gently, 'Talitha koum.' That means, 'Little girl, I say to you—get up!'\n\nImmediately, the girl opened her eyes. She stood up! She started walking around!\n\nHer parents were SHOCKED. Their little girl was ALIVE!\n\nJesus smiled. 'She's probably hungry. Give her something to eat.'\n\nJesus has power over sickness AND death. Nothing is too hard for Him. Even when things seem impossible, don't be afraid—just believe!"
    },
    {
      "title": "The Transfiguration",
      "slug": "transfiguration",
      "description": "Jesus is transformed on a mountain, His face shining like the sun. Moses and Elijah appear, and God the Father speaks.",
      "verses": ["Matthew 17:1-13", "Mark 9:2-13", "Luke 9:28-36"],
      "themes": ["Jesus' glory", "Listen to Jesus", "Moses and the Prophets fulfilled"],
      "characters": ["Jesus", "Peter", "James", "John", "Moses", "Elijah", "God the Father"],
      "narrative": "After six days Jesus took Peter, James and John with him and led them up a high mountain, where they were all alone. There he was transfigured before them. His face shone like the sun, and his clothes became as white as the light.\n\nJust then there appeared before them Moses and Elijah, talking with Jesus.\n\nPeter said to Jesus, 'Lord, it is good for us to be here. If you wish, I will put up three shelters—one for you, one for Moses and one for Elijah.'\n\nWhile he was still speaking, a bright cloud covered them, and a voice from the cloud said, 'This is my Son, whom I love; with him I am well pleased. Listen to him!'\n\nWhen the disciples heard this, they fell facedown to the ground, terrified. But Jesus came and touched them. 'Get up,' he said. 'Don't be afraid.'\n\nWhen they looked up, they saw no one except Jesus.\n\nAs they were coming down the mountain, Jesus instructed them, 'Don't tell anyone what you have seen, until the Son of Man has been raised from the dead.'\n\nFor one moment, the veil was pulled back and the disciples saw Jesus in His glory. Moses represented the Law, Elijah the Prophets—both testified to Christ. The Father's voice confirmed what the disciples needed to hear: 'This is my Son... Listen to him!' Not Moses, not Elijah—Jesus alone. After the cloud lifted, 'they saw no one except Jesus.' He is enough.",
      "kids_title": "Jesus Shines Bright",
      "kids_description": "Jesus took three disciples up a mountain, and suddenly He started GLOWING! His face shone like the sun. Moses and Elijah appeared, and God's voice spoke from a cloud!",
      "kids_narrative": "Jesus took three of His closest friends—Peter, James, and John—up a high mountain to pray.\n\nWhile they were there, something INCREDIBLE happened!\n\nJesus started to CHANGE! His face began to SHINE—as bright as the SUN! His clothes turned dazzling WHITE, brighter than anything they'd ever seen!\n\nThen two men appeared, talking with Jesus. It was MOSES and ELIJAH! Two of the most important people from the Old Testament!\n\nPeter didn't know what to say. 'Lord! This is amazing! Should I build three tents—one for You, one for Moses, one for Elijah?'\n\nWhile Peter was still talking, a bright cloud covered them all. Then a VOICE came from the cloud—GOD'S voice!\n\n'This is My Son, whom I love. I am SO pleased with Him. LISTEN TO HIM!'\n\nThe disciples fell flat on their faces, terrified!\n\nJesus came and touched them gently. 'Get up. Don't be afraid.'\n\nThey looked up. Moses and Elijah were gone. Only Jesus was there.\n\nAs they walked back down the mountain, Jesus told them, 'Don't tell anyone what you saw until after I rise from the dead.'\n\nThis amazing moment showed the disciples who Jesus really was—the glorious Son of God! Moses gave the Law. Elijah was a great prophet. But God said to listen to JESUS. He's the one who matters most.\n\nSometimes we see glimpses of how amazing Jesus truly is. One day in heaven, we'll see His glory forever!"
    },
    {
      "title": "Jesus Heals the Man with Many Spirits",
      "slug": "man-with-many-spirits",
      "description": "Jesus encounters a man possessed by many unclean spirits in the region of the Gadarenes and sets him free.",
      "verses": ["Mark 5:1-20", "Luke 8:26-39", "Matthew 8:28-34"],
      "themes": ["Jesus' power over evil", "Transformation", "Testimony", "Restoration"],
      "characters": ["Jesus", "The possessed man", "Disciples", "Townspeople"],
      "narrative": "They went across the lake to the region of the Gerasenes. When Jesus got out of the boat, a man with an unclean spirit came from the tombs to meet him. This man lived among the tombs, and no one could bind him anymore, not even with a chain. Night and day among the tombs and in the hills he would cry out and cut himself with stones.\n\nWhen he saw Jesus from a distance, he ran and fell on his knees in front of him. He shouted at the top of his voice, 'What do you want with me, Jesus, Son of the Most High God? In God's name don't torture me!' For Jesus had said to him, 'Come out of this man, you impure spirit!'\n\nThen Jesus asked him, 'What is your name?'\n\n'My name is Legion,' he replied, 'for we are many.' And he begged Jesus again and again not to send them out of the area.\n\nA large herd of pigs was feeding on the nearby hillside. The spirits begged Jesus, 'Send us among the pigs; allow us to go into them.' He gave them permission, and the impure spirits came out and went into the pigs. The herd, about two thousand in number, rushed down the steep bank into the lake and drowned.\n\nThose tending the pigs ran off and reported this in the town and countryside. When the people came to Jesus, they saw the man who had been possessed sitting there, dressed and in his right mind; and they were afraid. The people began to plead with Jesus to leave their region.\n\nAs Jesus was getting into the boat, the man who had been possessed begged to go with him. Jesus did not let him, but said, 'Go home to your own people and tell them how much the Lord has done for you, and how he has had mercy on you.' So the man went away and began to tell in the Decapolis how much Jesus had done for him. And all the people were amazed.",
      "kids_title": "Jesus Sets a Man Free",
      "kids_description": "A man was trapped by evil spirits and lived alone in a graveyard. Jesus set him completely free, and the man went and told everyone what Jesus did for him!",
      "kids_narrative": "Jesus and His disciples sailed across the lake to a new area. When they got out of the boat, they met a man who was in BIG trouble.\n\nThis man was controlled by evil spirits—lots of them! He was so strong that no chains could hold him. He lived in a graveyard, all alone, crying out day and night. It was so sad.\n\nWhen the man saw Jesus, he ran to Him. The evil spirits inside him were scared of Jesus! They knew exactly who He was.\n\n'What do you want with us, Jesus, Son of God?' they shouted.\n\nJesus asked, 'What is your name?'\n\n'Legion,' they answered. 'Because there are many of us.'\n\nNearby, a huge herd of pigs was eating on a hillside. The evil spirits begged, 'If you make us leave, let us go into those pigs!'\n\nJesus said, 'Go.'\n\nThe spirits left the man and went into the pigs. The whole herd ran down the hill into the lake!\n\nPeople from town came running to see what happened. And there was the man—sitting calmly, wearing normal clothes, completely healed! He was in his right mind!\n\nThe people were scared. They asked Jesus to leave.\n\nThe healed man wanted to go WITH Jesus. But Jesus said, 'No—go home and tell everyone what God has done for you!'\n\nSo the man went all through that area telling everyone how Jesus had saved him. Everyone was amazed!\n\nNo matter how trapped someone is, Jesus can set them free!"
    },
    {
      "title": "The Woman at the Well",
      "slug": "woman-at-the-well",
      "description": "Jesus speaks with a Samaritan woman at Jacob's well, offering her living water and revealing that He is the Messiah.",
      "verses": ["John 4:1-42"],
      "themes": ["Living water", "Worship in spirit and truth", "Salvation for all", "Jesus as Messiah"],
      "characters": ["Jesus", "Samaritan woman", "Disciples", "Samaritans"],
      "narrative": "Jesus left Judea and went back once more to Galilee. Now he had to go through Samaria. So he came to a town in Samaria called Sychar, near the plot of ground Jacob had given to his son Joseph. Jacob's well was there, and Jesus, tired as he was from the journey, sat down by the well. It was about noon.\n\nWhen a Samaritan woman came to draw water, Jesus said to her, 'Will you give me a drink?' (His disciples had gone into the town to buy food.)\n\nThe Samaritan woman said to him, 'You are a Jew and I am a Samaritan woman. How can you ask me for a drink?' (For Jews do not associate with Samaritans.)\n\nJesus answered her, 'If you knew the gift of God and who it is that asks you for a drink, you would have asked him and he would have given you living water.'\n\n'Sir,' the woman said, 'you have nothing to draw with and the well is deep. Where can you get this living water?'\n\nJesus answered, 'Everyone who drinks this water will be thirsty again, but whoever drinks the water I give them will never thirst. Indeed, the water I give them will become in them a spring of water welling up to eternal life.'\n\nThe woman said to him, 'Sir, give me this water so that I won't get thirsty and have to keep coming here to draw water.'\n\nJesus revealed that He knew about her past—she had had five husbands. The woman said, 'I know that Messiah is coming. When he comes, he will explain everything to us.'\n\nThen Jesus declared, 'I, the one speaking to you—I am he.'\n\nThe woman left her water jar, went back to the town and said to the people, 'Come, see a man who told me everything I ever did. Could this be the Messiah?' Many of the Samaritans from that town believed in him because of the woman's testimony.",
      "kids_title": "The Woman at the Well",
      "kids_description": "Jesus talked to a woman at a well and offered her 'living water' that would satisfy her forever. She ran and told her whole town about Jesus!",
      "kids_narrative": "Jesus was walking through an area called Samaria. He was tired and sat down by an old well to rest.\n\nA woman came to get water from the well. This was unusual—women usually came in groups, not alone, and not in the heat of the day.\n\nJesus said, 'Will you give Me a drink?'\n\nThe woman was SHOCKED. Jewish people didn't talk to Samaritans! And men didn't usually talk to women they didn't know!\n\n'Why are YOU asking ME for water?' she asked.\n\nJesus said something mysterious: 'If you knew who I am, YOU would ask ME for water. And I would give you LIVING water!'\n\n'Living water? What do you mean? You don't even have a bucket!'\n\nJesus explained: 'Everyone who drinks regular water gets thirsty again. But whoever drinks the water I give will NEVER be thirsty. My water becomes a spring inside you, bubbling up to eternal life!'\n\n'Sir! Give me this water!' the woman said.\n\nThen Jesus showed her that He knew all about her life—her mistakes, her past, everything. The woman was amazed.\n\n'You must be a prophet!' she said. 'I know the Messiah is coming someday...'\n\nJesus said, 'I am He. The one talking to you right now.'\n\nThe woman dropped her water jar and ran to town! 'Come see a man who knew everything about me! Could He be the Messiah?'\n\nThe whole town came out to meet Jesus. Many believed in Him!\n\nJesus offers living water—His love and eternal life—to everyone, no matter who they are or what they've done."
    },
    {
      "title": "Jesus and Zacchaeus",
      "slug": "jesus-and-zacchaeus",
      "description": "A despised tax collector climbs a tree to see Jesus. Jesus calls him down and transforms his life.",
      "verses": ["Luke 19:1-10"],
      "themes": ["Salvation", "Repentance", "Jesus seeks the lost", "Transformation"],
      "characters": ["Jesus", "Zacchaeus", "Crowd"],
      "narrative": "Jesus entered Jericho and was passing through. A man was there by the name of Zacchaeus; he was a chief tax collector and was wealthy. He wanted to see who Jesus was, but because he was short he could not see over the crowd. So he ran ahead and climbed a sycamore-fig tree to see him, since Jesus was coming that way.\n\nWhen Jesus reached the spot, he looked up and said to him, 'Zacchaeus, come down immediately. I must stay at your house today.' So he came down at once and welcomed him gladly.\n\nAll the people saw this and began to mutter, 'He has gone to be the guest of a sinner.'\n\nBut Zacchaeus stood up and said to the Lord, 'Look, Lord! Here and now I give half of my possessions to the poor, and if I have cheated anybody out of anything, I will pay back four times the amount.'\n\nJesus said to him, 'Today salvation has come to this house, because this man, too, is a son of Abraham. For the Son of Man came to seek and to save the lost.'\n\nZacchaeus was a chief tax collector—wealthy because he worked for Rome and likely cheated his own people. He was despised. Yet something drew him to Jesus. He was so determined to see Him that this wealthy, dignified man climbed a tree like a child.\n\nJesus didn't wait for Zacchaeus to come to Him. He looked up, called him by name, and invited Himself to dinner. The crowd was scandalized, but Jesus saw what they couldn't: a lost son ready to come home. Zacchaeus's response proved his heart had changed—immediate, generous restitution.",
      "kids_title": "The Little Man in the Tree",
      "kids_description": "Zacchaeus was a short man who cheated people. He climbed a tree to see Jesus—and Jesus changed his whole life!",
      "kids_narrative": "In the town of Jericho lived a man named Zacchaeus. He had two problems:\n\n1. He was really SHORT.\n2. Nobody liked him because he was a tax collector who cheated people.\n\nOne day, Jesus came walking through Jericho! HUGE crowds gathered. Zacchaeus wanted to see Jesus SO badly, but he was too short to see over everyone's heads!\n\nSo Zacchaeus did something funny. He ran ahead and climbed up a sycamore tree! There he sat, waiting for Jesus to walk by.\n\nWhen Jesus got to that tree, He stopped. He looked UP.\n\n'Zacchaeus!' Jesus called. 'Come down! I'm coming to YOUR house today!'\n\nZacchaeus almost fell out of the tree! Jesus knew his NAME! Jesus wanted to visit HIM!\n\nHe scrambled down that tree as fast as he could.\n\nThe crowd grumbled. 'Why is Jesus going to THAT man's house? He's a cheater! A sinner!'\n\nBut something amazing happened to Zacchaeus. Being with Jesus changed his heart!\n\n'Lord,' Zacchaeus said, 'I'm going to give HALF of everything I own to poor people! And anyone I've cheated—I'll pay them back FOUR TIMES as much!'\n\nJesus smiled. 'Today salvation has come to this house! I came to find and save lost people—just like Zacchaeus.'\n\nZacchaeus was lost and lonely. But Jesus found him, loved him, and changed him completely. Jesus can do the same for anyone!"
    },
    {
      "title": "The Woman Who Touched His Cloak",
      "slug": "woman-touched-his-cloak",
      "description": "A woman who has been bleeding for twelve years touches Jesus' garment in faith and is instantly healed.",
      "verses": ["Mark 5:24-34", "Luke 8:43-48", "Matthew 9:20-22"],
      "themes": ["Faith", "Healing", "Jesus' compassion", "Desperation"],
      "characters": ["Jesus", "The woman", "Disciples", "Crowd"],
      "narrative": "A large crowd followed and pressed around Jesus. And a woman was there who had been subject to bleeding for twelve years. She had suffered a great deal under the care of many doctors and had spent all she had, yet instead of getting better she grew worse.\n\nWhen she heard about Jesus, she came up behind him in the crowd and touched his cloak, because she thought, 'If I just touch his clothes, I will be healed.' Immediately her bleeding stopped and she felt in her body that she was freed from her suffering.\n\nAt once Jesus realized that power had gone out from him. He turned around in the crowd and asked, 'Who touched my clothes?'\n\n'You see the people crowding against you,' his disciples answered, 'and yet you can ask, \"Who touched me?\"'\n\nBut Jesus kept looking around to see who had done it. Then the woman, knowing what had happened to her, came and fell at his feet and, trembling with fear, told him the whole truth.\n\nHe said to her, 'Daughter, your faith has healed you. Go in peace and be freed from your suffering.'\n\nFor twelve years this woman had suffered—physically, financially, socially, and spiritually. Her condition made her ritually unclean; she couldn't worship at the temple or touch anyone without making them unclean too. She was isolated, hopeless, and desperate.\n\nBut she had faith. She believed that just touching Jesus' clothes would be enough. And it was. Jesus felt her faith amid the jostling crowd and stopped to honor her publicly, calling her 'Daughter'—restoring not just her body but her dignity.",
      "kids_title": "The Woman Who Touched Jesus' Coat",
      "kids_description": "A sick woman had been bleeding for 12 years. She believed that if she could just touch Jesus' clothes, she'd be healed—and she was right!",
      "kids_narrative": "There was a woman who had been very sick for TWELVE YEARS. She had a problem with bleeding that wouldn't stop. She had spent ALL her money on doctors, but nothing helped. She only got worse.\n\nBecause of her sickness, she wasn't allowed to touch anyone or go to the temple. She was all alone and miserable.\n\nThen she heard about Jesus.\n\n'If I could just touch His clothes,' she thought, 'I know I'd be healed!'\n\nShe pushed through the huge crowd around Jesus. People were bumping and pressing everywhere. Finally, she reached out and touched the edge of His coat.\n\nINSTANTLY, she felt it! The bleeding stopped! She was HEALED!\n\nBut then Jesus stopped walking. 'Who touched Me?'\n\nHis disciples looked confused. 'There are people pushing You from every direction! How can You ask who touched You?'\n\nBut Jesus knew this touch was different. Someone had touched Him with FAITH.\n\nThe woman was scared. Trembling, she came forward and knelt at Jesus' feet. She told Him everything.\n\nJesus looked at her with so much love. 'Daughter,' He said, 'your faith has made you well. Go in peace. You are healed!'\n\nJesus didn't just heal her body. He called her 'Daughter'—she belonged now. She wasn't alone anymore.\n\nJesus notices when we reach out to Him in faith, even in a crowd. He always has time for us."
    },
    {
      "title": "Jesus Heals the Centurion's Servant",
      "slug": "centurions-servant",
      "description": "A Roman centurion asks Jesus to heal his servant. Jesus marvels at his faith—greater than any He has found in Israel.",
      "verses": ["Matthew 8:5-13", "Luke 7:1-10"],
      "themes": ["Faith", "Authority", "Gentiles included", "Jesus' power"],
      "characters": ["Jesus", "Centurion", "Servant", "Jewish elders"],
      "narrative": "When Jesus had entered Capernaum, a centurion came to him, asking for help. 'Lord,' he said, 'my servant lies at home paralyzed, suffering terribly.'\n\nJesus said to him, 'Shall I come and heal him?'\n\nThe centurion replied, 'Lord, I do not deserve to have you come under my roof. But just say the word, and my servant will be healed. For I myself am a man under authority, with soldiers under me. I tell this one, \"Go,\" and he goes; and that one, \"Come,\" and he comes. I say to my servant, \"Do this,\" and he does it.'\n\nWhen Jesus heard this, he was amazed and said to those following him, 'Truly I tell you, I have not found anyone in Israel with such great faith. I say to you that many will come from the east and the west, and will take their places at the feast with Abraham, Isaac and Jacob in the kingdom of heaven.'\n\nThen Jesus said to the centurion, 'Go! Let it be done just as you believed it would.' And his servant was healed at that moment.\n\nThe centurion was a Gentile, a Roman soldier—an outsider. Yet he understood something profound about Jesus' authority. He didn't need Jesus to come physically; he recognized that Jesus' word alone carried power. Just as his own commands were obeyed instantly by soldiers, he believed Jesus' command would be obeyed by sickness and even death.\n\nJesus was amazed—a rare response recorded in the Gospels. This pagan soldier had greater faith than anyone in Israel.",
      "kids_title": "The Soldier's Faith",
      "kids_description": "A Roman soldier asked Jesus to heal his servant. He believed Jesus just had to SAY it, and it would happen. Jesus said He'd never seen such great faith!",
      "kids_narrative": "In the town of Capernaum, there was a Roman soldier called a centurion. He was in charge of 100 soldiers! Romans were the rulers, and Jewish people didn't usually like them.\n\nBut this centurion was different. He cared about his servant, who was very sick and couldn't move.\n\nThe centurion heard that Jesus was in town. He sent some friends to ask Jesus for help.\n\nJesus started walking toward the centurion's house. But before He got there, the centurion sent another message:\n\n'Lord, I don't deserve to have You come to my house. Just SAY the word, and I know my servant will be healed. I understand how authority works. I tell my soldiers to go, and they go. I tell them to come, and they come. I know that if You just give the command, sickness has to obey You!'\n\nWhen Jesus heard this, He was AMAZED!\n\nHe turned to the crowd. 'Wow! I haven't found faith like this anywhere in Israel! This man really understands who I am!'\n\nThen Jesus said, 'Go home. Because you believed, your servant is healed.'\n\nAt that very moment, the servant was completely well!\n\nThe centurion believed Jesus' word was powerful enough to heal from a distance. He didn't need Jesus to touch his servant or come to his house. He just trusted Jesus' authority.\n\nThat's the kind of faith that amazes Jesus!"
    },
    {
      "title": "Mary and Martha",
      "slug": "mary-and-martha",
      "description": "Jesus visits the home of Mary and Martha. While Martha busies herself with preparations, Mary sits at Jesus' feet.",
      "verses": ["Luke 10:38-42"],
      "themes": ["Priorities", "Listening to Jesus", "Worry vs. devotion"],
      "characters": ["Jesus", "Mary", "Martha"],
      "narrative": "As Jesus and his disciples were on their way, he came to a village where a woman named Martha opened her home to him. She had a sister called Mary, who sat at the Lord's feet listening to what he said.\n\nBut Martha was distracted by all the preparations that had to be made. She came to him and asked, 'Lord, don't you care that my sister has left me to do the work by myself? Tell her to help me!'\n\n'Martha, Martha,' the Lord answered, 'you are worried and upset about many things, but few things are needed—or indeed only one. Mary has chosen what is better, and it will not be taken away from her.'\n\nMartha wasn't doing anything wrong—hospitality was important, and she was honoring Jesus by serving Him. But she was 'distracted' and 'worried'—her serving had become anxious busyness rather than joyful devotion.\n\nMary, meanwhile, had taken the posture of a disciple—sitting at the teacher's feet. In that culture, this was remarkable; women were rarely taught by rabbis. Yet Jesus welcomed her and defended her choice.\n\nThe 'one thing needed' was not abandoning all work but maintaining right priorities. We can serve Jesus with anxious hearts or with hearts rooted in His presence. Mary chose the better part: first sit at His feet, then serve from overflow.",
      "kids_title": "Mary and Martha",
      "kids_description": "Jesus visited two sisters. Martha was busy cooking and cleaning. Mary just sat and listened to Jesus. Who made the better choice?",
      "kids_narrative": "Jesus came to visit two sisters named Mary and Martha. They were good friends of Jesus!\n\nMartha wanted everything to be PERFECT for Jesus. She cooked and cleaned and rushed around getting everything ready. So much to do!\n\nBut Mary did something different. She sat down right at Jesus' feet and listened to Him talk. She just wanted to be with Him.\n\nMartha got frustrated. 'Lord! Don't You see that Mary left me to do ALL the work by myself? Tell her to help me!'\n\nBut Jesus said gently, 'Martha, Martha. You're worried and stressed about so many things. But only ONE thing really matters. And Mary has chosen it. I won't take that away from her.'\n\nOuch! Martha was working SO hard for Jesus. But she was missing the most important thing—just BEING with Jesus.\n\nThis doesn't mean we should never help or work. Martha's serving was good! But she was so busy that she forgot to enjoy Jesus.\n\nMary knew that listening to Jesus was the best thing she could do. There would always be dishes to wash. But Jesus wouldn't always be sitting in their living room!\n\nSometimes we get so busy doing things FOR Jesus that we forget to spend time WITH Jesus. Reading the Bible, praying, just being quiet with Him—these matter most.\n\nDon't be so busy that you miss Jesus!"
    },
    {
      "title": "Jesus Raises the Widow's Son",
      "slug": "raises-widows-son",
      "description": "Jesus encounters a funeral procession and raises a widow's only son from the dead, giving him back to his mother.",
      "verses": ["Luke 7:11-17"],
      "themes": ["Compassion", "Jesus' power over death", "Caring for widows"],
      "characters": ["Jesus", "The widow", "Her son", "Disciples", "Crowd"],
      "narrative": "Soon afterward, Jesus went to a town called Nain, and his disciples and a large crowd went along with him. As he approached the town gate, a dead person was being carried out—the only son of his mother, and she was a widow. And a large crowd from the town was with her.\n\nWhen the Lord saw her, his heart went out to her and he said, 'Don't cry.'\n\nThen he went up and touched the bier they were carrying him on, and the bearers stood still. He said, 'Young man, I say to you, get up!'\n\nThe dead man sat up and began to talk, and Jesus gave him back to his mother.\n\nThey were all filled with awe and praised God. 'A great prophet has appeared among us,' they said. 'God has come to help his people.' This news about Jesus spread throughout Judea and the surrounding country.\n\nThis widow had lost everything. Her husband was dead; now her only son was dead too. In that culture, without husband or son, she had no provider, no protector, no future. She faced poverty and vulnerability.\n\nNo one asked Jesus to help. He wasn't responding to faith or a request. He simply saw her grief, and 'his heart went out to her'—the Greek word suggests His gut was wrenched with compassion. He touched the funeral bier (making Himself ritually unclean), spoke to the dead young man, and restored him to life.\n\nJesus gave the son back to his mother. He restored not just a life but a family, a future, a hope.",
      "kids_title": "A Mother Gets Her Son Back",
      "kids_description": "A widow's only son had died. When Jesus saw her crying, He felt so sad for her. He touched the coffin and said, 'Young man, get up!' And he did!",
      "kids_narrative": "Jesus and His disciples were walking toward a town called Nain. As they got close to the gate, they saw a sad sight.\n\nA funeral procession was coming out. People were carrying a young man who had died. His poor mother was crying and crying.\n\nThis mother had already lost her husband. Now her only son was dead too. She was all alone with no one to take care of her. It was the saddest thing.\n\nWhen Jesus saw her, His heart broke for her. He felt her pain so deeply.\n\n'Don't cry,' Jesus said gently.\n\nThen Jesus did something surprising. He walked up and touched the stretcher carrying the dead young man. Everyone stopped.\n\nJesus spoke: 'Young man, I say to you—GET UP!'\n\nAnd the young man SAT UP! He started talking! He was ALIVE!\n\nJesus took him by the hand and gave him back to his mother.\n\nCan you imagine how happy she was? Her son was alive! She wasn't alone anymore!\n\nEveryone was amazed and a little scared. 'A great prophet is here!' they said. 'God has come to help His people!'\n\nNo one asked Jesus to do this miracle. He just saw a sad mom and felt compassion. He couldn't walk past her pain without doing something.\n\nThat's how much Jesus cares. He sees our sadness, and His heart hurts with us. And He has the power to do something about it!"
    },
    {
      "title": "Boy Jesus at the Temple",
      "slug": "boy-jesus-temple",
      "description": "At age twelve, Jesus stays behind in Jerusalem after Passover, where His parents find Him in the temple astonishing the teachers with His understanding.",
      "verses": ["Luke 2:41-52"],
      "themes": ["Jesus's Childhood", "Wisdom", "God's House", "Growing in Faith"],
      "characters": ["Jesus", "Mary", "Joseph", "The Teachers"],
      "narrative": "Joseph and Mary went to Jerusalem every year at the feast of the Passover, faithful in their observance of the Law. When Jesus was twelve years old, they went up to Jerusalem after the custom of the feast. This was the age when Jewish boys began to take responsibility for keeping the Law, marking an important transition in Jesus's life.\n\nAfter they had fulfilled the days of the feast, as they returned, the child Jesus tarried behind in Jerusalem. Joseph and his mother knew not of it, assuming He was in their company among the travelers. They went a day's journey before they sought Him among their kinsfolk and acquaintance. When they found Him not, they turned back again to Jerusalem, seeking Him with growing concern.\n\nAfter three days they found Him in the temple, sitting in the midst of the doctors, both hearing them and asking them questions. All that heard Him were astonished at His understanding and answers. The teachers of the Law, learned men who had spent their lives studying the Scriptures, marveled at the wisdom of this twelve-year-old boy. He asked penetrating questions and gave profound answers that went beyond His years.\n\nWhen His parents saw Him, they were amazed. His mother said unto Him, 'Son, why hast thou thus dealt with us? behold, thy father and I have sought thee sorrowing.' Their distress was evident, having searched for three days for their lost child. Jesus's response revealed His divine consciousness: 'How is it that ye sought me? wist ye not that I must be about my Father's business?' This was the first recorded instance of Jesus acknowledging His unique relationship with God the Father and His divine mission.\n\nThough Mary and Joseph understood not the saying which He spake unto them, they treasured these things in their hearts. Jesus went down with them and came to Nazareth, and was subject unto them, demonstrating perfect obedience even while knowing His divine identity. Mary kept all these sayings in her heart, pondering them. And Jesus increased in wisdom and stature, and in favour with God and man, growing in every dimension of human life while remaining the sinless Son of God, preparing for His future ministry.",
      "kids_title": "When Young Jesus Surprised the Teachers",
      "kids_description": "Twelve-year-old Jesus stayed at the temple in Jerusalem asking and answering questions that amazed the wise teachers. He knew He had special work to do for His heavenly Father.",
      "kids_narrative": "Every year, Jesus's family traveled to Jerusalem for a big celebration called Passover. It was a long journey, but they went every year because it was important to worship God. When Jesus was twelve years old, something special and surprising happened on one of these trips. Jesus was growing up and starting to understand more about who He really was.\n\nAfter the Passover celebration ended, Mary and Joseph started the long journey home with all their family and friends. They thought Jesus was somewhere in the big group of travelers, maybe walking with His cousins or other relatives. But when evening came and they looked for Him to have dinner, they couldn't find Him anywhere! They searched among all their family and friends, but Jesus wasn't there. Mary and Joseph were so worried!\n\nThey rushed back to Jerusalem to find Jesus. Can you imagine how worried they were? They searched and searched for three whole days! Finally, they went to the temple, the special house where people worshiped God. And there was Jesus! He was sitting right in the middle of all the wise teachers, the smartest men who studied God's Word all day long. Jesus was listening to them and asking them questions. But here's the amazing part: the teachers were astonished! They couldn't believe how much this twelve-year-old boy understood about God!\n\nWhen Mary saw Jesus, she said, 'Son, why did You do this to us? Your father and I have been so worried, looking everywhere for You!' She was relieved to find Him but also confused about why He stayed behind. Jesus answered with something very important: 'Why were you looking for Me? Didn't you know I must be in My Father's house?' Jesus was talking about God as His Father! Even at twelve years old, Jesus knew He had special work to do for God.\n\nMary and Joseph didn't fully understand what Jesus meant, but Mary remembered everything in her heart to think about later. Jesus went home with them to Nazareth and obeyed them, just like a good son should. He grew taller and wiser, and everyone loved Him - both God and people. This story shows us that even when Jesus was young, He loved God's Word and loved being in God's house. He knew He had a special purpose. We can learn from Jesus to love learning about God and to remember that we all have special purposes too!"
    },
    {
      "title": "Jesus Cleanses the Temple",
      "slug": "jesus-cleanses-temple",
      "description": "Jesus drives out the money changers and merchants from the temple, declaring that God's house should be a house of prayer, not a den of thieves.",
      "verses": ["Matthew 21:12-17", "Mark 11:15-18", "John 2:13-22"],
      "themes": ["Holiness", "Righteous Anger", "God's House", "True Worship"],
      "characters": ["Jesus", "Money Changers", "Merchants", "Chief Priests", "Scribes"],
      "narrative": "When the Jews' passover was at hand, Jesus went up to Jerusalem and found in the temple those that sold oxen and sheep and doves, and the changers of money sitting there. The outer court of the temple, the Court of the Gentiles designed as a place where non-Jews could pray and seek God, had been transformed into a marketplace. The merchants sold animals for sacrifice at inflated prices, and money changers exchanged foreign currency for the temple currency, often cheating the worshipers.\n\nSeeing this desecration of His Father's house, Jesus made a scourge of small cords and drove them all out of the temple, both the sheep and the oxen, and poured out the changers' money, and overthrew the tables. The sound of coins scattering and tables crashing filled the temple courts as Jesus moved through with holy zeal. To them that sold doves He said, 'Take these things hence; make not my Father's house an house of merchandise.'\n\nHis disciples remembered that it was written, 'The zeal of thine house hath eaten me up.' They witnessed the fulfillment of Psalm 69:9 as Jesus demonstrated passionate concern for the purity of worship in God's house. Jesus declared, 'It is written, My house shall be called the house of prayer; but ye have made it a den of thieves.' The religious leaders had allowed, and likely profited from, the exploitation of worshipers who came to honor God.\n\nThe blind and the lame came to Him in the temple, and He healed them, showing what true temple ministry should look like - meeting people's needs and manifesting God's power and compassion. When the chief priests and scribes saw the wonderful things that He did, and the children crying in the temple and saying, 'Hosanna to the Son of David,' they were sore displeased. The religious leaders were indignant at the worship Jesus received.\n\nThey challenged Him: 'Hearest thou what these say?' Jesus responded, 'Yea; have ye never read, Out of the mouth of babes and sucklings thou hast perfected praise?' quoting Psalm 8:2. On another occasion of cleansing the temple, the Jews demanded, 'What sign shewest thou unto us, seeing that thou doest these things?' Jesus answered, 'Destroy this temple, and in three days I will raise it up.' They thought He spoke of Herod's temple, which had taken forty-six years to build, but He spoke of the temple of His body. After His resurrection, His disciples remembered this saying and believed both the Scripture and the words Jesus had spoken, understanding the deeper meaning of His prophetic declaration.",
      "kids_title": "Jesus Cleans Out God's House",
      "kids_description": "When Jesus saw people selling things and cheating others in God's temple, He got angry and chased them all out. God's house should be used for prayer and worship, not for making money!",
      "kids_narrative": "It was time for the Passover celebration, so Jesus went to Jerusalem. When He arrived at the temple, the special place where people came to worship God, Jesus saw something that made Him very upset. The temple was supposed to be a quiet, holy place for prayer, but instead, it looked like a noisy marketplace! People were selling animals for sacrifices, and money changers were sitting at tables, often cheating the worshipers by charging too much.\n\nJesus looked around at all this and became very angry - but it was the right kind of anger. He was angry because people were being greedy and dishonest in His Father's house! Jesus made a whip out of small ropes and started driving out all the animals and the people selling them. He flipped over the tables of the money changers, and coins went flying everywhere! Can you imagine the noise? Crash! Bang! Clink! Clank! Everyone stopped and stared at Jesus.\n\nJesus said to the people selling doves, 'Take these things out of here! Don't turn My Father's house into a place for making money!' Then He told everyone, 'The Bible says God's house should be called a house of prayer, but you have made it a den of thieves!' Jesus was teaching everyone an important lesson: God's house is special and holy. It's a place to worship God, not a place to cheat people or focus on money.\n\nAfter Jesus cleared out the temple, something beautiful happened. People who were blind and couldn't walk came to Him right there in the temple, and Jesus healed them! Children started singing, 'Hosanna to the Son of David!' praising Jesus. But the chief priests and teachers of the law didn't like this at all. They were angry that people were worshiping Jesus. 'Do You hear what these children are saying?' they asked Jesus. Jesus smiled and said, 'Yes! Haven't you read in the Bible that God makes sure even children can give Him perfect praise?'\n\nLater, the religious leaders asked Jesus, 'What right do You have to do these things?' Jesus gave them a mysterious answer: 'If you destroy this temple, I will raise it up in three days.' The leaders were confused because they thought He was talking about the big temple building that took forty-six years to build. But Jesus was actually talking about His own body! After Jesus died and rose again three days later, His disciples remembered what He said and understood. This story teaches us that God's house is special and should be treated with respect, and that Jesus cares deeply about true worship from our hearts."
    },
    {
      "title": "The Widow's Mite",
      "slug": "widows-mite",
      "description": "Jesus observes a poor widow giving two small coins to the temple treasury and declares she gave more than all the wealthy donors because she gave all she had.",
      "verses": ["Mark 12:41-44", "Luke 21:1-4"],
      "themes": ["Generosity", "Sacrifice", "True Giving", "Humility"],
      "characters": ["Jesus", "The Widow", "The Rich People", "The Disciples"],
      "narrative": "Jesus sat over against the treasury, observing how the people cast money into the collection box at the temple. Many that were rich cast in much, making their large donations with fanfare and drawing attention to their generosity. The wealthy could afford to give large sums without it affecting their comfortable lifestyles, and they likely took pride in the recognition their giving brought them.\n\nIn the midst of this parade of prosperity came a certain poor widow, unnoticed by most. She came quietly and cast in two mites, which make a farthing - the smallest coins in circulation, together worth less than a penny. In the eyes of the world, her contribution was insignificant, barely worth acknowledging. No one else likely paid any attention to her meager offering.\n\nBut Jesus saw her. He called unto Him His disciples and taught them a profound lesson about the nature of true giving. He said unto them, 'Verily I say unto you, That this poor widow hath cast more in, than all they which have cast into the treasury.' This statement must have shocked the disciples, who had just witnessed the wealthy depositing large sums of money. How could two mites be more than hundreds or thousands of coins?\n\nJesus explained the spiritual mathematics that heaven uses: 'For all they did cast in of their abundance; but she of her want did cast in all that she had, even all her living.' The rich gave out of their surplus, from what they had left over after taking care of all their needs and wants. Their giving, though large in amount, cost them nothing in terms of sacrifice or faith. But this widow gave out of her poverty, casting in everything she had to live on, holding nothing back for herself.\n\nHer gift required complete trust in God's provision. She could not know where her next meal would come from, yet she gave her last two coins to God. The rich gave what they could spare without inconvenience; she gave what she could not spare, trusting God to care for her. Jesus honored her sacrificial faith and used her example to teach His disciples - and all believers through the ages - that God measures giving not by the amount given but by the sacrifice involved and the heart behind it. In God's economy, the widow's two mites outweighed all the gold in the temple treasury.",
      "kids_title": "The Woman Who Gave Everything",
      "kids_description": "A poor widow put two tiny coins in the offering box at the temple. Jesus said she gave more than all the rich people because she gave all she had and trusted God completely.",
      "kids_narrative": "One day, Jesus was sitting near the offering box at the temple, watching people put in their money gifts to God. Many rich people came by, and they put in lots and lots of money. Their bags jingled with coins! Some of them made sure everyone could see how much they were giving. They wanted people to notice them and think, 'Wow, they're so generous!' But giving was easy for them because they had so much money left over.\n\nThen Jesus noticed a poor widow woman walking quietly up to the offering box. She was very poor and didn't have fancy clothes like the rich people. Nobody else was paying attention to her at all. She reached into her small purse and pulled out two tiny coins - the smallest coins you could have, worth less than a penny together. She dropped them into the box with a tiny clink. That was all the money she had in the whole world!\n\nJesus called His disciples over because He wanted to teach them something very important. He pointed to the widow and said, 'Do you see that poor widow? She just gave more than all those rich people!' The disciples must have been very confused. How could two tiny coins be more than bags full of money? That didn't make sense! But Jesus was about to teach them how God sees things differently than we do.\n\nJesus explained, 'All those rich people gave a lot of money, but they gave from their extra. They still have plenty of money left for food, clothes, and everything they need. But this poor widow gave all the money she had to live on. She gave everything!' The widow trusted God completely. She believed God would take care of her even though she had no money left. That took great faith and love for God!\n\nThis story teaches us that God doesn't just look at how much we give. He looks at our hearts and why we give. The rich people gave to look good, and it didn't cost them anything. But the widow gave because she loved God, and she gave everything she had, trusting Him to take care of her. God loves it when we give cheerfully and trust Him, whether we give a little or a lot. It's not about the amount - it's about the love and faith in our hearts. The widow's tiny gift was huge to God because she gave it with complete trust and love!"
    },
    {
      "title": "Nicodemus Visits Jesus",
      "slug": "nicodemus-visits-jesus",
      "description": "A Pharisee named Nicodemus comes to Jesus at night and learns about being born again and God's love for the world through His Son.",
      "verses": ["John 3:1-21"],
      "themes": ["New Birth", "Salvation", "God's Love", "Faith"],
      "characters": ["Nicodemus", "Jesus"],
      "narrative": "There was a man of the Pharisees named Nicodemus, a ruler of the Jews and a member of the Sanhedrin, the highest Jewish council. He was a respected teacher, learned in the Law and the traditions of Israel. Yet despite his knowledge and position, he recognized that Jesus had something he lacked. He came to Jesus by night, perhaps to avoid the scrutiny of his fellow Pharisees or perhaps because he wanted an unhurried, private conversation.\n\nNicodemus began respectfully: 'Rabbi, we know that thou art a teacher come from God: for no man can do these miracles that thou doest, except God be with him.' He acknowledged Jesus's divine credentials based on the signs he had witnessed. But Jesus, knowing the deeper need in Nicodemus's heart, cut straight to the essential issue. He answered, 'Verily, verily, I say unto thee, Except a man be born again, he cannot see the kingdom of God.'\n\nNicodemus struggled to understand this concept. 'How can a man be born when he is old? can he enter the second time into his mother's womb, and be born?' His question revealed he was thinking in purely physical terms. Jesus explained, 'Verily, verily, I say unto thee, Except a man be born of water and of the Spirit, he cannot enter into the kingdom of God. That which is born of the flesh is flesh; and that which is born of the Spirit is spirit.' Physical birth produces physical life, but spiritual birth is necessary for spiritual life.\n\nJesus continued, 'Marvel not that I said unto thee, Ye must be born again. The wind bloweth where it listeth, and thou hearest the sound thereof, but canst not tell whence it cometh, and whither it goeth: so is every one that is born of the Spirit.' Just as the wind is invisible yet real and powerful, so is the Spirit's work in regeneration. Nicodemus asked, 'How can these things be?' Jesus responded, 'Art thou a master of Israel, and knowest not these things?' As a teacher of Scripture, Nicodemus should have understood from the prophets about God's promise to give His people a new heart and new spirit.\n\nJesus then revealed the heart of the gospel: 'For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life. For God sent not his Son into the world to condemn the world; but that the world through him might be saved.' This is perhaps the most famous verse in Scripture, encapsulating the entire message of salvation. Jesus explained that belief in Him is the dividing line: 'He that believeth on him is not condemned: but he that believeth not is condemned already, because he hath not believed in the name of the only begotten Son of God.' The conversation concluded with Jesus describing how light has come into the world, but people loved darkness rather than light because their deeds were evil, while those who do truth come to the light. Nicodemus left that night with much to ponder, and later proved his growing faith by defending Jesus before the Sanhedrin and by helping to bury Jesus's body after the crucifixion.",
      "kids_title": "Nicodemus Learns About Being Born Again",
      "kids_description": "A Jewish teacher named Nicodemus visited Jesus at night to ask important questions. Jesus taught him that everyone needs to be born again by God's Spirit to enter heaven.",
      "kids_narrative": "Nicodemus was a very important man. He was a Pharisee, which meant he was a teacher of God's law, and he was a ruler of the Jewish people. He had studied the Scriptures his whole life and knew them very well. But even though Nicodemus was smart and important, he knew there was something special about Jesus. He had seen Jesus do miracles and wanted to learn more. So one night, when it was dark and quiet, Nicodemus went to visit Jesus.\n\nNicodemus said, 'Teacher, we know You come from God. Nobody could do the miracles You do unless God was with him.' Nicodemus was being very respectful. But Jesus knew what Nicodemus really needed to hear, so He said something that surprised him: 'I tell you the truth, unless someone is born again, they cannot see God's kingdom.' Born again? Nicodemus was confused! He asked, 'How can someone be born when they're old? They can't go back inside their mother and be born a second time!' Nicodemus was thinking about physical birth, like being a baby.\n\nJesus explained, 'You have to be born of water and the Spirit. When you were born the first time, you got a physical body. But to enter God's kingdom, you need to be born spiritually. Your spirit needs to become alive!' Jesus tried to help Nicodemus understand by talking about the wind. 'You can hear the wind blowing and feel it, but you can't see where it comes from or where it's going. That's what it's like when someone is born of the Spirit.' The Holy Spirit works in ways we can't always see, but we can see the results!\n\nThen Jesus told Nicodemus the most important thing anyone could ever hear: 'God loved the world so much that He gave His only Son. Everyone who believes in Jesus will not die forever but will have eternal life! God didn't send Jesus to condemn the world, but to save it!' This is the most famous verse in the whole Bible, and Jesus was teaching it to Nicodemus for the first time. Jesus was explaining that God loves us so much that He sent Jesus to save us.\n\nJesus told Nicodemus that people who believe in Jesus are not condemned, but people who don't believe are condemned already because they won't accept God's gift. Nicodemus had a lot to think about that night! He came as a teacher, but he learned he needed to become like a little child and be born again. Later on, we see that Nicodemus's faith grew. He defended Jesus when other leaders criticized Him, and he even helped bury Jesus after He died on the cross. This story teaches us that no matter how smart or important we are, everyone needs to be born again by believing in Jesus!"
    },
    {
      "title": "The Rich Young Ruler",
      "slug": "rich-young-ruler",
      "description": "A wealthy young ruler asks Jesus what he must do to inherit eternal life, but walks away sorrowful when told to sell all and follow Jesus.",
      "verses": ["Matthew 19:16-30", "Mark 10:17-27", "Luke 18:18-30"],
      "themes": ["Discipleship", "Wealth", "Eternal Life", "Sacrifice"],
      "characters": ["Rich Young Ruler", "Jesus", "The Disciples"],
      "narrative": "A certain ruler came running to Jesus, kneeled to Him, and asked, 'Good Master, what good thing shall I do, that I may have eternal life?' This young man possessed great wealth and held a position of authority, yet he recognized his spiritual need. His earnestness was evident in how he ran to Jesus and knelt before Him, showing both urgency and humility. He had everything the world valued, but he sensed something was missing.\n\nJesus responded, 'Why callest thou me good? there is none good but one, that is, God.' Jesus was probing the young man's understanding of who He truly was. Then Jesus said, 'If thou wilt enter into life, keep the commandments.' The young man asked, 'Which?' Jesus listed several commandments from the second table of the Law, those dealing with relationships with others: 'Thou shalt do no murder, Thou shalt not commit adultery, Thou shalt not steal, Thou shalt not bear false witness, Honour thy father and thy mother: and, Thou shalt love thy neighbour as thyself.'\n\nThe young man answered confidently, 'All these things have I kept from my youth up: what lack I yet?' He genuinely believed he had fulfilled these commandments and sensed there was still something missing in his spiritual life. Mark records that Jesus, beholding him, loved him - moved with compassion for this sincere seeker who nonetheless misunderstood the depths of his own need and the demands of true righteousness.\n\nJesus said unto him, 'If thou wilt be perfect, go and sell that thou hast, and give to the poor, and thou shalt have treasure in heaven: and come and follow me.' This command exposed the young man's true god: his wealth. Despite his religious observance, his heart was bound to his possessions. When the young man heard that saying, he went away sorrowful: for he had great possessions. He could not bring himself to part with his wealth, even for eternal life. The cost of discipleship was too high in his estimation.\n\nJesus then said unto His disciples, 'Verily I say unto you, That a rich man shall hardly enter into the kingdom of heaven. And again I say unto you, It is easier for a camel to go through the eye of a needle, than for a rich man to enter into the kingdom of God.' The disciples were exceedingly amazed, asking, 'Who then can be saved?' for they shared the common Jewish belief that wealth was a sign of God's blessing. Jesus looked at them and said, 'With men this is impossible; but with God all things are possible.' Salvation is always God's work, whether for rich or poor. Peter then spoke up: 'Behold, we have forsaken all, and followed thee; what shall we have therefore?' Jesus assured them that those who leave everything for His sake will receive a hundredfold in this life and inherit everlasting life, and that many that are first shall be last, and the last shall be first, indicating that earthly status and heavenly reward often stand in inverse relationship.",
      "kids_title": "The Rich Young Man's Sad Choice",
      "kids_description": "A rich young ruler asked Jesus how to get eternal life. But when Jesus told him to give away his money and follow Him, the young man chose his wealth over Jesus and left sadly.",
      "kids_narrative": "One day, a young man came running up to Jesus. He was very rich and very important - he was a ruler! But even with all his money and power, he felt like something was missing in his life. He kneeled down in front of Jesus and asked, 'Good Teacher, what good thing should I do to have eternal life?' This young man really wanted to know how to get to heaven!\n\nJesus asked him an interesting question: 'Why do you call me good? Only God is truly good.' Then Jesus said, 'If you want eternal life, keep God's commandments.' The young man asked, 'Which ones?' So Jesus listed some of the Ten Commandments: 'Don't murder, don't commit adultery, don't steal, don't lie, honor your parents, and love your neighbor as yourself.' These were all about being kind and honest with other people.\n\nThe young man answered with confidence, 'I've kept all of these commands since I was a little boy! What else do I need to do?' He really thought he had been perfect! He still felt like something was missing, though. The Bible tells us that Jesus looked at him with love. Jesus cared about this young man and wanted to help him understand something very important about his heart.\n\nJesus said, 'If you want to be perfect, go sell everything you own, give the money to poor people, and then come follow Me. You'll have treasure in heaven!' Suddenly, the young man's face fell. He became very sad. He loved his money and possessions so much that he couldn't imagine giving them up, even for Jesus! Even for eternal life! So he walked away very, very sad because he had so many things and couldn't let them go.\n\nAfter the young man left, Jesus told His disciples, 'It's very hard for rich people to enter God's kingdom. It's easier for a camel to go through the eye of a tiny sewing needle than for a rich person to enter heaven!' The disciples were shocked! 'Then who can be saved?' they asked. Jesus looked at them and said something wonderful: 'With people, this is impossible. But with God, all things are possible!' This story teaches us that nothing should be more important to us than Jesus - not money, not toys, not anything! When we love Jesus most, we find the true treasure that lasts forever."
    },
    {
      "title": "Jesus Heals a Demon-Possessed Boy",
      "slug": "jesus-heals-demon-possessed-boy",
      "description": "After the disciples fail to cast out a demon from a boy, Jesus heals him and teaches about faith and the power of prayer and fasting.",
      "verses": ["Matthew 17:14-21", "Mark 9:14-29", "Luke 9:37-43"],
      "themes": ["Faith", "Prayer", "Spiritual Warfare", "Jesus's Power"],
      "characters": ["Jesus", "The Boy", "The Father", "The Disciples", "The Demon"],
      "narrative": "When Jesus came down from the Mount of Transfiguration with Peter, James, and John, they found the other disciples surrounded by a great multitude and the scribes questioning with them. A certain man from the multitude came kneeling to Jesus and crying out, 'Lord, have mercy on my son: for he is lunatick, and sore vexed.' The father described his son's terrible condition: the demon would often cast him into the fire and into the water to destroy him.\n\nThe desperate father explained, 'I brought him to thy disciples, and they could not cure him.' This public failure of the disciples had given the scribes opportunity to question and criticize. Jesus responded with words that expressed grief over the unbelief He encountered: 'O faithless and perverse generation, how long shall I be with you? how long shall I suffer you? bring him hither to me.' His exasperation was directed not merely at the disciples but at the general lack of faith in that generation.\n\nAs they brought the boy to Jesus, the spirit saw Him and immediately tore the child, throwing him to the ground where he wallowed foaming at the mouth. Jesus asked the father, 'How long is it ago since this came unto him?' The father answered, 'Of a child,' explaining that this demon had tormented his son from early childhood. Then the father made a heartfelt plea: 'If thou canst do any thing, have compassion on us, and help us.'\n\nJesus responded, 'If thou canst believe, all things are possible to him that believeth.' The issue was not Jesus's ability but the father's faith. Immediately the father of the child cried out with tears, 'Lord, I believe; help thou mine unbelief.' This honest prayer acknowledged both his faith and his struggle with doubt, a prayer many believers can identify with. Jesus, seeing that the people came running together, rebuked the foul spirit, saying, 'Thou dumb and deaf spirit, I charge thee, come out of him, and enter no more into him.'\n\nThe spirit cried out and rent the boy terribly, then came out of him, leaving the child lying as if dead, so that many said, 'He is dead.' But Jesus took him by the hand and lifted him up, and he arose, completely healed and delivered. When Jesus was come into the house, His disciples asked Him privately, 'Why could not we cast him out?' Jesus said unto them, 'Because of your unbelief: for verily I say unto you, If ye have faith as a grain of mustard seed, ye shall say unto this mountain, Remove hence to yonder place; and it shall remove; and nothing shall be impossible unto you. Howbeit this kind goeth not out but by prayer and fasting.' Jesus taught them that some spiritual battles require deeper spiritual preparation and discipline, that faith must be cultivated through communion with God.",
      "kids_title": "Jesus Heals a Boy the Disciples Couldn't Help",
      "kids_description": "A father brought his demon-possessed son to Jesus's disciples, but they couldn't help. When Jesus came, He healed the boy instantly and taught about faith and prayer.",
      "kids_narrative": "When Jesus came down from a mountain with three of His disciples, He found a big crowd gathered around the other disciples. Everyone was arguing and asking questions. A man pushed through the crowd and kneeled in front of Jesus. 'Lord, please help my son!' he begged. 'A demon makes him suffer terribly. It throws him into fire and water trying to kill him! I brought him to Your disciples, but they couldn't make the demon leave.'\n\nJesus was sad that people didn't have more faith. He said, 'Bring the boy to Me.' When they brought the boy to Jesus, the demon saw Jesus and immediately threw the boy on the ground. The boy started rolling around, foaming at the mouth. It was a scary sight! Jesus asked the father, 'How long has this been happening?' The father answered, 'Since he was a little child. This demon has tormented him for years. Please, if You can do anything, help us!'\n\nJesus said something important: 'If you can believe, all things are possible to him who believes.' It wasn't about whether Jesus could do it - Jesus can do anything! It was about whether the father had faith. Right away, the father cried out with tears, 'Lord, I believe! Help me with my unbelief!' He was being honest - he had some faith, but he also had doubts, and he needed Jesus to help him with both. That's a prayer we can all pray when we're struggling to believe!\n\nJesus saw more people running over to see what was happening, so He spoke firmly to the demon: 'You deaf and mute spirit, I command you to come out of him and never enter him again!' The demon screamed and threw the boy around violently one last time, then left him. The boy lay on the ground so still that people thought he was dead. But Jesus took the boy's hand, lifted him up, and he stood up - completely healed! The father must have been so happy!\n\nLater, when Jesus and His disciples were alone in a house, the disciples asked Jesus privately, 'Why couldn't we cast out that demon? We've done it before!' Jesus gave them an important answer: 'Because you didn't have enough faith. Even faith as small as a tiny mustard seed can move mountains! Nothing is impossible with faith. But some demons only come out with prayer and fasting.' Jesus was teaching them that they needed to spend time praying and growing closer to God. Some spiritual battles need special preparation. This story teaches us to have faith in Jesus's power, to be honest with God about our doubts, and to remember that prayer is very important!"
    },
    {
      "title": "Jesus Calls His Disciples",
      "slug": "jesus-calls-his-disciples",
      "description": "Jesus calls fishermen Peter, Andrew, James, and John to follow Him and become fishers of men, demonstrating His power through a miraculous catch of fish that fills their nets to breaking.",
      "verses": ["Matthew 4:18-22", "Luke 5:1-11"],
      "themes": ["Discipleship", "Calling", "Obedience", "Leaving All to Follow Christ", "Miracles"],
      "characters": ["Jesus", "Peter (Simon)", "Andrew", "James", "John", "Zebedee"],
      "narrative": "As Jesus walked by the Sea of Galilee, He began to gather those who would become His closest followers and witnesses. Jesus saw two brethren, Simon called Peter and Andrew his brother, casting a net into the sea, for they were fishers. Jesus interrupted their work with a startling invitation: 'Follow me, and I will make you fishers of men.' Immediately they forsook their nets and followed Him. Going further, Jesus saw James and John with their father mending nets. He called them, and immediately they left the ship and their father and followed Him. Luke's account provides additional detail. The multitude pressed upon Jesus to hear the word of God as He stood by the lake. He entered Simon's ship and asked him to thrust out from land, then taught the people from the boat. When finished, Jesus said to Simon, 'Launch out into the deep, and let down your nets.' Simon answered, 'Master, we have toiled all night and taken nothing. Nevertheless at thy word I will let down the net.' When they let down the net, they enclosed a great multitude of fishes, so many that their net brake. They filled both ships until they began to sink. Peter fell at Jesus' knees saying, 'Depart from me; for I am a sinful man, O Lord.' Yet Jesus said, 'Fear not; from henceforth thou shalt catch men.' When they brought their ships to land, they forsook all and followed Him.",
      "kids_title": "Jesus Calls the Fishermen",
      "kids_description": "Jesus meets some fishermen by the lake and asks them to follow Him. After He fills their boats with so many fish they almost sink, they leave everything to become Jesus' special helpers!",
      "kids_narrative": "One day, Jesus was walking beside a big lake called the Sea of Galilee. He saw two brothers, Peter and Andrew, throwing their fishing nets into the water. They were fishermen—it was their job to catch fish every day. Jesus walked up to them and said something surprising: 'Follow me, and I will make you fishers of men!' Jesus wasn't talking about catching fish anymore. He meant they would help people learn about God. Right away, they left their nets and followed Him. Jesus kept walking and saw two more brothers, James and John. They were in a boat with their father, fixing their fishing nets. Jesus called to them, too. Immediately, James and John left the boat and their father and followed Jesus. Another time, so many people crowded around Jesus that He got into Peter's boat. He asked Peter to push the boat out a little, then taught from there. When finished, He told Peter, 'Row out to the deep water and let down your nets.' Peter was tired. 'Master, we fished all night and didn't catch anything,' he said. 'But because You say so, I'll do it.' Peter and his friends threw out the net—and suddenly, they caught SO many fish that the net started to break! They called for help. Soon both boats were so full of fish they were starting to sink! Peter was amazed. He fell on his knees and said, 'Lord, I'm just a sinner!' But Jesus smiled and said, 'Don't be afraid, Peter. From now on, you'll catch people instead of fish.' When they pulled their boats onto the shore, they left everything and followed Jesus."
    },
    {
      "title": "The Sermon on the Mount",
      "slug": "the-sermon-on-the-mount",
      "description": "Jesus delivers His greatest sermon, teaching about true blessedness, righteousness, loving enemies, prayer, trusting God instead of worrying, and building one's life on the solid rock of obedience to His words.",
      "verses": ["Matthew 5:1-48", "Matthew 6:1-34", "Matthew 7:1-29"],
      "themes": ["Kingdom Living", "Righteousness", "Prayer", "Trust in God", "True Discipleship", "Obedience"],
      "characters": ["Jesus", "The Disciples", "The Multitudes"],
      "narrative": "When Jesus saw the multitudes, He went up into a mountain, and when He was set, His disciples came unto Him. There, He delivered what has become known as the Sermon on the Mount—the most comprehensive summary of Christian ethics ever recorded. Jesus began with the Beatitudes: 'Blessed are the poor in spirit: for theirs is the kingdom of heaven. Blessed are they that mourn: for they shall be comforted. Blessed are the meek: for they shall inherit the earth.' He declared His followers to be salt of the earth and light of the world. He taught radical responses to evil: turn the other cheek, go the extra mile. Most revolutionary: 'Love your enemies, bless them that curse you, do good to them that hate you.' He taught them to pray: 'Our Father which art in heaven, Hallowed be thy name. Thy kingdom come, Thy will be done in earth, as it is in heaven...' Jesus commanded not to lay up treasures on earth but in heaven. His disciples should take no thought for their life—God feeds the birds and clothes the lilies. 'But seek ye first the kingdom of God, and his righteousness; and all these things shall be added unto you.' He taught, 'Judge not, that ye be not judged.' He encouraged persistent prayer: 'Ask, and it shall be given you; seek, and ye shall find.' He summarized the Law in the Golden Rule: 'Therefore all things whatsoever ye would that men should do to you, do ye even so to them.' Jesus concluded with the parable of the wise and foolish builders. Whoever hears His sayings and does them is like a wise man who built his house upon a rock. But whoever hears and does not obey is like a foolish man who built upon sand—when storms came, the house fell. The people were astonished at His doctrine, for He taught them as one having authority.",
      "kids_title": "Jesus' Mountain Sermon",
      "kids_description": "Jesus teaches a huge crowd on a mountainside about how to live for God—loving enemies, not worrying, praying to our Heavenly Father, and building our lives on obeying His words.",
      "kids_narrative": "One day, Jesus saw huge crowds of people coming to hear Him teach. He walked up on a mountainside, sat down, and His disciples gathered around Him. Then Jesus taught them the most important lessons about how to live for God. Jesus started by teaching about who is truly blessed, or happy. He said, 'Blessed are the poor in spirit, for theirs is the kingdom of heaven.' Blessed are those who are kind, who want to do what's right, who show mercy, who have pure hearts, and who make peace. Jesus told His followers, 'You are the salt of the earth and the light of the world.' Christians should make the world better and help others see God's love. Then Jesus taught about treating others with love. If someone is mean to you, don't be mean back. Most surprising of all, Jesus said, 'Love your enemies. Pray for people who are mean to you.' Jesus taught His followers how to pray: 'Our Father which art in heaven, Hallowed be thy name. Thy kingdom come, Thy will be done in earth, as it is in heaven. Give us this day our daily bread...' Jesus didn't want people to worry. He said, 'Look at the birds! They don't plant gardens, but God feeds them. You're much more important than birds! If God takes care of birds and flowers, He'll definitely take care of you!' Jesus also said we shouldn't judge other people for their mistakes when we make mistakes too. At the end of His sermon, Jesus told a story about two builders. One man built his house on a rock. When storms came, the house stayed strong. Another man built his house on sand. When the storm came, the house crashed down! Jesus said listening to His words and obeying them is like building on a rock. When Jesus finished teaching, the people were amazed. He spoke with power and authority because He is God's Son!"
    }
  ]
}
