{
  "category": "Miracles of Jesus",
  "slug": "miracles-of-jesus",
  "description": "The miraculous works of Christ—healing the sick, raising the dead, commanding nature—revealing His divine power and compassion.",
  "stories": [
    {
      "title": "Jesus Calms the Storm",
      "slug": "jesus-calms-the-storm",
      "description": "A violent storm threatens to sink the disciples' boat while Jesus sleeps. With a word, He commands the wind and waves to be still.",
      "verses": ["Mark 4:35-41", "Matthew 8:23-27", "Luke 8:22-25"],
      "themes": ["Power over nature", "Faith and fear", "Peace", "Trust", "Jesus' deity"],
      "characters": ["Jesus", "The disciples"],
      "narrative": "That day when evening came, Jesus said to His disciples, 'Let us go over to the other side' of the Sea of Galilee. Leaving the crowd behind, they took Him along, just as He was, in the boat.\n\nJesus was exhausted from a full day of teaching. He went to the stern, lay down on a cushion, and fell asleep.\n\nWithout warning, a furious squall came up. The Sea of Galilee sits in a basin surrounded by hills, and violent storms can descend with terrifying speed as cool air rushes down to meet the warm air over the water. Waves broke over the boat, filling it with water. Several of the disciples were experienced fishermen who had worked these waters all their lives—and they were terrified.\n\nThrough it all, Jesus slept.\n\n'Teacher!' they cried, waking Him. 'Don't you care if we drown?'\n\nJesus got up. He looked at the raging wind and the crashing waves. He spoke three words: 'Peace, be still.'\n\nThe wind died down. The waves flattened. It was completely calm—not the gradual settling that follows a storm, but instant, supernatural peace.\n\nThen Jesus turned to His disciples. 'Why are you so afraid? Do you still have no faith?'\n\nThey were terrified—but now with a different kind of fear. They asked each other, 'Who is this? Even the wind and the waves obey Him!'\n\nThe One who slept in exhaustion was fully human. The One who commanded creation was fully God. In that boat, the disciples were beginning to understand just who was with them—the Lord of heaven and earth, who holds the storms of life in His hands.",
      "kids_title": "Jesus Stops the Big Storm",
      "kids_description": "Jesus and His friends were in a boat when a scary storm came. The friends were afraid, but Jesus just told the storm to stop—and it did!",
      "kids_narrative": "Jesus and His friends got in a boat to cross a big lake. Jesus was SO tired from helping people all day. He found a pillow and fell fast asleep.\n\nThen something scary happened. A BIG storm came! The wind blew WHOOOOSH! The waves splashed CRASH! Water got in the boat!\n\nThe friends were so scared! Some of them were fishermen who knew all about boats, and even THEY were afraid. The boat was rocking and filling with water!\n\nBut Jesus was still sleeping! How could He sleep through this?\n\n'Jesus! Wake up!' they shouted. 'We're going to sink! Don't you care?'\n\nJesus woke up. He wasn't scared at all. He stood up in the rocky boat and looked at the storm.\n\n'PEACE! BE STILL!' Jesus said to the wind and waves.\n\nAnd just like that... the wind stopped. The waves calmed down. Everything was perfectly quiet and peaceful. Just like that!\n\nJesus looked at His friends. 'Why were you so scared? Don't you trust me?'\n\nThe friends looked at each other with big eyes. 'Whoa,' they whispered. 'Who IS this? Even the wind and waves do what He says!'\n\nJesus is so powerful that even storms obey Him! When we're scared, we can trust Jesus to take care of us."
    },
    {
      "title": "Jesus Feeds Five Thousand",
      "slug": "jesus-feeds-five-thousand",
      "description": "With only five loaves and two fish, Jesus feeds a massive crowd of over five thousand people, with twelve baskets of leftovers remaining.",
      "verses": ["John 6:1-14", "Matthew 14:13-21", "Mark 6:30-44", "Luke 9:10-17"],
      "themes": ["Provision", "Abundance", "Compassion", "Faith", "Jesus as Bread of Life"],
      "characters": ["Jesus", "The disciples", "Andrew", "Philip", "A boy with loaves and fish", "The crowd"],
      "narrative": "Jesus crossed to the far shore of the Sea of Galilee, and a great crowd followed Him because they saw the signs He had performed on the sick. He went up on a mountainside and sat down with His disciples.\n\nThe Jewish Passover Festival was near. When Jesus looked up and saw the vast crowd coming toward Him, He said to Philip, 'Where shall we buy bread for these people to eat?' He asked this to test Philip, for He already knew what He was going to do.\n\nPhilip answered, 'It would take more than half a year's wages to buy enough bread for each one to have a bite!'\n\nAndrew, Simon Peter's brother, spoke up: 'Here is a boy with five small barley loaves and two small fish. But how far will they go among so many?'\n\nJesus said, 'Have the people sit down.' There was plenty of grass in that place, and they sat down—about five thousand men, besides women and children.\n\nJesus took the loaves, gave thanks, and distributed them to those who were seated. He did the same with the fish, and everyone ate as much as they wanted.\n\nWhen they had all had enough to eat, Jesus said to His disciples, 'Gather the pieces that are left over. Let nothing be wasted.' They gathered twelve baskets full of broken pieces left over from the five barley loaves.\n\nAfter the people saw the sign Jesus performed, they began to say, 'Surely this is the Prophet who is to come into the world.'\n\nA boy's small lunch, placed in Jesus' hands, became a feast for thousands with abundance to spare. No need is too great for the One who created all things. No offering is too small when given to Him.",
      "kids_title": "A Big Picnic with Jesus",
      "kids_description": "Thousands of people were hungry, but there was only one little boy's lunch. Jesus took that tiny lunch and made enough food for EVERYONE—with leftovers!",
      "kids_narrative": "SO many people came to see Jesus—thousands and thousands! They listened to Him teach all day long. But then everyone got hungry. Uh oh!\n\nJesus asked His friend Philip, 'Where can we get food for all these people?'\n\nPhilip looked at the huge crowd. 'We could never buy enough food for everyone!'\n\nThen Andrew found something. 'There's a boy here with a lunch—five little rolls and two small fish. But that's not nearly enough!'\n\nJesus smiled. 'Tell everyone to sit down on the grass.'\n\nThe people sat down—5,000 men, plus women and kids! That's like filling a whole stadium!\n\nJesus took the boy's little lunch. He thanked God for it. Then He started breaking the bread and fish into pieces.\n\nAnd something AMAZING happened! Jesus kept breaking off pieces... and there was always more! The helpers passed out food to everyone. Every single person got plenty to eat!\n\nWhen everyone was full—totally stuffed!—Jesus said, 'Gather up the leftovers.'\n\nGuess how much was left over? TWELVE baskets full! More than they started with!\n\nEveryone was amazed. 'Jesus must be SO special!' they said.\n\nJesus can take something small—like a little boy's lunch—and do something HUGE with it. When we give what we have to Jesus, He can do amazing things!"
    },
    {
      "title": "Jesus Walks on Water",
      "slug": "jesus-walks-on-water",
      "description": "In the dark of night, the disciples struggle against a storm when they see Jesus walking toward them on the water. Peter steps out in faith.",
      "verses": ["Matthew 14:22-33", "Mark 6:45-52", "John 6:16-21"],
      "themes": ["Faith", "Fear", "Jesus' deity", "Peter's boldness", "Worship"],
      "characters": ["Jesus", "Peter", "The disciples"],
      "narrative": "Immediately after feeding the five thousand, Jesus made His disciples get into the boat and go on ahead of Him to the other side while He dismissed the crowd. After leaving them, He went up on a mountainside to pray.\n\nLater that night, the boat was in the middle of the lake, and Jesus was alone on land. He saw the disciples straining at the oars, because the wind was against them. Shortly before dawn, He went out to them, walking on the lake.\n\nWhen the disciples saw Him walking on the water, they were terrified. 'It's a ghost!' they cried out in fear.\n\nBut Jesus immediately said to them: 'Take courage! It is I. Don't be afraid.'\n\n'Lord, if it's you,' Peter replied, 'tell me to come to you on the water.'\n\n'Come,' said Jesus.\n\nThen Peter got down out of the boat, walked on the water, and came toward Jesus. But when he saw the wind and the waves, he was afraid and began to sink. 'Lord, save me!' he cried.\n\nImmediately Jesus reached out His hand and caught him. 'You of little faith,' He said, 'why did you doubt?'\n\nWhen they climbed into the boat, the wind died down. Then those who were in the boat worshiped Him, saying, 'Truly you are the Son of God.'\n\nPeter's brief walk on water reveals a profound truth: as long as his eyes were on Jesus, he did the impossible. When he looked at the circumstances, he sank. But even in his sinking, Jesus' hand was there to save him. The One who walks on storms can keep us walking too—if we keep our eyes on Him.",
      "kids_title": "Peter Walks on Water",
      "kids_description": "Jesus walked on top of the water to His friends' boat! Peter wanted to try too. As long as he looked at Jesus, he could walk on water. But when he got scared, he started to sink!",
      "kids_narrative": "The friends were in their boat at night, rowing across the lake. The wind was blowing hard, and they were tired from rowing.\n\nThen they saw something that made them scream! Someone was WALKING on the water toward them!\n\n'A GHOST!' they yelled.\n\nBut it wasn't a ghost. 'Don't be scared!' the person called out. 'It's me, Jesus!'\n\nPeter had an idea. 'Jesus, if that's really you, tell me to come walk on the water too!'\n\nJesus said, 'Come on!'\n\nPeter climbed out of the boat and put his feet on the water. And guess what? HE WAS WALKING ON WATER! As long as Peter looked at Jesus, he could do it!\n\nBut then Peter looked around at the big waves and the strong wind. He got scared. And he started to SINK!\n\n'JESUS, HELP!' Peter shouted.\n\nRight away, Jesus grabbed Peter's hand and pulled him up. 'Why did you stop trusting me?' Jesus asked.\n\nThey climbed into the boat together, and the wind stopped. All the friends were amazed. They bowed down to Jesus. 'You really ARE the Son of God!' they said.\n\nThis story teaches us something important: when we keep our eyes on Jesus and trust Him, we can do amazing things. Even when things get scary, Jesus is always there to help us!"
    },
    {
      "title": "Jesus Heals the Blind Man",
      "slug": "jesus-heals-the-blind-man",
      "description": "Jesus heals a man born blind, sparking controversy with the religious leaders. The healed man's testimony grows bolder: 'One thing I know—I was blind but now I see!'",
      "verses": ["John 9:1-41"],
      "themes": ["Spiritual blindness", "Physical healing", "Testimony", "Persecution", "Light of the world"],
      "characters": ["Jesus", "The man born blind", "The disciples", "The Pharisees", "The man's parents"],
      "narrative": "As Jesus went along, He saw a man blind from birth. His disciples asked, 'Rabbi, who sinned, this man or his parents, that he was born blind?'\n\n'Neither this man nor his parents sinned,' said Jesus. 'This happened so that the works of God might be displayed in him. While I am in the world, I am the light of the world.'\n\nJesus spit on the ground, made some mud with the saliva, and put it on the man's eyes. 'Go,' He told him, 'wash in the Pool of Siloam.' The man went, washed, and came home seeing.\n\nHis neighbors were stunned. 'Isn't this the same man who used to sit and beg?' Some said yes; others said he only looked like him. But the man kept saying, 'I am the man.'\n\nThey brought him to the Pharisees. It was the Sabbath when Jesus made the mud and opened his eyes. The Pharisees interrogated him. When he told them what happened, they were divided. 'This man is not from God, for He does not keep the Sabbath.' But others asked, 'How can a sinner perform such signs?'\n\nThey questioned the man again. 'What have you to say about Him? It was your eyes He opened.'\n\n'He is a prophet,' the man replied.\n\nThe Jewish leaders didn't believe he had been blind at all until they summoned his parents. 'Is this your son? Is this the one you say was born blind? How is it that now he can see?'\n\nHis parents were afraid of being expelled from the synagogue. 'We know he is our son and that he was born blind. But how he can see now, we don't know. Ask him. He is of age.'\n\nA second time they summoned the man. 'Give glory to God by telling the truth. We know this man is a sinner.'\n\nHe replied, 'Whether He is a sinner or not, I don't know. One thing I do know: I was blind but now I see!'\n\nExasperated, they hurled insults at him and threw him out. When Jesus heard this, He found the man. 'Do you believe in the Son of Man?'\n\n'Who is He, sir? Tell me so that I may believe in Him.'\n\n'You have now seen Him; in fact, He is the one speaking with you.'\n\n'Lord, I believe,' the man said, and he worshiped Him.\n\nJesus said, 'For judgment I have come into this world, so that the blind will see and those who see will become blind.'\n\nSome Pharisees heard Him. 'What? Are we blind too?'\n\nJesus replied, 'If you were blind, you would not be guilty of sin; but now that you claim you can see, your guilt remains.'\n\nThe man born blind gained his sight and his Savior. The religious leaders who thought they saw everything remained in darkness.",
      "kids_title": "Jesus Helps the Blind Man See",
      "kids_description": "A man had been blind his whole life. Jesus put mud on his eyes and told him to wash it off. When he did, he could SEE for the very first time!",
      "kids_narrative": "There was a man who had never, ever seen anything. He was born blind. He couldn't see colors or faces or anything at all. He had to beg for money because he couldn't work.\n\nOne day Jesus walked by. His friends asked, 'Why was this man born blind? Did he do something wrong?'\n\nJesus said, 'No! He was born this way so everyone could see God do something amazing!'\n\nThen Jesus did something unusual. He spit on the ground and made some mud. He put the mud on the man's eyes.\n\n'Go wash in the pool,' Jesus said.\n\nThe man went to the pool and washed off the mud. And when he opened his eyes... HE COULD SEE! For the first time EVER!\n\nHe could see the blue sky! He could see people's faces! He could see EVERYTHING!\n\nPeople couldn't believe it. 'Is that really you?' they asked.\n\n'Yes, it's me! I was blind, but now I can see!'\n\nSome grumpy leaders didn't like that Jesus healed on a special day. They asked the man lots of questions, trying to get him to say Jesus was bad.\n\nBut the man said, 'I don't know about all that. But I know ONE thing: I used to be blind, and now I can SEE!'\n\nLater, Jesus found the man again. 'Do you believe in Me?' Jesus asked.\n\n'Yes, Lord, I believe!' the man said. And he worshiped Jesus.\n\nJesus gives sight to blind eyes AND helps us see the truth about who He is!"
    },
    {
      "title": "Jesus Raises Lazarus",
      "slug": "jesus-raises-lazarus",
      "description": "Jesus' dear friend Lazarus dies and is buried for four days. At the tomb, Jesus commands him to come out—and death itself obeys.",
      "verses": ["John 11:1-44"],
      "themes": ["Resurrection", "Life and death", "Faith", "Grief", "Jesus weeps", "God's glory"],
      "characters": ["Jesus", "Lazarus", "Martha", "Mary", "The disciples", "The crowd"],
      "narrative": "A man named Lazarus was sick. He lived in Bethany with his sisters, Mary and Martha. The sisters sent word to Jesus: 'Lord, the one you love is sick.'\n\nWhen Jesus heard this, He said, 'This sickness will not end in death. It is for God's glory so that God's Son may be glorified through it.' Jesus loved Martha and her sister and Lazarus. Yet when He heard Lazarus was sick, He stayed where He was two more days.\n\nThen He said to His disciples, 'Let us go back to Judea. Our friend Lazarus has fallen asleep; I am going there to wake him up.'\n\nThe disciples misunderstood. 'Lord, if he sleeps, he will get better.'\n\nJesus told them plainly, 'Lazarus is dead, and for your sake I am glad I was not there, so that you may believe. But let us go to him.'\n\nWhen Jesus arrived, He found that Lazarus had already been in the tomb for four days. Martha came out to meet Him. 'Lord, if you had been here, my brother would not have died. But I know that even now God will give you whatever you ask.'\n\nJesus said to her, 'Your brother will rise again.'\n\n'I know he will rise again in the resurrection at the last day,' Martha answered.\n\nJesus said to her, 'I am the resurrection and the life. The one who believes in me will live, even though they die; and whoever lives by believing in me will never die. Do you believe this?'\n\n'Yes, Lord,' she replied. 'I believe that you are the Messiah, the Son of God.'\n\nMary came out next, weeping. When Jesus saw her weeping, and the Jews who had come along with her also weeping, He was deeply moved in spirit and troubled.\n\n'Where have you laid him?' He asked.\n\n'Come and see, Lord,' they replied.\n\nJesus wept.\n\nThe people said, 'See how He loved him!'\n\nJesus came to the tomb, a cave with a stone laid across the entrance. 'Take away the stone,' He said.\n\n'But, Lord,' Martha protested, 'by this time there is a bad odor, for he has been there four days.'\n\nJesus said, 'Did I not tell you that if you believe, you will see the glory of God?'\n\nThey took away the stone. Jesus looked up and prayed, 'Father, I thank you that you have heard me. I knew that you always hear me, but I said this for the benefit of the people standing here, that they may believe that you sent me.'\n\nThen Jesus called in a loud voice, 'Lazarus, come out!'\n\nThe dead man came out, his hands and feet wrapped with strips of linen, and a cloth around his face.\n\nJesus said to them, 'Take off the grave clothes and let him go.'\n\nThe One who is the resurrection and the life stood at a tomb and summoned a dead man back to living. Lazarus walked out. Many of the Jews who had seen what Jesus did believed in Him. The greatest sign yet pointed to an even greater resurrection to come.",
      "kids_title": "Jesus Brings Lazarus Back!",
      "kids_description": "Jesus' friend Lazarus got sick and died. His sisters were SO sad. But Jesus came and did something AMAZING—He brought Lazarus back to life!",
      "kids_narrative": "Jesus had good friends named Lazarus, Mary, and Martha. They were like family to Him.\n\nOne day Lazarus got very, very sick. His sisters sent a message to Jesus: 'Please come! Lazarus is sick!'\n\nBut Jesus waited. And sad to say, Lazarus died.\n\nWhen Jesus finally came, Martha ran to meet Him. She was crying. 'If you had been here, my brother wouldn't have died!'\n\nJesus said something very important: 'I am the resurrection and the life. Anyone who believes in me will live, even if they die. Do you believe this?'\n\n'Yes, Lord!' Martha said.\n\nMary came out crying too. So many people were crying. And guess what? Jesus cried too. He was sad because His friends were sad. Jesus FEELS our sadness with us.\n\nThey went to the tomb—a cave with a big stone in front. 'Move the stone,' Jesus said.\n\n'But Jesus,' Martha said, 'he's been dead four days!'\n\nJesus said, 'Didn't I tell you that if you believe, you'll see something amazing?'\n\nThey moved the stone. Jesus prayed to God. Then He shouted in a loud voice:\n\n'LAZARUS, COME OUT!'\n\nAnd... Lazarus came walking out! He was ALIVE! Still wrapped up in his burial cloths, but ALIVE!\n\n'Unwrap him!' Jesus said. And there was Lazarus, back from the dead!\n\nEveryone was amazed. Jesus is so powerful that even DEATH has to obey Him! Because Jesus is the resurrection and the life, everyone who believes in Him will live forever!"
    },
    {
      "title": "Jesus Heals Ten Lepers",
      "slug": "jesus-heals-ten-lepers",
      "description": "Ten men with leprosy cry out to Jesus for mercy. All are healed, but only one—a Samaritan—returns to give thanks.",
      "verses": ["Luke 17:11-19"],
      "themes": ["Healing", "Gratitude", "Faith", "Outcasts", "Worship"],
      "characters": ["Jesus", "The ten lepers", "The thankful Samaritan"],
      "narrative": "As Jesus traveled along the border between Samaria and Galilee, He was going into a village when ten men who had leprosy met Him. They stood at a distance—as the law required, for lepers were considered unclean and had to stay away from healthy people.\n\nThey called out in a loud voice, 'Jesus, Master, have pity on us!'\n\nWhen Jesus saw them, He said, 'Go, show yourselves to the priests.' This was the procedure prescribed by the law for anyone healed of leprosy—the priest would examine them and declare them clean.\n\nAs they went, they were cleansed. Their diseased flesh became whole. Their fingers and toes, perhaps disfigured or lost to the disease, were restored. They were healed.\n\nOne of them, when he saw he was healed, came back, praising God in a loud voice. He threw himself at Jesus' feet and thanked Him—and he was a Samaritan, one of the people Jews despised.\n\nJesus asked, 'Were not all ten cleansed? Where are the other nine? Has no one returned to give praise to God except this foreigner?'\n\nThen He said to him, 'Rise and go; your faith has made you well.'\n\nTen were healed. One was made whole—not just in body but in soul. The nine received a physical blessing and went on their way. The one who returned received something greater: a relationship with the Healer. Gratitude brought him back into the presence of Christ, and there he found what he truly needed.\n\nThe story asks each of us: Are we among the nine, or the one?",
      "kids_title": "One Man Says Thank You",
      "kids_description": "Ten sick men asked Jesus to heal them. Jesus healed ALL of them! But only ONE came back to say thank you. Jesus was happy that one man remembered to be thankful.",
      "kids_narrative": "Ten men stood far away from Jesus. They couldn't come close because they had a bad sickness called leprosy. People with leprosy had to stay away from everyone else.\n\n'Jesus! Please help us!' they shouted.\n\nJesus saw them and said, 'Go show yourselves to the priests.' That was what you did when you got better from leprosy.\n\nThe men started walking to find the priests. And as they walked, something amazing happened—they looked at their skin, and the leprosy was GONE! They were healed!\n\nAll ten men were SO happy! They ran off to start their new healthy lives.\n\nBut wait. One man stopped. He turned around and ran back to Jesus. He fell down at Jesus' feet.\n\n'THANK YOU, THANK YOU, THANK YOU!' he said, praising God with a loud voice.\n\nJesus looked around. 'Didn't I heal TEN men? Where are the other nine? Only this one came back to say thank you?'\n\nJesus smiled at the man. 'Get up and go. Your faith has made you well!'\n\nTen men got healed. But only ONE remembered to say thank you. That one man got something extra special—time with Jesus and His blessing.\n\nThis story reminds us to always say THANK YOU to God for all the good things He does for us. Don't be like the nine who forgot. Be like the one who came back!"
    },
    {
      "title": "Jesus Heals the Paralyzed Man",
      "slug": "jesus-heals-the-paralyzed-man",
      "description": "Four friends lower a paralyzed man through a roof to get him to Jesus. Jesus first forgives his sins, then heals his body, demonstrating His divine authority.",
      "verses": ["Mark 2:1-12", "Matthew 9:1-8", "Luke 5:17-26"],
      "themes": ["Faith", "Friendship", "Forgiveness", "Healing", "Jesus' authority"],
      "characters": ["Jesus", "The paralyzed man", "The four friends", "The Pharisees", "The crowd"],
      "narrative": "A few days later, when Jesus again entered Capernaum, the people heard that He had come home. So many gathered that there was no room left, not even outside the door, and He preached the word to them.\n\nFour men came, carrying a paralyzed man on a mat. They wanted to bring their friend to Jesus, but they could not get him through the crowd. So they made an opening in the roof above Jesus by digging through it, and then lowered the mat the man was lying on.\n\nWhen Jesus saw their faith, He said to the paralyzed man, 'Son, your sins are forgiven.'\n\nNow some teachers of the law were sitting there, thinking to themselves, 'Why does this fellow talk like that? He's blaspheming! Who can forgive sins but God alone?'\n\nImmediately Jesus knew in His spirit that this was what they were thinking. 'Why are you thinking these things?' He asked. 'Which is easier: to say to this paralyzed man, \"Your sins are forgiven,\" or to say, \"Get up, take your mat and walk\"? But I want you to know that the Son of Man has authority on earth to forgive sins.'\n\nThen He said to the paralyzed man, 'I tell you, get up, take your mat and go home.'\n\nImmediately the man got up, took his mat, and walked out in full view of them all. Everyone was amazed and praised God, saying, 'We have never seen anything like this!'\n\nThe four friends' determination broke through every barrier. The religious leaders' hearts remained closed even when the evidence stood and walked before them. And the paralyzed man received something greater than working legs—he received forgiveness from the only One who could give it.",
      "kids_title": "Through the Roof to See Jesus",
      "kids_description": "A man couldn't walk, but he had four amazing friends. They couldn't get through the crowd, so they made a hole in the roof and lowered their friend down to Jesus!",
      "kids_narrative": "A man couldn't walk at all. He had to lie on a mat all day. But he had four REALLY good friends.\n\nOne day his friends heard that Jesus was in a house nearby. 'Let's take our friend to Jesus!' they said. They picked up the mat with their friend on it and carried him to the house.\n\nBut oh no! There were SO many people crowded around! They couldn't get in the door. They couldn't even get close!\n\nDid the friends give up? NO WAY!\n\nThey carried their friend up to the ROOF! They started digging a hole in the roof. Pieces fell down. People inside looked up. 'What's happening?'\n\nThe friends made the hole bigger. Then they lowered their friend down, down, down on his mat—right in front of Jesus!\n\nJesus saw how much those friends believed in Him. He smiled at the man on the mat.\n\n'Your sins are forgiven,' Jesus said.\n\nSome grumpy people thought, 'Only God can forgive sins!'\n\nJesus knew what they were thinking. He said, 'I'll show you I have the power to forgive sins!'\n\nThen Jesus said to the man, 'Get up! Pick up your mat and walk home!'\n\nThe man STOOD UP! He picked up his mat! He WALKED right out the door! He was totally healed!\n\nEveryone was amazed! 'We've NEVER seen anything like this!'\n\nThose four friends didn't give up. They found a way to get their friend to Jesus. And Jesus did something amazing! What good friends!"
    },
    {
      "title": "Jesus Heals Jairus's Daughter",
      "slug": "jesus-heals-jairus-daughter",
      "description": "A synagogue leader begs Jesus to heal his dying daughter. Though she dies before Jesus arrives, He takes her by the hand and raises her back to life.",
      "verses": ["Mark 5:21-43", "Matthew 9:18-26", "Luke 8:40-56"],
      "themes": ["Faith", "Resurrection", "Compassion", "Parental Love", "Jesus' Power Over Death"],
      "characters": ["Jesus", "Jairus", "Jairus's daughter", "The disciples", "The mourners"],
      "narrative": "When Jesus had crossed over in the boat to the other side, a large crowd gathered around Him. Then a man named Jairus, a synagogue leader, came and fell at Jesus' feet. He pleaded earnestly with Him, 'My little daughter is dying. Please come and put your hands on her so that she will be healed and live.'\n\nJesus went with him, and a large crowd followed and pressed around Him. While Jesus was still speaking to another who had been healed, some people came from the house of Jairus. 'Your daughter is dead,' they said. 'Why bother the teacher anymore?'\n\nIgnoring what they said, Jesus told Jairus, 'Don't be afraid; just believe.'\n\nHe did not let anyone follow Him except Peter, James, and John. When they came to the home of the synagogue leader, Jesus saw a commotion, with people crying and wailing loudly. He went in and said to them, 'Why all this commotion and wailing? The child is not dead but asleep.'\n\nThey laughed at Him. But He put them all out, took the child's father and mother and those who were with Him, and went in where the child was. He took her by the hand and said to her, 'Talitha koum!' (which means 'Little girl, I say to you, get up!').\n\nImmediately the girl stood up and began to walk around. She was twelve years old. At this they were completely astonished. He gave strict orders not to let anyone know about this, and told them to give her something to eat.\n\nJairus had risked his reputation as a synagogue leader to seek help from Jesus. His faith was tested when news came that his daughter had died. But Jesus' words—'Don't be afraid; just believe'—carried him through. And in that little girl's room, death gave way to life at the touch of the Son of God.",
      "kids_title": "Jesus Wakes Up the Little Girl",
      "kids_description": "A father's little girl was very sick and then she died. But Jesus came and took her hand and said, 'Little girl, get up!' And she did!",
      "kids_narrative": "Jairus was an important man at the synagogue. But he had a big problem—his little girl was very, very sick. She was only twelve years old, and she was dying!\n\nJairus ran to find Jesus. He fell down at Jesus' feet. 'Please, please!' he begged. 'My daughter is dying! Please come and make her better!'\n\nJesus said, 'Let's go.'\n\nBut as they were walking, some people came running from Jairus's house. Their faces were sad. 'Don't bother Jesus anymore,' they said. 'Your daughter has died.'\n\nJairus's heart must have broken. His little girl was gone!\n\nBut Jesus turned to Jairus and said something important: 'Don't be afraid. Just believe.'\n\nThey kept walking to the house. When they got there, lots of people were crying and making loud noises because they were so sad.\n\nJesus said, 'Why are you crying? The little girl isn't dead—she's just sleeping!'\n\nThe people LAUGHED at Jesus. They knew she was dead!\n\nJesus made everyone leave except for the girl's mom and dad and three of His closest friends. They went into the room where the little girl was lying.\n\nJesus took her hand. He said gently, 'Little girl, get up!'\n\nAnd right away—the little girl opened her eyes! She got up! She walked around! She was ALIVE!\n\nHer mom and dad couldn't believe it! They were SO happy!\n\nJesus smiled. 'Give her something to eat,' He said.\n\nJesus is so powerful that even death has to listen to Him. When He says 'get up,' nothing can stay down!"
    },
    {
      "title": "The Wedding at Cana",
      "slug": "wedding-at-cana",
      "description": "At a wedding celebration, Jesus performs His first miracle by turning water into wine, revealing His glory and leading His disciples to believe in Him.",
      "verses": ["John 2:1-12"],
      "themes": ["Jesus' Glory", "First Miracle", "Abundance", "Obedience", "Joy"],
      "characters": ["Jesus", "Mary", "The disciples", "The servants", "The master of the banquet"],
      "narrative": "On the third day a wedding took place at Cana in Galilee. Jesus' mother was there, and Jesus and His disciples had also been invited to the wedding.\n\nWhen the wine was gone, Jesus' mother said to Him, 'They have no more wine.' In that culture, running out of wine at a wedding was a serious social embarrassment for the family.\n\n'Woman, why do you involve me?' Jesus replied. 'My hour has not yet come.'\n\nHis mother said to the servants, 'Do whatever He tells you.'\n\nNearby stood six stone water jars, the kind used by the Jews for ceremonial washing, each holding from twenty to thirty gallons. Jesus said to the servants, 'Fill the jars with water.' So they filled them to the brim.\n\nThen He told them, 'Now draw some out and take it to the master of the banquet.' They did so.\n\nThe master of the banquet tasted the water that had been turned into wine. He did not realize where it had come from, though the servants who had drawn the water knew. Then he called the bridegroom aside and said, 'Everyone brings out the choice wine first and then the cheaper wine after the guests have had too much to drink; but you have saved the best till now.'\n\nWhat Jesus did here in Cana of Galilee was the first of the signs through which He revealed His glory; and His disciples believed in Him.\n\nIn turning water to wine, Jesus was doing more than solving a social problem. He was revealing who He was. The water in those ceremonial jars—water used for Jewish purification rituals—became wine of the finest quality. The old was being transformed into the new. The Creator of all things was at work, and those with eyes to see could glimpse His glory.",
      "kids_title": "Jesus Makes the Best Drink Ever",
      "kids_description": "At a wedding party, they ran out of drinks for the guests. Jesus turned plain water into the most delicious drink anyone had ever tasted!",
      "kids_narrative": "Jesus and His friends went to a wedding party. Jesus' mom Mary was there too. Weddings back then were big celebrations that lasted for days!\n\nBut uh oh—there was a problem. The wedding ran out of drinks for all the guests! This was very embarrassing for the bride and groom's family.\n\nMary came to Jesus. 'They have no more wine,' she said.\n\nJesus said, 'My time hasn't come yet.'\n\nBut Mary told the servants, 'Do whatever Jesus tells you to do.'\n\nJesus saw six big stone jars sitting nearby. They were HUGE—each one could hold lots and lots of water.\n\n'Fill those jars with water,' Jesus said.\n\nThe servants filled the jars all the way to the very top.\n\n'Now pour some out and take it to the man in charge of the party,' Jesus said.\n\nThe servants did what Jesus said. When the man in charge tasted it, his eyes got big! It wasn't water anymore—it was the BEST drink he had ever tasted!\n\nHe called over the groom. 'Most people serve the best drinks first,' he said. 'But you saved the BEST for last! This is amazing!'\n\nThe servants knew what had happened. Jesus had turned plain water into the most delicious drink ever!\n\nThis was the first miracle Jesus ever did. When His friends saw it, they knew Jesus was really special. They believed in Him even more.\n\nJesus can take something ordinary and make it extraordinary!"
    }
  ]
}
