{
  "category": "Parables of Jesus",
  "slug": "parables-of-jesus",
  "description": "Jesus' powerful teaching stories that reveal deep truths about God's kingdom, using everyday situations to illuminate spiritual realities.",
  "stories": [
    {
      "title": "The Good Samaritan",
      "slug": "the-good-samaritan",
      "description": "When asked 'Who is my neighbor?' Jesus tells of a despised Samaritan who shows mercy to a wounded traveler ignored by religious leaders.",
      "verses": ["Luke 10:25-37"],
      "themes": ["Love your neighbor", "Mercy", "Compassion", "Breaking barriers"],
      "characters": ["Jesus", "Lawyer", "Samaritan", "Wounded man", "Priest", "Levite"],
      "narrative": "On one occasion an expert in the law stood up to test Jesus. 'Teacher,' he asked, 'what must I do to inherit eternal life?'\n\n'What is written in the Law?' Jesus replied. 'How do you read it?'\n\nHe answered, 'Love the Lord your God with all your heart and with all your soul and with all your strength and with all your mind; and, Love your neighbor as yourself.'\n\n'You have answered correctly,' Jesus replied. 'Do this and you will live.'\n\nBut he wanted to justify himself, so he asked Jesus, 'And who is my neighbor?'\n\nIn reply Jesus said: 'A man was going down from Jerusalem to Jericho, when he was attacked by robbers. They stripped him of his clothes, beat him and went away, leaving him half dead.\n\nA priest happened to be going down the same road, and when he saw the man, he passed by on the other side. So too, a Levite, when he came to the place and saw him, passed by on the other side.\n\nBut a Samaritan, as he traveled, came where the man was; and when he saw him, he took pity on him. He went to him and bandaged his wounds, pouring on oil and wine. Then he put the man on his own donkey, brought him to an inn and took care of him. The next day he took out two denarii and gave them to the innkeeper. \"Look after him,\" he said, \"and when I return, I will reimburse you for any extra expense you may have.\"\n\n'Which of these three do you think was a neighbor to the man who fell into the hands of robbers?'\n\nThe expert in the law replied, 'The one who had mercy on him.'\n\nJesus told him, 'Go and do likewise.'",
      "kids_title": "The Kind Stranger",
      "kids_description": "A man was hurt by robbers. Important religious people walked right past him! But a stranger from a different country stopped to help. Jesus says we should be like that kind stranger.",
      "kids_narrative": "Someone asked Jesus, 'Who is my neighbor?'\n\nJesus told a story to answer:\n\nA man was walking down a road when—BAM! Robbers attacked him! They took everything he had and left him lying on the ground, hurt and bleeding.\n\nA priest came walking down the road. He saw the hurt man. Did he help? NOPE! He crossed to the other side and kept walking.\n\nThen a Levite came—another important religious person. He looked at the hurt man, then walked right past on the other side. No help!\n\nThen came a Samaritan. Now, Jewish people and Samaritan people did NOT like each other. They were kind of like enemies.\n\nBut when the Samaritan saw the hurt man, his heart hurt for him. He stopped! He cleaned the man's wounds and wrapped them up. He put the man on his own donkey and took him to an inn.\n\nThe Samaritan paid for the man to stay at the inn. He told the innkeeper, 'Take care of him. If it costs more, I'll pay you back!'\n\nJesus asked, 'Which one was a good neighbor to the hurt man?'\n\nThe answer was obvious: the Samaritan! The one everyone thought was an enemy!\n\n'Go and do the same,' Jesus said.\n\nYour neighbor isn't just the person who lives next door. Your neighbor is ANYONE who needs help—even someone who's different from you. Be like the Good Samaritan!"
    },
    {
      "title": "The Prodigal Son",
      "slug": "the-prodigal-son",
      "description": "A young man demands his inheritance, wastes it all, and returns home in shame—only to be welcomed back by his loving father with celebration.",
      "verses": ["Luke 15:11-32"],
      "themes": ["God's love", "Repentance", "Forgiveness", "Grace"],
      "characters": ["Jesus", "Father", "Younger son", "Older son"],
      "narrative": "Jesus continued: 'There was a man who had two sons. The younger one said to his father, \"Father, give me my share of the estate.\" So he divided his property between them.\n\nNot long after that, the younger son got together all he had, set off for a distant country and there squandered his wealth in wild living. After he had spent everything, there was a severe famine in that whole country, and he began to be in need. So he went and hired himself out to a citizen of that country, who sent him to his fields to feed pigs. He longed to fill his stomach with the pods that the pigs were eating, but no one gave him anything.\n\nWhen he came to his senses, he said, \"How many of my father's hired servants have food to spare, and here I am starving to death! I will set out and go back to my father and say to him: Father, I have sinned against heaven and against you. I am no longer worthy to be called your son; make me like one of your hired servants.\"\n\nSo he got up and went to his father. But while he was still a long way off, his father saw him and was filled with compassion for him; he ran to his son, threw his arms around him and kissed him.\n\nThe son said to him, \"Father, I have sinned against heaven and against you. I am no longer worthy to be called your son.\"\n\nBut the father said to his servants, \"Quick! Bring the best robe and put it on him. Put a ring on his finger and sandals on his feet. Bring the fattened calf and kill it. Let's have a feast and celebrate. For this son of mine was dead and is alive again; he was lost and is found.\" So they began to celebrate.'",
      "kids_title": "The Son Who Came Home",
      "kids_description": "A son asked for his dad's money, then wasted it all on bad choices. When he came home, expecting to be a servant, his dad RAN to hug him and threw a party! That's how much God loves us!",
      "kids_narrative": "Jesus told a story about a father with two sons.\n\nThe younger son said, 'Dad, I want my share of your money NOW!'\n\nThis was really rude—like saying he wished his dad was dead! But the father gave him the money.\n\nThe young man left home and went far away. He spent ALL his money on parties and silly stuff. Soon it was ALL GONE.\n\nThen a terrible famine came. No food anywhere! The young man was SO hungry. The only job he could find was feeding pigs. He was so hungry he wanted to eat the pig food!\n\nFinally, he thought, 'What am I DOING? My dad's servants have more food than me! I'll go home and say I'm sorry. Maybe Dad will let me be a servant.'\n\nHe started walking home, practicing his apology.\n\nBut while he was still FAR AWAY, his father SAW him coming! The father didn't wait. He RAN down the road! He hugged his son and kissed him!\n\n'Father, I've sinned,' the son started to say. 'I don't deserve to be your son—'\n\nBut the father interrupted. 'Servants! Bring the best robe! Put a ring on his finger and sandals on his feet! Let's have a PARTY! My son was lost, but now he's FOUND!'\n\nThe father didn't care about the money. He just wanted his son back.\n\nThis is how God feels about YOU! No matter how far you've wandered or how badly you've messed up, God is waiting with open arms. When you come back to Him, He celebrates!"
    },
    {
      "title": "The Lost Sheep",
      "slug": "the-lost-sheep",
      "description": "A shepherd leaves ninety-nine sheep to search for one that is lost, and rejoices greatly when he finds it. So heaven rejoices over one sinner who repents.",
      "verses": ["Luke 15:1-7"],
      "themes": ["God seeks the lost", "Every person matters", "Joy in heaven", "Rescue"],
      "characters": ["Jesus", "Shepherd", "Lost sheep"],
      "narrative": "Now the tax collectors and sinners were all gathering around to hear Jesus. But the Pharisees and the teachers of the law muttered, 'This man welcomes sinners and eats with them.'\n\nThen Jesus told them this parable: 'Suppose one of you has a hundred sheep and loses one of them. Doesn't he leave the ninety-nine in the open country and go after the lost sheep until he finds it?\n\nAnd when he finds it, he joyfully puts it on his shoulders and goes home. Then he calls his friends and neighbors together and says, \"Rejoice with me; I have found my lost sheep.\"\n\nI tell you that in the same way there will be more rejoicing in heaven over one sinner who repents than over ninety-nine righteous persons who do not need to repent.'",
      "kids_title": "The Lost Sheep",
      "kids_description": "A shepherd had 100 sheep. When just ONE got lost, he left all the others to go find it! When he found it, he was SO happy! That's how God feels about each one of us.",
      "kids_narrative": "Some religious leaders were complaining about Jesus. 'Why does He hang out with BAD people?'\n\nJesus answered with a story:\n\nImagine you're a shepherd with 100 fluffy sheep. You count them: 1, 2, 3... all the way to 99. Wait—99?! One sheep is MISSING!\n\nWhat would you do? Leave the lost sheep alone? Say, 'Oh well, I still have 99'?\n\nNO WAY! You would leave those 99 sheep and go SEARCHING! Over hills, through valleys, calling out. You wouldn't give up until you found that one lost sheep.\n\nAnd when you finally find it—stuck in some bushes, scared and tired—you wouldn't yell at it. You'd pick it up, put it on your shoulders, and carry it home!\n\nThen you'd call all your friends: 'Come celebrate with me! I found my lost sheep!'\n\nJesus said, 'Heaven is like that! When ONE person turns away from sin and comes to God, all the angels celebrate! There's more joy over that one person than over 99 who didn't wander away.'\n\nYOU matter that much to God! If you feel lost, He's looking for you right now. He won't give up. And when you come back to Him, heaven throws a party!"
    },
    {
      "title": "The Sower",
      "slug": "the-sower",
      "description": "A farmer scatters seed on different types of soil. Jesus explains that the soil represents different responses people have when they hear God's Word.",
      "verses": ["Matthew 13:1-23"],
      "themes": ["Hearing God's Word", "Different responses", "Spiritual growth", "Fruitfulness"],
      "characters": ["Jesus", "Disciples", "Farmer"],
      "narrative": "A farmer went out to sow his seed. As he was scattering the seed, some fell along the path, and the birds came and ate it up. Some fell on rocky places, where it did not have much soil. It sprang up quickly, because the soil was shallow. But when the sun came up, the plants were scorched, and they withered because they had no root. Other seed fell among thorns, which grew up and choked the plants. Still other seed fell on good soil, where it produced a crop—a hundred, sixty or thirty times what was sown.\n\nJesus explained: 'When anyone hears the message about the kingdom and does not understand it, the evil one comes and snatches away what was sown in their heart. This is the seed sown along the path.\n\nThe seed falling on rocky ground refers to someone who hears the word and at once receives it with joy. But since they have no root, they last only a short time. When trouble or persecution comes, they quickly fall away.\n\nThe seed falling among the thorns refers to someone who hears the word, but the worries of this life and the deceitfulness of wealth choke the word, making it unfruitful.\n\nBut the seed falling on good soil refers to someone who hears the word and understands it. This is the one who produces a crop, yielding a hundred, sixty or thirty times what was sown.'",
      "kids_title": "The Farmer and the Seeds",
      "kids_description": "A farmer planted seeds in different kinds of soil. Some seeds couldn't grow, but some grew big and strong! Jesus explained that the seeds are like God's Word, and the soil is like our hearts.",
      "kids_narrative": "Jesus told a story about a farmer planting seeds.\n\nThe farmer walked through his field, throwing seeds everywhere.\n\nSome seeds fell on the HARD PATH. They just sat on top. Then birds came and—GOBBLE, GOBBLE—ate them all up! Those seeds never grew.\n\nSome seeds fell on ROCKY ground. They started to grow super fast! But there wasn't much dirt. When the hot sun came out, the little plants dried up and died. Their roots weren't deep enough.\n\nSome seeds fell where THORNY weeds were growing. The seeds started to grow, but the weeds grew faster. The weeds squeezed out the good plants. No fruit grew.\n\nBut some seeds fell on GOOD, soft soil. These seeds grew and grew and grew! They made TONS of fruit—30, 60, even 100 times more than what was planted!\n\nJesus explained what the story meant:\n\nThe SEEDS are God's Word—the Bible, the good news about Jesus.\n\nThe SOIL is people's hearts—how they respond when they hear about God.\n\nHARD PATH hearts don't understand. Satan snatches the truth away.\n\nROCKY hearts get excited at first, but give up when things get hard.\n\nTHORNY hearts are too worried about money and stuff. God's Word gets choked out.\n\nBut GOOD SOIL hearts hear God's Word, understand it, and let it grow! Their lives produce amazing things for God!\n\nWhat kind of soil is YOUR heart?"
    },
    {
      "title": "The Talents",
      "slug": "the-talents",
      "description": "A master entrusts his servants with talents (money). Two invest and double theirs; one buries his. The faithful servants are rewarded; the fearful one loses everything.",
      "verses": ["Matthew 25:14-30"],
      "themes": ["Using gifts for God", "Faithfulness", "Responsibility", "Accountability"],
      "characters": ["Jesus", "Master", "Three servants"],
      "narrative": "Jesus said, 'A man going on a journey called his servants and entrusted his wealth to them. To one he gave five talents of money, to another two talents, and to another one talent, each according to his ability. Then he went on his journey.\n\nThe man who had received five talents went at once and put his money to work and gained five more. So also, the one with two talents gained two more. But the man who had received one talent went off, dug a hole in the ground and hid his master's money.\n\nAfter a long time the master of those servants returned and settled accounts with them.\n\nThe man who had received five talents brought the other five. \"Master,\" he said, \"you entrusted me with five talents. See, I have gained five more.\" His master replied, \"Well done, good and faithful servant! You have been faithful with a few things; I will put you in charge of many things. Come and share your master's happiness!\"\n\nThe man with two talents also came. \"Master, you entrusted me with two talents; see, I have gained two more.\" His master replied, \"Well done, good and faithful servant!\"\n\nThen the man who had received one talent came. \"Master,\" he said, \"I knew that you are a hard man. So I was afraid and went out and hid your talent in the ground. See, here is what belongs to you.\"\n\nHis master replied, \"You wicked, lazy servant! You should have put my money on deposit with the bankers, so that when I returned I would have received it back with interest. Take the talent from him and give it to the one who has ten talents.\"'",
      "kids_title": "The Three Servants",
      "kids_description": "A rich man gave money to three servants before a trip. Two servants worked hard and doubled the money. One servant buried his in the ground! Guess which ones made the master happy?",
      "kids_narrative": "Jesus told a story about a rich man going on a trip.\n\nBefore leaving, he called three servants. 'Take care of my money while I'm gone.'\n\nTo the first servant, he gave FIVE bags of gold. To the second, TWO bags. To the third, ONE bag. Then he left.\n\nThe first servant got to work! He invested the money, started a business, worked hard. Soon he had TEN bags of gold—double what he started with!\n\nThe second servant did the same thing. He worked hard and turned two bags into FOUR bags!\n\nBut the third servant was scared. 'What if I lose the money?' So he dug a hole and BURIED his bag of gold. There it sat, doing nothing.\n\nFinally, the master came home.\n\nThe first servant said, 'Master! You gave me five bags. Look—I made five MORE!'\n\n'WELL DONE!' said the master. 'You were faithful with a little. Now I'll give you MORE responsibility! Come celebrate with me!'\n\nThe second servant said, 'You gave me two bags. I made two more!'\n\n'WELL DONE! Come celebrate!'\n\nThen the third servant came. 'Master, I was scared. So I buried your gold. Here it is. I didn't lose it!'\n\nThe master was NOT happy. 'You lazy servant! You could have at least put it in the bank to earn interest! Give your gold to the first servant!'\n\nThe lesson? God gives each of us talents—abilities, time, opportunities. He wants us to USE them for Him, not hide them! When we're faithful with what God gives us, He trusts us with even more!"
    },
    {
      "title": "The Pharisee and the Tax Collector",
      "slug": "the-pharisee-and-tax-collector",
      "description": "Two men pray in the temple. The Pharisee boasts about his righteousness; the tax collector humbly begs for mercy. Jesus says the humble man went home justified.",
      "verses": ["Luke 18:9-14"],
      "themes": ["Humility", "Pride", "Prayer", "God's mercy"],
      "characters": ["Jesus", "Pharisee", "Tax collector"],
      "narrative": "To some who were confident of their own righteousness and looked down on everyone else, Jesus told this parable:\n\n'Two men went up to the temple to pray, one a Pharisee and the other a tax collector.\n\nThe Pharisee stood by himself and prayed: \"God, I thank you that I am not like other people—robbers, evildoers, adulterers—or even like this tax collector. I fast twice a week and give a tenth of all I get.\"\n\nBut the tax collector stood at a distance. He would not even look up to heaven, but beat his breast and said, \"God, have mercy on me, a sinner.\"\n\nI tell you that this man, rather than the other, went home justified before God. For all those who exalt themselves will be humbled, and those who humble themselves will be exalted.'",
      "kids_title": "Two Men Pray",
      "kids_description": "Two men went to pray. One bragged about how good he was. The other just said, 'God, please forgive me!' Jesus said the humble one was right with God—not the proud one!",
      "kids_narrative": "Some people thought they were better than everyone else. So Jesus told them this story:\n\nTwo men went to the temple to pray.\n\nThe first man was a Pharisee—a super religious guy. He stood up tall where everyone could see him.\n\n'God, THANK YOU that I'm not like other people! I'm not a cheater or a liar. I'm definitely not like THAT guy over there—that tax collector! I fast twice a week. I give lots of money to the temple. I'm pretty great!'\n\nHe wasn't really praying to God. He was bragging about HIMSELF!\n\nThe second man was a tax collector. In those days, tax collectors were hated because they often cheated people. This man knew he had done wrong things.\n\nHe stood far away. He wouldn't even look up to heaven. He beat his chest sadly and prayed:\n\n'God... have mercy on me. I'm a sinner.'\n\nThat's ALL he said.\n\nJesus asked, 'Which man went home right with God?'\n\nNot the proud Pharisee! The humble tax collector!\n\nThe Pharisee thought he was SO good that he didn't need God's help. The tax collector knew he was a sinner and asked for mercy.\n\nGod doesn't want us to brag about how good we are. He wants us to be humble and admit we need Him. When we ask for God's mercy, He gives it!"
    },
    {
      "title": "The Rich Fool",
      "slug": "the-rich-fool",
      "description": "A rich man's land produces a huge harvest. He plans to build bigger barns and enjoy his wealth—but God tells him his life will end that very night.",
      "verses": ["Luke 12:13-21"],
      "themes": ["Greed", "True riches", "Life is short", "Trusting God"],
      "characters": ["Jesus", "Rich man", "God"],
      "narrative": "Someone in the crowd said to Jesus, 'Teacher, tell my brother to divide the inheritance with me.'\n\nJesus replied, 'Man, who appointed me a judge or an arbiter between you?' Then he said to them, 'Watch out! Be on your guard against all kinds of greed; life does not consist in an abundance of possessions.'\n\nAnd he told them this parable: 'The ground of a certain rich man yielded an abundant harvest. He thought to himself, \"What shall I do? I have no place to store my crops.\"\n\nThen he said, \"This is what I'll do. I will tear down my barns and build bigger ones, and there I will store my surplus grain. And I'll say to myself, 'You have plenty of grain laid up for many years. Take life easy; eat, drink and be merry.'\"\n\nBut God said to him, \"You fool! This very night your life will be demanded from you. Then who will get what you have prepared for yourself?\"\n\nThis is how it will be with whoever stores up things for themselves but is not rich toward God.'",
      "kids_title": "The Foolish Rich Man",
      "kids_description": "A rich farmer had SO much stuff that he needed bigger barns! He thought he could relax forever. But God said, 'Tonight you're going to die. Then whose stuff will it be?'",
      "kids_narrative": "Jesus warned people about being greedy. He told this story:\n\nA rich farmer had a HUGE harvest! His barns were overflowing with grain. He had a problem—a good problem, he thought.\n\n'What am I going to do with all this stuff?' he wondered.\n\n'I know! I'll tear down my barns and build BIGGER ones! Then I'll store ALL my grain and everything I own. And I'll say to myself: \"You've got it made! You have enough stuff to last for YEARS! Time to relax! Eat! Drink! Party!\"'\n\nThe rich man thought he had everything figured out. He was going to enjoy his riches for a long, long time.\n\nBut that night, God spoke to him:\n\n'You FOOL! Tonight you're going to DIE. Then who gets all your stuff?'\n\nThe rich man had spent his whole life collecting THINGS. But he forgot about what really matters. He wasn't 'rich toward God'—he never thought about loving God or helping others.\n\nNow his life was over. And ALL those things? They meant NOTHING.\n\nJesus said this is what happens when people care more about stuff than about God.\n\nMoney and things aren't bad. But they can't save us. They don't last forever. Only the things we do for GOD and for OTHERS last forever.\n\nAre you 'rich toward God'?"
    },
    {
      "title": "The Unmerciful Servant",
      "slug": "the-unmerciful-servant",
      "description": "A servant owes his master millions but is forgiven. He then refuses to forgive a fellow servant who owes him a tiny amount. The master punishes his unforgiving heart.",
      "verses": ["Matthew 18:21-35"],
      "themes": ["Forgiveness", "Mercy", "Hypocrisy", "God's forgiveness"],
      "characters": ["Jesus", "King", "Unmerciful servant", "Fellow servant"],
      "narrative": "Then Peter came to Jesus and asked, 'Lord, how many times shall I forgive my brother or sister who sins against me? Up to seven times?'\n\nJesus answered, 'I tell you, not seven times, but seventy-seven times.\n\nTherefore, the kingdom of heaven is like a king who wanted to settle accounts with his servants. As he began the settlement, a man who owed him ten thousand talents was brought to him. Since he was not able to pay, the master ordered that he and his wife and his children and all that he had be sold to repay the debt.\n\nAt this the servant fell on his knees before him. \"Be patient with me,\" he begged, \"and I will pay back everything.\" The servant's master took pity on him, canceled the debt and let him go.\n\nBut when that servant went out, he found one of his fellow servants who owed him a hundred silver coins. He grabbed him and began to choke him. \"Pay back what you owe me!\" he demanded.\n\nHis fellow servant fell to his knees and begged him, \"Be patient with me, and I will pay it back.\" But he refused. Instead, he went off and had the man thrown into prison.\n\nWhen the other servants saw what had happened, they were outraged and went and told their master everything.\n\nThen the master called the servant in. \"You wicked servant,\" he said, \"I canceled all that debt of yours because you begged me to. Shouldn't you have had mercy on your fellow servant just as I had on you?\" In anger his master handed him over to the jailers.\n\nThis is how my heavenly Father will treat each of you unless you forgive your brother or sister from your heart.'",
      "kids_title": "The Servant Who Wouldn't Forgive",
      "kids_description": "A servant owed the king MILLIONS but was forgiven! Then he refused to forgive another servant who owed him just a little bit. The king was NOT happy about that!",
      "kids_narrative": "Peter asked Jesus, 'How many times should I forgive someone? Seven times?'\n\nJesus said, 'Not seven—seventy times seven!' That basically means KEEP FORGIVING!\n\nThen Jesus told a story:\n\nA servant owed the king a HUGE amount of money—millions and millions! There was NO way he could pay it back.\n\nThe king said, 'Sell him and his family as slaves to pay the debt!'\n\nThe servant fell on his knees. 'Please, please! Be patient! I'll pay it all back!'\n\nThe king felt sorry for him. 'You know what? I forgive the WHOLE debt. You don't owe me anything. Go free!'\n\nWOW! The servant was forgiven MILLIONS!\n\nBut then that same servant found another servant who owed HIM a tiny bit of money—like a few dollars compared to millions.\n\nDid he forgive him? NO WAY!\n\nHe grabbed the other servant by the throat. 'PAY ME WHAT YOU OWE!'\n\n'Please, be patient! I'll pay you back!'\n\nBut the first servant had the man thrown in PRISON!\n\nOther servants saw this and told the king. The king was FURIOUS!\n\n'You wicked servant! I forgave you MILLIONS! Couldn't you forgive a tiny debt?!' The king threw him in prison.\n\nJesus said, 'This is what will happen if you don't forgive others from your heart.'\n\nGod has forgiven us SO MUCH. We should forgive others the same way!"
    },
    {
      "title": "The Lost Coin",
      "slug": "the-lost-coin",
      "description": "A woman loses one of her ten silver coins and searches the whole house until she finds it. Heaven rejoices the same way over one sinner who repents.",
      "verses": ["Luke 15:8-10"],
      "themes": ["God seeks the lost", "Value of each person", "Joy in heaven"],
      "characters": ["Jesus", "Woman"],
      "narrative": "Jesus continued: 'Or suppose a woman has ten silver coins and loses one. Doesn't she light a lamp, sweep the house and search carefully until she finds it?\n\nAnd when she finds it, she calls her friends and neighbors together and says, \"Rejoice with me; I have found my lost coin.\"\n\nIn the same way, I tell you, there is rejoicing in the presence of the angels of God over one sinner who repents.'\n\nThis parable is the second in a trilogy about lost things (the lost sheep, lost coin, and lost son). The coin was a drachma, worth about a day's wages—significant for a poor household. Some scholars suggest these ten coins may have been part of her marriage dowry, worn as a headpiece, making the loss both financial and sentimental.\n\nThe woman's response to finding the coin mirrors the shepherd's joy over finding his sheep. She lights a lamp because peasant homes in Palestine had few windows and were dark. She sweeps carefully because the coin could be hidden in the packed dirt floor or among the reeds.\n\nThe point is clear: God actively searches for those who are lost. And when one is found, heaven erupts in celebration. Every person matters infinitely to God.",
      "kids_title": "The Lost Coin",
      "kids_description": "A woman lost one of her ten special coins. She searched everywhere until she found it! God searches for lost people the same way.",
      "kids_narrative": "Right after the Lost Sheep story, Jesus told another one:\n\nImagine a woman who has ten silver coins. They're very special to her—maybe part of her wedding jewelry!\n\nOne day, she counts them: 1, 2, 3... 9. Wait—NINE?! One coin is MISSING!\n\nDoes she say, 'Oh well, I still have nine'? NO WAY!\n\nShe lights a lamp because her house is dark. She gets a broom and sweeps EVERYWHERE. She looks in every corner. She moves everything around.\n\nShe searches and searches and searches...\n\nCLINK! There it is! She found it!\n\nThe woman is SO happy! She calls all her friends and neighbors: 'Come celebrate with me! I found my lost coin!'\n\nJesus said, 'That's what happens in heaven when ONE person who was lost comes back to God. The angels have a big celebration!'\n\nThink about it—the woman had nine other coins. But that one lost coin mattered SO much to her. She wouldn't stop looking until she found it.\n\nThat's how God feels about YOU! Even if millions of people already love Him, YOU matter! If you're feeling lost, God is searching for you right now. He won't give up!\n\nAnd when you come to Him? Party time in heaven!"
    },
    {
      "title": "The Ten Virgins",
      "slug": "the-ten-virgins",
      "description": "Ten virgins wait for the bridegroom with their lamps. Five are wise and bring extra oil; five are foolish and run out. Only the prepared ones enter the wedding feast.",
      "verses": ["Matthew 25:1-13"],
      "themes": ["Be prepared", "Jesus' return", "Wisdom", "Readiness"],
      "characters": ["Jesus", "Ten virgins", "Bridegroom"],
      "narrative": "Jesus said: 'At that time the kingdom of heaven will be like ten virgins who took their lamps and went out to meet the bridegroom. Five of them were foolish and five were wise. The foolish ones took their lamps but did not take any oil with them. The wise ones, however, took oil in jars along with their lamps.\n\nThe bridegroom was a long time in coming, and they all became drowsy and fell asleep.\n\nAt midnight the cry rang out: \"Here's the bridegroom! Come out to meet him!\"\n\nThen all the virgins woke up and trimmed their lamps. The foolish ones said to the wise, \"Give us some of your oil; our lamps are going out.\"\n\n\"No,\" they replied, \"there may not be enough for both us and you. Instead, go to those who sell oil and buy some for yourselves.\"\n\nBut while they were on their way to buy the oil, the bridegroom arrived. The virgins who were ready went in with him to the wedding banquet. And the door was shut.\n\nLater the others also came. \"Lord, Lord,\" they said, \"open the door for us!\"\n\nBut he replied, \"Truly I tell you, I don't know you.\"\n\nTherefore keep watch, because you do not know the day or the hour.'\n\nIn Jewish weddings, the bridegroom would come to claim his bride, often at an unexpected hour. The bridesmaids needed their lamps burning to join the procession. The wise virgins prepared for delay; the foolish assumed the bridegroom would come quickly. When he was delayed, only the prepared were ready.\n\nThe oil cannot be borrowed—each person must have their own relationship with Christ. When He returns, there will be no time to prepare.",
      "kids_title": "The Wise and Foolish Girls",
      "kids_description": "Ten girls waited for a wedding party. Five brought extra oil for their lamps; five didn't. When the groom finally came at midnight, only the prepared ones got to go to the party!",
      "kids_narrative": "Jesus told a story about being ready:\n\nTen young women were waiting for a wedding. In those days, weddings happened at night! They needed lamps to see and to join the celebration.\n\nFive girls were WISE. They brought their lamps AND extra oil, just in case.\n\nFive girls were FOOLISH. They only brought their lamps—no extra oil.\n\nThey waited... and waited... and waited. The groom was taking a LONG time! Soon, all ten girls fell asleep. Zzzzz...\n\nThen at MIDNIGHT: 'THE GROOM IS COMING! Come out to meet him!'\n\nAll ten girls woke up and checked their lamps. Uh oh! The foolish girls' lamps were going out!\n\n'Give us some of your oil!' they begged the wise girls.\n\n'We can't—then we won't have enough either! Go buy some!'\n\nSo the five foolish girls ran off to find oil. But while they were gone... the groom arrived! The five wise girls went into the wedding party. And the door was SHUT.\n\nLater, the foolish girls came back. KNOCK KNOCK! 'Let us in! Let us in!'\n\nBut the groom said, 'I don't know you.' The door stayed closed.\n\nJesus said, 'Be ready! You don't know when I'm coming back.'\n\nJesus is like the bridegroom. One day He'll return! We need to be ready—not just SAYING we follow Him, but really knowing Him and living for Him.\n\nAre you ready?"
    },
    {
      "title": "The Mustard Seed",
      "slug": "the-mustard-seed",
      "description": "The kingdom of heaven is like a tiny mustard seed that grows into a large tree where birds can nest. Great things start small.",
      "verses": ["Matthew 13:31-32", "Mark 4:30-32", "Luke 13:18-19"],
      "themes": ["Kingdom growth", "Small beginnings", "Faith", "God's power"],
      "characters": ["Jesus"],
      "narrative": "Jesus told them another parable: 'The kingdom of heaven is like a mustard seed, which a man took and planted in his field. Though it is the smallest of all seeds, yet when it grows, it is the largest of garden plants and becomes a tree, so that the birds come and perch in its branches.'\n\nThe mustard seed was proverbially the smallest seed known to Jewish farmers of that time. Yet from this tiny beginning, a plant could grow ten to twelve feet tall—large enough for birds to nest in its branches.\n\nJesus was speaking to a small group of followers in an obscure corner of the Roman Empire. The religious establishment rejected Him. The world took no notice. Yet this tiny beginning would grow into something that would reshape human history.\n\nThe parable encourages those who feel their work for God is small and insignificant. A Sunday school teacher faithfully teaching children. A parent modeling faith at home. A believer sharing the gospel with one person. These may seem like mustard seeds—but God grows them into something beyond imagination.\n\nDo not despise the day of small beginnings. The kingdom of God starts tiny but becomes a shelter for many.",
      "kids_title": "The Tiny Seed",
      "kids_description": "Jesus said God's kingdom is like a tiny mustard seed. It starts SO small, but it grows into a HUGE tree! Big things can start small!",
      "kids_narrative": "Jesus told a story about a tiny seed:\n\n'The kingdom of God is like a mustard seed. It's one of the SMALLEST seeds there is. You can barely see it!\n\nBut when you plant it in the ground, it grows and grows and GROWS! It becomes one of the BIGGEST plants in the garden—so big that birds can build nests in its branches!'\n\nWhat was Jesus teaching?\n\nWhen Jesus started His ministry, He just had a few followers. Twelve guys! That's like a tiny seed.\n\nBut look what happened! That tiny group grew and grew. Now there are BILLIONS of Christians all around the world! The small seed became a HUGE tree!\n\nThis parable is also about YOU. Maybe you feel small. Maybe you think you can't do much for God. You're just a kid! What difference can you make?\n\nBut remember the mustard seed! When you do something kind, when you tell someone about Jesus, when you pray—those are like tiny seeds.\n\nGod can take your small act of faith and grow it into something HUGE!\n\nNever think you're too small to matter. God loves using small things to do BIG stuff! Just plant your little seed of faith, and watch what God does!"
    },
    {
      "title": "The Wheat and the Weeds",
      "slug": "the-wheat-and-weeds",
      "description": "An enemy sows weeds among a farmer's wheat. The farmer lets both grow together until harvest, when they will be separated. Good and evil will coexist until judgment day.",
      "verses": ["Matthew 13:24-30", "Matthew 13:36-43"],
      "themes": ["Good and evil", "Patience", "Final judgment", "God's timing"],
      "characters": ["Jesus", "Farmer", "Servants", "Enemy"],
      "narrative": "Jesus told them another parable: 'The kingdom of heaven is like a man who sowed good seed in his field. But while everyone was sleeping, his enemy came and sowed weeds among the wheat, and went away. When the wheat sprouted and formed heads, then the weeds also appeared.\n\nThe owner's servants came to him and said, \"Sir, didn't you sow good seed in your field? Where then did the weeds come from?\"\n\n\"An enemy did this,\" he replied.\n\nThe servants asked him, \"Do you want us to go and pull them up?\"\n\n\"No,\" he answered, \"because while you are pulling the weeds, you may uproot the wheat with them. Let both grow together until the harvest. At that time I will tell the harvesters: First collect the weeds and tie them in bundles to be burned; then gather the wheat and bring it into my barn.\"'\n\nJesus later explained: The one who sows the good seed is the Son of Man. The field is the world. The good seed represents the people of the kingdom. The weeds are the people of the evil one, and the enemy who sows them is the devil. The harvest is the end of the age, and the harvesters are angels.\n\nAs the weeds are pulled up and burned in the fire, so it will be at the end of the age. The Son of Man will send out his angels, and they will weed out of his kingdom everything that causes sin and all who do evil. Then the righteous will shine like the sun in the kingdom of their Father.",
      "kids_title": "The Wheat and the Weeds",
      "kids_description": "An enemy planted weeds in a farmer's wheat field. The farmer said to wait until harvest to separate them. Good and bad people live together now, but one day God will sort everyone out.",
      "kids_narrative": "Jesus told a story about a farmer:\n\nA farmer planted good wheat seeds in his field. But that night, while everyone was sleeping, an ENEMY snuck in and planted WEEDS everywhere! Then he ran away.\n\nWhen the plants started growing, the farmer's helpers noticed something wrong. 'Hey! There are weeds growing with the wheat! Should we pull them out?'\n\nThe farmer shook his head. 'No, don't do that. If you pull up the weeds now, you might accidentally pull up the good wheat too. Let them both grow together. At harvest time, we'll separate them. We'll burn the weeds and keep the wheat.'\n\nJesus explained what the story means:\n\nThe farmer is Jesus. The field is the whole world. The good wheat represents people who love God. The weeds represent people who follow the devil. The enemy who planted the weeds? That's Satan.\n\nRight now, good people and bad people live in the world together. Sometimes we wonder, 'Why doesn't God just get rid of all the bad people?'\n\nBut God is patient. He gives everyone time to turn to Him. And He knows exactly who is wheat and who is weeds—even when WE can't tell!\n\nAt the end of time, Jesus will sort everyone out. The weeds will be thrown away. But the wheat—everyone who loves God—will shine like the sun in God's kingdom!\n\nWhich one are you—wheat or a weed?"
    },
    {
      "title": "The Hidden Treasure and the Pearl",
      "slug": "hidden-treasure-and-pearl",
      "description": "A man finds treasure hidden in a field and joyfully sells everything to buy that field. A merchant finds a perfect pearl and sells everything to own it. The kingdom of heaven is worth everything.",
      "verses": ["Matthew 13:44-46"],
      "themes": ["Value of the kingdom", "Joy", "Sacrifice", "Priorities"],
      "characters": ["Jesus", "Man who found treasure", "Pearl merchant"],
      "narrative": "Jesus said: 'The kingdom of heaven is like treasure hidden in a field. When a man found it, he hid it again, and then in his joy went and sold all he had and bought that field.\n\nAgain, the kingdom of heaven is like a merchant looking for fine pearls. When he found one of great value, he went away and sold everything he had and bought it.'\n\nThese twin parables make the same point from two different angles. The first man stumbles upon treasure unexpectedly—perhaps a day laborer plowing someone else's field. The second man is actively searching—a merchant who knows pearls and recognizes perfection when he sees it.\n\nBoth men respond identically: they sell everything to obtain what they've found. Not reluctantly, not with regret—but with JOY. They know the value of what they've discovered far exceeds everything they're giving up.\n\nThe kingdom of heaven—relationship with God through Christ, forgiveness of sins, eternal life—is worth more than all worldly possessions combined. Those who truly see its value don't view following Jesus as sacrifice but as gain. They've found the treasure.",
      "kids_title": "The Hidden Treasure",
      "kids_description": "A man found buried treasure in a field! He was so happy that he sold everything he owned just to buy that field. Knowing Jesus is worth even more than that!",
      "kids_narrative": "Jesus told two short stories about things that are REALLY valuable:\n\nStory #1: A man was working in a field when—CLUNK!—he hit something. He dug down and found... TREASURE! A chest full of gold and jewels buried in the ground!\n\nHe quickly covered it up again. Then he ran home with a HUGE smile. He sold EVERYTHING he owned—his house, his animals, everything! He used all that money to buy the field.\n\nWhy would he sell everything? Because the treasure in that field was worth WAY more than all his stuff!\n\nStory #2: A merchant spent his whole life searching for perfect pearls. He'd seen lots of nice ones. But one day, he found THE ONE—the most beautiful, perfect pearl EVER.\n\nHe sold everything he had to buy it. And he was SO happy!\n\nWhat's Jesus teaching?\n\nThe treasure and the pearl represent KNOWING GOD. Being part of His kingdom. Having your sins forgiven. Living with Him forever.\n\nThis is worth more than ALL the money in the world! More than video games, more than toys, more than ANYTHING!\n\nWhen people really understand how amazing Jesus is, they're willing to give up everything to follow Him. And they do it with JOY—not sadness—because they know what they're getting is so much better!\n\nHave YOU found the treasure?"
    },
    {
      "title": "The Rich Man and Lazarus",
      "slug": "rich-man-and-lazarus",
      "description": "A rich man lives in luxury while a poor beggar named Lazarus suffers at his gate. Both die, and their positions are reversed for eternity.",
      "verses": ["Luke 16:19-31"],
      "themes": ["Eternity", "Compassion", "Judgment", "Listening to Scripture"],
      "characters": ["Jesus", "Rich man", "Lazarus", "Abraham"],
      "narrative": "Jesus said: 'There was a rich man who was dressed in purple and fine linen and lived in luxury every day. At his gate was laid a beggar named Lazarus, covered with sores and longing to eat what fell from the rich man's table. Even the dogs came and licked his sores.\n\nThe time came when the beggar died and the angels carried him to Abraham's side. The rich man also died and was buried. In Hades, where he was in torment, he looked up and saw Abraham far away, with Lazarus by his side.\n\nSo he called to him, \"Father Abraham, have pity on me and send Lazarus to dip the tip of his finger in water and cool my tongue, because I am in agony in this fire.\"\n\nBut Abraham replied, \"Son, remember that in your lifetime you received your good things, while Lazarus received bad things, but now he is comforted here and you are in agony. And besides all this, between us and you a great chasm has been set in place, so that those who want to go from here to you cannot, nor can anyone cross over from there to us.\"\n\nHe answered, \"Then I beg you, father, send Lazarus to my family, for I have five brothers. Let him warn them, so that they will not also come to this place of torment.\"\n\nAbraham replied, \"They have Moses and the Prophets; let them listen to them.\"\n\n\"No, father Abraham,\" he said, \"but if someone from the dead goes to them, they will repent.\"\n\nHe said to him, \"If they do not listen to Moses and the Prophets, they will not be convinced even if someone rises from the dead.\"'",
      "kids_title": "The Rich Man and Lazarus",
      "kids_description": "A rich man ignored a poor beggar every day. When they both died, everything was reversed—the poor man was comforted, and the rich man suffered. It's a warning about ignoring God and others.",
      "kids_narrative": "Jesus told a serious story:\n\nThere was a VERY rich man. He wore the fanciest clothes and ate the best food every single day. His house was like a palace!\n\nRight outside his gate sat a poor man named Lazarus. Lazarus was sick and hungry. He had sores all over his body. He just wanted to eat the scraps that fell from the rich man's table. But the rich man ignored him every day.\n\nOne day, Lazarus died. Angels carried him to heaven, where he sat right next to Abraham!\n\nThe rich man died too. But he didn't go to heaven. He went to a terrible place of suffering.\n\nFrom far away, the rich man saw Lazarus, happy and comfortable with Abraham. 'Father Abraham!' he called. 'Please send Lazarus to bring me just ONE drop of water! I'm in so much pain!'\n\nBut Abraham said, 'Remember—you had everything good while you were alive. Lazarus had nothing but suffering. Now he's comforted and you're in agony. And there's no way to cross from here to there.'\n\n'Then please send Lazarus to warn my brothers!' the rich man begged. 'So they don't end up here!'\n\n'They have the Bible,' Abraham said. 'They should listen to it.'\n\n'No, but if someone comes back from the dead, THEN they'll believe!'\n\n'If they won't listen to Scripture, they won't believe even if someone rises from the dead.'\n\nThis story warns us: Don't ignore God or ignore people in need. And don't wait until it's too late to listen to God's Word!"
    },
    {
      "title": "The Wise and Foolish Builders",
      "slug": "wise-and-foolish-builders",
      "description": "Two men build houses—one on rock, one on sand. When storms come, only the house on the rock stands. Those who hear and obey Jesus' words are like the wise builder.",
      "verses": ["Matthew 7:24-27", "Luke 6:46-49"],
      "themes": ["Obedience", "Foundation", "Hearing and doing", "Storms of life"],
      "characters": ["Jesus", "Wise builder", "Foolish builder"],
      "narrative": "Jesus concluded His Sermon on the Mount with this parable:\n\n'Therefore everyone who hears these words of mine and puts them into practice is like a wise man who built his house on the rock. The rain came down, the streams rose, and the winds blew and beat against that house; yet it did not fall, because it had its foundation on the rock.\n\nBut everyone who hears these words of mine and does not put them into practice is like a foolish man who built his house on sand. The rain came down, the streams rose, and the winds blew and beat against that house, and it fell with a great crash.'\n\nBoth builders heard Jesus' words. Both built houses. From the outside, the houses may have looked similar. The difference was invisible—until the storm came.\n\nThe wise builder dug deep, laying his foundation on bedrock. This took time and effort. The foolish builder took shortcuts, building on the easy surface of sand. When fair weather continued, both builders seemed equally successful.\n\nBut storms always come. Trials, temptations, crises—no life escapes them. The storm reveals the foundation. The house on rock stands; the house on sand collapses.\n\nJesus makes clear: hearing is not enough. Knowing the right answers is not enough. Only those who hear AND obey—who put His words into practice—have a foundation that will hold.",
      "kids_title": "The Two Builders",
      "kids_description": "One man built his house on solid rock. Another built on sand. When a big storm came, only one house was left standing! It's about building your life on Jesus.",
      "kids_narrative": "Jesus told a story about two builders:\n\nThe WISE builder wanted to build a house. He looked around and found a big, solid ROCK. 'I'll build here!' he said.\n\nHe worked hard digging down to the rock. It took a lot of effort! But finally, his house was built on a strong foundation.\n\nThe FOOLISH builder wanted to build a house too. He found a nice sandy beach. 'This looks easy!' he said. 'I'll build here!'\n\nHe didn't bother digging down. He just built right on top of the soft sand. Quick and easy!\n\nBoth houses looked nice when they were done.\n\nThen one day—WHOOOOSH! A huge storm came! Rain poured down! Wind howled! Floods rose!\n\nThe storm hit the wise man's house. CRASH! BANG! WHOOSH! But the house stood strong. It was built on the rock!\n\nThe storm hit the foolish man's house. CRASH! BANG! WHOOSH! And... BOOM! The whole house fell down! Nothing left but a pile of rubble!\n\nJesus said: 'The wise man is like someone who hears My words and OBEYS them. The foolish man is like someone who hears My words but DOESN'T obey.'\n\nStorms will come in your life—hard times, problems, scary things. What will keep you standing? Building your life on JESUS!\n\nDon't just HEAR what Jesus says—DO it! That's how you build on the rock."
    },
    {
      "title": "The Workers in the Vineyard",
      "slug": "workers-in-the-vineyard",
      "description": "A landowner hires workers throughout the day but pays them all the same wage. Those hired first complain, but the owner reminds them of his generosity.",
      "verses": ["Matthew 20:1-16"],
      "themes": ["Grace", "God's generosity", "Fairness vs. grace", "The last shall be first"],
      "characters": ["Jesus", "Landowner", "Workers"],
      "narrative": "Jesus said: 'For the kingdom of heaven is like a landowner who went out early in the morning to hire workers for his vineyard. He agreed to pay them a denarius for the day and sent them into his vineyard.\n\nAbout nine in the morning he went out and saw others standing in the marketplace doing nothing. He told them, \"You also go and work in my vineyard, and I will pay you whatever is right.\"\n\nHe went out again about noon and about three in the afternoon and did the same thing. About five in the afternoon he went out and found still others standing around. He asked them, \"Why have you been standing here all day long doing nothing?\"\n\n\"Because no one has hired us,\" they answered.\n\nHe said to them, \"You also go and work in my vineyard.\"\n\nWhen evening came, the owner of the vineyard said to his foreman, \"Call the workers and pay them their wages, beginning with the last ones hired and going on to the first.\"\n\nThe workers who were hired about five in the afternoon came and each received a denarius. So when those came who were hired first, they expected to receive more. But each one of them also received a denarius.\n\nWhen they received it, they began to grumble against the landowner. \"These who were hired last worked only one hour,\" they said, \"and you have made them equal to us who have borne the burden of the work and the heat of the day.\"\n\nBut he answered one of them, \"I am not being unfair to you, friend. Didn't you agree to work for a denarius? Take your pay and go. I want to give the one who was hired last the same as I gave you. Don't I have the right to do what I want with my own money? Or are you envious because I am generous?\"\n\nSo the last will be first, and the first will be last.'",
      "kids_title": "The Generous Farmer",
      "kids_description": "A farmer hired workers at different times of day but paid them all the same. Some thought it wasn't fair—but the farmer was being generous, not unfair!",
      "kids_narrative": "Jesus told a story about a farmer who needed help:\n\nEarly in the morning, the farmer went to town. 'Come work in my vineyard!' he said. 'I'll pay you one silver coin.' The workers agreed and went to work.\n\nA few hours later, the farmer found more people standing around. 'You can work too! I'll pay you fairly.' They went to work.\n\nAt noon, he found more workers. In the afternoon, more. Even near the END of the day—almost quitting time!—he found some people. 'Go work in my vineyard,' he said.\n\nWhen the day was done, the farmer paid everyone. He started with the ones who came LAST. He gave them... one silver coin!\n\nThe workers who came FIRST thought, 'Ooh! We worked ALL day! We'll get MORE!'\n\nBut they got... one silver coin too. Same as everyone else!\n\n'Hey! That's not FAIR!' they complained. 'We worked in the hot sun all day! Those guys only worked one hour!'\n\nThe farmer said, 'Friend, I'm not being unfair. Didn't you agree to work for one silver coin? I gave you exactly what we agreed. If I want to be GENEROUS to the others, that's my choice. Are you jealous because I'm kind?'\n\nThis story is about God's grace. Some people follow Jesus their whole lives. Some come to Him at the very end. But God gives the same gift to everyone: eternal life!\n\nWe shouldn't complain when God is generous to others. We should be thankful for His kindness to US!"
    },
    {
      "title": "The Great Banquet",
      "slug": "the-great-banquet",
      "description": "A man prepares a great feast, but the invited guests all make excuses. So he sends servants to bring in the poor, the crippled, the blind, and the lame.",
      "verses": ["Luke 14:15-24"],
      "themes": ["Invitation", "Excuses", "God's grace to all", "Rejection"],
      "characters": ["Jesus", "Host", "Servant", "Invited guests", "Poor and outcast"],
      "narrative": "When one of those at the table with Jesus said, 'Blessed is the one who will eat at the feast in the kingdom of God,' Jesus replied:\n\n'A certain man was preparing a great banquet and invited many guests. At the time of the banquet he sent his servant to tell those who had been invited, \"Come, for everything is now ready.\"\n\nBut they all alike began to make excuses. The first said, \"I have just bought a field, and I must go and see it. Please excuse me.\"\n\nAnother said, \"I have just bought five yoke of oxen, and I'm on my way to try them out. Please excuse me.\"\n\nStill another said, \"I just got married, so I can't come.\"\n\nThe servant came back and reported this to his master. Then the owner of the house became angry and ordered his servant, \"Go out quickly into the streets and alleys of the town and bring in the poor, the crippled, the blind and the lame.\"\n\n\"Sir,\" the servant said, \"what you ordered has been done, but there is still room.\"\n\nThen the master told his servant, \"Go out to the roads and country lanes and compel them to come in, so that my house will be full. I tell you, not one of those who were invited will get a taste of my banquet.\"'\n\nThe original guests represent those who should have recognized and welcomed Jesus—Israel's religious leaders. But they made excuses, prioritizing possessions and relationships over the invitation. So the invitation went to those the religious deemed unworthy: the poor, disabled, and outcasts.\n\nGod's banquet will be full—but those who reject His invitation will miss it.",
      "kids_title": "The Big Party",
      "kids_description": "A man planned an amazing party and invited lots of people. But they all made excuses! So he invited everyone else—and his house was full!",
      "kids_narrative": "Jesus told a story about a man who threw a HUGE party:\n\nThe man worked hard to prepare everything. The food was ready! The decorations were up! He sent his servant to tell all the invited guests: 'Come on! The party is starting!'\n\nBut something weird happened. EVERYONE made excuses!\n\n'Sorry, I just bought some land. I need to go look at it.' (Really? Right now?)\n\n'Sorry, I just bought some oxen. I need to test them.' (Can't that wait?)\n\n'Sorry, I just got married.' (Bring your wife to the party!)\n\nThe man was hurt and angry. He'd worked SO hard, and nobody wanted to come!\n\n'Fine!' he told his servant. 'Go into the streets. Find the poor people, the disabled people, the blind, the lame—bring them ALL!'\n\nThe servant did. But there was STILL room!\n\n'Go even farther!' the man said. 'Go to the highways and country roads. MAKE people come! I want my house FULL!'\n\nAnd it was! The party was amazing—full of grateful people who never expected to be invited.\n\nJesus was teaching: God invites everyone to His kingdom! But some people are too busy with other stuff. They make excuses.\n\nSo God invites EVERYONE else—people the world looks down on. His kingdom WILL be full!\n\nDon't be like those excuse-makers. When God invites you, say YES!"
    },
    {
      "title": "The Persistent Widow",
      "slug": "the-persistent-widow",
      "description": "A widow keeps asking an unjust judge for justice until he grants her request just to get rid of her. How much more will God answer those who cry out to Him!",
      "verses": ["Luke 18:1-8"],
      "themes": ["Persistent prayer", "God answers", "Faith", "Justice"],
      "characters": ["Jesus", "Widow", "Unjust judge"],
      "narrative": "Then Jesus told his disciples a parable to show them that they should always pray and not give up.\n\nHe said: 'In a certain town there was a judge who neither feared God nor cared what people thought. And there was a widow in that town who kept coming to him with the plea, \"Grant me justice against my adversary.\"\n\nFor some time he refused. But finally he said to himself, \"Even though I don't fear God or care what people think, yet because this widow keeps bothering me, I will see that she gets justice, so that she won't eventually come and attack me!\"\n\nAnd the Lord said, \"Listen to what the unjust judge says. And will not God bring about justice for his chosen ones, who cry out to him day and night? Will he keep putting them off? I tell you, he will see that they get justice, and quickly.\n\nHowever, when the Son of Man comes, will he find faith on the earth?\"'\n\nThe parable works by contrast, not comparison. If even an unjust, uncaring judge will eventually respond to persistent pleading, how much MORE will a loving, just God respond to His children?\n\nThe widow had no power, no influence, no husband to advocate for her. All she had was persistence. She kept coming. She refused to give up. And she got what she asked for.\n\nJesus' question at the end is haunting: 'When the Son of Man comes, will he find faith on the earth?' Will He find people still praying, still trusting, still persisting?",
      "kids_title": "The Woman Who Wouldn't Give Up",
      "kids_description": "A widow kept asking a mean judge for help. She asked and asked until he finally helped her! Jesus says we should keep praying and never give up.",
      "kids_narrative": "Jesus told a story to teach us to keep praying and never give up:\n\nThere was a judge in a certain town. He was NOT a nice man. He didn't care about God, and he didn't care about people. He was selfish and mean.\n\nA widow lived in that town. Someone had treated her unfairly, and she needed the judge to help her. 'Please give me justice!' she asked.\n\nDid the judge help her? NOPE. He ignored her.\n\nBut the widow didn't give up!\n\nThe next day: 'Please give me justice!'\n\nThe judge ignored her.\n\nThe next day: 'Please give me justice!'\n\nIgnored again.\n\nDay after day after day, the widow came back. She kept asking. She REFUSED to give up!\n\nFinally, the judge thought, 'I don't care about this woman, but she's driving me CRAZY! If I don't help her, she'll keep coming forever!'\n\nSo he gave her what she asked for—just to get rid of her!\n\nJesus said, 'Did you hear that? Even a MEAN judge finally helped because she kept asking. Think about GOD! He's not mean—He LOVES you! If you keep praying, won't He answer you? He definitely will!'\n\nThen Jesus asked a serious question: 'But when I come back, will I find people who still have faith? Will I find people still praying?'\n\nThe lesson: Don't give up! Keep praying! God hears every prayer, and He WILL answer!"
    },
    {
      "title": "The Sheep and the Goats",
      "slug": "the-sheep-and-goats",
      "description": "At the final judgment, the King separates people like a shepherd separates sheep from goats. How we treat 'the least of these' reveals our true heart.",
      "verses": ["Matthew 25:31-46"],
      "themes": ["Final judgment", "Serving others", "True faith", "Eternal destiny"],
      "characters": ["Jesus", "The King", "Sheep", "Goats", "The least of these"],
      "narrative": "Jesus said: 'When the Son of Man comes in his glory, and all the angels with him, he will sit on his glorious throne. All the nations will be gathered before him, and he will separate the people one from another as a shepherd separates the sheep from the goats. He will put the sheep on his right and the goats on his left.\n\nThen the King will say to those on his right, \"Come, you who are blessed by my Father; take your inheritance, the kingdom prepared for you since the creation of the world. For I was hungry and you gave me something to eat, I was thirsty and you gave me something to drink, I was a stranger and you invited me in, I needed clothes and you clothed me, I was sick and you looked after me, I was in prison and you came to visit me.\"\n\nThen the righteous will answer him, \"Lord, when did we see you hungry and feed you, or thirsty and give you something to drink? When did we see you a stranger and invite you in, or needing clothes and clothe you? When did we see you sick or in prison and go to visit you?\"\n\nThe King will reply, \"Truly I tell you, whatever you did for one of the least of these brothers and sisters of mine, you did for me.\"\n\nThen he will say to those on his left, \"Depart from me, you who are cursed, into the eternal fire prepared for the devil and his angels. For I was hungry and you gave me nothing to eat...\" whatever you did not do for one of the least of these, you did not do for me.\"\n\nThen they will go away to eternal punishment, but the righteous to eternal life.'",
      "kids_title": "The Sheep and the Goats",
      "kids_description": "One day Jesus will separate everyone—like a shepherd separates sheep from goats. How we treat hungry, sick, and lonely people shows what's really in our hearts.",
      "kids_narrative": "Jesus told a story about the day He will judge everyone:\n\nWhen Jesus comes back in all His glory, every person who ever lived will stand before Him. He'll separate them into two groups—like a shepherd separates sheep from goats.\n\nTo the SHEEP on His right, Jesus will say: 'Come! You're blessed! Enter the kingdom My Father prepared for you. Because when I was hungry, you fed Me. When I was thirsty, you gave Me water. When I was a stranger, you welcomed Me. When I needed clothes, you gave Me some. When I was sick or in prison, you visited Me.'\n\nThe sheep will be confused. 'Lord, when did we ever do those things for YOU?'\n\nJesus will answer: 'Whenever you helped the least important person, you were helping ME.'\n\nThen to the GOATS on His left, Jesus will say: 'Go away. When I was hungry, you didn't feed Me. When I was thirsty, you gave Me nothing. When I was a stranger, you ignored Me. When I was sick or in prison, you didn't visit.'\n\nThe goats will say, 'Lord, when did we see You and not help?'\n\nJesus will answer: 'Whenever you DIDN'T help the least important person, you were ignoring ME.'\n\nThis is serious! Jesus says how we treat other people—especially poor, sick, lonely people—shows what's in our hearts.\n\nWhen you help someone in need, you're serving JESUS. When you ignore them, you're ignoring Him."
    }
  ]
}
