{
  "category": "Death & Resurrection",
  "slug": "death-and-resurrection",
  "description": "The climax of redemption—Jesus' final week, His sacrificial death on the cross, and His glorious resurrection that conquered sin and death forever.",
  "stories": [
    {
      "title": "The Triumphal Entry",
      "slug": "triumphal-entry",
      "description": "Jesus enters Jerusalem riding on a donkey as crowds wave palm branches and shout 'Hosanna!' fulfilling the prophecy of Zechariah.",
      "verses": ["Matthew 21:1-11", "Zechariah 9:9"],
      "themes": ["Jesus as King", "Prophecy fulfilled", "Praise"],
      "characters": ["Jesus", "Disciples", "Crowds"],
      "narrative": "As they approached Jerusalem and came to Bethphage on the Mount of Olives, Jesus sent two disciples, saying to them, 'Go to the village ahead of you, and at once you will find a donkey tied there, with her colt by her. Untie them and bring them to me. If anyone says anything to you, say that the Lord needs them, and he will send them right away.'\n\nThis took place to fulfill what was spoken through the prophet: 'Say to Daughter Zion, \"See, your king comes to you, gentle and riding on a donkey, and on a colt, the foal of a donkey.\"'\n\nThe disciples went and did as Jesus had instructed them. They brought the donkey and the colt and placed their cloaks on them for Jesus to sit on.\n\nA very large crowd spread their cloaks on the road, while others cut branches from the trees and spread them on the road. The crowds that went ahead of him and those that followed shouted, 'Hosanna to the Son of David! Blessed is he who comes in the name of the Lord! Hosanna in the highest heaven!'\n\nWhen Jesus entered Jerusalem, the whole city was stirred and asked, 'Who is this?'\n\nThe crowds answered, 'This is Jesus, the prophet from Nazareth in Galilee.'",
      "kids_title": "Jesus Rides into Jerusalem",
      "kids_description": "Jesus rode into Jerusalem on a donkey while crowds cheered and waved palm branches! They shouted 'Hosanna!' and treated Him like a king!",
      "kids_narrative": "It was almost time for the special Passover holiday. Jesus and His friends were walking toward Jerusalem.\n\nJesus told two disciples, 'Go into that village. You'll find a donkey tied up with her baby. Bring them to me.'\n\nThey did exactly what Jesus said. They put their coats on the donkey for Jesus to sit on.\n\nThen something AMAZING happened! As Jesus rode toward Jerusalem, HUGE crowds came out!\n\nPeople spread their coats on the road like a carpet. Others cut branches from palm trees and waved them in the air!\n\n'HOSANNA!' they shouted. 'Blessed is the King who comes in God's name! HOSANNA in the highest!'\n\nIt was like a parade! Everyone was cheering for Jesus!\n\nWhen Jesus entered the city, everyone was asking, 'Who IS this?'\n\n'It's JESUS!' the crowds said. 'The prophet from Nazareth!'\n\nHundreds of years before, a prophet named Zechariah had written that the King would come riding on a donkey. And here was Jesus, doing exactly that!\n\nThe people wanted Jesus to be their king. They didn't know that Jesus WAS a king—but not the kind they expected. He came to save people from sin, not from the Romans.\n\nWe celebrate this day as Palm Sunday—the day Jesus entered Jerusalem as King!"
    },
    {
      "title": "The Last Supper",
      "slug": "the-last-supper",
      "description": "On the night before His death, Jesus shares a final Passover meal with His disciples, washing their feet and instituting the Lord's Supper.",
      "verses": ["John 13:1-17", "Luke 22:14-20"],
      "themes": ["Servant leadership", "Remembrance", "New covenant", "Love"],
      "characters": ["Jesus", "The Twelve Disciples", "Peter", "Judas"],
      "narrative": "It was just before the Passover Festival. Jesus knew that the hour had come for him to leave this world and go to the Father. Having loved his own who were in the world, he loved them to the end.\n\nJesus got up from the meal, took off his outer clothing, and wrapped a towel around his waist. After that, he poured water into a basin and began to wash his disciples' feet, drying them with the towel.\n\nHe came to Simon Peter, who said to him, 'Lord, are you going to wash my feet?'\n\nJesus replied, 'You do not realize now what I am doing, but later you will understand.'\n\n'No,' said Peter, 'you shall never wash my feet.'\n\nJesus answered, 'Unless I wash you, you have no part with me.'\n\nWhen he had finished washing their feet, he said, 'Do you understand what I have done for you? You call me \"Teacher\" and \"Lord,\" and rightly so, for that is what I am. Now that I, your Lord and Teacher, have washed your feet, you also should wash one another's feet. I have set you an example that you should do as I have done for you.'\n\nThen Jesus took bread, gave thanks and broke it, and gave it to them, saying, 'This is my body given for you; do this in remembrance of me.'\n\nIn the same way, after the supper he took the cup, saying, 'This cup is the new covenant in my blood, which is poured out for you.'",
      "kids_title": "Jesus' Last Meal with His Friends",
      "kids_description": "Jesus had one last dinner with His disciples before He died. He surprised them by washing their dirty feet! Then He gave them bread and wine to help them remember Him.",
      "kids_narrative": "Jesus knew something the disciples didn't know. He knew He would soon die. This would be His last meal with His friends.\n\nThey were eating the Passover dinner together. But then Jesus did something VERY surprising.\n\nHe got up from the table, took off His outer robe, and wrapped a towel around His waist. He poured water in a bowl and started washing the disciples' FEET!\n\nIn those days, people wore sandals on dusty, dirty roads. Washing feet was a gross job—usually done by servants! But here was JESUS, the Son of God, doing it!\n\nPeter said, 'No way, Lord! You can't wash MY feet!'\n\nJesus said, 'If I don't wash you, you can't be part of what I'm doing.'\n\n'Then wash my hands and head too!' Peter said.\n\nWhen Jesus finished, He explained: 'I'm your Teacher and Lord, and I washed your feet. You should serve each other the same way. I'm showing you how to be humble and loving.'\n\nThen Jesus picked up some bread. He thanked God, broke it, and gave pieces to everyone.\n\n'This bread is like My body, which will be broken for you. Whenever you eat it, remember Me.'\n\nThen He took a cup of wine. 'This cup represents My blood, which will be poured out for you. It starts a new promise between God and His people.'\n\nThis is why Christians take communion today—to remember what Jesus did for us!"
    },
    {
      "title": "The Garden of Gethsemane",
      "slug": "garden-of-gethsemane",
      "description": "Jesus prays in agony in the garden while His disciples sleep. He surrenders to the Father's will, and Judas arrives with soldiers to arrest Him.",
      "verses": ["Matthew 26:36-56", "Luke 22:39-46"],
      "themes": ["Prayer", "Submission to God", "Betrayal", "Human struggle"],
      "characters": ["Jesus", "Peter", "James", "John", "Judas"],
      "narrative": "Then Jesus went with his disciples to a place called Gethsemane, and he said to them, 'Sit here while I go over there and pray.' He took Peter and the two sons of Zebedee along with him, and he began to be sorrowful and troubled.\n\nThen he said to them, 'My soul is overwhelmed with sorrow to the point of death. Stay here and keep watch with me.'\n\nGoing a little farther, he fell with his face to the ground and prayed, 'My Father, if it is possible, may this cup be taken from me. Yet not as I will, but as you will.'\n\nThen he returned to his disciples and found them sleeping. 'Couldn't you men keep watch with me for one hour?' he asked Peter. 'Watch and pray so that you will not fall into temptation. The spirit is willing, but the flesh is weak.'\n\nHe went away a second time and prayed, 'My Father, if it is not possible for this cup to be taken away unless I drink it, may your will be done.'\n\nAn angel from heaven appeared to him and strengthened him. And being in anguish, he prayed more earnestly, and his sweat was like drops of blood falling to the ground.\n\nWhile he was still speaking, Judas, one of the Twelve, arrived. With him was a large crowd armed with swords and clubs. The betrayer had arranged a signal: 'The one I kiss is the man; arrest him.'\n\nGoing at once to Jesus, Judas said, 'Greetings, Rabbi!' and kissed him.\n\n'Do what you came for, friend,' Jesus replied.\n\nThen the men seized Jesus and arrested him.",
      "kids_title": "Jesus Prays in the Garden",
      "kids_description": "Jesus knew He was about to die, and He was very sad. He prayed in a garden while His friends fell asleep. Then Judas came with soldiers to arrest Him.",
      "kids_narrative": "After dinner, Jesus and His disciples went to a garden called Gethsemane. It was nighttime. Jesus felt very, very sad.\n\n'Stay here,' Jesus told most of the disciples. He took Peter, James, and John a little farther.\n\n'My heart is breaking,' Jesus told them. 'Please stay awake and pray with Me.'\n\nJesus walked ahead and fell on His face to pray. He knew what was coming—He was going to die a terrible death on a cross.\n\n'Father,' Jesus prayed, 'if there's any other way, please take this away from Me. But... not what I want. What YOU want.'\n\nJesus was so stressed that His sweat fell like drops of blood. An angel came from heaven to give Him strength.\n\nJesus went back to check on His friends. They were ASLEEP!\n\n'Couldn't you stay awake just ONE hour?' Jesus asked Peter sadly.\n\nJesus prayed two more times. Each time, He found His friends sleeping. They were so tired and sad.\n\nFinally, Jesus said, 'Get up. The one who's betraying Me is here.'\n\nJust then, Judas walked up—with a crowd of soldiers carrying swords and torches!\n\nJudas kissed Jesus on the cheek. That was the signal he'd arranged to show the soldiers which man was Jesus.\n\n'Friend,' Jesus said sadly, 'do what you came to do.'\n\nThe soldiers grabbed Jesus and arrested Him.\n\nEven though Jesus was scared, He trusted His Father. He chose to obey, even when it was the hardest thing ever."
    },
    {
      "title": "Peter Denies Jesus",
      "slug": "peter-denies-jesus",
      "description": "While Jesus is on trial, Peter denies knowing Him three times, just as Jesus predicted. When the rooster crows, Peter remembers and weeps bitterly.",
      "verses": ["Luke 22:54-62", "Matthew 26:69-75"],
      "themes": ["Human weakness", "Fear", "Repentance", "Jesus knows us"],
      "characters": ["Peter", "Jesus", "Servants"],
      "narrative": "Then seizing Jesus, they led him away and took him into the house of the high priest. Peter followed at a distance. And when some there had kindled a fire in the middle of the courtyard and had sat down together, Peter sat down with them.\n\nA servant girl saw him seated there in the firelight. She looked closely at him and said, 'This man was with him.'\n\nBut Peter denied it. 'Woman, I don't know him,' he said.\n\nA little later someone else saw him and said, 'You also are one of them.'\n\n'Man, I am not!' Peter replied.\n\nAbout an hour later another asserted, 'Certainly this fellow was with him, for he is a Galilean.'\n\nPeter replied, 'Man, I don't know what you're talking about!'\n\nJust as he was speaking, the rooster crowed. The Lord turned and looked straight at Peter. Then Peter remembered the word the Lord had spoken to him: 'Before the rooster crows today, you will disown me three times.'\n\nAnd he went outside and wept bitterly.\n\nPeter, who had sworn he would die for Jesus, had denied even knowing Him. Yet this was not the end of Peter's story. The risen Christ would restore him, asking three times, 'Do you love me?' and commissioning him to feed His sheep.",
      "kids_title": "Peter Says He Doesn't Know Jesus",
      "kids_description": "Peter promised he would never leave Jesus. But when Jesus was arrested, Peter got scared. Three times he said, 'I don't know Him!' Then he cried and cried.",
      "kids_narrative": "Earlier that night, Peter had said, 'Jesus, I'll NEVER leave You! I'd even DIE for You!'\n\nJesus looked at Peter sadly. 'Peter, before the rooster crows tomorrow morning, you'll say three times that you don't even know Me.'\n\n'No way!' Peter said. 'NEVER!'\n\nBut now Jesus was arrested. Soldiers took Him to the high priest's house. Peter followed, but he stayed far back. He was scared.\n\nPeter sat by a fire in the courtyard, trying to blend in.\n\nA servant girl stared at him. 'Hey! You were with Jesus!'\n\nPeter's heart pounded. 'No I wasn't! I don't know Him!'\n\nLater, someone else said, 'You're one of His followers!'\n\n'No I'm NOT!' Peter said.\n\nAbout an hour passed. Then another person said, 'You MUST be with Jesus! I can tell by your accent!'\n\nPeter got really upset. 'I DON'T KNOW WHAT YOU'RE TALKING ABOUT!'\n\nRight then—COCK-A-DOODLE-DOO! A rooster crowed.\n\nJesus turned and looked right at Peter.\n\nSuddenly Peter remembered Jesus' words. 'Before the rooster crows, you'll deny Me three times.'\n\nThree times. Peter had done it. He had said he didn't know Jesus—THREE TIMES.\n\nPeter ran outside and cried and cried. He felt SO bad!\n\nBut this isn't the end of Peter's story. After Jesus rose from the dead, He forgave Peter and gave him an important job. Jesus knew Peter would fail, but He loved him anyway.\n\nJesus loves us even when we mess up too."
    },
    {
      "title": "The Trial of Jesus",
      "slug": "the-trial-of-jesus",
      "description": "Jesus stands trial before the Jewish Sanhedrin and the Roman governor Pilate, is falsely accused, mocked, and condemned to death despite Pilate finding no fault in Him, while Barabbas the criminal is released.",
      "verses": ["Matthew 26:57-68", "Matthew 27:11-26"],
      "themes": ["Injustice", "Christ's Suffering", "Fulfillment of Prophecy", "Substitutionary Death", "Human Sinfulness"],
      "characters": ["Jesus", "Caiaphas", "The Sanhedrin", "Pontius Pilate", "Barabbas", "The Crowd"],
      "narrative": "After His arrest in the Garden of Gethsemane, Jesus was led away to Caiaphas the high priest, where the scribes and elders were assembled. The religious leaders sought false witness against Jesus to put Him to death, but found none. Though many false witnesses came, their testimonies did not agree. The high priest demanded, 'Tell us whether thou be the Christ, the Son of God.' Jesus answered, 'Thou hast said: nevertheless I say unto you, Hereafter shall ye see the Son of man sitting on the right hand of power, and coming in the clouds of heaven.' The high priest rent his clothes, crying, 'He hath spoken blasphemy!' They answered, 'He is guilty of death.' Then they spat in His face and buffeted Him.\n\nSince the Jewish council lacked authority to execute, they brought Jesus before Pontius Pilate. Pilate asked Him, 'Art thou the King of the Jews?' Jesus replied, 'Thou sayest.' When the chief priests accused Him, Jesus answered nothing, causing Pilate to marvel. Now at the feast, the governor was accustomed to release one prisoner. They had a notable prisoner called Barabbas, a robber and murderer. Pilate asked, 'Whom will ye that I release unto you? Barabbas, or Jesus which is called Christ?' The chief priests persuaded the multitude to ask for Barabbas. Pilate asked, 'What shall I do then with Jesus which is called Christ?' They all said, 'Let him be crucified.' Pilate asked, 'Why, what evil hath he done?' But they cried out the more, 'Let him be crucified.' Pilate took water and washed his hands before the multitude, saying, 'I am innocent of the blood of this just person.' He released Barabbas and delivered Jesus to be crucified. Thus the innocent Son of God was condemned in place of a guilty criminal.",
      "kids_title": "Jesus on Trial",
      "kids_description": "Jesus is arrested and brought before religious leaders and the Roman governor Pilate. Even though He did nothing wrong, the people choose to free a criminal instead and demand that Jesus be crucified.",
      "kids_narrative": "After Jesus was arrested in the garden, the soldiers took Him to the house of the high priest, a religious leader named Caiaphas. All the important religious leaders were there. They wanted to find something bad Jesus had done so they could punish Him. But there was a problem—Jesus hadn't done anything wrong! They brought in people who told lies about Jesus, but the lies didn't match. Finally, the high priest asked Jesus directly: 'Are You the Christ, the Son of God?' Jesus answered, 'Yes, I am. And one day you will see the Son of Man sitting at the right hand of God.' The high priest tore his clothes and shouted, 'He says He's God! He deserves to die!' Then they spit on Jesus and hit Him.\n\nBut these religious leaders couldn't execute anyone—only the Romans could do that. So they took Jesus to Pontius Pilate, the Roman governor. Pilate asked Jesus, 'Are You the King of the Jews?' Jesus said, 'You have said so.' Pilate could tell that the religious leaders were just jealous of Jesus. He knew Jesus hadn't done anything wrong. Every year at Passover, Pilate would release one prisoner that the people chose. There was a famous prisoner named Barabbas, who was a robber and had even killed people. Pilate asked the crowd, 'Which one do you want me to release—Barabbas, or Jesus?' The chief priests convinced the people to shout, 'Barabbas!' Pilate asked, 'Then what should I do with Jesus?' They all shouted, 'Crucify Him!' Pilate washed his hands and said, 'I am innocent of this man's blood.' Then he let Barabbas go free and ordered Jesus to be crucified. Just like Barabbas went free while Jesus was punished, we can go free because Jesus took the punishment for our sins."
    },
    {
      "title": "The Crucifixion",
      "slug": "the-crucifixion",
      "description": "Jesus is beaten, mocked, and nailed to a cross between two thieves. In His final hours, He forgives His enemies and commits His spirit to the Father.",
      "verses": ["Luke 23:26-49", "John 19:17-30"],
      "themes": ["Sacrifice", "Forgiveness", "Salvation", "Love"],
      "characters": ["Jesus", "Mary", "John", "Roman soldiers", "Two thieves"],
      "narrative": "They brought Jesus to the place called Golgotha (which means 'the place of the skull'). There they offered him wine mixed with myrrh, but he did not take it. And they crucified him.\n\nIt was nine in the morning when they crucified him. The written notice of the charge against him read: THE KING OF THE JEWS. They crucified two rebels with him, one on his right and one on his left.\n\nJesus said, 'Father, forgive them, for they do not know what they are doing.'\n\nOne of the criminals hanging beside him hurled insults at him: 'Aren't you the Messiah? Save yourself and us!'\n\nBut the other criminal rebuked him. 'Don't you fear God, since you are under the same sentence? We are punished justly, but this man has done nothing wrong.' Then he said, 'Jesus, remember me when you come into your kingdom.'\n\nJesus answered him, 'Truly I tell you, today you will be with me in paradise.'\n\nNear the cross stood Jesus' mother Mary and the disciple whom he loved. When Jesus saw his mother there, he said to her, 'Woman, here is your son,' and to the disciple, 'Here is your mother.' From that time on, this disciple took her into his home.\n\nAt noon, darkness came over the whole land until three in the afternoon. At three o'clock Jesus cried out in a loud voice, 'My God, my God, why have you forsaken me?'\n\nKnowing that everything had now been finished, Jesus said, 'I am thirsty.' He received the drink and said, 'It is finished.'\n\nWith that, he bowed his head and gave up his spirit.\n\nThe curtain of the temple was torn in two from top to bottom. When the centurion saw what had happened, he praised God and said, 'Surely this was a righteous man.'",
      "kids_title": "Jesus Dies on the Cross",
      "kids_description": "Soldiers nailed Jesus to a wooden cross. Even while dying, Jesus forgave them. He died to take the punishment for all the wrong things everyone has ever done.",
      "kids_narrative": "The soldiers took Jesus to a hill called Golgotha. They nailed His hands and feet to a wooden cross and lifted it up.\n\nIt hurt SO much. But do you know what Jesus said?\n\n'Father, FORGIVE them. They don't know what they're doing.'\n\nEven while dying, Jesus forgave the people hurting Him.\n\nTwo criminals were crucified next to Jesus—one on each side. One of them made fun of Jesus. But the other one said, 'We deserve to be punished. But this man did nothing wrong!' Then he said, 'Jesus, remember me when You're in Your kingdom.'\n\nJesus answered, 'Today, you will be with Me in paradise.'\n\nEven while dying, Jesus saved someone!\n\nJesus saw His mother Mary crying nearby. He asked His friend John to take care of her.\n\nAt noon, the sky went DARK—in the middle of the day! It stayed dark for three hours.\n\nJesus cried out, 'My God, My God, why have You left Me?' Jesus was taking the punishment for all the sins of the whole world. It was like God had to turn away.\n\nFinally, Jesus said, 'IT IS FINISHED.'\n\nThen He died.\n\nAt that moment, the big curtain in the temple ripped from TOP to BOTTOM! This meant people could now come close to God because of what Jesus did.\n\nA Roman soldier said, 'This really WAS God's Son!'\n\nJesus died for YOU. He took the punishment for all the bad things you've ever done—so you can be forgiven and be with God forever."
    },
    {
      "title": "The Resurrection",
      "slug": "the-resurrection",
      "description": "On the third day, women find Jesus' tomb empty. Angels announce He has risen! Jesus appears to Mary Magdalene and later to His disciples.",
      "verses": ["Matthew 28:1-10", "John 20:1-18"],
      "themes": ["Victory over death", "New life", "Hope", "Good news"],
      "characters": ["Jesus", "Mary Magdalene", "Angels", "Women", "Peter", "John"],
      "narrative": "Early on the first day of the week, while it was still dark, Mary Magdalene went to the tomb and saw that the stone had been removed from the entrance.\n\nShe came running to Simon Peter and the other disciple. 'They have taken the Lord out of the tomb, and we don't know where they have put him!'\n\nPeter and the other disciple started for the tomb. The other disciple outran Peter and reached the tomb first. He bent over and looked in at the strips of linen lying there but did not go in. Then Simon Peter arrived and went into the tomb. He saw the strips of linen lying there, as well as the cloth that had been wrapped around Jesus' head, folded up by itself.\n\nThen the disciples went back to where they were staying. Now Mary stood outside the tomb crying. As she wept, she bent over to look into the tomb and saw two angels in white, seated where Jesus' body had been.\n\nThey asked her, 'Woman, why are you crying?'\n\n'They have taken my Lord away,' she said, 'and I don't know where they have put him.'\n\nAt this, she turned around and saw Jesus standing there, but she did not realize that it was Jesus.\n\n'Woman,' he said, 'why are you crying? Who is it you are looking for?'\n\nThinking he was the gardener, she said, 'Sir, if you have carried him away, tell me where you have put him.'\n\nJesus said to her, 'Mary.'\n\nShe turned toward him and cried out, 'Rabboni!' (which means 'Teacher').\n\nJesus said, 'Go to my brothers and tell them I am ascending to my Father and your Father, to my God and your God.'\n\nMary Magdalene went to the disciples with the news: 'I have seen the Lord!'",
      "kids_title": "Jesus Is Alive!",
      "kids_description": "Three days after Jesus died, women went to His tomb—but it was EMPTY! An angel said, 'He's not here! He's ALIVE!' Jesus had risen from the dead!",
      "kids_narrative": "Jesus was dead. His friends put His body in a tomb—a cave with a big stone rolled in front of it.\n\nEveryone was SO sad. They thought it was all over.\n\nBut then came Sunday morning...\n\nMary Magdalene and some other women walked to the tomb very early. They wanted to put special spices on Jesus' body.\n\nBut when they got there—the stone was ROLLED AWAY! The tomb was OPEN!\n\nMary ran to tell Peter and John. 'Someone took Jesus' body!'\n\nPeter and John raced to the tomb. They went inside. The cloths that had been wrapped around Jesus were there, but no body!\n\nThey went home confused. But Mary stayed, crying outside the tomb.\n\nShe looked inside and saw two ANGELS in white!\n\n'Why are you crying?' they asked.\n\n'They took my Lord away! I don't know where He is!'\n\nThen Mary turned around. A man was standing there.\n\n'Why are you crying?' He asked. 'Who are you looking for?'\n\nMary thought He was the gardener. 'Sir, if you took Him, please tell me where!'\n\nThen the man said one word: 'Mary.'\n\nShe KNEW that voice! 'TEACHER!' she cried.\n\nIt was JESUS! He was ALIVE!\n\nMary was SO happy! Jesus told her, 'Go tell My friends that I'm going back to My Father!'\n\nMary ran faster than she'd ever run. 'I SAW THE LORD! He's ALIVE!'\n\nJesus didn't stay dead. He rose from the dead! He won the battle against death!\n\nAnd because Jesus is alive, everyone who believes in Him will live forever too!"
    },
    {
      "title": "Jesus Appears to Thomas",
      "slug": "jesus-appears-to-thomas",
      "description": "Thomas doubts the resurrection until Jesus appears and invites him to touch His wounds. Thomas exclaims, 'My Lord and my God!'",
      "verses": ["John 20:24-29"],
      "themes": ["Faith", "Doubt", "Seeing and believing", "Jesus' patience"],
      "characters": ["Jesus", "Thomas", "The Disciples"],
      "narrative": "Now Thomas, one of the Twelve, was not with the disciples when Jesus came. So the other disciples told him, 'We have seen the Lord!'\n\nBut he said to them, 'Unless I see the nail marks in his hands and put my finger where the nails were, and put my hand into his side, I will not believe.'\n\nA week later his disciples were in the house again, and Thomas was with them. Though the doors were locked, Jesus came and stood among them and said, 'Peace be with you!'\n\nThen he said to Thomas, 'Put your finger here; see my hands. Reach out your hand and put it into my side. Stop doubting and believe.'\n\nThomas said to him, 'My Lord and my God!'\n\nThen Jesus told him, 'Because you have seen me, you have believed; blessed are those who have not seen and yet have believed.'",
      "kids_title": "Thomas Believes",
      "kids_description": "Thomas wasn't there when Jesus first appeared to the disciples. He said, 'I won't believe until I see for myself!' A week later, Jesus came back just for Thomas.",
      "kids_narrative": "After Jesus rose from the dead, He visited His disciples. But one of them wasn't there—Thomas.\n\nWhen Thomas got back, everyone was SO excited!\n\n'Thomas! Thomas! We SAW Jesus! He's ALIVE!'\n\nBut Thomas shook his head. 'No way. I won't believe it unless I see Him myself. I need to see the holes in His hands and touch His side where the spear went in. Then I'll believe.'\n\nA whole week went by. The disciples were together in a room with the doors locked.\n\nSuddenly—Jesus was there! Right in the middle of the room!\n\n'Peace be with you,' Jesus said.\n\nThen Jesus looked at Thomas. He held out His hands.\n\n'Thomas, come here. Look at My hands. Put your finger right here where the nails were. Touch My side. Stop doubting and BELIEVE!'\n\nThomas stared. It really WAS Jesus! He fell to his knees.\n\n'My Lord and my God!'\n\nThomas believed! He KNEW Jesus was alive!\n\nJesus said something important: 'You believe because you've seen Me. But there will be people who believe without seeing—and they are blessed!'\n\nThat's US! We haven't seen Jesus with our eyes, but we believe He's real and alive. Jesus says we're BLESSED!\n\nJesus was patient with Thomas. He's patient with us too when we have questions or doubts. He wants us to believe!"
    },
    {
      "title": "The Road to Emmaus",
      "slug": "road-to-emmaus",
      "description": "Two discouraged disciples walk toward Emmaus when a stranger joins them. As He explains the Scriptures and breaks bread, their eyes are opened—it's Jesus!",
      "verses": ["Luke 24:13-35"],
      "themes": ["Scripture reveals Jesus", "Discouragement to joy", "Recognizing Jesus", "Fellowship"],
      "characters": ["Jesus", "Cleopas", "Another disciple"],
      "narrative": "Now that same day two of them were going to a village called Emmaus, about seven miles from Jerusalem. They were talking with each other about everything that had happened.\n\nAs they talked and discussed these things, Jesus himself came up and walked along with them; but they were kept from recognizing him.\n\nHe asked them, 'What are you discussing together as you walk along?'\n\nThey stood still, their faces downcast. One of them, named Cleopas, asked him, 'Are you the only one visiting Jerusalem who does not know the things that have happened there in these days?'\n\n'What things?' he asked.\n\n'About Jesus of Nazareth,' they replied. 'He was a prophet, powerful in word and deed. The chief priests handed him over to be crucified. We had hoped that he was the one who was going to redeem Israel. And what is more, it is the third day since all this took place. Some women amazed us—they went to the tomb but didn't find his body. They came and told us they had seen angels who said he was alive.'\n\nHe said to them, 'How foolish you are, and how slow to believe all that the prophets have spoken! Did not the Messiah have to suffer these things and then enter his glory?' And beginning with Moses and all the Prophets, he explained to them what was said in all the Scriptures concerning himself.\n\nAs they approached the village, Jesus continued on as if he were going farther. But they urged him strongly, 'Stay with us, for it is nearly evening.' So he went in to stay with them.\n\nWhen he was at the table with them, he took bread, gave thanks, broke it and began to give it to them. Then their eyes were opened and they recognized him, and he disappeared from their sight.\n\nThey asked each other, 'Were not our hearts burning within us while he talked with us on the road and opened the Scriptures to us?'\n\nThey got up and returned at once to Jerusalem. There they found the Eleven gathered together, and they told what had happened on the road, and how Jesus was recognized by them when he broke the bread.",
      "kids_title": "The Stranger on the Road",
      "kids_description": "Two sad disciples were walking home when a stranger joined them. He explained the Bible to them. At dinner, they finally recognized Him—it was Jesus!",
      "kids_narrative": "It was the same day Jesus rose from the dead. Two of His followers were walking to a village called Emmaus. They were SO sad.\n\n'I can't believe Jesus is gone,' one said. His name was Cleopas.\n\n'I thought He was the one who would save Israel,' the other said.\n\nA stranger came up and started walking with them.\n\n'What are you talking about?' the stranger asked.\n\nThey stopped and stared at Him. 'Are you the ONLY person who doesn't know what happened? Jesus of Nazareth was crucified! We thought He was the Messiah. Now He's dead.'\n\nThe stranger shook His head. 'Don't you understand? The prophets said the Messiah HAD to suffer before entering His glory!'\n\nThen the stranger started explaining the WHOLE Bible—from Moses to all the prophets—showing how everything pointed to Jesus!\n\nThe two disciples listened with wide eyes. Their hearts felt like they were on FIRE!\n\nWhen they reached Emmaus, it was getting dark. 'Please stay with us!' they begged.\n\nThe stranger agreed. They sat down to eat. The stranger took the bread, blessed it, broke it, and gave it to them.\n\nSuddenly—their eyes were opened! The stranger was JESUS!\n\nAnd then—POOF! He disappeared!\n\n'NO WONDER our hearts were burning!' they said. 'It was JESUS the whole time!'\n\nThey ran ALL the way back to Jerusalem to tell the other disciples: 'We SAW Jesus! He's ALIVE!'\n\nJesus loved them so much that He walked beside them even when they didn't recognize Him. He's with us too, even when we can't see Him."
    },
    {
      "title": "Jesus Restores Peter",
      "slug": "jesus-restores-peter",
      "description": "By the Sea of Galilee, the risen Jesus cooks breakfast for His disciples and asks Peter three times, 'Do you love me?'—restoring the disciple who had denied Him three times.",
      "verses": ["John 21:1-19"],
      "themes": ["Restoration", "Forgiveness", "Second chances", "Calling"],
      "characters": ["Jesus", "Peter", "John", "Other disciples"],
      "narrative": "Afterward Jesus appeared again to his disciples, by the Sea of Galilee. Simon Peter, Thomas, Nathanael, the sons of Zebedee, and two other disciples were together.\n\n'I'm going out to fish,' Simon Peter told them, and they said, 'We'll go with you.' So they went out and got into the boat, but that night they caught nothing.\n\nEarly in the morning, Jesus stood on the shore, but the disciples did not realize it was him.\n\nHe called out to them, 'Friends, haven't you any fish?'\n\n'No,' they answered.\n\nHe said, 'Throw your net on the right side of the boat and you will find some.' When they did, they were unable to haul the net in because of the large number of fish.\n\nThen the disciple whom Jesus loved said to Peter, 'It is the Lord!' As soon as Simon Peter heard this, he jumped into the water.\n\nWhen they landed, they saw a fire of burning coals there with fish on it, and some bread. Jesus said to them, 'Come and have breakfast.'\n\nWhen they had finished eating, Jesus said to Simon Peter, 'Simon son of John, do you love me more than these?'\n\n'Yes, Lord,' he said, 'you know that I love you.'\n\nJesus said, 'Feed my lambs.'\n\nAgain Jesus said, 'Simon son of John, do you love me?'\n\nHe answered, 'Yes, Lord, you know that I love you.'\n\nJesus said, 'Take care of my sheep.'\n\nThe third time he said to him, 'Simon son of John, do you love me?'\n\nPeter was hurt because Jesus asked him the third time. He said, 'Lord, you know all things; you know that I love you.'\n\nJesus said, 'Feed my sheep. Very truly I tell you, when you were younger you dressed yourself and went where you wanted; but when you are old you will stretch out your hands, and someone else will dress you and lead you where you do not want to go.' Jesus said this to indicate the kind of death by which Peter would glorify God. Then he said to him, 'Follow me!'",
      "kids_title": "Breakfast with Jesus",
      "kids_description": "After Peter had denied Jesus three times, he felt terrible. But Jesus made him breakfast and asked three times, 'Do you love me?' Jesus forgave Peter and gave him an important job!",
      "kids_narrative": "Peter felt SO bad. He had told people THREE times that he didn't know Jesus. How could Jesus ever forgive him?\n\nOne night, Peter and some other disciples went fishing on the Sea of Galilee. They fished ALL night but caught NOTHING.\n\nIn the morning, someone called from the shore: 'Hey! Catch any fish?'\n\n'No!' they shouted back.\n\n'Throw your net on the other side of the boat!'\n\nThey did—and WHOOSH! So many fish filled the net they couldn't even pull it in!\n\nJohn's eyes got big. 'It's the LORD!'\n\nPeter was so excited he JUMPED into the water and swam to shore! The others brought the boat.\n\nOn the beach, Jesus had a fire going with fish cooking on it. 'Come have breakfast!' Jesus said.\n\nJesus served them bread and fish. It was SO good!\n\nAfter breakfast, Jesus turned to Peter.\n\n'Simon Peter, do you love me?'\n\n'Yes, Lord! You know I love you!'\n\n'Then feed my lambs.'\n\nAgain Jesus asked, 'Peter, do you love me?'\n\n'Yes, Lord, you know I love you!'\n\n'Take care of my sheep.'\n\nA third time: 'Peter, do you love me?'\n\nPeter felt sad—Jesus asked THREE times. But then he understood. He had denied Jesus three times. Now Jesus was giving him three chances to say he loved Him!\n\n'Lord, you know everything! You know I love you!'\n\n'Feed my sheep. Follow me.'\n\nJesus forgave Peter! Not only that—Jesus gave him an important job: take care of God's people!\n\nWhen WE mess up, Jesus doesn't throw us away. He forgives us and gives us another chance. He still has plans for us!"
    },
    {
      "title": "The Great Commission",
      "slug": "great-commission",
      "description": "The risen Jesus meets His disciples on a mountain in Galilee and gives them their mission: to make disciples of all nations, baptizing and teaching them.",
      "verses": ["Matthew 28:16-20"],
      "themes": ["Mission", "Authority of Jesus", "Making disciples", "Jesus' presence"],
      "characters": ["Jesus", "The Eleven Disciples"],
      "narrative": "Then the eleven disciples went to Galilee, to the mountain where Jesus had told them to go. When they saw him, they worshiped him; but some doubted.\n\nThen Jesus came to them and said, 'All authority in heaven and on earth has been given to me. Therefore go and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, and teaching them to obey everything I have commanded you. And surely I am with you always, to the very end of the age.'",
      "kids_title": "Go and Tell Everyone!",
      "kids_description": "Before Jesus went back to heaven, He gave His followers an important job: go everywhere in the world and tell people about Him!",
      "kids_narrative": "Jesus told His disciples to meet Him on a mountain in Galilee. When they saw Him, they fell down and worshiped Him!\n\nJesus had something VERY important to tell them.\n\n'ALL power in heaven and earth has been given to Me,' Jesus said.\n\nThe disciples listened carefully.\n\n'So HERE'S what I want you to do: GO! Go to ALL the nations—every country in the whole world!'\n\nJesus continued: 'Make disciples everywhere. Baptize them in the name of the Father, the Son, and the Holy Spirit. Teach them to obey everything I've taught you.'\n\nThat was a BIG job! Go to the whole world? Tell EVERYONE?\n\nBut then Jesus said the best part:\n\n'And remember this: I am with you ALWAYS. Even to the very end of the world.'\n\nJesus wasn't going to leave them alone! He would be with them every step of the way.\n\nThis is called the 'Great Commission.' Jesus was giving His followers their mission—their special job.\n\nAnd guess what? This job is for US too! Jesus wants EVERYONE to hear about Him. That includes people in every country, speaking every language.\n\nSome people become missionaries and go far away. Some people tell their neighbors and friends. But ALL of us can share Jesus with others!\n\nAnd Jesus promises: He's ALWAYS with us. We're never alone. He'll help us tell others about Him!"
    },
    {
      "title": "The Ascension",
      "slug": "the-ascension",
      "description": "Forty days after His resurrection, Jesus blesses His disciples and is taken up into heaven. Angels promise He will return the same way.",
      "verses": ["Acts 1:1-11", "Luke 24:50-53"],
      "themes": ["Jesus' return to heaven", "Promise of the Holy Spirit", "Jesus will come back", "Worship"],
      "characters": ["Jesus", "The Disciples", "Two Angels"],
      "narrative": "In my former book, Theophilus, I wrote about all that Jesus began to do and to teach until the day he was taken up to heaven, after giving instructions through the Holy Spirit to the apostles he had chosen.\n\nAfter his suffering, he presented himself to them and gave many convincing proofs that he was alive. He appeared to them over a period of forty days and spoke about the kingdom of God.\n\nOn one occasion, while he was eating with them, he gave them this command: 'Do not leave Jerusalem, but wait for the gift my Father promised, which you have heard me speak about. For John baptized with water, but in a few days you will be baptized with the Holy Spirit.'\n\nThen they gathered around him and asked him, 'Lord, are you at this time going to restore the kingdom to Israel?'\n\nHe said to them: 'It is not for you to know the times or dates the Father has set by his own authority. But you will receive power when the Holy Spirit comes on you; and you will be my witnesses in Jerusalem, and in all Judea and Samaria, and to the ends of the earth.'\n\nAfter he said this, he was taken up before their very eyes, and a cloud hid him from their sight.\n\nThey were looking intently up into the sky as he was going, when suddenly two men dressed in white stood beside them. 'Men of Galilee,' they said, 'why do you stand here looking into the sky? This same Jesus, who has been taken from you into heaven, will come back in the same way you have seen him go into heaven.'\n\nThen the disciples worshiped him and returned to Jerusalem with great joy.",
      "kids_title": "Jesus Goes to Heaven",
      "kids_description": "Forty days after rising from the dead, Jesus went back up to heaven. But He promised to send the Holy Spirit—and to come back one day!",
      "kids_narrative": "For forty days after Jesus rose from the dead, He kept appearing to His disciples. He taught them more about God's kingdom. He ate meals with them. He proved He was really, truly alive!\n\nOne day, Jesus led His disciples to a hill near Jerusalem.\n\n'Don't leave Jerusalem yet,' Jesus told them. 'Wait for the gift My Father promised—the Holy Spirit! In a few days, you'll be baptized with the Holy Spirit. You'll receive POWER! And you'll tell people about Me—first in Jerusalem, then everywhere in the world!'\n\nThe disciples had a question: 'Lord, is this when You'll set up Your kingdom?'\n\nJesus said, 'It's not for you to know the timing. The Father decides that. But you WILL receive power when the Holy Spirit comes!'\n\nThen something AMAZING happened.\n\nJesus lifted His hands and blessed them. And then—He started going UP! Higher and higher! A cloud surrounded Him, and He went right up into HEAVEN!\n\nThe disciples stared up at the sky with their mouths open.\n\nSuddenly, two men in white clothes (angels!) appeared beside them.\n\n'Why are you standing here looking at the sky?' the angels asked. 'This same Jesus will come BACK the same way you saw Him go!'\n\nJesus went to heaven, but He's coming back! One day, He'll return in the clouds, and everyone will see Him!\n\nThe disciples were SO happy! They went back to Jerusalem praising God, waiting for the Holy Spirit.\n\nJesus is in heaven now, preparing a place for everyone who believes in Him. And one day—He's coming back!"
    }
  ]
}
