{
  "category": "Paul's Missions",
  "slug": "paul-missions",
  "description": "The apostle Paul's transformation from persecutor to preacher, his missionary journeys spreading the gospel to the Gentile world, and his letters that shaped the early church.",
  "stories": [
    {
      "title": "From Persecutor to Preacher",
      "slug": "from-persecutor-to-preacher",
      "description": "Saul encounters the risen Christ on the road to Damascus, transforming him from Christianity's greatest enemy to its most ardent advocate.",
      "verses": ["Acts 9:1-31", "Acts 22:3-21", "Acts 26:9-18"],
      "themes": ["Conversion", "Grace", "Divine calling", "Transformation", "Forgiveness"],
      "characters": ["Saul/Paul", "Jesus", "Ananias", "Barnabas"],
      "narrative": "Saul of Tarsus was breathing out threats and murder against the disciples of the Lord. A Pharisee trained under Gamaliel, he was convinced that followers of the Way were blaspheming God. He obtained letters from the high priest authorizing him to arrest any Christians in Damascus and bring them bound to Jerusalem.\n\nAs he journeyed, suddenly a light from heaven flashed around him. He fell to the ground and heard a voice: 'Saul, Saul, why are you persecuting Me?'\n\n'Who are You, Lord?' Saul asked.\n\n'I am Jesus, whom you are persecuting. Rise and go into the city, and you will be told what to do.'\n\nThe men traveling with him stood speechless, hearing the voice but seeing no one. When Saul arose, he opened his eyes but could see nothing. They led him by the hand into Damascus, where he remained blind for three days, neither eating nor drinking.\n\nMeanwhile, the Lord appeared to a disciple named Ananias, telling him to go to Saul. Ananias protested—he had heard of this man's persecution of the saints. But God said, 'Go, for he is a chosen instrument of Mine to carry My name before the Gentiles and kings and the children of Israel.'\n\nAnanias obeyed. Laying his hands on Saul, he said, 'Brother Saul, the Lord Jesus who appeared to you on the road has sent me that you may regain your sight and be filled with the Holy Spirit.' Immediately something like scales fell from Saul's eyes, and he could see again. He arose and was baptized.\n\nThen Saul—soon to be known as Paul—began proclaiming Jesus in the synagogues, declaring that He is the Son of God. All who heard him were amazed: 'Is not this the man who made havoc in Jerusalem of those who called on this name?' But Saul increased all the more in strength, confounding the Jews by proving that Jesus was the Christ.\n\nThe greatest persecutor had become the greatest preacher. The one who destroyed the church would build it. Grace had transformed an enemy into an apostle.",
      "kids_title": "The Day Everything Changed for Saul",
      "kids_description": "Saul was trying to hurt Christians, but Jesus appeared to him in a bright light. Saul became Paul and spent the rest of his life telling everyone about Jesus!",
      "kids_narrative": "There was a man named Saul who was very angry at people who loved Jesus. He wanted to arrest them and put them in jail! One day, Saul was walking to a city called Damascus to find more Christians to hurt.\n\nSuddenly, a super bright light from heaven shined all around him! Saul fell down. Then he heard a voice: 'Saul, Saul, why are you hurting Me?'\n\n'Who are You?' Saul asked.\n\n'I am Jesus! Every time you hurt My followers, you're hurting Me!'\n\nWhen Saul stood up, he couldn't see anything! He was blind! His friends had to lead him by the hand into the city. For three days, Saul couldn't see. He didn't eat or drink. He just prayed.\n\nGod sent a brave man named Ananias to help Saul. Ananias was scared at first because he knew Saul hurt Christians. But God said, 'Don't worry! I'm going to use Saul to tell everyone about Me!'\n\nAnanias put his hands on Saul and said, 'Brother Saul, Jesus sent me to help you see again!' Right away, Saul could see! He got baptized and started telling everyone that Jesus is God's Son!\n\nEveryone was surprised! 'Isn't this the man who used to hurt Christians?' they asked. But Saul, who now called himself Paul, had completely changed. Jesus turned His enemy into His friend!\n\nJesus can change anyone's heart—even the meanest person can become kind when they meet Jesus!"
    },
    {
      "title": "The First Missionary Journey",
      "slug": "first-missionary-journey",
      "description": "Paul and Barnabas are set apart by the Holy Spirit to bring the gospel to Cyprus and Asia Minor, planting churches among the Gentiles.",
      "verses": ["Acts 13:1-14:28"],
      "themes": ["Missions", "Gospel to the Gentiles", "Persecution", "Church planting", "Boldness"],
      "characters": ["Paul", "Barnabas", "John Mark", "Sergius Paulus", "Elymas"],
      "narrative": "In Antioch, as the church was worshiping and fasting, the Holy Spirit said, 'Set apart for Me Barnabas and Saul for the work to which I have called them.' After fasting and praying, they laid hands on them and sent them off.\n\nThey sailed to Cyprus, where they proclaimed the word of God in the synagogues. At Paphos, they encountered a false prophet named Elymas who opposed them, trying to turn the proconsul Sergius Paulus from the faith. Paul, filled with the Holy Spirit, pronounced judgment on Elymas, who was struck with temporary blindness. The proconsul, seeing this, believed.\n\nFrom there they sailed to Perga and traveled to Pisidian Antioch. In the synagogue, Paul preached that Jesus was the promised Messiah, the fulfillment of God's promises to Israel. Many Jews and devout converts believed, but when the gospel was extended to Gentiles, the Jewish leaders became jealous and contradicted Paul. He declared, 'Since you thrust the word of God aside, we turn to the Gentiles.'\n\nThe Gentiles rejoiced and many believed, but persecution arose. Paul and Barnabas were driven out and went to Iconium, where again many believed—both Jews and Greeks. When a plot formed to stone them, they fled to Lystra.\n\nIn Lystra, Paul healed a man lame from birth. The crowd thought Paul and Barnabas were gods and tried to offer sacrifices to them. Paul tore his garments and cried out, 'We are men just like you, bringing you good news!' Yet Jews from Antioch came and stirred up the crowd. They stoned Paul and dragged him outside the city, supposing him dead. But as the disciples gathered around him, he rose up and entered the city again.\n\nAfter preaching in Derbe, they retraced their steps, strengthening the souls of the disciples, encouraging them to continue in the faith, saying, 'Through many tribulations we must enter the kingdom of God.' They appointed elders in every church and returned to Antioch, where they reported all that God had done through them—how He had opened a door of faith to the Gentiles.\n\nThe first missionary journey had established the pattern: preach the gospel, endure persecution, plant churches, appoint leaders, and trust God for the increase.",
      "kids_title": "Paul and Barnabas Go on a Big Trip",
      "kids_description": "The Holy Spirit sent Paul and Barnabas to tell people in faraway places about Jesus. They faced troubles, but they kept sharing the good news!",
      "kids_narrative": "Paul and Barnabas were praying with their friends when God said, 'I have a special job for Paul and Barnabas. Send them out to tell people about Jesus!'\n\nSo they got on a boat and sailed to an island called Cyprus. They told everyone there about Jesus. A leader on the island wanted to believe, but a bad man named Elymas tried to stop him. Paul said, 'God is going to make you blind for a while because you're trying to stop people from learning about Jesus!' And Elymas couldn't see! When the leader saw this, he believed in Jesus.\n\nPaul and Barnabas kept traveling to different cities. In some cities, people were happy to hear about Jesus and many believed! But in other cities, people got angry. In one city called Lystra, Paul healed a man who couldn't walk. The people were so amazed they thought Paul and Barnabas were special gods!\n\n'No, no!' Paul said. 'We're just regular people! We want to tell you about the real God!'\n\nBut some mean people from another city came and made the crowd angry at Paul. They threw rocks at him until he fell down. Everyone thought Paul was dead! But when his friends gathered around him, Paul stood up! He wasn't going to give up.\n\nPaul and Barnabas visited more cities, telling people about Jesus and starting churches—places where believers could meet together. Then they went back to visit all the new believers to encourage them.\n\nWhen they got home, they told everyone, 'Look at all the amazing things God did! Lots of people believe in Jesus now!' Paul and Barnabas were brave missionaries who brought the good news to many people!"
    },
    {
      "title": "Prison Songs at Midnight",
      "slug": "prison-songs-at-midnight",
      "description": "Paul and Silas are beaten and imprisoned in Philippi, but their midnight worship leads to miraculous deliverance and the conversion of the jailer and his household.",
      "verses": ["Acts 16:16-40"],
      "themes": ["Worship through suffering", "God's power", "Salvation", "Joy in trials", "Miracles"],
      "characters": ["Paul", "Silas", "The slave girl", "The jailer"],
      "narrative": "In Philippi, Paul and Silas encountered a slave girl with a spirit of divination who followed them, crying out, 'These men are servants of the Most High God, who proclaim to you the way of salvation!' Though her words were true, the spirit behind them was not. After many days, Paul turned and commanded the spirit, 'I command you in the name of Jesus Christ to come out of her.' It came out that very hour.\n\nBut when her owners saw their hope of profit was gone, they seized Paul and Silas and dragged them to the marketplace before the rulers. 'These men are Jews and they are disturbing our city,' they accused. The crowd joined in attacking them, and the magistrates had them stripped and beaten with rods. After many blows, they threw them into prison, charging the jailer to keep them safely. He put them in the inner prison and fastened their feet in stocks.\n\nAbout midnight—backs bleeding, feet in stocks, in the innermost cell—Paul and Silas were praying and singing hymns to God. The other prisoners were listening. Suddenly there was a great earthquake that shook the foundations of the prison. All the doors flew open and everyone's bonds were unfastened.\n\nWhen the jailer woke and saw the prison doors open, he drew his sword to kill himself, assuming the prisoners had fled. But Paul cried with a loud voice, 'Do not harm yourself, for we are all here!' The jailer called for lights and rushed in, trembling with fear. He fell down before Paul and Silas and brought them out, asking, 'Sirs, what must I do to be saved?'\n\nThey said, 'Believe in the Lord Jesus, and you will be saved, you and your household.'\n\nThat very night, at that very hour, the jailer washed their wounds and was baptized with all his family. He brought them into his house, set food before them, and rejoiced along with his entire household that he had believed in God.\n\nWhat began with beatings ended with baptism. What started with imprisonment concluded with joy. Paul and Silas's midnight worship had turned a prison into a place of salvation.",
      "kids_title": "Singing in Jail",
      "kids_description": "Paul and Silas were put in jail for telling people about Jesus, but they sang songs to God anyway. Then God sent an earthquake that opened all the doors!",
      "kids_narrative": "Paul and Silas were in a city telling people about Jesus. They helped a girl by making an evil spirit leave her. But the people who owned the girl got mad because they were using her to make money!\n\nThe angry people grabbed Paul and Silas and beat them with sticks. Ouch! Then they threw them in jail. The jailer put them deep inside the prison and locked their feet in heavy chains so they couldn't move.\n\nIt was midnight. Paul and Silas's backs hurt from being beaten. Their feet were locked up. They were in the darkest part of the jail. What did they do? Did they cry? Did they complain?\n\nNo! They SANG! They prayed and sang songs to God! The other prisoners listened. Even in jail, Paul and Silas praised God!\n\nSuddenly—RUMBLE, RUMBLE, SHAKE, SHAKE! A big earthquake shook the whole jail! All the doors flew open! Everyone's chains fell off! Paul and Silas were free!\n\nThe jailer woke up and saw all the doors open. He thought all the prisoners ran away. He was so scared! But Paul shouted, 'Don't worry! We're all still here!'\n\nThe jailer ran to Paul and Silas. He was shaking. 'What do I need to do to be saved?' he asked.\n\n'Believe in Jesus!' Paul said.\n\nRight there, that night, the jailer and his whole family believed in Jesus and got baptized! The jailer washed Paul and Silas's wounds and made them dinner. Everyone was so happy!\n\nPaul and Silas showed us that even when bad things happen, we can still worship God. And God can use our hardest times to help others find Jesus!"
    },
    {
      "title": "Teaching in Athens",
      "slug": "teaching-in-athens",
      "description": "Paul engages with the philosophers of Athens on Mars Hill, proclaiming the unknown God they worship as the Creator who raised Jesus from the dead.",
      "verses": ["Acts 17:16-34"],
      "themes": ["Apologetics", "Gospel to intellectuals", "God as Creator", "Resurrection", "Cultural engagement"],
      "characters": ["Paul", "Epicurean philosophers", "Stoic philosophers", "Dionysius", "Damaris"],
      "narrative": "While Paul waited in Athens for Silas and Timothy, his spirit was provoked within him as he saw the city full of idols. He reasoned in the synagogue with Jews and devout persons, and in the marketplace every day with those who happened to be there.\n\nSome Epicurean and Stoic philosophers encountered him. Some said, 'What does this babbler wish to say?' Others said, 'He seems to be a preacher of foreign divinities'—because he was preaching Jesus and the resurrection. They brought him to the Areopagus (Mars Hill), saying, 'May we know what this new teaching is that you are presenting?'\n\nPaul stood in the midst of the Areopagus and said, 'Men of Athens, I perceive that in every way you are very religious. For as I passed along and observed the objects of your worship, I found also an altar with this inscription: \"To the unknown god.\" What therefore you worship as unknown, this I proclaim to you.'\n\nHe declared that the God who made the world and everything in it, being Lord of heaven and earth, does not live in temples made by man, nor is He served by human hands, as though He needed anything—He Himself gives to all mankind life and breath and everything. From one man He made every nation to live on all the earth, determining their times and boundaries, that they should seek God and perhaps reach out and find Him. 'Yet He is actually not far from each one of us, for \"In Him we live and move and have our being.\"'\n\nPaul quoted their own poets to establish common ground, then turned to the gospel: 'Being then God's offspring, we ought not to think that the divine being is like gold or silver or stone, an image formed by human art. The times of ignorance God overlooked, but now He commands all people everywhere to repent, because He has fixed a day on which He will judge the world in righteousness by a Man whom He has appointed; and of this He has given assurance to all by raising Him from the dead.'\n\nWhen they heard of the resurrection of the dead, some mocked. But others said, 'We will hear you again about this.' Some men joined him and believed, including Dionysius the Areopagite and a woman named Damaris.\n\nPaul had met the philosophers on their own ground and pointed them beyond their vain speculations to the living God and His risen Son.",
      "kids_title": "Paul Talks to Smart People",
      "kids_description": "In Athens, a city full of statues of fake gods, Paul told the people about the real God who made everything and came back to life.",
      "kids_narrative": "Paul went to a big city called Athens. This city had lots and lots of statues—statues of pretend gods everywhere! This made Paul sad because the people didn't know about the real God.\n\nPaul went to the marketplace and started talking to people about Jesus. Some smart people called philosophers heard him. 'What is this guy talking about?' they wondered. They brought Paul to a special place called Mars Hill where people gave speeches.\n\n'Tell us about this new teaching!' they said.\n\nPaul was brave. He stood up in front of everyone and said, 'People of Athens, I can see you love to worship! As I walked around your city, I saw an altar with words that said \"To the Unknown God.\" Well, I want to tell you about this God you don't know!'\n\nThen Paul told them amazing things: 'The real God made the whole world and everything in it! He doesn't live in buildings made by people. He doesn't need anything from us—instead, He gives us everything! He gives us life and breath and all we have. God made every person on earth, and He's not far away. He's close to all of us!'\n\nPaul continued, 'God wants everyone to know Him. He sent a special Man—Jesus—who came back to life after He died. This proves that Jesus will one day judge the world fairly.'\n\nSome people laughed when Paul talked about someone coming back to life. But others wanted to hear more! And some people believed in Jesus that day, including a man named Dionysius and a woman named Damaris.\n\nPaul showed us that we can tell anyone about Jesus—even really smart people who think they know everything. The real God is not made of stone or gold. He's alive, and He loves us!"
    },
    {
      "title": "Shipwreck and Malta",
      "slug": "shipwreck-and-malta",
      "description": "On his journey to Rome as a prisoner, Paul survives a violent storm and shipwreck, demonstrating God's protection and power through his ministry on Malta.",
      "verses": ["Acts 27:1-28:10"],
      "themes": ["God's sovereignty", "Protection", "Leadership", "Miracles", "Providence"],
      "characters": ["Paul", "Julius the centurion", "Luke", "Aristarchus", "The islanders of Malta"],
      "narrative": "When it was decided that Paul should sail to Italy, he was delivered to a centurion named Julius. They set sail, and after many days reached Crete. Paul advised them not to sail further, saying, 'I perceive that the voyage will be with injury and much loss.' But the centurion paid more attention to the pilot than to Paul, and they set sail.\n\nSoon a tempestuous wind called the northeaster struck. The ship was caught and could not face the wind, so they were driven along. For many days neither sun nor stars appeared, and no small tempest lay on them. All hope of being saved was abandoned.\n\nBut Paul stood up and said, 'Take heart, for there will be no loss of life among you, but only of the ship. For this very night there stood before me an angel of the God to whom I belong and whom I worship, and he said, \"Do not be afraid, Paul; you must stand before Caesar. And behold, God has granted you all those who sail with you.\" So take heart, for I have faith in God that it will be exactly as I have been told.'\n\nOn the fourteenth night, about midnight, the sailors suspected they were nearing land. Fearing they would run aground on the rocks, they let down anchors. Some sailors tried to escape in the lifeboat, but Paul warned the centurion, 'Unless these men stay in the ship, you cannot be saved.' So they cut away the lifeboat.\n\nAs day was about to dawn, Paul urged them all to take some food, saying, 'Today is the fourteenth day you have continued in suspense without taking any food. Take some food; it will give you strength, for not a hair is to perish from the head of any of you.' He took bread, gave thanks to God, and began to eat. They were all encouraged and ate some food themselves.\n\nWhen it was day, they ran the ship aground. The soldiers planned to kill the prisoners lest any swim away, but the centurion, wishing to save Paul, kept them from their purpose. All 276 people escaped safely to land, reaching the island of Malta.\n\nThe native people showed them unusual kindness, building a fire because of the rain and cold. When Paul gathered a bundle of sticks and put them on the fire, a viper came out and fastened on his hand. The islanders expected him to swell up or suddenly fall dead, but when nothing happened, they changed their minds and said he was a god.\n\nPaul stayed on Malta three months, healing the sick and preaching the gospel. When they set sail again, the islanders put on board whatever they needed. God had turned disaster into opportunity for ministry.",
      "kids_title": "Paul's Big Storm",
      "kids_description": "Paul was on a ship going to Rome when a huge storm hit! The ship crashed, but God kept everyone safe, just like He promised.",
      "kids_narrative": "Paul was being taken on a big ship to the city of Rome. But Paul told the people in charge, 'We shouldn't sail now. A bad storm is coming!' The captain didn't listen to Paul. He thought he knew better.\n\nThey sailed out into the sea. Then—WHOOOOSH! A huge storm came! The wind blew and blew. Waves crashed over the ship. Rain poured down. It was so dark they couldn't see the sun or stars for many days!\n\nEveryone was scared. They thought they were going to die! But Paul stood up and said, 'Don't be afraid! Last night an angel from God came to me. God said we will ALL be safe! The ship will crash, but every single person will live. I believe God!'\n\nThe storm kept going for fourteen days! Finally, CRASH! The ship hit some rocks and broke into pieces. 'Swim to shore!' everyone yelled. Some people swam, and some floated on pieces of wood. Guess what? All 276 people made it safely to an island called Malta, just like God promised!\n\nThe people on Malta were very kind. They made a fire to warm everyone up. When Paul was putting sticks on the fire, a poisonous snake bit his hand! Everyone thought Paul would die. But Paul just shook the snake off into the fire. Nothing bad happened to him at all! The people were amazed.\n\nPaul stayed on Malta for three months. He healed sick people and told everyone about Jesus. God protected Paul through the storm and used him to help many people!\n\nWhen God makes a promise, He always keeps it. Not even a huge storm or a poisonous snake could stop God's plan for Paul!"
    },
    {
      "title": "Eutychus Falls from the Window",
      "slug": "eutychus-falls-from-window",
      "description": "During Paul's lengthy sermon at Troas, a young man named Eutychus falls asleep and tumbles from a third-story window to his death, but Paul raises him back to life through God's power.",
      "verses": ["Acts 20:7-12"],
      "themes": ["Resurrection Power", "Preaching", "Fellowship", "Divine Miracles", "Perseverance"],
      "characters": ["Paul", "Eutychus", "Disciples at Troas"],
      "narrative": "Upon the first day of the week, when the disciples came together to break bread, Paul preached unto them, ready to depart on the morrow. The congregation gathered in an upper chamber on the third loft of a house in Troas, and many lights were burning. Paul, knowing this would be his last opportunity to minister to them, continued his speech until midnight.\n\nThere sat in a window a young man named Eutychus, who was listening to Paul's discourse. As Paul prolonged his speech, Eutychus was overcome with sleep. As he sank down with sleep, he fell from the third loft down to the ground below. Those present rushed down and took him up dead.\n\nPaul went down and fell on him, and embracing him said, 'Trouble not yourselves; for his life is in him.' The power of God that raised Jesus from the dead was present to restore life to this young man.\n\nWhen Paul had come up again into the upper chamber and had broken bread and eaten, he talked a long while, even till break of day, and so departed. The miracle had not shortened his message. And they brought the young man alive, and were not a little comforted.",
      "kids_title": "The Boy Who Fell Asleep in Church",
      "kids_description": "A young man falls out of a window during Paul's long sermon and dies, but God brings him back to life through Paul's prayer.",
      "kids_narrative": "In the city of Troas, all the Christians gathered together on Sunday evening to hear Paul preach. They met in a room on the third floor of a house. There were lots of oil lamps burning, making the room warm and bright. Paul had so much to teach them that he kept preaching and preaching, even until midnight!\n\nA young man named Eutychus was sitting by the window listening to Paul. It got later and later, and Eutychus started feeling very sleepy. His eyes got heavier and heavier. Even though he wanted to stay awake and listen, he just couldn't keep his eyes open anymore. Eutychus fell fast asleep right there in the window!\n\nSuddenly, Eutychus tumbled right out of the window! He fell all the way down from the third floor to the ground below. Everyone rushed downstairs to help him, but when they got there, they found that Eutychus was dead.\n\nBut Paul hurried down the stairs too. He bent down and hugged Eutychus, and then Paul said, 'Don't worry! His life is in him!' God's power worked through Paul, and Eutychus came back to life! Everyone was so happy and amazed. They brought Eutychus back upstairs, and he was perfectly fine.\n\nThen Paul kept on teaching them until the sun came up in the morning. He had so much to tell them about Jesus! Everyone went home that day feeling so happy and comforted because they had seen God's amazing power."
    },
    {
      "title": "Paul's Conversion on the Damascus Road",
      "slug": "pauls-damascus-road",
      "description": "Saul of Tarsus, a fierce persecutor of Christians, encounters the risen Christ on the road to Damascus and is transformed from the church's greatest enemy into its most zealous apostle.",
      "verses": ["Acts 9:1-22", "Acts 22:6-16", "Acts 26:12-18"],
      "themes": ["Conversion", "God's Sovereignty", "Grace", "Calling", "Transformation", "Repentance"],
      "characters": ["Saul/Paul", "Jesus Christ", "Ananias", "Disciples in Damascus"],
      "narrative": "Saul, yet breathing out threatenings and slaughter against the disciples of the Lord, went unto the high priest and desired of him letters to Damascus, that if he found any of this way, whether men or women, he might bring them bound unto Jerusalem. He was a Pharisee of Pharisees, zealous for the law, and he persecuted the church beyond measure.\n\nAs he journeyed and came near Damascus about noon, suddenly there shined round about him a light from heaven above the brightness of the sun. He fell to the earth and heard a voice saying, 'Saul, Saul, why persecutest thou me?'\n\nTrembling, Saul said, 'Who art thou, Lord?' And the Lord said, 'I am Jesus whom thou persecutest.' In that moment, all of Saul's religious certainty crumbled. The One he thought to be a blasphemous impostor was indeed the Lord of glory, risen from the dead.\n\nSaul arose from the earth, and when his eyes were opened, he saw no man—the glory had left him blind. They led him by the hand into Damascus, where he was three days without sight, neither eating nor drinking.\n\nThe Lord appeared to a disciple named Ananias, commanding him to go to Saul. Though Ananias feared Saul's reputation, the Lord said, 'Go thy way: for he is a chosen vessel unto me, to bear my name before the Gentiles, and kings, and the children of Israel.'\n\nAnanias went and laid his hands on Saul, saying, 'Brother Saul, the Lord, even Jesus, hath sent me, that thou mightest receive thy sight, and be filled with the Holy Ghost.' Immediately there fell from his eyes as it had been scales, and he received sight forthwith, and arose and was baptized.\n\nStraightway he preached Christ in the synagogues, that he is the Son of God. All that heard him were amazed. The greatest persecutor had become the greatest preacher.",
      "kids_title": "Saul Meets Jesus on the Road",
      "kids_description": "Saul, who hurt Christians, meets Jesus in a bright light and becomes Paul, one of Jesus's greatest followers.",
      "kids_narrative": "There was a man named Saul who hated people who loved Jesus. He thought they were wrong, and he wanted to stop them from telling others about Jesus. Saul went from town to town finding Christians and putting them in jail. Now Saul was going to a city called Damascus to arrest more Christians.\n\nBut something amazing happened while Saul was walking on the road! Suddenly, a bright light from heaven shined all around him. It was brighter than the sun! Saul fell down on the ground, and he heard a voice saying, 'Saul, Saul, why are you hurting me?'\n\nSaul was confused and asked, 'Who are you, Lord?' The voice answered, 'I am Jesus, the one you are hurting!' Saul realized that when he hurt people who loved Jesus, he was actually hurting Jesus Himself!\n\nJesus told Saul to get up and go into the city. When Saul stood up and opened his eyes, he couldn't see anything! The bright light had made him blind. His friends had to hold his hand and lead him into Damascus. For three days, Saul couldn't see, and he didn't eat or drink anything. He just prayed and prayed.\n\nGod spoke to a Christian man named Ananias and told him to go visit Saul. Ananias was scared because he had heard that Saul hurt Christians! But God said, 'Don't be afraid. I have chosen Saul to tell people all over the world about me.'\n\nSo Ananias went to Saul and put his hands on him. He said, 'Brother Saul, Jesus sent me so you can see again!' Right away, something like scales fell off Saul's eyes, and he could see! Saul was baptized and became a follower of Jesus. The man who used to hurt Christians became one of the greatest teachers about Jesus ever!"
    }
  ]
}
