{"1:1":"called to be an apostle of Jesus Christ through the will of God","1:2":"called to be saints","1:3":"Grace be unto you","1:4":"for the grace of God which was given you in Christ Jesus;","1:5":"in all speech and all knowledge;","1:6":"Even as the testimony of Christ was confirmed in you:","1:7":"So that ye come behind in no gift; waiting for the coming of our Lord Jesus Christ:","1:8":"blameless in the day of our Lord Jesus Christ.","1:9":"through whom you were called into the fellowship of his Son","1:10":"brothers","1:11":"my brothers","1:12":"that each one of you says","1:13":"Is Christ divided? was Paul crucified for you? or were ye baptized in the name of Paul?","1:14":"except Crispus and Gaius","1:15":"Lest any should say that I had baptized in mine own name.","1:16":"I don't know whether I baptized any other.)","1:17":"but to preach the Good News-- not in wisdom of words","1:18":"but to us who are saved it is the power of God.","1:19":"I will destroy the wisdom of the wise, I will bring the discernment of the discerning to nothing.{Isaiah 29:14}","1:20":"Where is the wise? where is the scribe? where is the disputer of this world? hath not God made foolish the wisdom of this world?","1:21":"the world through its wisdom didn't know God","1:22":"Greeks seek after wisdom","1:23":"and foolishness to Greeks","1:24":"both Jews and Greeks","1:25":"and the weakness of God is stronger than men.","1:26":"brothers","1:27":"that he might put to shame the things that are strong;","1:28":"and the things that are despised","1:29":"That no flesh should glory in his presence.","1:30":"you are in Christ Jesus","1:31":"according as it is written","2:1":"brothers","2:2":"except Jesus Christ","2:3":"in fear","2:4":"but in demonstration of the Spirit and of power","2:5":"but in the power of God.","2:6":"however","2:7":"the wisdom that has been hidden","2:8":"they wouldn't have crucified the Lord of glory.","2:9":"Things which an eye didn't see, and an ear didn't hear, which didn't enter into the heart of man, these God has prepared for those who love him.{Isaiah 64:4}","2:10":"God revealed them through the Spirit. For the Spirit searches all things","2:11":"except the spirit of the man","2:12":"not the spirit of the world","2:13":"not in words which man's wisdom teaches","2:14":"for they are foolishness to him","2:15":"and he himself is judged by no one.","2:16":"For who hath known the mind of the Lord","3:1":"I couldn't speak to you as to spiritual","3:2":"not with meat; for you weren't yet ready. Indeed","3:3":"strife","3:4":"I follow Paul, and another","3:5":"and who is Paul","3:6":"I have planted","3:7":"nor he who waters","3:8":"but each will receive his own reward according to his own labor.","3:9":"God's building.","3:10":"as a wise master builder I laid a foundation","3:11":"which is Jesus Christ.","3:12":"silver","3:13":"because it is revealed in fire; and the fire itself will test what sort of work each man's work is.","3:14":"he will receive a reward.","3:15":"he will suffer loss","3:16":"and that God's Spirit lives in you?","3:17":"God will destroy him; for God's temple is holy","3:18":"let him become a fool","3:19":"He has taken the wise in their craftiness.{Job 5:13}","3:20":"The Lord knows the reasoning of the wise, that it is worthless.{Psalm 94:11}","3:21":"","3:22":"or Apollos","3:23":"and Christ is God's.","4:1":"and stewards of God's mysteries.","4:2":"moreover","4:3":"or by man's judgment.  Yes","4:4":"but he who judges me is the Lord.","4:5":"until the Lord comes","4:6":"brothers","4:7":"why do you boast as if you had not received it?","4:8":"and I wish that you did reign","4:9":"I think that God has displayed us","4:10":"but you are wise in Christ. We are weak","4:11":"thirst","4:12":"working with our own hands.  When people curse us","4:13":"we entreat.  We are made as the filth of the world","4:14":"but to admonish you as my beloved children.","4:15":"yet not many fathers.  For in Christ Jesus","4:16":"be imitators of me.","4:17":"who is my beloved and faithful child in the Lord","4:18":"as though I were not coming to you.","4:19":"if the Lord is willing. And I will know","4:20":"but in power.","4:21":"or in love and a spirit of gentleness?","5:1":"and such sexual immorality as is not even named among the Gentiles","5:2":"and didn't rather mourn","5:3":"as being absent in body but present in spirit","5:4":"you being gathered together","5:5":"that the spirit may be saved in the day of the Lord Jesus.","5:6":"Your glorying is not good. Know ye not that a little leaven leaveneth the whole lump?","5:7":"that you may be a new lump","5:8":"not with old yeast","5:9":"I wrote unto you in an epistle not to company with fornicators:","5:10":"or with the covetous and extortioners","5:11":"I wrote to you not to associate with anyone who is called a brother who is a sexual sinner","5:12":"For what have I to do to judge them also that are without? do not ye judge them that are within?","5:13":"God judges.  Put away the wicked man from among yourselves.{Deuteronomy 17:7; 19:19; 21:21; 22:21; 24:7}","6:1":"having a matter against his neighbor","6:2":"are you unworthy to judge the smallest matters?","6:3":"things that pertain to this life?","6:4":"you have to judge things pertaining to this life","6:5":"I speak to your shame. Is it so","6:6":"and that before unbelievers!","6:7":"that you have lawsuits one with another.  Why not rather be wronged? Why not rather be defrauded?","6:8":"but you yourselves do wrong","6:9":"nor idolaters","6:10":"nor covetous","6:11":"but you were washed.  But you were sanctified. But you were justified in the name of the Lord Jesus","6:12":"All things are lawful unto me","6:13":"but for the Lord; and the Lord for the body.","6:14":"and will also raise us up by his power.","6:15":"and make them members of a prostitute? May it never be!","6:16":"The two, says he","6:17":"But he that is joined unto the Lord is one spirit.","6:18":"Flee fornication. Every sin that a man doeth is without the body; but he that committeth fornication sinneth against his own body.","6:19":"which you have from God?  You are not your own","6:20":"which are God's.","7:1":"Now concerning the things whereof ye wrote unto me: It is good for a man not to touch a woman.","7:2":"because of sexual immoralities","7:3":"and likewise also the wife to her husband.","7:4":"but the husband. Likewise also the husband doesn't have authority over his own body","7:5":"unless it is by consent for a season","7:6":"not of commandment.","7:7":"one of this kind","7:8":"it is good for them if they remain even as I am.","7:9":"let them marry. For it's better to marry than to burn.","7:10":"but the Lord--that the wife not leave her husband","7:11":"let her remain unmarried","7:12":"if any brother has an unbelieving wife","7:13":"and he is content to live with her","7:14":"and the unbelieving wife is sanctified in the husband. Otherwise your children would be unclean","7:15":"let there be separation. The brother or the sister is not under bondage in such cases","7:16":"wife","7:17":"as the Lord has distributed to each man","7:18":"Is any man called being circumcised? let him not become uncircumcised. Is any called in uncircumcision? let him not be circumcised.","7:19":"and uncircumcision is nothing","7:20":"Let every man abide in the same calling wherein he was called.","7:21":"but if you get an opportunity to become free","7:22":"For he that is called in the Lord","7:23":"Ye are bought with a price; be not ye the servants of men.","7:24":"let each man","7:25":"I have no commandment from the Lord","7:26":"because of the distress that is on us","7:27":"Art thou bound unto a wife? seek not to be loosed. Art thou loosed from a wife? seek not a wife.","7:28":"you have not sinned.  If a virgin marries","7:29":"brothers:  the time is short","7:30":"as though they didn't weep; and those who rejoice","7:31":"as not using it to the fullest. For the mode of this world passes away.","7:32":"how he may please the Lord;","7:33":"how he may please his wife.","7:34":"that she may be holy both in body and in spirit. But she who is married cares about the things of the world-- how she may please her husband.","7:35":"but for that which is appropriate","7:36":"if she is past the flower of her age","7:37":"having no necessity","7:38":"and he who doesn't give her in marriage does better.","7:39":"she is free to be married to whoever she desires","7:40":"in my judgment","8:1":"but love builds up.","8:2":"he doesn't yet know as he ought to know.","8:3":"the same is known by him.","8:4":"we know that no idol is anything in the world","8:5":"For though there be that are called gods","8:6":"the Father","8:7":"that knowledge isn't in all men.  But some","8:8":"if we don't eat","8:9":"But take heed lest by any means this liberty of your's become a stumblingblock to them that are weak.","8:10":"won't his conscience","8:11":"he who is weak perishes","8:12":"sinning against the brothers","8:13":"if food causes my brother to stumble","9:1":"our Lord?  Aren't you my work in the Lord?","9:2":"yet at least I am to you; for you are the seal of my apostleship in the Lord.","9:3":"Mine answer to them that do examine me is this","9:4":"Have we not power to eat and to drink?","9:5":"even as the rest of the apostles","9:6":"Or I only and Barnabas","9:7":"and doesn't eat of its fruit? Or who feeds a flock","9:8":"Say I these things as a man? or saith not the law the same also?","9:9":"You shall not muzzle an ox while it treads out the grain.{Deuteronomy 25:4} Is it for the oxen that God cares","9:10":"it was written for our sake","9:11":"is it a great thing if we reap your fleshly things?","9:12":"don't we yet more? Nevertheless we did not use this right","9:13":"and those who wait on the altar have their portion with the altar?","9:14":"Even so hath the Lord ordained that they which preach the gospel should live of the gospel.","9:15":"and I don't write these things that it may be done so in my case; for I would rather die","9:16":"I have nothing to boast about; for necessity is laid on me; but woe is to me","9:17":"I have a reward. But if not of my own will","9:18":"when I preach the Good News","9:19":"I brought myself under bondage to all","9:20":"that I might gain Jews; to those who are under the law","9:21":"as without law (not being without law toward God","9:22":"that I might gain the weak. I have become all things to all men","9:23":"that I may be a joint partaker of it.","9:24":"but one receives the prize?  Run like that","9:25":"but we an incorruptible.","9:26":"as not uncertainly.  I fight like that","9:27":"lest by any means","10:1":"brothers","10:2":"And were all baptized unto Moses in the cloud and in the sea;","10:3":"And did all eat the same spiritual meat;","10:4":"and the rock was Christ.","10:5":"God was not well pleased","10:6":"to the intent we should not lust after evil things","10:7":"as some of them were.  As it is written","10:8":"as some of them committed","10:9":"as some of them tested","10:10":"as some of them also grumbled","10:11":"and they were written for our admonition","10:12":"Wherefore let him that thinketh he standeth take heed lest he fall.","10:13":"who will not allow you to be tempted above what you are able","10:14":"my beloved","10:15":"I speak as to wise men; judge ye what I say.","10:16":"isn't it a communion of the blood of Christ?  The bread which we break","10:17":"we","10:18":"Behold Israel after the flesh: are not they which eat of the sacrifices partakers of the altar?","10:19":"or that an idol is anything?","10:20":"they sacrifice to demons","10:21":"and of the table of demons.","10:22":"Do we provoke the Lord to jealousy? are we stronger than he?","10:23":"All things are lawful for me","10:24":"but each one his neighbor's good.","10:25":"eat","10:26":"For the earth is the Lord's","10:27":"and you are inclined to go","10:28":"This was offered to idols, don't eat it for the sake of the one who told you","10:29":"I say","10:30":"why am I denounced for that for which I give thanks?","10:31":"or drink","10:32":"either to Jews","10:33":"not seeking my own profit","11:1":"even as I also am of Christ.","11:2":"brothers","11:3":"and the head of the woman is the man","11:4":"having his head covered","11:5":"But every woman that prayeth or prophesieth with her head uncovered dishonoureth her head: for that is even all one as if she were shaven.","11:6":"let her also be shorn. But if it is shameful for a woman to be shorn or shaved","11:7":"because he is the image and glory of God","11:8":"but woman from man;","11:9":"but woman for the man.","11:10":"because of the angels.","11:11":"neither is the woman independent of the man","11:12":"so a man also comes through a woman; but all things are from God.","11:13":"Judge in yourselves: is it comely that a woman pray unto God uncovered?","11:14":"it is a dishonor to him?","11:15":"it is a glory to her","11:16":"we have no such custom","11:17":"I don't praise you","11:18":"when you come together in the assembly","11:19":"that those who are approved may be revealed among you.","11:20":"it is not the Lord's supper that you eat.","11:21":"and another is drunken.","11:22":"don't you have houses to eat and to drink in? Or do you despise God's assembly","11:23":"that the Lord Jesus on the night in which he was betrayed took bread.","11:24":"he broke it","11:25":"after supper","11:26":"you proclaim the Lord's death until he comes.","11:27":"Wherefore whosoever shall eat this bread","11:28":"and so let him eat of the bread","11:29":"if he doesn't discern the Lord's body.","11:30":"and not a few sleep.","11:31":"we wouldn't be judged.","11:32":"we are punished by the Lord","11:33":"my brothers","11:34":"let him eat at home","12:1":"brothers","12:2":"you were led away to those mute idols","12:3":"Jesus is accursed.  No one can say","12:4":"but the same Spirit.","12:5":"and the same Lord.","12:6":"but the same God","12:7":"But the manifestation of the Spirit is given to every man to profit withal.","12:8":"and to another the word of knowledge","12:9":"by the same Spirit; and to another gifts of healings","12:10":"To another the working of miracles; to another prophecy; to another discerning of spirits; to another divers kinds of tongues; to another the interpretation of tongues:","12:11":"distributing to each one separately as he desires.","12:12":"and has many members","12:13":"whether Jews or Greeks","12:14":"but many.","12:15":"Because I'm not the hand, I'm not part of the body, it is not therefore not part of the body.","12:16":"Because I'm not the eye, I'm not part of the body, it's not therefore not part of the body.","12:17":"where would the hearing be? If the whole were hearing","12:18":"each one of them","12:19":"where would the body be?","12:20":"but one body.","12:21":"I have no need for you, or again the head to the feet","12:22":"much rather","12:23":"on those we bestow more abundant honor; and our unpresentable parts have more abundant propriety;","12:24":"giving more abundant honor to the inferior part","12:25":"but that the members should have the same care for one another.","12:26":"all the members suffer with it. Or when one member is honored","12:27":"and members individually.","12:28":"second prophets","12:29":"Are all apostles? are all prophets? are all teachers? are all workers of miracles?","12:30":"Have all the gifts of healing? do all speak with tongues? do all interpret?","12:31":"I show a most excellent way to you.","13:1":"but don't have love","13:2":"and know all mysteries and all knowledge; and if I have all faith","13:3":"and if I give my body to be burned","13:4":"is not proud","13:5":"doesn't seek its own way","13:6":"but rejoices with the truth;","13:7":"believes all things","13:8":"they will be done away with.  Where there are various languages","13:9":"and we prophesy in part;","13:10":"then that which is partial will be done away with.","13:11":"I spoke as a child","13:12":"dimly","13:13":"hope","14:1":"and earnestly desire spiritual gifts","14:2":"but to God; for no one understands; but in the Spirit he speaks mysteries.","14:3":"exhortation","14:4":"but he who prophesies edifies the assembly.","14:5":"but rather that you would prophesy.  For he is greater who prophesies than he who speaks with other languages","14:6":"brothers","14:7":"giving a voice","14:8":"who would prepare himself for war?","14:9":"unless you uttered by the tongue words easy to understand","14:10":"it may be","14:11":"I would be to him who speaks a foreigner","14:12":"since you are zealous for spiritual gifts","14:13":"Wherefore let him that speaketh in an unknown tongue pray that he may interpret.","14:14":"my spirit prays","14:15":"and I will pray with the understanding also.  I will sing with the spirit","14:16":"how will he who fills the place of the unlearned say the Amen at your giving of thanks","14:17":"but the other person is not built up.","14:18":"I speak with other languages more than you all.","14:19":"that I might instruct others also","14:20":"don't be children in thoughts","14:21":"By men of strange languages and by the lips of strangers I will speak to this people. Not even thus will they hear me, says the Lord.{Isaiah 28:11-12}","14:22":"not to those who believe","14:23":"and unlearned or unbelieving people come in","14:24":"and someone unbelieving or unlearned comes in","14:25":"declaring that God is among you indeed.","14:26":"brothers?  When you come together","14:27":"let it be two","14:28":"let him keep silent in the assembly","14:29":"two or three","14:30":"let the first keep silent.","14:31":"that all may learn","14:32":"","14:33":"but of peace. As in all the assemblies of the saints","14:34":"for it has not been permitted for them to speak; but let them be in subjection","14:35":"let them ask their own husbands at home","14:36":"What? came the word of God out from you? or came it unto you only?","14:37":"or spiritual","14:38":"let him be ignorant.","14:39":"brothers","14:40":"Let all things be done decently and in order.","15:1":"brothers","15:2":"if you hold firmly the word which I preached to you--unless you believed in vain.","15:3":"","15:4":"that he was raised on the third day according to the Scriptures","15:5":"then to the twelve.","15:6":"most of whom remain until now","15:7":"then to all the apostles","15:8":"as to the child born at the wrong time","15:9":"who is not worthy to be called an apostle","15:10":"but I worked more than all of them; yet not I","15:11":"so we preach","15:12":"that he has been raised from the dead","15:13":"neither has Christ been raised.","15:14":"then our preaching is in vain","15:15":"we are found false witnesses of God","15:16":"neither has Christ been raised.","15:17":"your faith is vain; you are still in your sins.","15:18":"Then they also which are fallen asleep in Christ are perished.","15:19":"we are of all men most pitiable.","15:20":"But now is Christ risen from the dead","15:21":"the resurrection of the dead also came by man.","15:22":"so also in Christ all will be made alive.","15:23":"then those who are Christ's","15:24":"when he will deliver up the Kingdom to God","15:25":"For he must reign","15:26":"The last enemy that shall be destroyed is death.","15:27":"He put all things in subjection under his feet.{Psalm 8:6} But when he says","15:28":"then the Son will also himself be subjected to him who subjected all things to him","15:29":"why then are they baptized for the dead?","15:30":"And why stand we in jeopardy every hour?","15:31":"by the boasting in you which I have in Christ Jesus our Lord","15:32":"what does it profit me?  If the dead are not raised","15:33":"Be not deceived: evil communications corrupt good manners.","15:34":"and don't sin","15:35":"How are the dead raised? and","15:36":"that which you yourself sow is not made alive unless it dies.","15:37":"you don't sow the body that will be","15:38":"and to each seed a body of its own.","15:39":"but there is one flesh of men","15:40":"and terrestrial bodies; but the glory of the celestial differs from that of the terrestrial.","15:41":"another glory of the moon","15:42":"So also is the resurrection of the dead. It is sown in corruption; it is raised in incorruption:","15:43":"It is sown in dishonour; it is raised in glory: it is sown in weakness; it is raised in power:","15:44":"It is sown a natural body; it is raised a spiritual body. There is a natural body","15:45":"The first man, Adam, became a living soul.{Genesis 2:7} The last Adam became a life-giving spirit.","15:46":"but that which is natural","15:47":"made of dust.  The second man is the Lord from heaven.","15:48":"such are those who are also made of dust; and as is the heavenly","15:49":"let's{NU","15:50":"brothers","15:51":"I tell you a mystery.  We will not all sleep","15:52":"in the twinkling of an eye","15:53":"and this mortal must put on immortality.","15:54":"and this mortal will have put on immortality","15:55":"O death","15:56":"and the power of sin is the law.","15:57":"who gives us the victory through our Lord Jesus Christ.","15:58":"my beloved brothers","16:1":"as I commanded the assemblies of Galatia","16:2":"let each one of you save","16:3":"I will send whoever you approve with letters to carry your gracious gift to Jerusalem.","16:4":"they will go with me.","16:5":"for I am passing through Macedonia.","16:6":"or even winter","16:7":"but I hope to stay a while with you","16:8":"","16:9":"and there are many adversaries.","16:10":"see that he is with you without fear","16:11":"that he may come to me; for I expect him with the brothers.","16:12":"the brother","16:13":"Watch ye","16:14":"Let all your things be done with charity.","16:15":"brothers (you know the house of Stephanas","16:16":"and to everyone who helps in the work and labors.","16:17":"Fortunatus","16:18":"For they have refreshed my spirit and your's: therefore acknowledge ye them that are such.","16:19":"together with the assembly that is in their house.","16:20":"All the brethren greet you. Greet ye one another with an holy kiss.","16:21":"Paul","16:22":"let him be accursed{Greek: anathema.}. Come","16:23":"The grace of our Lord Jesus Christ be with you.","16:24":"My love be with you all in Christ Jesus. Amen."}