{"1:1":"but he got no heat.","1:2":"Let there be sought for my lord the king a young virgin:  and let her stand before the king","1:3":"and found Abishag the Shunammite","1:4":"and ministered to him; but the king didn't know her intimately.","1:5":"saying","1:6":"Why have you done so? and he was also a very goodly man; and he was born after Absalom.","1:7":"and with Abiathar the priest:  and they following Adonijah helped him.","1:8":"and Benaiah the son of Jehoiada","1:9":"which is beside En Rogel; and he called all his brothers","1:10":"and Benaiah","1:11":"saying","1:12":"please let me give you counsel","1:13":"and tell him","1:14":"while you yet talk there with the king","1:15":"And Bathsheba went in unto the king into the chamber: and the king was very old; and Abishag the Shunammite ministered unto the king.","1:16":"and did obeisance to the king.  The king said","1:17":"My lord","1:18":"behold","1:19":"and has called all the sons of the king","1:20":"my lord the king","1:21":"when my lord the king shall sleep with his fathers","1:22":"while she yet talked with the king","1:23":"saying","1:24":"My lord","1:25":"and has slain oxen and fatlings and sheep in abundance","1:26":"even me your servant","1:27":"and you haven't shown to your servants who should sit on the throne of my lord the king after him?","1:28":"Call to me Bathsheba. She came into the king's presence","1:29":"and said","1:30":"the God of Israel","1:31":"and did obeisance to the king","1:32":"Call to me Zadok the priest","1:33":"Take with you the servants of your lord","1:34":"and say","1:35":"and he shall come and sit on my throne; for he shall be king in my place; and I have appointed him to be prince over Israel and over Judah.","1:36":"and said","1:37":"even so be he with Solomon","1:38":"and Nathan the prophet","1:39":"and anointed Solomon.  They blew the trumpet; and all the people said","1:40":"and the people piped with pipes","1:41":"he said","1:42":"behold","1:43":"Most certainly our lord king David has made Solomon king:","1:44":"and Nathan the prophet","1:45":"so that the city rang again.  This is the noise that you have heard.","1:46":"And also Solomon sitteth on the throne of the kingdom.","1:47":"saying","1:48":"Blessed be Yahweh","1:49":"and rose up","1:50":"and went","1:51":"saying","1:52":"If he shall show himself a worthy man","1:53":"and they brought him down from the altar. He came and did obeisance to king Solomon; and Solomon said to him","2:1":"saying","2:2":"and show yourself a man;","2:3":"to walk in his ways","2:4":"saying","2:5":"even what he did to the two captains of the armies of Israel","2:6":"and don't let his gray head go down to Sheol in peace.","2:7":"and let them be of those who eat at your table; for so they came to me when I fled from Absalom your brother.","2:8":"there is with you Shimei the son of Gera","2:9":"for you are a wise man; and you will know what you ought to do to him","2:10":"and was buried in the city of David.","2:11":"and thirty-three years reigned he in Jerusalem.","2:12":"Then sat Solomon upon the throne of David his father; and his kingdom was established greatly.","2:13":"Come you peaceably? He said","2:14":"I have somewhat to tell you. She said","2:15":"You know that the kingdom was mine","2:16":"Say on.","2:17":"Please speak to Solomon the king (for he will not tell you 'no'), that he give me Abishag the Shunammite as wife.","2:18":"Well; I will speak for you to the king.","2:19":"to speak to him for Adonijah.  The king rose up to meet her","2:20":"I ask one small petition of you; don't deny me. The king said to her","2:21":"Let Abishag the Shunammite be given to Adonijah your brother as wife.","2:22":"Why do you ask Abishag the Shunammite for Adonijah? ask for him the kingdom also; for he is my elder brother; even for him","2:23":"saying","2:24":"who has established me","2:25":"so that he died.","2:26":"Get you to Anathoth","2:27":"that he might fulfill the word of Yahweh","2:28":"though he didn't turn after Absalom.  Joab fled to the Tent of Yahweh","2:29":"Joab is fled to the Tent of Yahweh","2:30":"and said to him","2:31":"Do as he has said","2:32":"because he fell on two men more righteous and better than he","2:33":"and on the head of his seed forever:  but to David","2:34":"and fell on him","2:35":"And the king put Benaiah the son of Jehoiada in his room over the host: and Zadok the priest did the king put in the room of Abiathar.","2:36":"and said to him","2:37":"and pass over the brook Kidron","2:38":"The saying is good: as my lord the king has said","2:39":"that two of the servants of Shimei ran away to Achish","2:40":"and saddled his donkey","2:41":"and was come again.","2:42":"and said to him","2:43":"and the commandment that I have charged you with?","2:44":"You know all the wickedness which your heart is privy to","2:45":"and the throne of David shall be established before Yahweh forever.","2:46":"and fell on him","3:1":"and took Pharaoh's daughter","3:2":"because there was no house built for the name of Yahweh until those days.","3:3":"walking in the statutes of David his father: only he sacrificed and burnt incense in the high places.","3:4":"And the king went to Gibeon to sacrifice there; for that was the great high place: a thousand burnt offerings did Solomon offer upon that altar.","3:5":"Ask what I shall give you.","3:6":"You have shown to your servant David my father great loving kindness","3:7":"Yahweh my God","3:8":"a great people","3:9":"that I may discern between good and evil; for who is able to judge this your great people?","3:10":"that Solomon had asked this thing.","3:11":"Because you have asked this thing","3:12":"I have done according to your word:  behold","3:13":"both riches and honor","3:14":"to keep my statutes and my commandments","3:15":"it was a dream:  and he came to Jerusalem","3:16":"to the king","3:17":"Oh","3:18":"that this woman was delivered also; and we were together; there was no stranger with us in the house","3:19":"because she lay on it.","3:20":"and took my son from beside me","3:21":"behold","3:22":"No; but the living is my son","3:23":"The one says","3:24":"Get me a sword.  They brought a sword before the king.","3:25":"Divide the living child in two","3:26":"for her heart yearned over her son","3:27":"Give her the living child","3:28":"to do justice.","4:1":"So king Solomon was king over all Israel.","4:2":"the priest;","4:3":"the sons of Shisha","4:4":"And Benaiah the son of Jehoiada was over the host: and Zadok and Abiathar were the priests:","4:5":"[and] the king's friend;","4:6":"And Ahishar was over the household: and Adoniram the son of Abda was over the tribute.","4:7":"who provided food for the king and his household:  each man had to make provision for a month in the year.","4:8":"in the hill country of Ephraim;","4:9":"in Makaz","4:10":"in Arubboth (to him [pertained] Socoh","4:11":"in all the height of Dor (he had Taphath the daughter of Solomon as wife);","4:12":"in Taanach and Megiddo","4:13":"in Ramoth Gilead (to him [pertained] the towns of Jair the son of Manasseh","4:14":"in Mahanaim;","4:15":"in Naphtali (he also took Basemath the daughter of Solomon as wife);","4:16":"in Asher and Bealoth;","4:17":"in Issachar;","4:18":"in Benjamin;","4:19":"in the land of Gilead","4:20":"eating and drinking and making merry.","4:21":"and to the border of Egypt: they brought tribute","4:22":"and sixty measures of meal","4:23":"and twenty oxen out of the pastures","4:24":"from Tiphsah even to Gaza","4:25":"every man under his vine and under his fig tree","4:26":"and twelve thousand horsemen.","4:27":"and for all who came to king Solomon's table","4:28":"every man according to his charge.","4:29":"and very great understanding","4:30":"and all the wisdom of Egypt.","4:31":"and Heman","4:32":"And he spake three thousand proverbs: and his songs were a thousand and five.","4:33":"from the cedar that is in Lebanon even to the hyssop that springs out of the wall; he spoke also of animals","4:34":"from all kings of the earth","5:1":"And Hiram king of Tyre sent his servants unto Solomon; for he had heard that they had anointed him king in the room of his father: for Hiram was ever a lover of David.","5:2":"saying","5:3":"until Yahweh put them under the soles of his feet.","5:4":"nor evil occurrence.","5:5":"I purpose to build a house for the name of Yahweh my God","5:6":"Now therefore command thou that they hew me cedar trees out of Lebanon; and my servants shall be with thy servants: and unto thee will I give hire for thy servants according to all that thou shalt appoint: for thou knowest that there is not among us any that can skill to hew timber like unto the Sidonians.","5:7":"when Hiram heard the words of Solomon","5:8":"saying","5:9":"and will cause them to be broken up there","5:10":"So Hiram gave Solomon cedar trees and fir trees according to all his desire.","5:11":"and twenty measures of pure oil: thus gave Solomon to Hiram year by year.","5:12":"as he promised him; and there was peace between Hiram and Solomon; and they two made a league together.","5:13":"And king Solomon raised a levy out of all Israel; and the levy was thirty thousand men.","5:14":"ten thousand a month by courses; a month they were in Lebanon","5:15":"and eighty thousand who were stone cutters in the mountains;","5:16":"three thousand and three hundred","5:17":"and they hewed out great stones","5:18":"and prepared the timber and the stones to build the house.","6:1":"in the fourth year of Solomon's reign over Israel","6:2":"the length of it was sixty cubits","6:3":"twenty cubits was the length of it","6:4":"And for the house he made windows of narrow lights.","6:5":"against the walls of the house round about","6:6":"and the middle was six cubits broad","6:7":"when it was in building","6:8":"and out of the middle into the third.","6:9":"and finished it; and he covered the house with beams and planks of cedar.","6:10":"each five cubits high: and they rested on the house with timber of cedar.","6:11":"saying","6:12":"if you will walk in my statutes","6:13":"and will not forsake my people Israel.","6:14":"and finished it.","6:15":"he covered them on the inside with wood; and he covered the floor of the house with boards of fir.","6:16":"for an oracle","6:17":"that is","6:18":"carved with buds and open flowers:  all was cedar; there was no stone seen.","6:19":"to set there the ark of the covenant of Yahweh.","6:20":"and twenty cubits in breadth","6:21":"So Solomon overlaid the house within with pure gold: and he made a partition by the chains of gold before the oracle; and he overlaid it with gold.","6:22":"until all the house was finished:  also the whole altar that belonged to the oracle he overlaid with gold.","6:23":"each ten cubits high.","6:24":"and five cubits the other wing of the cherub:  from the uttermost part of the one wing to the uttermost part of the other were ten cubits.","6:25":"And the other cherub was ten cubits: both the cherubim were of one measure and one size.","6:26":"and so was it of the other cherub.","6:27":"so that the wing of the one touched the one wall","6:28":"And he overlaid the cherubim with gold.","6:29":"inside and outside.","6:30":"inside and outside.","6:31":"And for the entering of the oracle he made doors of olive tree: the lintel and side posts were a fifth part of the wall.","6:32":"and overlaid them with gold; and he spread the gold on the cherubim","6:33":"out of a fourth part [of the wall];","6:34":"and the two leaves of the other door were folding.","6:35":"And he carved thereon cherubim and palm trees and open flowers: and covered them with gold fitted upon the carved work.","6:36":"and a course of cedar beams.","6:37":"in the month Ziv.","6:38":"in the month Bul","7:1":"and he finished all his house.","7:2":"and the breadth of it fifty cubits","7:3":"that were on the pillars; fifteen in a row.","7:4":"and window was over against window in three ranks.","7:5":"And all the doors and posts were square","7:6":"and the breadth of it thirty cubits; and a porch before them; and pillars and a threshold before them.","7:7":"even the porch of judgment:  and it was covered with cedar from floor to floor.","7:8":"the other court within the porch","7:9":"even of hewn stone","7:10":"even great stones","7:11":"even hewn stone","7:12":"and a course of cedar beams; like as the inner court of the house of Yahweh","7:13":"And king Solomon sent and fetched Hiram out of Tyre.","7:14":"and his father was a man of Tyre","7:15":"eighteen cubits high apiece:  and a line of twelve cubits compassed either of them about.","7:16":"to set on the tops of the pillars:  the height of the one capital was five cubits","7:17":"and wreaths of chain work","7:18":"to cover the capitals that were on the top of the pillars:  and so did he for the other capital.","7:19":"four cubits.","7:20":"close by the belly which was beside the network: and the pomegranates were two hundred","7:21":"and called the name of it Jachin; and he set up the left pillar","7:22":"And upon the top of the pillars was lily work: so was the work of the pillars finished.","7:23":"round in compass","7:24":"for ten cubits","7:25":"three looking toward the north","7:26":"like the flower of a lily: it held two thousand baths.","7:27":"and four cubits the breadth of it","7:28":"And the work of the bases was on this manner: they had borders","7:29":"oxen","7:30":"and axles of brass; and the four feet of it had supports:  beneath the basin were the supports molten","7:31":"a cubit and a half; and also on the mouth of it were engravings","7:32":"And under the borders were four wheels; and the axletrees of the wheels were joined to the base: and the height of a wheel was a cubit and half a cubit.","7:33":"and their rims","7:34":"And there were four undersetters to the four corners of one base: and the undersetters were of the very base itself.","7:35":"And in the top of the base was there a round compass of half a cubit high: and on the top of the base the ledges thereof and the borders thereof were of the same.","7:36":"and on the panels of it","7:37":"one measure","7:38":"Then made he ten lavers of brass: one laver contained forty baths: and every laver was four cubits: and upon every one of the ten bases one laver.","7:39":"five on the right side of the house","7:40":"and the shovels","7:41":"and the two bowls of the capitals that were on the top of the pillars; and the two networks to cover the two bowls of the capitals that were on the top of the pillars;","7:42":"to cover the two bowls of the capitals that were on the pillars;","7:43":"and the ten basins on the bases;","7:44":"and the twelve oxen under the sea;","7:45":"and the shovels","7:46":"in the clay ground between Succoth and Zarethan.","7:47":"because they were exceeding many:  the weight of the brass could not be found out.","7:48":"and the table whereupon the show bread was","7:49":"five on the right side","7:50":"and the snuffers","7:51":"[even] the silver","8:1":"and all the heads of the tribes","8:2":"in the month Ethanim","8:3":"and the priests took up the ark.","8:4":"and the tent of meeting","8:5":"who were assembled to him","8:6":"into the oracle of the house","8:7":"and the cherubim covered the ark and the poles of it above.","8:8":"And they drew out the staves","8:9":"when Yahweh made a covenant with the children of Israel","8:10":"when the priests were come out of the holy place","8:11":"So that the priests could not stand to minister because of the cloud: for the glory of the LORD had filled the house of the LORD.","8:12":"Yahweh has said that he would dwell in the thick darkness.","8:13":"a place for you to dwell in forever.","8:14":"and blessed all the assembly of Israel:  and all the assembly of Israel stood.","8:15":"Blessed be Yahweh","8:16":"I chose no city out of all the tribes of Israel to build a house","8:17":"the God of Israel.","8:18":"Whereas it was in your heart to build a house for my name","8:19":"he shall build the house for my name.","8:20":"and sit on the throne of Israel","8:21":"in which is the covenant of Yahweh","8:22":"and spread forth his hands toward heaven;","8:23":"Yahweh","8:24":"you spoke with your mouth","8:25":"Yahweh","8:26":"God of Israel","8:27":"heaven and the heaven of heavens can't contain you; how much less this house that I have built!","8:28":"and for his supplication","8:29":"even toward the place of which you have said","8:30":"and of your people Israel","8:31":"and an oath be laid on him to cause him to swear","8:32":"and do","8:33":"because they have sinned against you; if they turn again to you","8:34":"and forgive the sin of your people Israel","8:35":"and there is no rain","8:36":"and forgive the sin of your servants","8:37":"if there be pestilence","8:38":"[or] by all your people Israel","8:39":"your dwelling place","8:40":"That they may fear thee all the days that they live in the land which thou gavest unto our fathers.","8:41":"who is not of your people Israel","8:42":"and of your mighty hand","8:43":"your dwelling place","8:44":"by whatever way you shall send them","8:45":"and maintain their cause.","8:46":"and you are angry with them","8:47":"and turn again","8:48":"who carried them captive","8:49":"your dwelling place","8:50":"and all their transgressions in which they have transgressed against you; and give them compassion before those who carried them captive","8:51":"and your inheritance","8:52":"and to the supplication of your people Israel","8:53":"to be your inheritance","8:54":"that when Solomon had made an end of praying all this prayer and supplication to Yahweh","8:55":"and blessed all the assembly of Israel with a loud voice","8:56":"who has given rest to his people Israel","8:57":"as he was with our fathers: let him not leave us","8:58":"to walk in all his ways","8:59":"with which I have made supplication before Yahweh","8:60":"he is God; there is none else.","8:61":"to walk in his statutes","8:62":"and all Israel with him","8:63":"which he offered to Yahweh","8:64":"and the meal offering","8:65":"and all Israel with him","8:66":"and went to their tents joyful and glad of heart for all the goodness that Yahweh had shown to David his servant","9:1":"when Solomon had finished the building of the house of Yahweh","9:2":"as he had appeared to him at Gibeon.","9:3":"I have heard your prayer and your supplication","9:4":"if you will walk before me","9:5":"according as I promised to David your father","9:6":"you or your children","9:7":"which I have made holy for my name","9:8":"yet shall everyone who passes by it be astonished","9:9":"Because they forsook Yahweh their God","9:10":"in which Solomon had built the two houses","9:11":"and with gold","9:12":"And Hiram came out from Tyre to see the cities which Solomon had given him; and they pleased him not.","9:13":"What cities are these which you have given me","9:14":"And Hiram sent to the king sixscore talents of gold.","9:15":"to build the house of Yahweh","9:16":"and taken Gezer","9:17":"and Beth Horon the lower","9:18":"and Tamar in the wilderness","9:19":"and the cities for his chariots","9:20":"the Hittites","9:21":"whom the children of Israel were not able utterly to destroy","9:22":"and his servants","9:23":"five hundred fifty","9:24":"But Pharaoh's daughter came up out of the city of David unto her house which Solomon had built for her: then did he build Millo.","9:25":"burning incense therewith","9:26":"which is beside Eloth","9:27":"sailors who had knowledge of the sea","9:28":"and fetched from there gold","10:1":"she came to prove him with hard questions.","10:2":"with camels that bore spices","10:3":"And Solomon told her all her questions: there was not any thing hid from the king","10:4":"and the house that he had built","10:5":"and the sitting of his servants","10:6":"It was a true report that I heard in my own land of your acts","10:7":"until I came","10:8":"happy are these your servants","10:9":"who delighted in you","10:10":"and of spices very great store","10:11":"that brought gold from Ophir","10:12":"and for the king's house","10:13":"whatever she asked","10:14":"","10:15":"and the traffic of the merchants","10:16":"And king Solomon made two hundred targets of beaten gold: six hundred shekels of gold went to one target.","10:17":"And he made three hundred shields of beaten gold; three pound of gold went to one shield: and the king put them in the house of the forest of Lebanon.","10:18":"and overlaid it with the finest gold.","10:19":"and the top of the throne was round behind; and there were stays on either side by the place of the seat","10:20":"And twelve lions stood there on the one side and on the other upon the six steps: there was not the like made in any kingdom.","10:21":"and all the vessels of the house of the forest of Lebanon were of pure gold: none were of silver; it was nothing accounted of in the days of Solomon.","10:22":"bringing gold","10:23":"So king Solomon exceeded all the kings of the earth for riches and for wisdom.","10:24":"to hear his wisdom","10:25":"vessels of silver","10:26":"and twelve thousand horsemen","10:27":"and cedars made he to be as the sycamore trees that are in the lowland","10:28":"each drove at a price.","10:29":"and a horse for one hundred fifty; and so for all the kings of the Hittites","11:1":"together with the daughter of Pharaoh","11:2":"You shall not go among them","11:3":"princesses","11:4":"when Solomon was old","11:5":"and after Milcom the abomination of the Ammonites.","11:6":"and didn't go fully after Yahweh","11:7":"on the mountain that is before Jerusalem","11:8":"who burnt incense and sacrificed to their gods.","11:9":"because his heart was turned away from Yahweh","11:10":"that he should not go after other gods:  but he didn't keep that which Yahweh commanded.","11:11":"Because this is done of you","11:12":"for David your father's sake:  but I will tear it out of the hand of your son.","11:13":"for David my servant's sake","11:14":"Hadad the Edomite: he was of the king's seed in Edom.","11:15":"when David was in Edom","11:16":"until he had cut off every male in Edom);","11:17":"he and certain Edomites of his father's servants with him","11:18":"and came to Paran; and they took men with them out of Paran","11:19":"so that he gave him as wife the sister of his own wife","11:20":"whom Tahpenes weaned in Pharaoh's house; and Genubath was in Pharaoh's house among the sons of Pharaoh.","11:21":"and that Joab the captain of the army was dead","11:22":"But what have you lacked with me","11:23":"Rezon the son of Eliada","11:24":"and became captain over a troop","11:25":"besides the mischief that Hadad [did]: and he abhorred Israel","11:26":"an Ephraimite of Zeredah","11:27":"and repaired the breach of the city of David his father.","11:28":"and he gave him charge over all the labor of the house of Joseph.","11:29":"when Jeroboam went out of Jerusalem","11:30":"and tore it in twelve pieces.","11:31":"Take ten pieces; for thus says Yahweh","11:32":"for my servant David's sake and for Jerusalem's sake","11:33":"and have worshiped Ashtoreth the goddess of the Sidonians","11:34":"for David my servant's sake whom I chose","11:35":"and will give it to you","11:36":"that David my servant may have a lamp always before me in Jerusalem","11:37":"and you shall reign according to all that your soul desires","11:38":"if you will listen to all that I command you","11:39":"but not forever.","11:40":"and fled into Egypt","11:41":"and all that he did","11:42":"And the time that Solomon reigned in Jerusalem over all Israel was forty years.","11:43":"and was buried in the city of David his father:  and Rehoboam his son reigned in his place.","12:1":"And Rehoboam went to Shechem: for all Israel were come to Shechem to make him king.","12:2":"when Jeroboam the son of Nebat heard of it (for he was yet in Egypt","12:3":"that Jeroboam and all the assembly of Israel came","12:4":"and his heavy yoke which he put on us","12:5":"Depart yet for three days","12:6":"who had stood before Solomon his father while he yet lived","12:7":"saying","12:8":"and took counsel with the young men who had grown up with him","12:9":"What counsel do you give","12:10":"saying","12:11":"I will add to your yoke:  my father chastised you with whips","12:12":"as the king bade","12:13":"and forsook the counsel of the old men which they had given him","12:14":"saying","12:15":"that he might establish his word","12:16":"the people answered the king","12:17":"Rehoboam reigned over them.","12:18":"who was over the men subject to forced labor; and all Israel stoned him to death with stones. King Rehoboam made speed to get him up to his chariot","12:19":"So Israel rebelled against the house of David unto this day.","12:20":"when all Israel heard that Jeroboam was returned","12:21":"he assembled all the house of Judah","12:22":"saying","12:23":"king of Judah","12:24":"You shall not go up","12:25":"and lived therein; and he went out from there","12:26":"Now will the kingdom return to the house of David:","12:27":"then will the heart of this people turn again to their lord","12:28":"and made two calves of gold; and he said to them","12:29":"and the other put he in Dan.","12:30":"even to Dan.","12:31":"and made priests from among all the people","12:32":"on the fifteenth day of the month","12:33":"even in the month which he had devised of his own heart:  and he ordained a feast for the children of Israel","13:1":"there came a man of God out of Judah by the word of Yahweh to Beth El:  and Jeroboam was standing by the altar to burn incense.","13:2":"and said","13:3":"saying","13:4":"when the king heard the saying of the man of God","13:5":"and the ashes poured out from the altar","13:6":"Entreat now the favor of Yahweh your God","13:7":"Come home with me","13:8":"If you will give me half your house","13:9":"saying","13:10":"and didn't return by the way that he came to Bethel.","13:11":"them also they told to their father.","13:12":"Which way did he go? Now his sons had seen which way the man of God went","13:13":"Saddle me the donkey.  So they saddled him the donkey; and he rode thereon.","13:14":"and found him sitting under an oak; and he said to him","13:15":"Come home with me","13:16":"I may not return with you","13:17":"You shall eat no bread nor drink water there","13:18":"I also am a prophet as you are; and an angel spoke to me by the word of Yahweh","13:19":"and ate bread in his house","13:20":"as they sat at the table","13:21":"saying","13:22":"and have eaten bread and drunk water in the place of which he said to you","13:23":"after he had eaten bread","13:24":"a lion met him by the way","13:25":"men passed by","13:26":"he said","13:27":"saying","13:28":"and the donkey and the lion standing by the body:  the lion had not eaten the body","13:29":"and laid it on the donkey","13:30":"[saying]","13:31":"after he had buried him","13:32":"and against all the houses of the high places which are in the cities of Samaria","13:33":"but made again from among all the people priests of the high places: whoever would","13:34":"even to cut it off","14:1":"At that time Abijah the son of Jeroboam fell sick.","14:2":"Please get up and disguise yourself","14:3":"and cakes","14:4":"and arose","14:5":"Behold","14:6":"when Ahijah heard the sound of her feet","14:7":"tell Jeroboam","14:8":"and gave it you; and yet you have not been as my servant David","14:9":"and have gone and made you other gods","14:10":"behold","14:11":"Him that dieth of Jeroboam in the city shall the dogs eat; and him that dieth in the field shall the fowls of the air eat: for the LORD hath spoken it.","14:12":"get you to your house:  [and] when your feet enter into the city","14:13":"and bury him; for he only of Jeroboam shall come to the grave","14:14":"who shall cut off the house of Jeroboam that day: but what? even now.","14:15":"as a reed is shaken in the water; and he will root up Israel out of this good land which he gave to their fathers","14:16":"which he has sinned","14:17":"and departed","14:18":"and mourned for him","14:19":"how he warred","14:20":"and Nadab his son reigned in his place.","14:21":"and he reigned seventeen years in Jerusalem","14:22":"and they provoked him to jealousy with their sins which they committed","14:23":"and pillars","14:24":"And there were also sodomites in the land: and they did according to all the abominations of the nations which the LORD cast out before the children of Israel.","14:25":"that Shishak king of Egypt came up against Jerusalem;","14:26":"and the treasures of the king's house; he even took away all: and he took away all the shields of gold which Solomon had made.","14:27":"and committed them to the hands of the captains of the guard","14:28":"that as often as the king went into the house of Yahweh","14:29":"and all that he did","14:30":"And there was war between Rehoboam and Jeroboam all their days.","14:31":"and was buried with his fathers in the city of David:  and his mother's name was Naamah the Ammonitess. Abijam his son reigned in his place.","15:1":"Now in the eighteenth year of king Jeroboam the son of Nebat reigned Abijam over Judah.","15:2":"Three years reigned he in Jerusalem. and his mother's name was Maachah","15:3":"which he had done before him; and his heart was not perfect with Yahweh his God","15:4":"to set up his son after him","15:5":"and didn't turn aside from anything that he commanded him all the days of his life","15:6":"And there was war between Rehoboam and Jeroboam all the days of his life.","15:7":"and all that he did","15:8":"And Abijam slept with his fathers; and they buried him in the city of David: and Asa his son reigned in his stead.","15:9":"And in the twentieth year of Jeroboam king of Israel reigned Asa over Judah.","15:10":"And forty and one years reigned he in Jerusalem. And his mother's name was Maachah","15:11":"as did David his father.","15:12":"and removed all the idols that his fathers had made.","15:13":"because she had made an abominable image for an Asherah; and Asa cut down her image","15:14":"But the high places were not removed: nevertheless Asa's heart was perfect with the LORD all his days.","15:15":"and the things that himself had dedicated","15:16":"And there was war between Asa and Baasha king of Israel all their days.","15:17":"and built Ramah","15:18":"and the treasures of the king's house","15:19":"between my father and your father:  behold","15:20":"and sent the captains of his armies against the cities of Israel","15:21":"when Baasha heard of it","15:22":"and the timber of it","15:23":"and all his might","15:24":"and was buried with his fathers in the city of David his father; and Jehoshaphat his son reigned in his place.","15:25":"And Nadab the son of Jeroboam began to reign over Israel in the second year of Asa king of Judah","15:26":"and walked in the way of his father","15:27":"of the house of Issachar","15:28":"and reigned in his place.","15:29":"as soon as he was king","15:30":"and with which he made Israel to sin","15:31":"and all that he did","15:32":"And there was war between Asa and Baasha king of Israel all their days.","15:33":"[and reigned] twenty-four years.","15:34":"and walked in the way of Jeroboam","16:1":"saying","16:2":"and made you prince over my people Israel","16:3":"I will utterly sweep away Baasha and his house; and I will make your house like the house of Jeroboam the son of Nebat.","16:4":"Him that dieth of Baasha in the city shall the dogs eat; and him that dieth of his in the fields shall the fowls of the air eat.","16:5":"and what he did","16:6":"and was buried in Tirzah; and Elah his son reigned in his place.","16:7":"and against his house","16:8":"[and reigned] two years.","16:9":"captain of half his chariots","16:10":"and killed him","16:11":"when he began to reign","16:12":"according to the word of Yahweh","16:13":"and the sins of Elah his son","16:14":"and all that he did","16:15":"which belonged to the Philistines.","16:16":"Zimri has conspired","16:17":"and all Israel with him","16:18":"when Zimri saw that the city was taken","16:19":"in walking in the way of Jeroboam","16:20":"and his treason that he did","16:21":"to make him king; and half followed Omri.","16:22":"and Omri reigned.","16:23":"[and reigned] twelve years: six years reigned he in Tirzah.","16:24":"and called the name of the city which he built","16:25":"and dealt wickedly above all who were before him.","16:26":"and in his sins with which he made Israel to sin","16:27":"and his might that he shown","16:28":"and was buried in Samaria; and Ahab his son reigned in his place.","16:29":"And in the thirty and eighth year of Asa king of Judah began Ahab the son of Omri to reign over Israel: and Ahab the son of Omri reigned over Israel in Samaria twenty and two years.","16:30":"And Ahab the son of Omri did evil in the sight of the LORD above all that were before him.","16:31":"as if it had been a light thing for him to walk in the sins of Jeroboam the son of Nebat","16:32":"which he had built in Samaria.","16:33":"the God of Israel","16:34":"and set up the gates of it with the loss of his youngest son Segub","17:1":"who was of the foreigners of Gilead","17:2":"saying","17:3":"and turn you eastward","17:4":"that you shall drink of the brook; and I have commanded the ravens to feed you there.","17:5":"that is before the Jordan.","17:6":"and bread and flesh in the evening; and he drank of the brook.","17:7":"that the brook dried up","17:8":"saying","17:9":"get you to Zarephath","17:10":"behold","17:11":"he called to her","17:12":"As Yahweh your God lives","17:13":"Don't be afraid; go and do as you have said; but make me of it a little cake first","17:14":"the God of Israel","17:15":"and he","17:16":"neither did the jar of oil fail","17:17":"that the son of the woman","17:18":"What have I to do with you","17:19":"Give me your son.  He took him out of her bosom","17:20":"and said","17:21":"and cried to Yahweh","17:22":"and he revived.","17:23":"and brought him down out of the chamber into the house","17:24":"Now I know that you are a man of God","18:1":"that the word of Yahweh came to Elijah","18:2":"And Elijah went to show himself unto Ahab. And there was a sore famine in Samaria.","18:3":"who was over the household. (Now Obadiah feared Yahweh greatly:","18:4":"when Jezebel cut off the prophets of Yahweh","18:5":"Go through the land","18:6":"and Obadiah went another way by himself.","18:7":"behold","18:8":"It is I:  go","18:9":"Wherein have I sinned","18:10":"there is no nation or kingdom","18:11":"Go","18:12":"as soon as I am gone from you","18:13":"how I hid one hundred men of Yahweh's prophets by fifty in a cave","18:14":"Go","18:15":"As Yahweh of Armies lives","18:16":"and told him; and Ahab went to meet Elijah.","18:17":"when Ahab saw Elijah","18:18":"I have not troubled Israel; but you","18:19":"and gather to me all Israel to Mount Carmel","18:20":"and gathered the prophets together to Mount Carmel.","18:21":"and said","18:22":"I, even I only, am left a prophet of Yahweh; but Baal's prophets are four hundred fifty men.,Then said Elijah unto the people, I, even I only, remain a prophet of the LORD; but Baal's prophets are four hundred and fifty men.,  וַיֹּאמֶר אֵלִיָּהוּ אֶל־הָעָם אֲנִי נוֹתַרְתִּי נָבִיא לַיהוָה לְבַדִּי וּנְבִיאֵי הַבַּעַל אַרְבַּע־מֵאוֹת וַחֲמִשִּׁים אִישׁ׃ ‬,Then said Elijah unto the people: I","18:23":"and cut it in pieces","18:24":"and I will call on the name of Yahweh; and the God who answers by fire","18:25":"Choose one bull for yourselves, and dress it first; for you are many; and call on the name of your god, but put no fire under it.","18:26":"and they dressed it","18:27":"that Elijah mocked them","18:28":"and cut themselves after their manner with knives and lances","18:29":"when midday was past","18:30":"Come near to me; and all the people came near to him.  He repaired the altar of Yahweh that was thrown down.","18:31":"according to the number of the tribes of the sons of Jacob","18:32":"as great as would contain two measures of seed.","18:33":"and cut the bull in pieces","18:34":"Do it the second time; and they did it the second time. He said","18:35":"And the water ran round about the altar; and he filled the trench also with water.","18:36":"that Elijah the prophet came near","18:37":"Yahweh","18:38":"and consumed the burnt offering","18:39":"they fell on their faces: and they said","18:40":"Take the prophets of Baal; don't let one of them escape.  They took them; and Elijah brought them down to the brook Kishon","18:41":"Get you up","18:42":"and put his face between his knees.","18:43":"Go up now","18:44":"that he said","18:45":"that the sky grew black with clouds and wind","18:46":"and ran before Ahab to the entrance of Jezreel.","19:1":"and how he had killed all the prophets with the sword.","19:2":"saying","19:3":"he arose","19:4":"and came and sat down under a juniper tree:  and he requested for himself that he might die","19:5":"an angel touched him","19:6":"and behold","19:7":"and touched him","19:8":"and ate and drink","19:9":"and lodged there; and behold","19:10":"I have been very jealous for Yahweh","19:11":"Go forth","19:12":"And after the earthquake a fire; but the LORD was not in the fire: and after the fire a still small voice.","19:13":"when Elijah heard it","19:14":"I have been very jealous for Yahweh","19:15":"Go","19:16":"And Jehu the son of Nimshi shalt thou anoint to be king over Israel: and Elisha the son of Shaphat of Abelmeholah shalt thou anoint to be prophet in thy room.","19:17":"that he who escapes from the sword of Hazael shall Jehu kill; and he who escapes from the sword of Jehu shall Elisha kill.","19:18":"all the knees which have not bowed to Baal","19:19":"and found Elisha the son of Shaphat","19:20":"and ran after Elijah","19:21":"and took the yoke of oxen","20:1":"and horses and chariots: and he went up and besieged Samaria","20:2":"into the city","20:3":"even the best","20:4":"It is according to your saying","20:5":"and said","20:6":"and they shall search your house","20:7":"and said","20:8":"Don't you listen","20:9":"Tell my lord the king","20:10":"and said","20:11":"Tell him","20:12":"when [Ben Hadad] heard this message","20:13":"a prophet came near to Ahab king of Israel","20:14":"By whom?  He said","20:15":"and they were two hundred and thirty-two: and after them he mustered all the people","20:16":"he and the kings","20:17":"and they told him","20:18":"Whether they are come out for peace","20:19":"the young men of the princes of the provinces","20:20":"and Israel pursued them:  and Ben Hadad the king of Syria escaped on a horse with horsemen.","20:21":"and struck the horses and chariots","20:22":"and said to him","20:23":"Their god is a god of the hills; therefore they were stronger than we: but let us fight against them in the plain","20:24":"every man out of his place","20:25":"like the army that you have lost","20:26":"that Ben Hadad mustered the Syrians","20:27":"and were provisioned","20:28":"and said","20:29":"that in the seventh day the battle was joined; and the children of Israel killed of the Syrians one hundred thousand footmen in one day.","20:30":"into the city; and the wall fell on twenty-seven thousand men who were left.  Ben Hadad fled","20:31":"See now","20:32":"and [put] ropes on their heads","20:33":"and hurried to catch whether it were his mind; and they said","20:34":"The cities which my father took from your father I will restore; and you shall make streets for you in Damascus","20:35":"Please strike me.  The man refused to strike him.","20:36":"Because you have not obeyed the voice of Yahweh","20:37":"and said","20:38":"and waited for the king by the way","20:39":"he cried to the king; and he said","20:40":"he was gone. The king of Israel said to him","20:41":"and took the headband away from his eyes; and the king of Israel discerned him that he was of the prophets.","20:42":"Thus says Yahweh","20:43":"and came to Samaria.","21:1":"that Naboth the Jezreelite had a vineyard","21:2":"saying","21:3":"Yahweh forbid it me","21:4":"I will not give you the inheritance of my fathers. He laid him down on his bed","21:5":"and said to him","21:6":"Because I spoke to Naboth the Jezreelite","21:7":"Do you now govern the kingdom of Israel? arise","21:8":"and sealed them with his seal","21:9":"saying","21:10":"base fellows","21:11":"even the elders and the nobles who lived in his city","21:12":"and set Naboth on high among the people.","21:13":"the base fellows","21:14":"saying","21:15":"when Jezebel heard that Naboth was stoned","21:16":"when Ahab heard that Naboth was dead","21:17":"saying","21:18":"go down to meet Ahab king of Israel","21:19":"saying","21:20":"Have you found me","21:21":"I will bring evil on you","21:22":"and like the house of Baasha the son of Ahijah for the provocation with which you have provoked me to anger","21:23":"saying","21:24":"Him that dieth of Ahab in the city the dogs shall eat; and him that dieth in the field shall the fowls of the air eat.","21:25":"who did sell himself to do that which was evil in the sight of Yahweh","21:26":"according to all that the Amorites did","21:27":"when Ahab heard those words","21:28":"saying","21:29":"I will not bring the evil in his days; but in his son's days will I bring the evil on his house.","22:1":"And they continued three years without war between Syria and Israel.","22:2":"that Jehoshaphat the king of Judah came down to the king of Israel.","22:3":"You know that Ramoth Gilead is ours, and we are still, and don't take it out of the hand of the king of Syria?","22:4":"Will you go with me to battle to Ramoth Gilead?  Jehoshaphat said to the king of Israel","22:5":"Please inquire first for the word of Yahweh.","22:6":"about four hundred men","22:7":"Isn't there here a prophet of Yahweh besides","22:8":"there is yet one man by whom we may inquire of Yahweh","22:9":"and said","22:10":"arrayed in their robes","22:11":"and said","22:12":"saying","22:13":"saying","22:14":"As Yahweh lives","22:15":"the king said to him","22:16":"How many times shall I adjure you that you speak to me nothing but the truth in the name of Yahweh?","22:17":"I saw all Israel scattered on the mountains","22:18":"Didn't I tell you that he would not prophesy good concerning me","22:19":"Therefore hear the word of Yahweh:  I saw Yahweh sitting on his throne, and all the army of heaven standing by him on his right hand and on his left.,And he said, Hear thou therefore the word of the LORD: I saw the LORD sitting on his throne, and all the host of heaven standing by him on his right hand and on his left.,  וַיֹּאמֶר לָכֵן שְׁמַע דְּבַר־יְהוָה רָאִיתִי אֶת־יְהוָה יֹשֵׁב עַל־כִּסְאוֹ וְכָל־צְבָא הַשָּׁמַיִם עֹמֵד עָלָיו מִימִינוֹ וּמִשְּׂמֹאלוֹ׃ ‬,And he said: Therefore hear thou the word of the LORD. I saw the LORD sitting on His throne","22:20":"'Who shall entice Ahab","22:21":"and stood before Yahweh","22:22":"'How?'  He said","22:23":"behold","22:24":"and struck Micaiah on the cheek","22:25":"Behold","22:26":"Take Micaiah","22:27":"Thus says the king","22:28":"If you return at all in peace","22:29":"So the king of Israel and Jehoshaphat the king of Judah went up to Ramothgilead.","22:30":"I will disguise myself","22:31":"saying","22:32":"when the captains of the chariots saw Jehoshaphat","22:33":"when the captains of the chariots saw that it was not the king of Israel","22:34":"and struck the king of Israel between the joints of the armor: therefore he said to the driver of his chariot","22:35":"and died at even; and the blood ran out of the wound into the bottom of the chariot.","22:36":"saying","22:37":"and was brought to Samaria; and they buried the king in Samaria.","22:38":"And one washed the chariot in the pool of Samaria; and the dogs licked up his blood; and they washed his armor; according unto the word of the LORD which he spake.","22:39":"and all that he did","22:40":"So Ahab slept with his fathers; and Ahaziah his son reigned in his stead.","22:41":"And Jehoshaphat the son of Asa began to reign over Judah in the fourth year of Ahab king of Israel.","22:42":"Jehoshaphat was thirty and five years old when he began to reign; and he reigned twenty and five years in Jerusalem. And his mother's name was Azubah the daughter of Shilhi.","22:43":"doing that which was right in the eyes of Yahweh: however the high places were not taken away; the people still sacrificed and burnt incense in the high places.","22:44":"And Jehoshaphat made peace with the king of Israel.","22:45":"and his might that he shown","22:46":"that remained in the days of his father Asa","22:47":"There was then no king in Edom: a deputy was king.","22:48":"Jehoshaphat made ships of Tharshish to go to Ophir for gold: but they went not; for the ships were broken at Eziongeber.","22:49":"Let my servants go with your servants in the ships.  But Jehoshaphat would not.","22:50":"and was buried with his fathers in the city of David his father; Jehoram his son reigned in his place.","22:51":"and he reigned two years over Israel.","22:52":"and walked in the way of his father","22:53":"and worshiped him"}