{"1:1":"an apostle of Jesus Christ","1:2":"in sanctification of the Spirit","1:3":"who according to his great mercy became our father again to a living hope through the resurrection of Jesus Christ from the dead","1:4":"reserved in Heaven for you","1:5":"Who are kept by the power of God through faith unto salvation ready to be revealed in the last time.","1:6":"though now for a little while","1:7":"which is more precious than gold that perishes even though it is tested by fire","1:8":"though now you don't see him","1:9":"the salvation of your souls.","1:10":"the prophets sought and searched diligently","1:11":"which was in them","1:12":"that not to themselves","1:13":"prepare your minds for action","1:14":"not conforming yourselves according to your former lusts as in your ignorance","1:15":"you yourselves also be holy in all of your behavior;","1:16":"You shall be holy; for I am holy.{Leviticus 11:44-45}","1:17":"who without respect of persons judges according to each man's work","1:18":"not with corruptible things","1:19":"as of a faultless and pure lamb","1:20":"but was revealed at the end of times for your sake","1:21":"who raised him from the dead","1:22":"love one another from the heart fervently:","1:23":"not of corruptible seed","1:24":"All flesh is like grass, and all of man's glory like the flower in the grass.  The grass withers, and its flower falls;,For all flesh is as grass, and all the glory of man as the flower of grass. The grass withereth, and the flower thereof falleth away:,,,,,,,,","1:25":"","2:1":"all deceit","2:2":"long for the pure milk of the Word","2:3":"If so be ye have tasted that the Lord is gracious.","2:4":"a living stone","2:5":"as living stones","2:6":"Behold, I lay in Zion a chief cornerstone, chosen, and precious: He who believes in him will not be disappointed.{Isaiah 28:16}","2:7":"but for those who are disobedient","2:8":"a stone of stumbling, and a rock of offense.{Isaiah 8:14} For they stumble at the word","2:9":"a royal priesthood","2:10":"but now are God's people","2:11":"I beg you as foreigners and pilgrims","2:12":"so in that of which they speak against you as evil-doers","2:13":"as supreme;","2:14":"as sent by him for vengeance on evil-doers and for praise to those who do well.","2:15":"that by well-doing you should put to silence the ignorance of foolish men:","2:16":"and not using your freedom for a cloak of wickedness","2:17":"Honour all men. Love the brotherhood. Fear God. Honour the king.","2:18":"be in subjection to your masters with all fear; not only to the good and gentle","2:19":"suffering unjustly","2:20":"when you sin","2:21":"because Christ also suffered for us","2:22":"neither was deceit found in his mouth.{Isaiah 53:9}","2:23":"when he was cursed","2:24":"that we","2:25":"which can mean overseer","3:1":"wives","3:2":"While they behold your chaste conversation coupled with fear.","3:3":"and of wearing jewels of gold","3:4":"in the incorruptible adornment of a gentle and quiet spirit","3:5":"who hoped in God also adorned themselves","3:6":"calling him lord","3:7":"in like manner","3:8":"be all like-minded","3:9":"or reviling for reviling; but instead blessing; knowing that to this were you called","3:10":"He who would love life, and see good days, let him keep his tongue from evil, and his lips from speaking deceit.,For he that will love life, and see good days, let him refrain his tongue from evil, and his lips that they speak no guile:,,,,,,,,","3:11":"and do good.  Let him seek peace","3:12":"and his ears open to their prayer; but the face of the Lord is against those who do evil.{Psalm 34:12-16},For the eyes of the Lord are over the righteous, and his ears are open unto their prayers: but the face of the Lord is against them that do evil.,,,,,,,,","3:13":"if you become imitators of that which is good?","3:14":"you are blessed.  Don't fear what they fear, neither be troubled.{Isaiah 8:12}","3:15":"with humility and fear:","3:16":"while you are spoken against as evildoers","3:17":"if it is God's will","3:18":"the righteous for the unrighteous","3:19":"","3:20":"when God waited patiently in the days of Noah","3:21":"which now saves you-- not the putting away of the filth of the flesh","3:22":"having gone into heaven","4:1":"arm yourselves also with the same mind; for he who has suffered in the flesh has ceased from sin;","4:2":"but for the will of God.","4:3":"and having walked in lewdness","4:4":"blaspheming:","4:5":"Who shall give account to him that is ready to judge the quick and the dead.","4:6":"that they might be judged indeed as men in the flesh","4:7":"self-controlled","4:8":"for love covers a multitude of sins.","4:9":"Use hospitality one to another without grudging.","4:10":"employ it in serving one another","4:11":"let it be as it were the very words of God. If anyone serves","4:12":"don't be astonished at the fiery trial which has come upon you","4:13":"rejoice; that at the revelation of his glory you also may rejoice with exceeding joy.","4:14":"you are blessed; because the Spirit of glory and of God rests on you. On their part he is blasphemed","4:15":"or a thief","4:16":"let him not be ashamed; but let him glorify God in this matter.","4:17":"what will happen to those who don't obey the Good News of God?","4:18":"And if the righteous scarcely be saved","4:19":"as to a faithful Creator.","5:1":"as a fellow elder","5:2":"exercising the oversight","5:3":"but making yourselves examples to the flock.","5:4":"you will receive the crown of glory that doesn't fade away.","5:5":"you younger ones","5:6":"that he may exalt you in due time;","5:7":"because he cares for you.","5:8":"walks around like a roaring lion","5:9":"knowing that your brothers who are in the world are undergoing the same sufferings.","5:10":"who called you to his eternal glory by Christ Jesus","5:11":"To him be glory and dominion for ever and ever. Amen.","5:12":"our faithful brother","5:13":"chosen together with you","5:14":"Greet ye one another with a kiss of charity. Peace be with you all that are in Christ Jesus. Amen."}