{"1:1":"of the hill country of Ephraim","1:2":"and the name of other Peninnah:  and Peninnah had children","1:3":"Hophni and Phinehas","1:4":"he gave to Peninnah his wife","1:5":"but Yahweh had shut up her womb.","1:6":"to make her fret","1:7":"when she went up to the house of Yahweh","1:8":"Hannah","1:9":"and after they had drunk.  Now Eli the priest was sitting on his seat by the doorpost of the temple of Yahweh.","1:10":"and prayed to Yahweh","1:11":"and said","1:12":"as she continued praying before Yahweh","1:13":"she spoke in her heart; only her lips moved","1:14":"How long will you be drunken? put away your wine from you.","1:15":"No","1:16":"Count not thine handmaid for a daughter of Belial: for out of the abundance of my complaint and grief have I spoken hitherto.","1:17":"Go in peace; and the God of Israel grant your petition that you have asked of him.","1:18":"Let your handmaid find favor in your sight. So the woman went her way","1:19":"and worshiped before Yahweh","1:20":"when the time was come about","1:21":"and all his house","1:22":"[I will not go up] until the child be weaned; and then I will bring him","1:23":"Do what seems you good; wait until you have weaned him; only Yahweh establish his word. So the woman waited and nursed her son","1:24":"she took him up with her","1:25":"and brought the child to Eli.","1:26":"Oh","1:27":"For this child I prayed; and the LORD hath given me my petition which I asked of him:","1:28":"Therefore also I have lent him to the LORD; as long as he liveth he shall be lent to the LORD. And he worshipped the LORD there.","2:1":"and said:  My heart exults in Yahweh!  My horn is exalted in Yahweh.  My mouth is enlarged over my enemies","2:2":"For there is no one besides you","2:3":"For Yahweh is a God of knowledge. By him actions are weighed.","2:4":"The bows of the mighty men are broken","2:5":"the barren has borne seven.  She who has many children languishes.","2:6":"and makes alive.  He brings down to Sheol","2:7":"and makes rich.  He brings low","2:8":"To make them sit with princes","2:9":"but the wicked shall be put to silence in darkness; for no man shall prevail by strength.","2:10":"and exalt the horn of his anointed.","2:11":"And Elkanah went to Ramah to his house. And the child did minister unto the LORD before Eli the priest.","2:12":"Now the sons of Eli were sons of Belial; they knew not the LORD.","2:13":"the priest's servant came","2:14":"or kettle","2:15":"before they burnt the fat","2:16":"They will surely burn the fat first","2:17":"Wherefore the sin of the young men was very great before the LORD: for men abhorred the offering of the LORD.","2:18":"being a child","2:19":"and brought it to him from year to year","2:20":"and said","2:21":"and she conceived","2:22":"and how that they lay with the women who served at the door of the tent of meeting.","2:23":"Why do you such things? for I hear of your evil dealings from all this people.","2:24":"my sons; for it is no good report that I hear: you make Yahweh's people to disobey.","2:25":"God shall judge him; but if a man sin against Yahweh","2:26":"and increased in favor both with Yahweh","2:27":"and said to him","2:28":"to go up to my altar","2:29":"which I have commanded in [my] habitation","2:30":"the God of Israel","2:31":"the days come","2:32":"in all the wealth which [God] shall give Israel; and there shall not be an old man in your house forever.","2:33":"[whom] I shall not cut off from my altar","2:34":"that shall come on your two sons","2:35":"that shall do according to that which is in my heart and in my mind: and I will build him a sure house; and he shall walk before my anointed forever.","2:36":"that everyone who is left in your house shall come and bow down to him for a piece of silver and a loaf of bread","3:1":"And the child Samuel ministered unto the LORD before Eli. And the word of the LORD was precious in those days; there was no open vision.","3:2":"when Eli was laid down in his place (now his eyes had begun to grow dim","3:3":"and Samuel had laid down [to sleep]","3:4":"Here am I.","3:5":"and said","3:6":"Samuel.  Samuel arose and went to Eli","3:7":"neither was the word of Yahweh yet revealed to him.","3:8":"and said","3:9":"Go","3:10":"and stood","3:11":"Behold","3:12":"from the beginning even to the end.","3:13":"for the iniquity which he knew","3:14":"that the iniquity of Eli's house shall not be expiated with sacrifice nor offering forever.","3:15":"and opened the doors of the house of Yahweh.  Samuel feared to show Eli the vision.","3:16":"and said","3:17":"What is the thing that [Yahweh] has spoken to you? Please don't hide it from me.  God do so to you, and more also, if you hide anything from me of all the things that he spoke to you.","3:18":"and hid nothing from him. He said","3:19":"and Yahweh was with him","3:20":"And all Israel from Dan even to Beersheba knew that Samuel was established to be a prophet of the LORD.","3:21":"And the LORD appeared again in Shiloh: for the LORD revealed himself to Samuel in Shiloh by the word of the LORD.","4:1":"and encamped beside Ebenezer: and the Philistines encamped in Aphek.","4:2":"Israel was struck before the Philistines; and they killed of the army in the field about four thousand men.","4:3":"the elders of Israel said","4:4":"who sits [above] the cherubim: and the two sons of Eli","4:5":"all Israel shouted with a great shout","4:6":"they said","4:7":"for they said","4:8":"Woe unto us! who shall deliver us out of the hand of these mighty Gods? these are the Gods that smote the Egyptians with all the plagues in the wilderness.","4:9":"and behave yourselves like men","4:10":"and Israel was struck","4:11":"Hophni and Phinehas","4:12":"and came to Shiloh the same day","4:13":"behold","4:14":"he said","4:15":"so that he could not see.","4:16":"I am he who came out of the army","4:17":"Israel is fled before the Philistines","4:18":"when he made mention of the ark of God","4:19":"Phinehas' wife","4:20":"Don't be afraid; for you have brought forth a son. But she didn't answer","4:21":"saying","4:22":"The glory is departed from Israel; for the ark of God is taken.","5:1":"and they brought it from Ebenezer to Ashdod.","5:2":"and brought it into the house of Dagon","5:3":"behold","5:4":"behold","5:5":"nor any who come into Dagon's house","5:6":"and he destroyed them","5:7":"they said","5:8":"and said","5:9":"that after they had carried it about","5:10":"as the ark of God came to Ekron","5:11":"and they said","5:12":"And the men that died not were smitten with the emerods: and the cry of the city went up to heaven.","6:1":"And the ark of the LORD was in the country of the Philistines seven months.","6:2":"saying","6:3":"If you send away the ark of the God of Israel, don't send it empty; but by all means return him a trespass offering: then you shall be healed, and it shall be known to you why his hand is not removed from you.","6:4":"What shall be the trespass offering which we shall return to him?  They said","6:5":"and images of your mice that mar the land; and you shall give glory to the God of Israel:  peradventure he will lighten his hand from off you","6:6":"as the Egyptians and Pharaoh hardened their hearts?  When he had worked wonderfully among them","6:7":"and two milk cows","6:8":"and lay it on the cart; and put the jewels of gold","6:9":"then he has done us this great evil:  but if not","6:10":"and took two milk cows","6:11":"and the coffer with the mice of gold and the images of their tumors.","6:12":"lowing as they went","6:13":"and saw the ark","6:14":"and stood there","6:15":"and the coffer that was with it","6:16":"they returned to Ekron the same day.","6:17":"for Gaza one","6:18":"according to the number of all the cities of the Philistines belonging to the five lords","6:19":"because they had looked into the ark of Yahweh","6:20":"Who is able to stand before Yahweh","6:21":"saying","7:1":"and fetched up the ark of Yahweh","7:2":"from the day that the ark abode in Kiriath Jearim","7:3":"saying","7:4":"and served Yahweh only.","7:5":"Gather all Israel to Mizpah, and I will pray for you to Yahweh.","7:6":"and drew water","7:7":"the lords of the Philistines went up against Israel.  When the children of Israel heard it","7:8":"Don't cease to cry to Yahweh our God for us, that he will save us out of the hand of the Philistines.","7:9":"and offered it for a whole burnt offering to Yahweh:  and Samuel cried to Yahweh for Israel; and Yahweh answered him.","7:10":"the Philistines drew near to battle against Israel; but Yahweh thundered with a great thunder on that day on the Philistines","7:11":"and pursued the Philistines","7:12":"and set it between Mizpah and Shen","7:13":"and they came no more within the border of Israel:  and the hand of Yahweh was against the Philistines all the days of Samuel.","7:14":"from Ekron even to Gath; and the border of it did Israel deliver out of the hand of the Philistines. There was peace between Israel and the Amorites.","7:15":"And Samuel judged Israel all the days of his life.","7:16":"and Mizpah; and he judged Israel in all those places.","7:17":"for there was his house; and there he judged Israel:  and he built there an altar to Yahweh.","8:1":"when Samuel was old","8:2":"Abijah:  they were judges in Beersheba.","8:3":"but turned aside after lucre","8:4":"and came to Samuel to Ramah;","8:5":"Behold","8:6":"when they said","8:7":"Listen to the voice of the people in all that they tell you; for they have not rejected you","8:8":"in that they have forsaken me","8:9":"and shall show them the manner of the king who shall reign over them.","8:10":"And Samuel told all the words of the LORD unto the people that asked of him a king.","8:11":"This will be the manner of the king who shall reign over you:  he will take your sons","8:12":"and captains of fifties; and [he will set some] to plow his ground","8:13":"and to be cooks","8:14":"and your vineyards","8:15":"and of your vineyards","8:16":"and your female servants","8:17":"He will take the tenth of your sheep: and ye shall be his servants.","8:18":"And ye shall cry out in that day because of your king which ye shall have chosen you; and the LORD will not hear you in that day.","8:19":"No:  but we will have a king over us","8:20":"and that our king may judge us","8:21":"and he rehearsed them in the ears of Yahweh.","8:22":"Listen to their voice","9:1":"whose name was Kish","9:2":"whose name was Saul","9:3":"Saul's father","9:4":"and passed through the land of Shalishah","9:5":"Saul said to his servant who was with him","9:6":"See now","9:7":"But","9:8":"and said","9:9":"when a man went to inquire of God","9:10":"Well said; come","9:11":"they found young maidens going out to draw water","9:12":"and said","9:13":"you shall immediately find him","9:14":"behold","9:15":"saying","9:16":"and you shall anoint him to be prince over my people Israel; and he shall save my people out of the hand of the Philistines:  for I have looked on my people","9:17":"Yahweh said to him","9:18":"and said","9:19":"and said","9:20":"don't set your mind on them; for they are found. For whom is all that is desirable in Israel?  Is it not for you","9:21":"Am I not a Benjamite","9:22":"and brought them into the guest room","9:23":"Bring the portion which I gave you","9:24":"and that which was on it","9:25":"he talked with Saul on the housetop.","9:26":"that Samuel called to Saul on the housetop","9:27":"Samuel said to Saul","10:1":"and poured it on his head","10:2":"then you shall find two men by Rachel's tomb","10:3":"and you shall come to the oak of Tabor; and there shall meet you there three men going up to God to Bethel","10:4":"and give you two loaves of bread","10:5":"where is the garrison of the Philistines:  and it shall happen","10:6":"and you shall prophesy with them","10:7":"when these signs are come to you","10:8":"I will come down to you","10:9":"that when he had turned his back to go from Samuel","10:10":"behold","10:11":"when all who knew him before saw that","10:12":"Who is their father? Therefore it became a proverb","10:13":"he came to the high place.","10:14":"Where went you? He said","10:15":"Tell me","10:16":"He told us plainly that the donkeys were found.  But concerning the matter of the kingdom","10:17":"And Samuel called the people together unto the LORD to Mizpeh;","10:18":"Thus says Yahweh","10:19":"who himself saves you out of all your calamities and your distresses; and you have said to him","10:20":"and the tribe of Benjamin was taken.","10:21":"he could not be found.","10:22":"Is there yet a man to come here?  Yahweh answered","10:23":"he was higher than any of the people from his shoulders and upward.","10:24":"You see him whom Yahweh has chosen, that there is none like him among all the people? All the people shouted","10:25":"and wrote it in a book","10:26":"whose hearts God had touched.","10:27":"How shall this man save us? They despised him","11:1":"and encamped against Jabesh Gilead: and all the men of Jabesh said to Nahash","11:2":"On this condition will I make it with you","11:3":"Give us seven days' respite","11:4":"and spoke these words in the ears of the people:  and all the people lifted up their voice","11:5":"Saul came following the oxen out of the field; and Saul said","11:6":"and his anger was kindled greatly.","11:7":"and cut them in pieces","11:8":"and the men of Judah thirty thousand.","11:9":"Thus shall you tell the men of Jabesh Gilead","11:10":"Tomorrow we will come out to you","11:11":"that Saul put the people in three companies; and they came into the midst of the camp in the morning watch","11:12":"Who is he who said","11:13":"There shall not a man be put to death this day; for today Yahweh has worked deliverance in Israel.","11:14":"Come","11:15":"And all the people went to Gilgal; and there they made Saul king before the LORD in Gilgal; and there they sacrificed sacrifices of peace offerings before the LORD; and there Saul and all the men of Israel rejoiced greatly.","12:1":"Behold","12:2":"behold","12:3":"and before his anointed:  whose ox have I taken? or whose donkey have I taken? or whom have I defrauded? whom have I oppressed? or of whose hand have I taken a ransom to blind my eyes therewith? and I will restore it you.","12:4":"You have not defrauded us","12:5":"Yahweh is witness against you","12:6":"It is Yahweh who appointed Moses and Aaron","12:7":"that I may plead with you before Yahweh concerning all the righteous acts of Yahweh","12:8":"and your fathers cried to Yahweh","12:9":"captain of the army of Hazor","12:10":"and said","12:11":"and Bedan","12:12":"you said to me","12:13":"and whom you have asked for:  and behold","12:14":"and serve him","12:15":"but rebel against the commandment of Yahweh","12:16":"which Yahweh will do before your eyes.","12:17":"that he may send thunder and rain; and you shall know and see that your wickedness is great","12:18":"So Samuel called unto the LORD; and the LORD sent thunder and rain that day: and all the people greatly feared the LORD and Samuel.","12:19":"Pray for your servants to Yahweh your God","12:20":"Don't be afraid; you have indeed done all this evil; yet don't turn aside from following Yahweh, but serve Yahweh with all your heart:,And Samuel said unto the people, Fear not: ye have done all this wickedness: yet turn not aside from following the LORD, but serve the LORD with all your heart;,  וַיֹּאמֶר שְׁמוּאֵל אֶל־הָעָם אַל־תִּירָאוּ אַתֶּם עֲשִׂיתֶם אֵת כָּל־הָרָעָה הַזֹּאת אַךְ אַל־תָּסוּרוּ מֵאַחֲרֵי יְהוָה וַעֲבַדְתֶּם אֶת־יְהוָה בְּכָל־לְבַבְכֶם׃ ‬,And Samuel said unto the people: Fear not; ye have indeed done all this evil; yet turn not \faside from following the LORD","12:21":"for they are vain.","12:22":"because it has pleased Yahweh to make you a people to himself.","12:23":"far be it from me that I should sin against Yahweh in ceasing to pray for you:  but I will instruct you in the good and the right way.","12:24":"and serve him in truth with all your heart; for consider how great things he has done for you.","12:25":"you shall be consumed","13:1":"","13:2":"of which two thousand were with Saul in Michmash and in the Mount of Bethel","13:3":"saying","13:4":"and also that Israel was had in abomination with the Philistines.  The people were gathered together after Saul to Gilgal.","13:5":"thirty thousand chariots","13:6":"then the people did hide themselves in caves","13:7":"he was yet in Gilgal","13:8":"according to the set time that Samuel [had appointed]: but Samuel didn't come to Gilgal; and the people were scattered from him.","13:9":"Bring here the burnt offering to me","13:10":"behold","13:11":"What have you done?  Saul said","13:12":"Now will the Philistines come down on me to Gilgal","13:13":"You have done foolishly; you have not kept the commandment of Yahweh your God","13:14":"and Yahweh has appointed him to be prince over his people","13:15":"and got him up from Gilgal to Gibeah of Benjamin. Saul numbered the people who were present with him","13:16":"and Jonathan his son","13:17":"to the land of Shual;","13:18":"And another company turned the way to Bethhoron: and another company turned to the way of the border that looketh to the valley of Zeboim toward the wilderness.","13:19":"Lest the Hebrews make them swords or spears:","13:20":"to sharpen every man his plowshare","13:21":"and for the plowshares","13:22":"that there was neither sword nor spear found in the hand of any of the people who were with Saul and Jonathan:  but with Saul and with Jonathan his son was there found.","13:23":"And the garrison of the Philistines went out to the passage of Michmash.","14:1":"that Jonathan the son of Saul said to the young man who bore his armor","14:2":"And Saul tarried in the uttermost part of Gibeah under a pomegranate tree which is in Migron: and the people that were with him were about six hundred men;","14:3":"the son of Ahitub","14:4":"by which Jonathan sought to go over to the Philistines' garrison","14:5":"and the other on the south in front of Geba.","14:6":"Come","14:7":"Do all that is in your heart: turn you","14:8":"Behold","14:9":"Wait until we come to you; then we will stand still in our place","14:10":"Come up to us; then we will go up; for Yahweh has delivered them into our hand:  and this shall be the sign to us.","14:11":"Behold","14:12":"and said","14:13":"and his armor bearer after him:  and they fell before Jonathan; and his armor bearer killed them after him.","14:14":"which Jonathan and his armor bearer made","14:15":"in the field","14:16":"the multitude melted away","14:17":"Number now","14:18":"Bring here the ark of God.  For the ark of God was [there] at that time with the children of Israel.","14:19":"while Saul talked to the priest","14:20":"and came to the battle:  and behold","14:21":"and who went up with them into the camp","14:22":"when they heard that the Philistines fled","14:23":"So the LORD saved Israel that day: and the battle passed over unto Bethaven.","14:24":"saying","14:25":"And all they of the land came to a wood; and there was honey upon the ground.","14:26":"behold","14:27":"and dipped it in the honeycomb","14:28":"and said","14:29":"My father has troubled the land. Please look how my eyes have been enlightened","14:30":"if haply the people had eaten freely today of the spoil of their enemies which they found? for now has there been no great slaughter among the Philistines.","14:31":"And they smote the Philistines that day from Michmash to Aijalon: and the people were very faint.","14:32":"and took sheep","14:33":"saying","14:34":"Disperse yourselves among the people","14:35":"And Saul built an altar unto the LORD: the same was the first altar that he built unto the LORD.","14:36":"Let us go down after the Philistines by night","14:37":"Shall I go down after the Philistines? will you deliver them into the hand of Israel?  But he didn't answer him that day.","14:38":"Draw near here","14:39":"as Yahweh lives","14:40":"Be you on one side","14:41":"the God of Israel","14:42":"Cast [lots] between me and Jonathan my son. Jonathan was taken.","14:43":"Tell me what you have done. Jonathan told him","14:44":"God do so and more also; for you shall surely die","14:45":"Shall Jonathan die","14:46":"Then Saul went up from following the Philistines: and the Philistines went to their own place.","14:47":"he fought against all his enemies on every side","14:48":"and struck the Amalekites","14:49":"and Ishvi","14:50":"Saul's uncle.","14:51":"And Kish was the father of Saul; and Ner the father of Abner was the son of Abiel.","14:52":"or any valiant man","15:1":"Yahweh sent me to anoint you to be king over his people","15:2":"I have marked that which Amalek did to Israel","15:3":"and utterly destroy all that they have","15:4":"and numbered them in Telaim","15:5":"and laid wait in the valley.","15:6":"Go","15:7":"from Havilah as you go to Shur","15:8":"and utterly destroyed all the people with the edge of the sword.","15:9":"and the best of the sheep","15:10":"saying","15:11":"and has not performed my commandments. Samuel was angry; and he cried to Yahweh all night.","15:12":"saying","15:13":"Blessed are you by Yahweh:  I have performed the commandment of Yahweh.","15:14":"What means then this bleating of the sheep in my ears","15:15":"They have brought them from the Amalekites: for the people spared the best of the sheep and of the oxen","15:16":"Stay","15:17":"Though you were little in your own sight, weren't you made the head of the tribes of Israel?  Yahweh anointed you king over Israel;,And Samuel said, When thou wast little in thine own sight, wast thou not made the head of the tribes of Israel, and the LORD anointed thee king over Israel?,  וַיֹּאמֶר שְׁמוּאֵל הֲלוֹא אִם־קָטֹן אַתָּה בְּעֵינֶיךָ רֹאשׁ שִׁבְטֵי יִשְׂרָאֵל אָתָּה וַיִּמְשָׁחֲךָ יְהוָה לְמֶלֶךְ עַל־יִשְׂרָאֵל׃ ‬,And Samuel said: Though thou be little in thine own sight","15:18":"and said","15:19":"but flew on the spoil","15:20":"Yes","15:21":"sheep and oxen","15:22":"Has Yahweh as great delight in burnt offerings and sacrifices","15:23":"and stubbornness is as idolatry and teraphim.  Because you have rejected the word of Yahweh","15:24":"I have sinned; for I have transgressed the commandment of Yahweh","15:25":"please pardon my sin","15:26":"I will not return with you; for you have rejected the word of Yahweh","15:27":"[Saul] laid hold on the skirt of his robe","15:28":"Yahweh has torn the kingdom of Israel from you this day","15:29":"that he should repent.","15:30":"I have sinned:  yet honor me now","15:31":"So Samuel turned again after Saul; and Saul worshipped the LORD.","15:32":"Bring you here to me Agag the king of the Amalekites.  Agag came to him cheerfully. Agag said","15:33":"As your sword has made women childless","15:34":"Then Samuel went to Ramah; and Saul went up to his house to Gibeah of Saul.","15:35":"And Samuel came no more to see Saul until the day of his death: nevertheless Samuel mourned for Saul: and the LORD repented that he had made Saul king over Israel.","16:1":"How long will you mourn for Saul","16:2":"How can I go? if Saul hear it","16:3":"and I will show you what you shall do: and you shall anoint to me him whom I name to you.","16:4":"and came to Bethlehem. The elders of the city came to meet him trembling","16:5":"Peaceably; I am come to sacrifice to Yahweh: sanctify yourselves","16:6":"when they had come","16:7":"Don't look on his face, or on the height of his stature; because I have rejected him: for [Yahweh sees] not as man sees; for man looks at the outward appearance, but Yahweh looks at the heart.","16:8":"and made him pass before Samuel. He said","16:9":"Neither has Yahweh chosen this.","16:10":"Yahweh has not chosen these.","16:11":"Are here all your children? He said","16:12":"and brought him in.  Now he was ruddy","16:13":"and anointed him in the midst of his brothers:  and the Spirit of Yahweh came mightily on David from that day forward.  So Samuel rose up","16:14":"and an evil spirit from Yahweh troubled him.","16:15":"See now","16:16":"to seek out a man who is a skillful player on the harp: and it shall happen","16:17":"Provide me now a man who can play well","16:18":"and said","16:19":"and said","16:20":"and a bottle of wine","16:21":"and stood before him:  and he loved him greatly; and he became his armor bearer.","16:22":"saying","16:23":"when the [evil] spirit from God was on Saul","17:1":"which belongs to Judah","17:2":"and encamped in the valley of Elah","17:3":"and Israel stood on the mountain on the other side: and there was a valley between them.","17:4":"named Goliath","17:5":"and he was clad with a coat of mail; and the weight of the coat was five thousand shekels of brass.","17:6":"and a javelin of brass between his shoulders.","17:7":"And the staff of his spear was like a weaver's beam; and his spear's head weighed six hundred shekels of iron: and one bearing a shield went before him.","17:8":"and said to them","17:9":"and kill me","17:10":"I defy the armies of Israel this day; give me a man","17:11":"they were dismayed","17:12":"whose name was Jesse; and he had eight sons:  and the man was an old man in the days of Saul","17:13":"and next to him Abinadab","17:14":"And David was the youngest: and the three eldest followed Saul.","17:15":"But David went and returned from Saul to feed his father's sheep at Bethlehem.","17:16":"and presented himself forty days.","17:17":"Take now for your brothers an ephah of this parched grain","17:18":"and look how your brothers fare","17:19":"and they","17:20":"and left the sheep with a keeper","17:21":"army against army.","17:22":"and ran to the army","17:23":"behold","17:24":"when they saw the man","17:25":"Have you seen this man who is come up? surely to defy Israel is he come up:  and it shall be","17:26":"saying","17:27":"saying","17:28":"and he said","17:29":"What have I now done?  Is there not a cause?","17:30":"and spoke after the same manner:  and the people answered him again after the former manner.","17:31":"they rehearsed them before Saul; and he sent for him.","17:32":"Let no man's heart fail because of him; your servant will go and fight with this Philistine.","17:33":"You are not able to go against this Philistine to fight with him; for you are but a youth","17:34":"Your servant was keeping his father's sheep; and when there came a lion","17:35":"and struck him","17:36":"seeing he has defied the armies of the living God.","17:37":"Yahweh who delivered me out of the paw of the lion","17:38":"and he put a helmet of brass on his head","17:39":"and he tried to go; for he had not proved it.  David said to Saul","17:40":"and chose him five smooth stones out of the brook","17:41":"And the Philistine came on and drew near unto David; and the man that bare the shield went before him.","17:42":"and saw David","17:43":"Am I a dog","17:44":"Come to me","17:45":"You come to me with a sword","17:46":"and take your head from off you; and I will give the dead bodies of the army of the Philistines this day to the birds of the sky","17:47":"and he will give you into our hand.","17:48":"when the Philistine arose","17:49":"and took there a stone","17:50":"and struck the Philistine","17:51":"and stood over the Philistine","17:52":"and shouted","17:53":"and they plundered their camp.","17:54":"and brought it to Jerusalem; but he put his armor in his tent.","17:55":"he said to Abner","17:56":"Inquire whose son the young man is!","17:57":"Abner took him","17:58":"Whose son are you","18:1":"when he had made an end of speaking to Saul","18:2":"and would let him go no more home to his father's house.","18:3":"because he loved him as his own soul.","18:4":"and gave it to David","18:5":"[and] behaved himself wisely: and Saul set him over the men of war","18:6":"when David returned from the slaughter of the Philistine","18:7":"and said","18:8":"and this saying displeased him; and he said","18:9":"And Saul eyed David from that day and forward.","18:10":"that an evil spirit from God came mightily on Saul","18:11":"I will strike David even to the wall.  David avoided out of his presence twice.","18:12":"because Yahweh was with him","18:13":"and made him his captain over a thousand; and he went out and came in before the people.","18:14":"And David behaved himself wisely in all his ways; and the LORD was with him.","18:15":"he stood in awe of him.","18:16":"But all Israel and Judah loved David","18:17":"Behold","18:18":"Who am I","18:19":"Saul's daughter","18:20":"Saul's daughter","18:21":"I will give her to him","18:22":"[saying]","18:23":"Seems it to you a light thing to be the king's son-in-law","18:24":"saying","18:25":"Thus shall you tell David","18:26":"it pleased David well to be the king's son-in-law. The days were not expired;","18:27":"he and his men","18:28":"Saul's daughter","18:29":"And Saul was yet the more afraid of David; and Saul became David's enemy continually.","18:30":"as often as they went forth","19:1":"and to all his servants","19:2":"saying","19:3":"and I will commune with my father of you; and if I see anything","19:4":"and said to him","19:5":"and struck the Philistine","19:6":"As Yahweh lives","19:7":"and Jonathan showed him all those things. Jonathan brought David to Saul","19:8":"and fought with the Philistines","19:9":"as he sat in his house with his spear in his hand; and David was playing with his hand.","19:10":"and he struck the spear into the wall:  and David fled","19:11":"to watch him","19:12":"and fled","19:13":"and laid it in the bed","19:14":"she said","19:15":"saying","19:16":"behold","19:17":"Why have you deceived me thus","19:18":"and escaped","19:19":"saying","19:20":"and Samuel standing as head over them","19:21":"he sent other messengers","19:22":"and came to the great well that is in Secu:  and he asked and said","19:23":"and he went on","19:24":"and he also prophesied before Samuel","20:1":"and came and said before Jonathan","20:2":"Far from it; you shall not die:  behold, my father does nothing either great or small, but that he discloses it to me; and why should my father hide this thing from me? It is not so.","20:3":"and said","20:4":"Whatever your soul desires, I will even do it for you.","20:5":"Behold, tomorrow is the new moon, and I should not fail to dine with the king; but let me go, that I may hide myself in the field to the third day at evening.,And David said unto Jonathan, Behold, to morrow is the new moon, and I should not fail to sit with the king at meat: but let me go, that I may hide myself in the field unto the third day at even.,  וַיֹּאמֶר דָּוִד אֶל־יְהוֹנָתָן הִנֵּה־חֹדֶשׁ מָחָר וְאָנֹכִי יָשֹׁב־אֵשֵׁב עִם־הַמֶּלֶךְ לֶאֱכוֹל וְשִׁלַּחְתַּנִי וְנִסְתַּרְתִּי בַשָּׂדֶה עַד הָעֶרֶב הַשְּׁלִשִׁית׃ ‬,And David said unto Jonathan: Behold","20:6":"then say","20:7":"'It is well;' your servant shall have peace: but if he be angry","20:8":"kill me yourself; for why should you bring me to your father?,Therefore thou shalt deal kindly with thy servant; for thou hast brought thy servant into a covenant of the LORD with thee: notwithstanding, if there be in me iniquity, slay me thyself; for why shouldest thou bring me to thy father?,  וְעָשִׂיתָ חֶסֶד עַל־עַבְדֶּךָ כִּי בִּבְרִית יְהוָה הֵבֵאתָ אֶת־עַבְדְּךָ עִמָּךְ וְאִם־יֶשׁ־בִּי עָוֺן הֲמִיתֵנִי אַתָּה וְעַד־אָבִיךָ לָמָּה־זֶּה תְבִיאֵנִי׃ פ ‬,Therefore deal kindly with thy servant; for thou hast brought thy servant into a covenant of the LORD with thee; but if there be in me iniquity, slay me thyself; for why shouldest thou bring me to thy father?","20:9":"Far be it from you; for if I should at all know that evil were determined by my father to come on you, then wouldn't I tell you that?","20:10":"Who shall tell me if perchance your father answer you roughly?","20:11":"Come, and let us go out into the field. They both went out into the field.","20:12":"Yahweh, the God of Israel, [be witness]: when I have sounded my father about this time tomorrow, [or] the third day, behold, if there be good toward David, shall I not then send to you, and disclose it to you?,And Jonathan said unto David, O LORD God of Israel, when I have sounded my father about to morrow any time, or the third day, and, behold, if there be good toward David, and I then send not unto thee, and show it thee;,  וַיֹּאמֶר יְהוֹנָתָן אֶל־דָּוִד יְהוָה אֱלֹהֵי יִשְׂרָאֵל כִּי־אֶחְקֹר אֶת־אָבִי כָּעֵת מָחָר הַשְּׁלִשִׁית וְהִנֵּה־טוֹב אֶל־דָּוִד וְלֹא־אָז אֶשְׁלַח אֵלֶיךָ וְגָלִיתִי אֶת־אָזְנֶךָ׃ ‬,And Jonathan said unto David: The LORD","20:13":"and more also","20:14":"that I not die;","20:15":"not when Yahweh has cut off the enemies of David everyone from the surface of the earth.,But also thou shalt not cut off thy kindness from my house for ever: no, not when the LORD hath cut off the enemies of David every one from the face of the earth.,  וְלֹא־תַכְרִת אֶת־חַסְדְּךָ מֵעִם בֵּיתִי עַד־עוֹלָם וְלֹא בְּהַכְרִת יְהוָה אֶת־אֹיְבֵי דָוִד אִישׁ מֵעַל פְּנֵי הָאֲדָמָה׃ ‬,but also thou shalt not cut off thy kindness from my house for ever; no, not when the LORD hath cut off the enemies of David every one from the face of the earth.","20:16":"[saying]","20:17":"for the love that he had to him; for he loved him as he loved his own soul.","20:18":"Tomorrow is the new moon: and you will be missed","20:19":"you shall go down quickly","20:20":"as though I shot at a mark.","20:21":"I will send the boy","20:22":"Behold","20:23":"behold","20:24":"the king sat him down to eat food.","20:25":"as at other times","20:26":"Something has happened to him.  He is not clean. Surely he is not clean.","20:27":"[which was] the second [day]","20:28":"David earnestly asked leave of me to go to Bethlehem:","20:29":"Please let me go","20:30":"and he said to him","20:31":"you shall not be established","20:32":"and said to him","20:33":"And Saul cast a javelin at him to smite him: whereby Jonathan knew that it was determined of his father to slay David.","20:34":"and ate no food the second day of the month; for he was grieved for David","20:35":"that Jonathan went out into the field at the time appointed with David","20:36":"Run","20:37":"Jonathan cried after the boy","20:38":"Go fast!  Hurry!  Don't delay! Jonathan's boy gathered up the arrows","20:39":"But the lad knew not any thing: only Jonathan and David knew the matter.","20:40":"and said to him","20:41":"David arose out of [a place] toward the South","20:42":"Go in peace","21:1":"and said to him","21:2":"The king has commanded me a business","21:3":"or whatever there is present.","21:4":"and said","21:5":"and said to him","21:6":"that was taken from before Yahweh","21:7":"detained before Yahweh; and his name was Doeg the Edomite","21:8":"Isn't there here under your hand spear or sword? for I have neither brought my sword nor my weapons with me","21:9":"The sword of Goliath the Philistine","21:10":"and fled that day for fear of Saul","21:11":"Isn't this David the king of the land?  Didn't they sing one to another about him in dances, saying, 'Saul has slain his thousands, David his ten thousands?'","21:12":"and was very afraid of Achish the king of Gath.","21:13":"and feigned himself mad in their hands","21:14":"Look","21:15":"that you have brought this fellow to play the madman in my presence? shall this fellow come into my house?","22:1":"and escaped to the cave of Adullam: and when his brothers and all his father's house heard it","22:2":"and everyone who was in debt","22:3":"Please let my father and my mother come forth","22:4":"And he brought them before the king of Moab: and they dwelt with him all the while that David was in the hold.","22:5":"Don't stay in the stronghold; depart","22:6":"and the men who were with him: now Saul was sitting in Gibeah","22:7":"Hear now","22:8":"and there is none who discloses to me when my son makes a league with the son of Jesse","22:9":"who stood by the servants of Saul","22:10":"and gave him food","22:11":"the son of Ahitub","22:12":"Hear now","22:13":"Why have you conspired against me","22:14":"and said","22:15":"nor to all the house of my father; for your servant knows nothing of all this","22:16":"You shall surely die","22:17":"Turn","22:18":"Turn you","22:19":"the city of the priests","22:20":"the son of Ahitub","22:21":"And Abiathar showed David that Saul had slain the LORD's priests.","22:22":"I knew on that day","22:23":"don't be afraid; for he who seeks my life seeks your life:  for with me you shall be in safeguard.","23:1":"saying","23:2":"saying","23:3":"Behold","23:4":"and said","23:5":"and fought with the Philistines","23:6":"when Abiathar the son of Ahimelech fled to David to Keilah","23:7":"God has delivered him into my hand; for he is shut in","23:8":"to go down to Keilah","23:9":"Bring here the ephod.","23:10":"O Yahweh","23:11":"as your servant has heard? Yahweh","23:12":"Will the men of Keilah deliver up to me and my men into the hand of Saul?  Yahweh said","23:13":"who were about six hundred","23:14":"and remained in the hill country in the wilderness of Ziph. Saul sought him every day","23:15":"And David saw that Saul was come out to seek his life: and David was in the wilderness of Ziph in a wood.","23:16":"Saul's son","23:17":"Don't be afraid; for the hand of Saul my father shall not find you; and you shall be king over Israel","23:18":"and Jonathan went to his house.","23:19":"saying","23:20":"O king","23:21":"Blessed be you of Yahweh; for you have had compassion on me.","23:22":"and know and see his place where his haunt is","23:23":"and take knowledge of all the lurking places where he hides himself","23:24":"and went to Ziph before Saul:  but David and his men were in the wilderness of Maon","23:25":"he went down to the rock","23:26":"and David and his men on that side of the mountain:  and David made haste to get away for fear of Saul; for Saul and his men compassed David and his men round about to take them.","23:27":"saying","23:28":"and went against the Philistines:  therefore they called that place Sela Hammahlekoth.","23:29":"and lived in the strongholds of En Gedi.","24:1":"when Saul was returned from following the Philistines","24:2":"and went to seek David and his men on the rocks of the wild goats.","24:3":"where was a cave; and Saul went in to relieve himself.  Now David and his men were abiding in the innermost parts of the cave.","24:4":"Behold","24:5":"that David's heart struck him","24:6":"Yahweh forbid that I should do this thing to my lord","24:7":"and didn't allow them to rise against Saul.  Saul rose up out of the cave","24:8":"and went out of the cave","24:9":"Why listen you to men's words","24:10":"this day your eyes have seen how that Yahweh had delivered you today into my hand in the cave: and some bade me kill you; but [my eye] spared you; and I said","24:11":"my father","24:12":"and Yahweh avenge me of you; but my hand shall not be on you.","24:13":"Out of the wicked comes forth wickedness; but my hand shall not be on you.","24:14":"after a flea.","24:15":"and give sentence between me and you","24:16":"when David had made an end of speaking these words to Saul","24:17":"You are more righteous than I; for you have rendered to me good","24:18":"because when Yahweh had delivered me up into your hand","24:19":"will he let him go away unharmed? Therefore may Yahweh reward you good for that which you have done to me this day.","24:20":"behold","24:21":"that you will not cut off my seed after me","24:22":"And David sware unto Saul. And Saul went home; but David and his men gat them up unto the hold.","25:1":"and lamented him","25:2":"whose possessions were in Carmel; and the man was very great","25:3":"and of a beautiful face: but the man was churlish and evil in his doings; and he was of the house of Caleb.","25:4":"And David heard in the wilderness that Nabal did shear his sheep.","25:5":"and David said to the young men","25:6":"Peace be to you","25:7":"and we did them no hurt","25:8":"and they will tell you:  therefore let the young men find favor in your eyes; for we come in a good day. Please give whatever comes to your hand","25:9":"they spoke to Nabal according to all those words in the name of David","25:10":"and said","25:11":"and my water","25:12":"and went back","25:13":"Gird you on every man his sword. They girded on every man his sword; and David also girded on his sword:  and there went up after David about four hundred men; and two hundred abode by the baggage.","25:14":"Nabal's wife","25:15":"and we were not hurt","25:16":"all the while we were with them keeping the sheep.","25:17":"and against all his house: for he is such a worthless fellow that one can't speak to him.","25:18":"and took two hundred loaves","25:19":"Go on before me; behold","25:20":"as she rode on her donkey","25:21":"Surely in vain have I kept all that this fellow has in the wilderness","25:22":"and more also","25:23":"she hurried","25:24":"and said","25:25":"even Nabal; for as his name is","25:26":"my lord","25:27":"let it be given to the young men who follow my lord.","25:28":"because my lord fights the battles of Yahweh; and evil shall not be found in you all your days.","25:29":"and to seek your soul","25:30":"when Yahweh shall have done to my lord according to all the good that he has spoken concerning you","25:31":"nor offense of heart to my lord","25:32":"Blessed be Yahweh","25:33":"and blessed be you","25:34":"as Yahweh","25:35":"Go up in peace to your house; behold","25:36":"he held a feast in his house","25:37":"when the wine was gone out of Nabal","25:38":"that Yahweh struck Nabal","25:39":"he said","25:40":"they spoke to her","25:41":"and bowed herself with her face to the earth","25:42":"and arose","25:43":"David also took Ahinoam of Jezreel; and they were also both of them his wives.","25:44":"David's wife","26:1":"saying","26:2":"and went down to the wilderness of Ziph","26:3":"which is before the desert","26:4":"and understood that Saul was come of a certainty.","26:5":"and came to the place where Saul had encamped; and David saw the place where Saul lay","26:6":"and to Abishai the son of Zeruiah","26:7":"behold","26:8":"God has delivered up your enemy into your hand this day:  now therefore please let me strike him with the spear to the earth at one stroke","26:9":"Don't destroy him; for who can put forth his hand against Yahweh's anointed","26:10":"As Yahweh lives","26:11":"and the jar of water","26:12":"nor knew it","26:13":"and stood on the top of the mountain afar off; a great space being between them;","26:14":"and to Abner the son of Ner","26:15":"Aren't you a [valiant] man? and who is like you in Israel? why then have you not kept watch over your lord","26:16":"you are worthy to die","26:17":"and said","26:18":"Why does my lord pursue after his servant? for what have I done? or what evil is in my hand?","26:19":"please let my lord the king hear the words of his servant.  If it be Yahweh that has stirred you up against me","26:20":"don't let my blood fall to the earth away from the presence of Yahweh:  for the king of Israel is come out to seek a flea","26:21":"I have sinned:  return","26:22":"Behold the spear","26:23":"and I wouldn't put forth my hand against Yahweh's anointed.","26:24":"as your life was much set by this day in my eyes","26:25":"Blessed be you","27:1":"I shall now perish one day by the hand of Saul:  there is nothing better for me than that I should escape into the land of the Philistines; and Saul will despair of me","27:2":"and passed over","27:3":"he and his men","27:4":"And it was told Saul that David was fled to Gath: and he sought no more again for him.","27:5":"If now I have found favor in your eyes","27:6":"Then Achish gave him Ziklag that day: wherefore Ziklag pertaineth unto the kings of Judah unto this day.","27:7":"And the time that David dwelt in the country of the Philistines was a full year and four months.","27:8":"and made a raid on the Geshurites","27:9":"and saved neither man nor woman alive","27:10":"Against whom have you made a raid today? David said","27:11":"to bring them to Gath","27:12":"saying","28:1":"that the Philistines gathered their armies together for warfare","28:2":"Therefore you shall know what your servant will do.  Achish said to David","28:3":"and all Israel had lamented him","28:4":"and came and encamped in Shunem:  and Saul gathered all Israel together","28:5":"he was afraid","28:6":"Yahweh didn't answer him","28:7":"Seek me a woman who has a familiar spirit","28:8":"and put on other clothing","28:9":"Behold","28:10":"saying","28:11":"Whom shall I bring up to you? He said","28:12":"she cried with a loud voice; and the woman spoke to Saul","28:13":"Don't be afraid:  for what do you see? The woman said to Saul","28:14":"What form is he of?  She said","28:15":"Why have you disquieted me","28:16":"Why then do you ask of me","28:17":"as he spoke by me:  and Yahweh has torn the kingdom out of your hand","28:18":"and didn't execute his fierce wrath on Amalek","28:19":"Moreover the LORD will also deliver Israel with thee into the hand of the Philistines: and to morrow shalt thou and thy sons be with me: the LORD also shall deliver the host of Israel into the hand of the Philistines.","28:20":"and was sore afraid","28:21":"and saw that he was sore troubled","28:22":"please listen also to the voice of your handmaid","28:23":"and said","28:24":"and killed it; and she took flour","28:25":"and before his servants; and they ate.  Then they rose up","29:1":"Now the Philistines gathered together all their armies to Aphek: and the Israelites pitched by a fountain which is in Jezreel.","29:2":"and by thousands; and David and his men passed on in the rearward with Achish.","29:3":"What [do] these Hebrews [here]?  Achish said to the princes of the Philistines","29:4":"Make the man return","29:5":"of whom they sang one to another in dances","29:6":"and said to him","29:7":"and go in peace","29:8":"But what have I done? and what have you found in your servant so long as I have been before you to this day","29:9":"I know that you are good in my sight","29:10":"and have light","29:11":"he and his men","30:1":"when David and his men were come to Ziklag on the third day","30:2":"both small and great:  they didn't kill any","30:3":"behold","30:4":"until they had no more power to weep.","30:5":"Ahinoam the Jezreelitess","30:6":"because the soul of all the people was grieved","30:7":"the son of Ahimelech","30:8":"saying","30:9":"he and the six hundred men who were with him","30:10":"he and four hundred men; for two hundred stayed behind","30:11":"and brought him to David","30:12":"and two clusters of raisins: and when he had eaten","30:13":"To whom belong you? and whence are you? He said","30:14":"and on that which belongs to Judah","30:15":"Will you bring me down to this troop? He said","30:16":"behold","30:17":"except four hundred young men","30:18":"And David recovered all that the Amalekites had carried away: and David rescued his two wives.","30:19":"neither small nor great","30:20":"[which] they drove before those [other] livestock","30:21":"who were so faint that they could not follow David","30:22":"of those who went with David","30:23":"You shall not do so","30:24":"so shall his share be who tarries by the baggage:  they shall share alike.","30:25":"that he made it a statute and an ordinance for Israel to this day.","30:26":"he sent of the spoil to the elders of Judah","30:27":"and to those who were in Ramoth of the South","30:28":"and to those who were in Siphmoth","30:29":"and to those who were in the cities of the Jerahmeelites","30:30":"and to those who were in Borashan","30:31":"and to all the places where David himself and his men used to stay.","31:1":"and fell down slain on Mount Gilboa.","31:2":"and Abinadab","31:3":"and the archers overtook him; and he was greatly distressed by reason of the archers.","31:4":"Draw your sword","31:5":"he likewise fell on his sword","31:6":"and his three sons","31:7":"and those who were beyond the Jordan","31:8":"when the Philistines came to strip the slain","31:9":"and stripped off his armor","31:10":"And they put his armor in the house of Ashtaroth: and they fastened his body to the wall of Bethshan.","31:11":"","31:12":"and went all night","31:13":"and buried them under the tamarisk tree in Jabesh"}