{"1:1":"and Yahweh his God was with him","1:2":"to the captains of thousands and of hundreds","1:3":"and all the assembly with him","1:4":"But the ark of God had David brought up from Kirjathjearim to the place which David had prepared for it: for he had pitched a tent for it at Jerusalem.","1:5":"that Bezalel the son of Uri","1:6":"which was at the tent of meeting","1:7":"and said to him","1:8":"You have shown great loving kindness to David my father","1:9":"Yahweh God","1:10":"that I may go out and come in before this people; for who can judge this your people","1:11":"Because this was in your heart","1:12":"and wealth","1:13":"from before the tent of meeting","1:14":"and twelve thousand horsemen","1:15":"and cedars made he to be as the sycamore trees that are in the lowland","1:16":"And Solomon had horses brought out of Egypt","1:17":"and a horse for one hundred fifty: and so for all the kings of the Hittites","2:1":"and a house for his kingdom.","2:2":"and eighty thousand men who were stone cutters in the mountains","2:3":"saying","2:4":"I am about to build a house for the name of Yahweh my God","2:5":"And the house which I build is great: for great is our God above all gods.","2:6":"seeing heaven and the heaven of heavens can't contain him? who am I then","2:7":"and in silver","2:8":"fir trees","2:9":"Even to prepare me timber in abundance: for the house which I am about to build shall be wonderful great.","2:10":"I will give to your servants","2:11":"which he sent to Solomon","2:12":"Blessed be Yahweh, the God of Israel, that made heaven and earth, who has given to David the king a wise son, endowed with discretion and understanding, that should build a house for Yahweh, and a house for his kingdom.,Huram said moreover, Blessed be the LORD God of Israel, that made heaven and earth, who hath given to David the king a wise son, endued with prudence and understanding, that might build an house for the LORD, and an house for his kingdom.,  וַיֹּאמֶר חוּרָם בָּרוּךְ יְהוָה אֱלֹהֵי יִשְׂרָאֵל אֲשֶׁר עָשָׂה אֶת־הַשָּׁמַיִם וְאֶת־הָאָרֶץ אֲשֶׁר נָתַן לְדָוִיד הַמֶּלֶךְ בֵּן חָכָם יוֹדֵעַ שֵׂכֶל וּבִינָה אֲשֶׁר יִבְנֶה־בַּיִת לַיהוָה וּבַיִת לְמַלְכוּתוֹ׃ ‬,Huram said moreover: Blessed be the LORD","2:13":"endowed with understanding","2:14":"skillful to work in gold","2:15":"the oil and the wine","2:16":"as much as you shall need; and we will bring it to you in floats by sea to Joppa; and you shall carry it up to Jerusalem.,And we will cut wood out of Lebanon, as much as thou shalt need: and we will bring it to thee in floats by sea to Joppa; and thou shalt carry it up to Jerusalem.,  וַאֲנַחְנוּ נִכְרֹת עֵצִים מִן־הַלְּבָנוֹן כְּכָל־צָרְכֶּךָ וּנְבִיאֵם לְךָ רַפְסֹדוֹת עַל־יָם יָפוֹ וְאַתָּה תַּעֲלֶה אֹתָם יְרוּשָׁלִָם׃ פ ‬,and we will cut wood out of Lebanon, as much as thou shalt need; and we will bring it to thee in floats by sea to Joppa; and thou shalt carry it up to Jerusalem.","2:17":"after the numbering with which David his father had numbered them; and they were found one hundred fifty-three thousand six hundred.","2:18":"and eighty thousand who were stone cutters in the mountains","3:1":"where [Yahweh] appeared to David his father","3:2":"in the fourth year of his reign.","3:3":"and the breadth twenty cubits.","3:4":"the length of it","3:5":"which he overlaid with fine gold","3:6":"And he garnished the house with precious stones for beauty: and the gold was gold of Parvaim.","3:7":"the beams","3:8":"according to the breadth of the house","3:9":"And the weight of the nails was fifty shekels of gold. And he overlaid the upper chambers with gold.","3:10":"And in the most holy house he made two cherubim of image work","3:11":"reaching to the wall of the house; and the other wing was [likewise] five cubits","3:12":"reaching to the wall of the house; and the other wing was five cubits [also]","3:13":"and their faces were toward the house.","3:14":"and purple","3:15":"and the capital that was on the top of each of them was five cubits.","3:16":"and put [them] on the tops of the pillars; and he made one hundred pomegranates","3:17":"one on the right hand","4:1":"twenty cubits the length of it","4:2":"round in compass; and the height of it was five cubits; and a line of thirty cubits compassed it round about.","4:3":"which did compass it round about","4:4":"three looking toward the north","4:5":"like the flower of a lily: it received and held three thousand baths.","4:6":"and put five on the right hand","4:7":"five on the right hand","4:8":"and placed them in the temple","4:9":"and the great court","4:10":"toward the south.","4:11":"and the shovels","4:12":"and the bowls","4:13":"to cover the two bowls of the capitals that were on the pillars.","4:14":"and the basins made he on the bases;","4:15":"and the twelve oxen under it.","4:16":"and the shovels","4:17":"in the clay ground between Succoth and Zeredah.","4:18":"Thus Solomon made all these vessels in great abundance: for the weight of the brass could not be found out.","4:19":"the golden altar also","4:20":"to burn according to the ordinance before the oracle","4:21":"and the lamps","4:22":"and the basins","5:1":"even the silver","5:2":"and all the heads of the tribes","5:3":"which was [in] the seventh month.","5:4":"And all the elders of Israel came; and the Levites took up the ark.","5:5":"and the tent of meeting","5:6":"that were assembled to him","5:7":"into the oracle of the house","5:8":"and the cherubim covered the ark and the poles of it above.","5:9":"And they drew out the staves of the ark","5:10":"when Yahweh made a covenant with the children of Israel","5:11":"when the priests were come out of the holy place","5:12":"all of them","5:13":"when the trumpeters and singers were as one","5:14":"So that the priests could not stand to minister by reason of the cloud: for the glory of the LORD had filled the house of God.","6:1":"Yahweh has said that he would dwell in the thick darkness.","6:2":"and a place for you to dwell in forever.","6:3":"and blessed all the assembly of Israel: and all the assembly of Israel stood.","6:4":"Blessed be Yahweh","6:5":"I chose no city out of all the tribes of Israel to build a house in","6:6":"that my name might be there; and have chosen David to be over my people Israel.","6:7":"the God of Israel.","6:8":"Whereas it was in your heart to build a house for my name","6:9":"he shall build the house for my name.","6:10":"and sit on the throne of Israel","6:11":"in which is the covenant of Yahweh","6:12":"and spread forth his hands","6:13":"five cubits long","6:14":"Yahweh","6:15":"you spoke with your mouth","6:16":"Yahweh","6:17":"Yahweh","6:18":"heaven and the heaven of heavens can't contain you; how much less this house which I have built!","6:19":"and to his supplication","6:20":"even toward the place where you have said that you would put your name; to listen to the prayer which your servant shall pray toward this place.","6:21":"and of your people Israel","6:22":"and an oath is laid on him to cause him to swear","6:23":"and do","6:24":"because they have sinned against you","6:25":"and forgive the sin of your people Israel","6:26":"and there is no rain","6:27":"and forgive the sin of your servants","6:28":"if there be pestilence","6:29":"or by all your people Israel","6:30":"your dwelling place and forgive","6:31":"to walk in your ways","6:32":"who is not of your people Israel","6:33":"even from your dwelling place","6:34":"by whatever way you shall send them","6:35":"and maintain their cause.","6:36":"and you are angry with them","6:37":"and turn again","6:38":"where they have carried them captive","6:39":"even from your dwelling place","6:40":"my God","6:41":"Yahweh God","6:42":"don't turn away the face of your anointed: remember [your] loving kindnesses to David your servant.","7:1":"the fire came down from heaven","7:2":"because the glory of Yahweh filled Yahweh's house.","7:3":"when the fire came down","7:4":"Then the king and all the people offered sacrifices before the LORD.","7:5":"and a hundred and twenty thousand sheep.  So the king and all the people dedicated the house of God.","7:6":"according to their offices; the Levites also with instruments of music of Yahweh","7:7":"and the fat of the peace offerings","7:8":"and all Israel with him","7:9":"and the feast seven days.","7:10":"joyful and glad of heart for the goodness that Yahweh had shown to David","7:11":"and the king's house: and he successfully completed all that came into Solomon's heart to make in the house of Yahweh","7:12":"and said to him","7:13":"or if I command the locust to devour the land","7:14":"who are called by my name","7:15":"and my ears attentive","7:16":"that my name may be there forever; and my eyes and my heart shall be there perpetually.","7:17":"if you will walk before me as David your father walked","7:18":"according as I covenanted with David your father","7:19":"and forsake my statutes and my commandments which I have set before you","7:20":"which I have made holy for my name","7:21":"which is so high","7:22":"Because they abandoned Yahweh","8:1":"in which Solomon had built the house of Yahweh","8:2":"Solomon built them","8:3":"and prevailed against it.","8:4":"and all the storage cities","8:5":"and Beth Horon the lower","8:6":"and all the storage cities that Solomon had","8:7":"and the Amorites","8:8":"whom the children of Israel didn't consume","8:9":"and chief of his captains","8:10":"even two-hundred fifty","8:11":"My wife shall not dwell in the house of David king of Israel","8:12":"which he had built before the porch","8:13":"offering according to the commandment of Moses","8:14":"according to the ordinance of David his father","8:15":"or concerning the treasures.","8:16":"and until it was finished. [So] the house of Yahweh was completed.","8:17":"and to Eloth","8:18":"and fetched from there four hundred fifty talents of gold","9:1":"she came to prove Solomon with hard questions at Jerusalem","9:2":"And Solomon told her all her questions: and there was nothing hid from Solomon which he told her not.","9:3":"and the house that he had built","9:4":"and the sitting of his servants","9:5":"It was a true report that I heard in my own land of your acts","9:6":"until I came","9:7":"and happy are these your servants","9:8":"who delighted in you","9:9":"and spices in great abundance","9:10":"and the servants of Solomon","9:11":"and for the king's house","9:12":"whatever she asked","9:13":"","9:14":"Beside that which chapmen and merchants brought. And all the kings of Arabia and governors of the country brought gold and silver to Solomon.","9:15":"And king Solomon made two hundred targets of beaten gold: six hundred shekels of beaten gold went to one target.","9:16":"And three hundred shields made he of beaten gold: three hundred shekels of gold went to one shield. And the king put them in the house of the forest of Lebanon.","9:17":"and overlaid it with pure gold.","9:18":"with a footstool of gold","9:19":"And twelve lions stood there on the one side and on the other upon the six steps. There was not the like made in any kingdom.","9:20":"and all the vessels of the house of the forest of Lebanon were of pure gold: silver was nothing accounted of in the days of Solomon.","9:21":"bringing gold","9:22":"And king Solomon passed all the kings of the earth in riches and wisdom.","9:23":"to hear his wisdom","9:24":"vessels of silver","9:25":"and twelve thousand horsemen","9:26":"and to the border of Egypt.","9:27":"and he made cedars to be as the sycamore trees that are in the lowland","9:28":"and out of all lands.","9:29":"first and last","9:30":"And Solomon reigned in Jerusalem over all Israel forty years.","9:31":"and he was buried in the city of David his father:  and Rehoboam his son reigned in his place.","10:1":"And Rehoboam went to Shechem: for to Shechem were all Israel come to make him king.","10:2":"when Jeroboam the son of Nebat heard of it","10:3":"and they spoke to Rehoboam","10:4":"and his heavy yoke which he put on us","10:5":"Come again to me after three days. The people departed.","10:6":"who had stood before Solomon his father while he yet lived","10:7":"saying","10:8":"and took counsel with the young men who had grown up with him","10:9":"What counsel give you","10:10":"saying","10:11":"I will add to your yoke:  my father chastised you with whips","10:12":"as the king bade","10:13":"","10:14":"saying","10:15":"that Yahweh might establish his word","10:16":"the people answered the king","10:17":"Rehoboam reigned over them.","10:18":"who was over the men subject to forced labor; and the children of Israel stoned him to death with stones.  King Rehoboam made speed to get him up to his chariot","10:19":"And Israel rebelled against the house of David unto this day.","11:1":"he assembled the house of Judah and Benjamin","11:2":"saying","11:3":"king of Judah","11:4":"You shall not go up","11:5":"and built cities for defense in Judah.","11:6":"and Etam","11:7":"and Soco","11:8":"and Mareshah","11:9":"and Lachish","11:10":"and Aijalon","11:11":"and put captains in them","11:12":"and made them exceeding strong.  Judah and Benjamin belonged to him.","11:13":"And the priests and the Levites that were in all Israel resorted to him out of all their coasts.","11:14":"and came to Judah and Jerusalem:  for Jeroboam and his sons cast them off","11:15":"and for the male goats","11:16":"out of all the tribes of Israel","11:17":"and made Rehoboam the son of Solomon strong","11:18":"Mahalath the daughter of Jerimoth the son of David","11:19":"and Shemariah","11:20":"and Attai","11:21":"and sixty concubines","11:22":"[even] the prince among his brothers; for [he was minded] to make him king.","11:23":"and dispersed of all his sons throughout all the lands of Judah and Benjamin","12:1":"when the kingdom of Rehoboam was established","12:2":"that Shishak king of Egypt came up against Jerusalem","12:3":"and sixty thousand horsemen. The people were without number who came with him out of Egypt: the Lubim","12:4":"and came to Jerusalem.","12:5":"and to the princes of Judah","12:6":"Yahweh is righteous.","12:7":"the word of Yahweh came to Shemaiah","12:8":"that they may know my service","12:9":"and took away the treasures of the house of Yahweh","12:10":"and committed them to the hands of the captains of the guard","12:11":"that as often as the king entered into the house of Yahweh","12:12":"the wrath of Yahweh turned from him","12:13":"and reigned: for Rehoboam was forty-one years old when he began to reign","12:14":"because he didn't set his heart to seek Yahweh.","12:15":"first and last","12:16":"and was buried in the city of David: and Abijah his son reigned in his place.","13:1":"Now in the eighteenth year of king Jeroboam began Abijah to reign over Judah.","13:2":"He reigned three years in Jerusalem. His mother's name also was Michaiah the daughter of Uriel of Gibeah. And there was war between Abijah and Jeroboam.","13:3":"even four hundred thousand chosen men:  and Jeroboam set the battle in array against him with eight hundred thousand chosen men","13:4":"which is in the hill country of Ephraim","13:5":"the God of Israel","13:6":"the servant of Solomon the son of David","13:7":"base fellows","13:8":"and there are with you the golden calves which Jeroboam made you for gods.","13:9":"the sons of Aaron","13:10":"Yahweh is our God","13:11":"to burn every evening:  for we keep the charge of Yahweh our God; but you have forsaken him.","13:12":"God is with us at our head","13:13":"and the ambush was behind them.","13:14":"behold","13:15":"it happened","13:16":"And the children of Israel fled before Judah: and God delivered them into their hand.","13:17":"And Abijah and his people slew them with a great slaughter: so there fell down slain of Israel five hundred thousand chosen men.","13:18":"and the children of Judah prevailed","13:19":"and took cities from him","13:20":"and he died.","13:21":"and took to himself fourteen wives","13:22":"and his ways","14:1":"and they buried him in the city of David; and Asa his son reigned in his place. In his days the land was quiet ten years.","14:2":"And Asa did that which was good and right in the eyes of the LORD his God:","14:3":"and the high places","14:4":"the God of their fathers","14:5":"Also he took away out of all the cities of Judah the high places and the images: and the kingdom was quiet before him.","14:6":"and he had no war in those years","14:7":"Let us build these cities","14:8":"out of Judah three hundred thousand; and out of Benjamin","14:9":"and three hundred chariots; and he came to Mareshah.","14:10":"and they set the battle in array in the valley of Zephathah at Mareshah.","14:11":"and said","14:12":"and before Judah; and the Ethiopians fled.","14:13":"and before his army; and they carried away very much booty.","14:14":"And they smote all the cities round about Gerar; for the fear of the LORD came upon them: and they spoiled all the cities; for there was exceeding much spoil in them.","14:15":"and carried away sheep in abundance","15:1":"And the Spirit of God came upon Azariah the son of Oded:","15:2":"and said to him","15:3":"and without a teaching priest","15:4":"the God of Israel","15:5":"nor to him who came in; but great vexations were on all the inhabitants of the lands.","15:6":"nation against nation","15:7":"and don't let your hands be slack; for your work shall be rewarded.","15:8":"and the prophecy of Oded the prophet","15:9":"and those who sojourned with them out of Ephraim and Manasseh","15:10":"in the fifteenth year of the reign of Asa.","15:11":"of the spoil which they had brought","15:12":"the God of their fathers","15:13":"the God of Israel","15:14":"and with shouting","15:15":"and sought him with their whole desire; and he was found of them:  and Yahweh gave them rest round about.","15:16":"the mother of Asa the king","15:17":"But the high places were not taken away out of Israel: nevertheless the heart of Asa was perfect all his days.","15:18":"and that he himself had dedicated","15:19":"And there was no more war unto the five and thirtieth year of the reign of Asa.","16:1":"Baasha king of Israel went up against Judah","16:2":"and sent to Ben Hadad king of Syria","16:3":"as [there was] between my father and your father:  behold","16:4":"and sent the captains of his armies against the cities of Israel; and they struck Ijon","16:5":"when Baasha heard of it","16:6":"and the timber of it","16:7":"and said to him","16:8":"with chariots and horsemen exceeding many? yet","16:9":"to show himself strong in the behalf of them whose heart is perfect toward him.  Herein you have done foolishly; for from henceforth you shall have wars.","16:10":"and put him in the prison; for he was in a rage with him because of this thing. Asa oppressed some of the people at the same time.","16:11":"the acts of Asa","16:12":"but to the physicians.","16:13":"and died in the one and fortieth year of his reign.","16:14":"which he had hewn out for himself in the city of David","17:1":"and strengthened himself against Israel.","17:2":"and set garrisons in the land of Judah","17:3":"because he walked in the first ways of his father David","17:4":"and walked in his commandments","17:5":"Therefore the LORD stablished the kingdom in his hand; and all Judah brought to Jehoshaphat presents; and he had riches and honor in abundance.","17:6":"And his heart was lifted up in the ways of the LORD: moreover he took away the high places and groves out of Judah.","17:7":"even Ben Hail","17:8":"even Shemaiah","17:9":"having the book of the law of Yahweh with them; and they went about throughout all the cities of Judah","17:10":"so that they made no war against Jehoshaphat.","17:11":"and silver for tribute; the Arabians also brought him flocks","17:12":"And Jehoshaphat waxed great exceedingly; and he built in Judah castles","17:13":"mighty men of valor","17:14":"the captains of thousands:  Adnah the captain","17:15":"and with him two hundred eighty thousand;","17:16":"who willingly offered himself to Yahweh; and with him two hundred thousand mighty men of valor.","17:17":"and with him two hundred thousand armed with bow and shield;","17:18":"And next him was Jehozabad","17:19":"besides those whom the king put in the fortified cities throughout all Judah.","18:1":"Now Jehoshaphat had riches and honor in abundance","18:2":"and for the people who were with him","18:3":"Will you go with me to Ramoth Gilead?  He answered him","18:4":"Please inquire first for the word of Yahweh.","18:5":"four hundred men","18:6":"Isn't there here a prophet of Yahweh besides","18:7":"There is yet one man by whom we may inquire of Yahweh:  but I hate him; for he never prophesies good concerning me","18:8":"and said","18:9":"arrayed in their robes","18:10":"and said","18:11":"saying","18:12":"saying","18:13":"As Yahweh lives","18:14":"the king said to him","18:15":"How many times shall I adjure you that you speak to me nothing but the truth in the name of Yahweh?","18:16":"I saw all Israel scattered on the mountains","18:17":"Didn't I tell you that he would not prophesy good concerning me","18:18":"Therefore hear you the word of Yahweh:  I saw Yahweh sitting on his throne, and all the army of heaven standing on his right hand and on his left.,Again he said, Therefore hear the word of the LORD; I saw the LORD sitting upon his throne, and all the host of heaven standing on his right hand and on his left.,  וַיֹּאמֶר לָכֵן שִׁמְעוּ דְבַר־יְהוָה רָאִיתִי אֶת־יְהוָה יוֹשֵׁב עַל־כִּסְאוֹ וְכָל־צְבָא הַשָּׁמַיִם עֹמְדִים עַל־יְמִינוֹ וּשְׂמֹאלוֹ׃ ‬,And he said: Therefore hear ye the word of the LORD: I saw the LORD sitting upon His throne","18:19":"'Who shall entice Ahab king of Israel","18:20":"and stood before Yahweh","18:21":"'I will go forth","18:22":"behold","18:23":"and struck Micaiah on the cheek","18:24":"Behold","18:25":"Take Micaiah","18:26":"Thus says the king","18:27":"If you return at all in peace","18:28":"So the king of Israel and Jehoshaphat the king of Judah went up to Ramothgilead.","18:29":"I will disguise myself","18:30":"saying","18:31":"when the captains of the chariots saw Jehoshaphat","18:32":"when the captains of the chariots saw that it was not the king of Israel","18:33":"and struck the king of Israel between the joints of the armor. Therefore he said to the driver of the chariot","18:34":"And the battle increased that day: howbeit the king of Israel stayed himself up in his chariot against the Syrians until the even: and about the time of the sun going down he died.","19:1":"And Jehoshaphat the king of Judah returned to his house in peace to Jerusalem.","19:2":"and said to king Jehoshaphat","19:3":"in that you have put away the Asheroth out of the land","19:4":"and brought them back to Yahweh","19:5":"city by city","19:6":"Consider what you do:  for you don't judge for man","19:7":"nor respect of persons","19:8":"and of the heads of the fathers' [houses] of Israel","19:9":"saying","19:10":"between blood and blood","19:11":"Amariah the chief priest is over you in all matters of Yahweh; and Zebadiah the son of Ishmael","20:1":"that the children of Moab","20:2":"saying","20:3":"and set himself to seek to Yahweh; and he proclaimed a fast throughout all Judah.","20:4":"to seek [help] of Yahweh: even out of all the cities of Judah they came to seek Yahweh.","20:5":"in the house of Yahweh","20:6":"Yahweh","20:7":"our God","20:8":"and have built you a sanctuary therein for your name","20:9":"the sword","20:10":"behold","20:11":"how they reward us","20:12":"will you not judge them? for we have no might against this great company that comes against us; neither know we what to do: but our eyes are on you.","20:13":"with their little ones","20:14":"the son of Benaiah","20:15":"Listen you","20:16":"they come up by the ascent of Ziz; and you shall find them at the end of the valley","20:17":"stand you still","20:18":"worshipping Yahweh.","20:19":"of the children of the Kohathites and of the children of the Korahites","20:20":"and went forth into the wilderness of Tekoa:  and as they went forth","20:21":"he appointed those who should sing to Yahweh","20:22":"Yahweh set ambushers against the children of Ammon","20:23":"utterly to kill and destroy them: and when they had made an end of the inhabitants of Seir","20:24":"they looked at the multitude; and behold","20:25":"they found among them in abundance both riches and dead bodies","20:26":"And on the fourth day they assembled themselves in the valley of Berachah; for there they blessed the LORD: therefore the name of the same place was called","20:27":"every man of Judah and Jerusalem","20:28":"And they came to Jerusalem with psalteries and harps and trumpets unto the house of the LORD.","20:29":"when they heard that Yahweh fought against the enemies of Israel.","20:30":"So the realm of Jehoshaphat was quiet: for his God gave him rest round about.","20:31":"And Jehoshaphat reigned over Judah: he was thirty and five years old when he began to reign","20:32":"and didn't turn aside from it","20:33":"Howbeit the high places were not taken away: for as yet the people had not prepared their hearts unto the God of their fathers.","20:34":"first and last","20:35":"And after this did Jehoshaphat king of Judah join himself with Ahaziah king of Israel","20:36":"And he joined himself with him to make ships to go to Tarshish: and they made the ships in Eziongaber.","20:37":"saying","21:1":"and was buried with his fathers in the city of David:  and Jehoram his son reigned in his place.","21:2":"the sons of Jehoshaphat:  Azariah","21:3":"of silver","21:4":"and had strengthened himself","21:5":"Jehoram was thirty and two years old when he began to reign","21:6":"as did the house of Ahab; for he had the daughter of Ahab as wife: and he did that which was evil in the sight of Yahweh.","21:7":"because of the covenant that he had made with David","21:8":"and made a king over themselves.","21:9":"and all his chariots with him:  and he rose up by night","21:10":"because he had forsaken Yahweh","21:11":"and made the inhabitants of Jerusalem to play the prostitute","21:12":"saying","21:13":"and have made Judah and the inhabitants of Jerusalem to play the prostitute","21:14":"Yahweh will strike with a great plague your people","21:15":"until your bowels fall out by reason of the sickness","21:16":"and of the Arabians who are beside the Ethiopians:","21:17":"and broke into it","21:18":"And after all this the LORD smote him in his bowels with an incurable disease.","21:19":"in process of time","21:20":"and he reigned in Jerusalem eight years:  and he departed without being desired; and they buried him in the city of David","22:1":"And the inhabitants of Jerusalem made Ahaziah his youngest son king in his stead: for the band of men that came with the Arabians to the camp had slain all the eldest. So Ahaziah the son of Jehoram king of Judah reigned.","22:2":"Forty and two years old was Ahaziah when he began to reign","22:3":"He also walked in the ways of the house of Ahab: for his mother was his counselor to do wickedly.","22:4":"as did the house of Ahab; for they were his counselors after the death of his father","22:5":"and went with Jehoram the son of Ahab king of Israel to war against Hazael king of Syria at Ramoth Gilead:  and the Syrians wounded Joram.","22:6":"when he fought against Hazael king of Syria. Azariah the son of Jehoram king of Judah went down to see Jehoram the son of Ahab in Jezreel","22:7":"in that he went to Joram: for when he was come","22:8":"when Jehu was executing judgment on the house of Ahab","22:9":"and they caught him (now he was hiding in Samaria)","22:10":"she arose and destroyed all the royal seed of the house of Judah.","22:11":"the daughter of the king","22:12":"And he was with them hid in the house of God six years: and Athaliah reigned over the land.","23:1":"and took the captains of hundreds","23:2":"and gathered the Levites out of all the cities of Judah","23:3":"Behold","23:4":"who come in on the Sabbath","23:5":"And a third part shall be at the king's house; and a third part at the gate of the foundation: and all the people shall be in the courts of the house of the LORD.","23:6":"save the priests","23:7":"every man with his weapons in his hand; and whoever comes into the house","23:8":"those who were to come in on the Sabbath; with those who were to go out on the Sabbath; for Jehoiada the priest didn't dismiss the shift.","23:9":"and bucklers","23:10":"every man with his weapon in his hand","23:11":"and put the crown on him","23:12":"she came to the people into the house of Yahweh:","23:13":"and","23:14":"and said to them","23:15":"So they laid hands on her; and when she was come to the entering of the horse gate by the king's house","23:16":"and all the people","23:17":"and broke it down","23:18":"whom David had distributed in the house of Yahweh","23:19":"that no one who was unclean in anything should enter in.","23:20":"and the nobles","23:21":"and the city was quiet. Athaliah they had slain with the sword.","24:1":"of Beersheba.","24:2":"And Joash did that which was right in the sight of the LORD all the days of Jehoiada the priest.","24:3":"And Jehoiada took for him two wives; and he begat sons and daughters.","24:4":"that Joash was minded to restore the house of Yahweh.","24:5":"and said to them","24:6":"and said to him","24:7":"that wicked woman","24:8":"and they made a chest","24:9":"to bring in for Yahweh the tax that Moses the servant of God laid on Israel in the wilderness.","24:10":"and brought in","24:11":"that whenever the chest was brought to the king's officers by the hand of the Levites","24:12":"and also such as worked iron and brass to repair the house of Yahweh.","24:13":"and the work of repairing went forward in their hands","24:14":"they brought the rest of the money before the king and Jehoiada","24:15":"and he died; one hundred thirty years old was he when he died.","24:16":"because he had done good in Israel","24:17":"and made obeisance to the king.  Then the king listened to them.","24:18":"the God of their fathers","24:19":"to bring them again to Yahweh; and they testified against them:  but they would not give ear.","24:20":"and said to them","24:21":"and stoned him with stones at the commandment of the king in the court of the house of Yahweh.","24:22":"but killed his son. When he died","24:23":"that the army of the Syrians came up against him:  and they came to Judah and Jerusalem","24:24":"because they had forsaken Yahweh","24:25":"his own servants conspired against him for the blood of the sons of Jehoiada the priest","24:26":"and Jehozabad the son of Shimrith the Moabitess.","24:27":"and the greatness of the burdens [laid] on him","25:1":"of Jerusalem.","25:2":"but not with a perfect heart.","25:3":"when the kingdom was established to him","25:4":"but did according to that which is written in the law in the book of Moses","25:5":"and ordered them according to their fathers' houses","25:6":"He hired also an hundred thousand mighty men of valor out of Israel for an hundred talents of silver.","25:7":"saying","25:8":"do [valiantly]","25:9":"But what shall we do for the hundred talents which I have given to the army of Israel?  The man of God answered","25:10":"[to wit]","25:11":"and led forth his people","25:12":"and brought them to the top of the rock","25:13":"that they should not go with him to battle","25:14":"after that Amaziah was come from the slaughter of the Edomites","25:15":"and he sent to him a prophet","25:16":"as he talked with him","25:17":"and sent to Joash","25:18":"saying","25:19":"Behold","25:20":"that he might deliver them into the hand [of their enemies]","25:21":"which belongs to Judah.","25:22":"And Judah was put to the worse before Israel","25:23":"the son of Joash the son of Jehoahaz","25:24":"and all the vessels that were found in the house of God with Obed-Edom","25:25":"And Amaziah the son of Joash king of Judah lived after the death of Joash son of Jehoahaz king of Israel fifteen years.","25:26":"first and last","25:27":"and killed him there.","25:28":"and buried him with his fathers in the city of Judah.","26:1":"who was sixteen years old","26:2":"and restored it to Judah","26:3":"of Jerusalem.","26:4":"according to all that his father Amaziah had done.","26:5":"who had understanding in the vision of God:  and as long as he sought Yahweh","26:6":"and broke down the wall of Gath","26:7":"and against the Arabians who lived in Gur Baal","26:8":"And the Ammonites gave gifts to Uzziah: and his name spread abroad even to the entering in of Egypt; for he strengthened himself exceedingly.","26:9":"and at the valley gate","26:10":"and hewed out many cisterns","26:11":"who went out to war by bands","26:12":"even the mighty men of valor","26:13":"three hundred thousand and seven thousand and five hundred","26:14":"even for all the army","26:15":"invented by skillful men","26:16":"his heart was lifted up","26:17":"and with him eighty priests of Yahweh","26:18":"and said to him","26:19":"the leprosy broke forth in his forehead before the priests in the house of Yahweh","26:20":"and all the priests","26:21":"and lived in a separate house","26:22":"first and last","26:23":"He is a leper:  and Jotham his son reigned in his place.","27:1":"Jotham was twenty and five years old when he began to reign","27:2":"according to all that his father Uzziah had done: however he didn't enter into the temple of Yahweh. The people did yet corruptly.","27:3":"and on the wall of Ophel he built much.","27:4":"and in the forests he built castles and towers.","27:5":"and prevailed against them.  The children of Ammon gave him the same year one hundred talents of silver","27:6":"because he ordered his ways before Yahweh his God.","27:7":"and all his wars","27:8":"and reigned sixteen years in Jerusalem.","27:9":"and they buried him in the city of David:  and Ahaz his son reigned in his place.","28:1":"like David his father;","28:2":"and made also molten images for the Baals.","28:3":"and burnt his children in the fire","28:4":"and on the hills","28:5":"and carried away of his a great multitude of captives","28:6":"all of them valiant men; because they had forsaken Yahweh","28:7":"a mighty man of Ephraim","28:8":"women","28:9":"whose name was Oded: and he went out to meet the army that came to Samaria","28:10":"And now ye purpose to keep under the children of Judah and Jerusalem for bondmen and bondwomen unto you: but are there not with you","28:11":"and send back the captives","28:12":"Azariah the son of Johanan","28:13":"You shall not bring in the captives here: for you purpose that which will bring on us a trespass against Yahweh","28:14":"So the armed men left the captives and the spoil before the princes and all the congregation.","28:15":"and took the captives","28:16":"At that time did king Ahaz send unto the kings of Assyria to help him.","28:17":"and carried away captives.","28:18":"and of the South of Judah","28:19":"and trespassed severely against Yahweh.","28:20":"and distressed him","28:21":"and out of the house of the king and of the princes","28:22":"this same king Ahaz.","28:23":"which struck him; and he said","28:24":"and cut in pieces the vessels of the house of God","28:25":"and provoked to anger Yahweh","28:26":"and all his ways","28:27":"and they buried him in the city","29:1":"the daughter of Zechariah.","29:2":"according to all that David his father had done.","29:3":"in the first month","29:4":"and gathered them together into the broad place on the east","29:5":"Hear me","29:6":"and done that which was evil in the sight of Yahweh our God","29:7":"and put out the lamps","29:8":"and he has delivered them to be tossed back and forth","29:9":"behold","29:10":"the God of Israel","29:11":"don't be negligent now; for Yahweh has chosen you to stand before him","29:12":"Mahath","29:13":"Shimri and Jeuel; and of the sons of Asaph","29:14":"Jehuel and Shimei; and of the sons of Jeduthun","29:15":"and sanctified themselves","29:16":"to cleanse it","29:17":"and on the eighth day of the month came they to the porch of Yahweh; and they sanctified the house of Yahweh in eight days: and on the sixteenth day of the first month they made an end.","29:18":"and said","29:19":"which king Ahaz in his reign did cast away when he trespassed","29:20":"and gathered the princes of the city","29:21":"and seven rams","29:22":"and the priests received the blood","29:23":"And they brought forth the he goats for the sin offering before the king and the congregation; and they laid their hands upon them:","29:24":"and they made a sin offering with their blood on the altar","29:25":"with stringed instruments","29:26":"and the priests with the trumpets.","29:27":"the song of Yahweh began also","29:28":"and the singers sang","29:29":"the king and all who were present with him bowed themselves and worshiped.","29:30":"and of Asaph the seer.  They sang praises with gladness","29:31":"Now you have consecrated yourselves to Yahweh; come near and bring sacrifices and thank offerings into the house of Yahweh.  The assembly brought in sacrifices and thank offerings; and as many as were of a willing heart [brought] burnt offerings.","29:32":"one hundred rams","29:33":"And the consecrated things were six hundred oxen and three thousand sheep.","29:34":"so that they could not flay all the burnt offerings:  therefore their brothers the Levites helped them","29:35":"with the fat of the peace offerings","29:36":"and all the people","30:1":"and wrote letters also to Ephraim and Manasseh","30:2":"and his princes","30:3":"because the priests had not sanctified themselves in sufficient number","30:4":"And the thing pleased the king and all the congregation.","30:5":"from Beersheba even to Dan","30:6":"and according to the commandment of the king","30:7":"and like your brothers","30:8":"as your fathers were; but yield yourselves to Yahweh","30:9":"your brothers and your children shall find compassion before those who led them captive","30:10":"even to Zebulun:  but they ridiculed them","30:11":"and came to Jerusalem.","30:12":"to do the commandment of the king and of the princes by the word of Yahweh.","30:13":"a very great assembly.","30:14":"and all the altars for incense took they away","30:15":"and sanctified themselves","30:16":"according to the law of Moses the man of God:  the priests sprinkled the blood [which they received] of the hand of the Levites.","30:17":"to sanctify them to Yahweh.","30:18":"even many of Ephraim and Manasseh","30:19":"Yahweh","30:20":"and healed the people.","30:21":"[singing] with loud instruments to Yahweh.","30:22":"offering sacrifices of peace offerings","30:23":"And the whole assembly took counsel to keep other seven days: and they kept other seven days with gladness.","30:24":"For Hezekiah king of Judah did give to the congregation a thousand bullocks and seven thousand sheep; and the princes gave to the congregation a thousand bullocks and ten thousand sheep: and a great number of priests sanctified themselves.","30:25":"with the priests and the Levites","30:26":"So there was great joy in Jerusalem: for since the time of Solomon the son of David king of Israel there was not the like in Jerusalem.","30:27":"and their prayer came up to his holy habitation","31:1":"all Israel who were present went out to the cities of Judah","31:2":"every man according to his service","31:3":"[to wit]","31:4":"that they might give themselves to the law of Yahweh.","31:5":"the children of Israel gave in abundance the first fruits of grain","31:6":"who lived in the cities of Judah","31:7":"and finished them in the seventh month.","31:8":"they blessed Yahweh","31:9":"Then Hezekiah questioned with the priests and the Levites concerning the heaps.","31:10":"of the house of Zadok","31:11":"Then Hezekiah commanded to prepare chambers in the house of the LORD; and they prepared them","31:12":"and Shimei his brother was second.","31:13":"and Azaziah","31:14":"the porter at the east [gate]","31:15":"and Miniamin","31:16":"from three years old and upward","31:17":"and the Levites from twenty years old and upward","31:18":"their wives","31:19":"who were in the fields of the suburbs of their cities","31:20":"And thus did Hezekiah throughout all Judah","31:21":"and in the law","32:1":"and this faithfulness","32:2":"and that he was purposed to fight against Jerusalem","32:3":"He took counsel with his princes and his mighty men to stop the waters of the fountains which were without the city: and they did help him.","32:4":"and they stopped all the springs","32:5":"and built up all the wall that was broken down","32:6":"and gathered them together to him in the broad place at the gate of the city","32:7":"don't be afraid nor dismayed for the king of Assyria","32:8":"and to fight our battles.  The people rested themselves on the words of Hezekiah king of Judah.","32:9":"(now he was before Lachish","32:10":"Whereon do you trust","32:11":"to give you over to die by famine and by thirst","32:12":"and commanded Judah and Jerusalem","32:13":"Know ye not what I and my fathers have done unto all the people of other lands? were the gods of the nations of those lands any ways able to deliver their lands out of mine hand?","32:14":"that could deliver his people out of my hand","32:15":"nor persuade you after this manner","32:16":"and against his servant Hezekiah.","32:17":"to rail on Yahweh","32:18":"to frighten them","32:19":"as of the gods of the peoples of the earth","32:20":"and Isaiah the prophet the son of Amoz","32:21":"who cut off all the mighty men of valor","32:22":"and from the hand of all [others]","32:23":"and precious things to Hezekiah king of Judah; so that he was exalted in the sight of all nations from thenceforth.","32:24":"and gave him a sign.","32:25":"and on Judah and Jerusalem.","32:26":"both he and the inhabitants of Jerusalem","32:27":"and for gold","32:28":"and flocks in folds.","32:29":"and possessions of flocks and herds in abundance; for God had given him very much substance.","32:30":"and brought them straight down on the west side of the city of David.  Hezekiah prospered in all his works.","32:31":"who sent to him to inquire of the wonder that was done in the land","32:32":"and his good deeds","32:33":"and they buried him in the ascent of the tombs of the sons of David:  and all Judah and the inhabitants of Jerusalem did him honor at his death. Manasseh his son reigned in his place.","33:1":"Manasseh was twelve years old when he began to reign","33:2":"after the abominations of the nations whom Yahweh cast out before the children of Israel.","33:3":"and made Asheroth","33:4":"of which Yahweh said","33:5":"And he built altars for all the host of heaven in the two courts of the house of the LORD.","33:6":"and used enchantments","33:7":"which he had made","33:8":"if only they will observe to do all that I have commanded them","33:9":"so that they did evil more than did the nations whom Yahweh destroyed before the children of Israel.","33:10":"and to his people; but they gave no heed.","33:11":"who took Manasseh in chains","33:12":"he begged Yahweh his God","33:13":"and heard his supplication","33:14":"on the west side of Gihon","33:15":"and the idol out of the house of Yahweh","33:16":"and offered thereon sacrifices of peace offerings and of thanksgiving","33:17":"but only to Yahweh their God.","33:18":"and his prayer to his God","33:19":"and how [God] was entreated of him","33:20":"and they buried him in his own house:  and Amon his son reigned in his place.","33:21":"Amon was two and twenty years old when he began to reign","33:22":"as did Manasseh his father; and Amon sacrificed to all the engraved images which Manasseh his father had made","33:23":"as Manasseh his father had humbled himself; but this same Amon trespassed more and more.","33:24":"and put him to death in his own house.","33:25":"But the people of the land slew all them that had conspired against king Amon; and the people of the land made Josiah his son king in his stead.","34:1":"Josiah was eight years old when he began to reign","34:2":"and walked in the ways of David his father","34:3":"while he was yet young","34:4":"and the engraved images","34:5":"and purged Judah and Jerusalem.","34:6":"even to Naphtali","34:7":"and beat the Asherim and the engraved images into powder","34:8":"when he had purged the land and the house","34:9":"and delivered the money that was brought into the house of God","34:10":"And they put it in the hand of the workmen that had the oversight of the house of the LORD","34:11":"to buy hewn stone","34:12":"the Levites","34:13":"and set forward all who did the work in every manner of service: and of the Levites there were scribes","34:14":"Hilkiah the priest found the book of the law of Yahweh [given] by Moses.","34:15":"I have found the book of the law in the house of Yahweh.  Hilkiah delivered the book to Shaphan.","34:16":"and moreover brought back word to the king","34:17":"and have delivered it into the hand of the overseers","34:18":"saying","34:19":"when the king had heard the words of the law","34:20":"and Ahikam the son of Shaphan","34:21":"inquire of Yahweh for me","34:22":"and they whom the king [had commanded]","34:23":"Thus says Yahweh","34:24":"Behold","34:25":"and have burned incense to other gods","34:26":"who sent you to inquire of Yahweh","34:27":"and you did humble yourself before God","34:28":"I will gather you to your fathers","34:29":"Then the king sent and gathered together all the elders of Judah and Jerusalem.","34:30":"and all the men of Judah and the inhabitants of Jerusalem","34:31":"and made a covenant before Yahweh","34:32":"the God of their fathers.","34:33":"and made all who were found in Israel to serve","35:1":"Moreover Josiah kept a passover unto the LORD in Jerusalem: and they killed the passover on the fourteenth day of the first month.","35:2":"and encouraged them to the service of the house of Yahweh.","35:3":"who were holy to Yahweh","35:4":"according to the writing of David king of Israel","35:5":"and [let there be for each] a portion of a fathers' house of the Levites.","35:6":"and sanctify yourselves","35:7":"of the flock","35:8":"to the priests","35:9":"and Shemaiah and Nethanel","35:10":"and the priests stood in their place","35:11":"and the priests sprinkled [the blood which they received] of their hand","35:12":"that they might give them according to the divisions of the fathers' houses of the children of the people","35:13":"and in caldrons","35:14":"and for the priests","35:15":"according to the commandment of David","35:16":"to keep the Passover","35:17":"and the feast of unleavened bread seven days.","35:18":"and the priests","35:19":"In the eighteenth year of the reign of Josiah was this passover kept.","35:20":"when Josiah had prepared the temple","35:21":"saying","35:22":"but disguised himself","35:23":"Have me away; for I am sore wounded.","35:24":"and put him in the second chariot that he had","35:25":"they are written in the lamentations.","35:26":"and his good deeds","35:27":"first and last","36:1":"and made him king in his father's place in Jerusalem.","36:2":"Jehoahaz was twenty and three years old when he began to reign","36:3":"and fined the land one hundred talents of silver and a talent of gold.","36:4":"and changed his name to Jehoiakim. Neco took Joahaz his brother","36:5":"Jehoiakim was twenty and five years old when he began to reign","36:6":"and bound him in fetters","36:7":"and put them in his temple at Babylon.","36:8":"and his abominations which he did","36:9":"Jehoiachin was eight years old when he began to reign","36:10":"and brought him to Babylon","36:11":"Zedekiah was one and twenty years old when he began to reign","36:12":"And he did that which was evil in the sight of the LORD his God","36:13":"who had made him swear by God:  but he stiffened his neck","36:14":"and the people","36:15":"the God of their fathers","36:16":"and despised his words","36:17":"who killed their young men with the sword in the house of their sanctuary","36:18":"great and small","36:19":"and broke down the wall of Jerusalem","36:20":"And them that had escaped from the sword carried he away to Babylon; where they were servants to him and his sons until the reign of the kingdom of Persia:","36:21":"until the land had enjoyed its Sabbaths:  [for] as long as it lay desolate it kept Sabbath","36:22":"that the word of Yahweh by the mouth of Jeremiah might be accomplished","36:23":"All the kingdoms of the earth has Yahweh"}