{"1:1":"an apostle of Christ Jesus through the will of God","1:2":"Grace be to you and peace from God our Father","1:3":"the Father of mercies and God of all comfort;","1:4":"that we may be able to comfort those who are in any affliction","1:5":"even so our comfort also abounds through Christ.","1:6":"it is for your comfort and salvation. If we are comforted","1:7":"knowing that","1:8":"brothers","1:9":"we ourselves have had the sentence of death within ourselves","1:10":"and does deliver; on whom we have set our hope that he will also still deliver us;","1:11":"for the gift bestowed on us by means of many","1:12":"that in holiness and sincerity of God","1:13":"than what you read or even acknowledge","1:14":"that we are your boasting","1:15":"I was determined to come first to you","1:16":"and again from Macedonia to come to you","1:17":"did I show fickleness? Or the things that I purpose","1:18":"our word toward you was not Yes and no.","1:19":"Jesus Christ","1:20":"in him is the Yes. Therefore also through him is the Amen, to the glory of God through us.","1:21":"and anointed us","1:22":"and gave us the down payment of the Spirit in our hearts.","1:23":"that I didn't come to Corinth to spare you.","1:24":"but are fellow workers with you for your joy.  For you stand firm in faith.","2:1":"that I would not come to you again in sorrow.","2:2":"then who will make me glad but he who is made sorry by me?","2:3":"so that","2:4":"not that you should be made sorry","2:5":"he has caused sorrow","2:6":"Sufficient to such a man is this punishment","2:7":"lest by any means such a one should be swallowed up with his excessive sorrow.","2:8":"Wherefore I beseech you that ye would confirm your love toward him.","2:9":"that I might know the proof of you","2:10":"I have forgiven that one for your sakes in the presence of Christ","2:11":"Lest Satan should get an advantage of us: for we are not ignorant of his devices.","2:12":"and when a door was opened to me in the Lord","2:13":"because I didn't find Titus","2:14":"who always leads us in triumph in Christ","2:15":"in those who are saved","2:16":"To the one we are the savour of death unto death; and to the other the savour of life unto life. And who is sufficient for these things?","2:17":"peddling the word of God. But as of sincerity","3:1":"as do some","3:2":"written in our hearts","3:3":"served by us","3:4":"And such trust have we through Christ to God-ward:","3:5":"to account anything as from ourselves; but our sufficiency is from God;","3:6":"but of the Spirit.  For the letter kills","3:7":"written engraved on stones","3:8":"How shall not the ministration of the spirit be rather glorious?","3:9":"the service of righteousness exceeds much more in glory.","3:10":"by reason of the glory that surpasses.","3:11":"much more that which remains is in glory.","3:12":"we use great boldness of speech","3:13":"who put a veil on his face","3:14":"for until this very day at the reading of the old covenant the same veil remains","3:15":"when Moses is read","3:16":"the veil is taken away.","3:17":"there is liberty.","3:18":"with unveiled face beholding as in a mirror the glory of the Lord","4:1":"even as we obtained mercy","4:2":"not walking in craftiness","4:3":"it is veiled in those who perish;","4:4":"that the light of the Good News of the glory of Christ","4:5":"but Christ Jesus as Lord","4:6":"Light will shine out of darkness,{Genesis 1:3} who has shone in our hearts","4:7":"that the exceeding greatness of the power may be of God","4:8":"yet not crushed; perplexed","4:9":"yet not forsaken; struck down","4:10":"that the life of Jesus may also be revealed in our body.","4:11":"that the life also of Jesus may be revealed in our mortal flesh.","4:12":"but life in you.","4:13":"according to that which is written","4:14":"and will present us with you.","4:15":"that the grace","4:16":"but though our outward man is decaying","4:17":"which is for the moment","4:18":"but at the things which are not seen.  For the things which are seen are temporal","5:1":"we have a building from God","5:2":"longing to be clothed with our habitation which is from heaven;","5:3":"If so be that being clothed we shall not be found naked.","5:4":"being burdened; not that we desire to be unclothed","5:5":"who also gave to us the down payment of the Spirit.","5:6":"we are always confident and know that while we are at home in the body","5:7":"not by sight.","5:8":"I say","5:9":"whether at home or absent","5:10":"according to what he has done","5:11":"we persuade men","5:12":"but speak as giving you occasion of boasting on our behalf","5:13":"it is for God.  Or if we are of sober mind","5:14":"that one died for all","5:15":"that those who live should no longer live to themselves","5:16":"yet now we know him so no more.","5:17":"he is a new creation. The old things have passed away.  Behold","5:18":"who reconciled us to himself through Jesus Christ","5:19":"that God was in Christ reconciling the world to himself","5:20":"as though God were entreating by us.  We beg you on behalf of Christ","5:21":"For he hath made him to be sin for us","6:1":"we entreat also that you not receive the grace of God in vain","6:2":"At an acceptable time I listened to you, in a day of salvation I helped you.{Isaiah 49:8} Behold","6:3":"that our service may not be blamed","6:4":"as servants of God","6:5":"in imprisonments","6:6":"in knowledge","6:7":"in the power of God; by the armor of righteousness on the right hand and on the left","6:8":"by evil report and good report; as deceivers","6:9":"and yet well known; as dying","6:10":"yet always rejoicing; as poor","6:11":"Corinthians.  Our heart is enlarged.","6:12":"but you are restricted by your own affections.","6:13":"I speak as to my children","6:14":"for what fellowship have righteousness and iniquity?  Or what communion has light with darkness?","6:15":"And what concord hath Christ with Belial? or what part hath he that believeth with an infidel?","6:16":"I will dwell in them, and walk in them; and I will be their God, and they will be my people.{Leviticus 26:12; Jeremiah 32:38; Ezekiel 37:27}","6:17":"'Come out from among them, and be separate,' says the Lord.  'Touch no unclean thing.  I will receive you.{Isaiah 52:11; Ezekiel 20:34,41},Wherefore come out from among them, and be ye separate, saith the Lord, and touch not the unclean thing; and I will receive you.,,,,,,,,","6:18":"' says the Lord Almighty.{2 Samuel 7:14; 7:8},And will be a Father unto you, and ye shall be my sons and daughters, saith the Lord Almighty.,,,,,,,,","7:1":"beloved","7:2":"Receive us; we have wronged no man","7:3":"for I have said before","7:4":"Great is my boldness of speech toward you","7:5":"our flesh had no relief","7:6":"he who comforts the lowly","7:7":"but also by the comfort with which he was comforted in you","7:8":"I do not regret it","7:9":"not that you were made sorry","7:10":"which brings no regret.  But the sorrow of the world works death.","7:11":"this same thing","7:12":"I wrote not for his cause that did the wrong","7:13":"because his spirit has been refreshed by you all.","7:14":"I was not disappointed.  But as we spoke all things to you in truth","7:15":"while he remembers all of your obedience","7:16":"I rejoice therefore that I have confidence in you in all things.","8:1":"brothers","8:2":"How that in a great trial of affliction the abundance of their joy and their deep poverty abounded unto the riches of their liberality.","8:3":"I testify","8:4":"Praying us with much intreaty that we would receive the gift","8:5":"but first they gave their own selves to the Lord","8:6":"that as he made a beginning before","8:7":"in faith","8:8":"but as proving through the earnestness of others the sincerity also of your love.","8:9":"that","8:10":"who were the first to start a year ago","8:11":"that as there was the readiness to be willing","8:12":"it is acceptable according to what you have","8:13":"","8:14":"that their abundance also may become a supply for your lack; that there may be equality.","8:15":"He who gathered much had nothing left over, and he who gathered little had no lack.{Exodus 16:8}","8:16":"who puts the same earnest care for you into the heart of Titus.","8:17":"but being himself very earnest","8:18":"And we have sent with him the brother","8:19":"but who was also appointed by the assemblies to travel with us in this grace","8:20":"that any man should blame us concerning this abundance which is administered by us.","8:21":"not only in the sight of the Lord","8:22":"whom we have many times proved earnest in many things","8:23":"he is my partner and fellow worker for you. As for our brothers","8:24":"and of our boasting on your behalf.","9:1":"","9:2":"of which I boast on your behalf to them of Macedonia","9:3":"that","9:4":"if there come with me any of Macedonia and find you unprepared","9:5":"and arrange ahead of time the generous gift that you promised before","9:6":"But this I say","9:7":"or under compulsion; for God loves a cheerful giver.","9:8":"that you","9:9":"He has scattered abroad, he has given to the poor. His righteousness remains forever.{Psalm 112:9}","9:10":"supply and multiply your seed for sowing","9:11":"which works through us thanksgiving to God.","9:12":"but abounds also through many givings of thanks to God;","9:13":"they glorify God for the obedience of your confession to the Good News of Christ","9:14":"with supplication on your behalf","9:15":"Thanks be unto God for his unspeakable gift.","10:1":"myself","10:2":"I beg you that I may not","10:3":"we don't wage war according to the flesh;","10:4":"but mighty before God to the throwing down of strongholds","10:5":"and bringing every thought into captivity to the obedience of Christ;","10:6":"when your obedience will be made full.","10:7":"let him consider this again with himself","10:8":"(which the Lord gave for building you up","10:9":"That I may not seem as if I would terrify you by letters.","10:10":"His letters, they say","10:11":"that what we are in word by letters when we are absent","10:12":"measuring themselves by themselves","10:13":"but within the boundaries with which God appointed to us","10:14":"as though we didn't reach to you.  For we came even as far as to you with the Good News of Christ","10:15":"but having hope that as your faith grows","10:16":"not to boast in what someone else has already done.","10:17":"But he that glorieth","10:18":"but whom the Lord commends.","11:1":"but indeed you do bear with me.","11:2":"that I might present you as a pure virgin to Christ.","11:3":"as the serpent deceived Eve in his craftiness","11:4":"whom we did not preach","11:5":"For I suppose I was not a whit behind the very chiefest apostles.","11:6":"yet I am not unskilled in knowledge.  No","11:7":"because I preached to you God's Good News free of charge?","11:8":"taking wages from them that I might serve you.","11:9":"I wasn't a burden on anyone","11:10":"no one will stop me from this boasting in the regions of Achaia.","11:11":"Wherefore? because I love you not? God knoweth.","11:12":"that I will do","11:13":"deceitful workers","11:14":"for even Satan masquerades as an angel of light.","11:15":"whose end will be according to their works.","11:16":"let no one think me foolish.  But if so","11:17":"I don't speak according to the Lord","11:18":"I will also boast.","11:19":"being wise.","11:20":"if he brings you into bondage","11:21":"as though we had been weak. Yet however any is bold (I speak in foolishness)","11:22":"Are they Hebrews? so am I. Are they Israelites? so am I. Are they the seed of Abraham? so am I.","11:23":"in prisons more abundantly","11:24":"Of the Jews five times received I forty stripes save one.","11:25":"Thrice was I beaten with rods","11:26":"perils of rivers","11:27":"in watchings often","11:28":"there is that which presses on me daily","11:29":"and I am not weak?  Who is caused to stumble","11:30":"I will boast of the things that concern my weakness.","11:31":"he who is blessed forevermore","11:32":"In Damascus the governor under Aretas the king kept the city of the Damascenes with a garrison","11:33":"and escaped his hands.","12:1":"It is not expedient for me doubtless to glory. I will come to visions and revelations of the Lord.","12:2":"fourteen years ago (whether in the body","12:3":"or outside of the body","12:4":"and heard unspeakable words","12:5":"but on my own behalf I will not boast","12:6":"I will not be foolish; for I will speak the truth.  But I refrain","12:7":"that I should not be exalted excessively","12:8":"I begged the Lord three times that it might depart from me.","12:9":"My grace is sufficient for you, for my power is made perfect in weakness.  Most gladly therefore I will rather glory in my weaknesses","12:10":"in injuries","12:11":"for I ought to have been commended by you","12:12":"in signs and wonders and mighty works.","12:13":"unless it is that I myself was not a burden to you? Forgive me this wrong.","12:14":"this is the third time I am ready to come to you","12:15":"am I loved the less?","12:16":"I did not myself burden you.  But","12:17":"Did I make a gain of you by any of them whom I sent unto you?","12:18":"and I sent the brother with him.  Did Titus take any advantage of you?  Didn't we walk in the same spirit? Didn't we walk in the same steps?","12:19":"do you think that we are excusing ourselves to you? In the sight of God we speak in Christ.  But all things","12:20":"when I come","12:21":"and I would mourn for many of those who have sinned before now","13:1":"This is the third time I am coming to you. In the mouth of two or three witnesses shall every word be established.","13:2":"and I do say beforehand","13:3":"but is powerful in you.","13:4":"yet he lives through the power of God.  For we also are weak in him","13:5":"whether you are in the faith. Test your own selves.  Or don't you know as to your own selves","13:6":"But I trust that ye shall know that we are not reprobates.","13:7":"but that you may do that which is honorable","13:8":"but for the truth.","13:9":"even your perfecting.","13:10":"that I may not deal sharply when present","13:11":"brothers","13:12":"Greet one another with an holy kiss.","13:13":"All the saints salute you.","13:14":"the love of God"}