{"1:1":"Then Moab rebelled against Israel after the death of Ahab.","1:2":"and was sick:  and he sent messengers","1:3":"Arise","1:4":"You shall not come down from the bed where you are gone up","1:5":"and he said to them","1:6":"There came up a man to meet us","1:7":"What manner of man was he who came up to meet you","1:8":"He was a hairy man","1:9":"he was sitting on the top of the hill.  He spoke to him","1:10":"If I be a man of God","1:11":"man of God","1:12":"If I be a man of God","1:13":"and came and fell on his knees before Elijah","1:14":"fire came down from the sky","1:15":"Go down with him: don't be afraid of him.  He arose","1:16":"Thus says Yahweh","1:17":"So he died according to the word of the LORD which Elijah had spoken. And Jehoram reigned in his stead in the second year of Jehoram the son of Jehoshaphat king of Judah; because he had no son.","1:18":"aren't they written in the book of the chronicles of the kings of Israel?","2:1":"when Yahweh would take up Elijah by a whirlwind into heaven","2:2":"Please wait here","2:3":"and said to him","2:4":"Elisha","2:5":"and said to him","2:6":"Please wait here, for Yahweh has sent me to the Jordan.  He said","2:7":"and stood over against them afar off:  and they two stood by the Jordan.","2:8":"and wrapped it together","2:9":"when they had gone over","2:10":"You have asked a hard thing:  [nevertheless]","2:11":"as they still went on","2:12":"and he cried","2:13":"and went back","2:14":"and struck the waters","2:15":"they said","2:16":"See now","2:17":"he said","2:18":"while he stayed at Jericho; and he said to them","2:19":"Behold","2:20":"Bring me a new jar","2:21":"and cast salt therein","2:22":"according to the word of Elisha which he spoke.","2:23":"some youths came out of the city and mocked him","2:24":"and cursed them in the name of Yahweh.  Two female bears came out of the woods","2:25":"and from there he returned to Samaria.","3:1":"and reigned twelve years.","3:2":"but not like his father","3:3":"with which he made Israel to sin; he didn't depart from it.","3:4":"and of one hundred thousand rams.","3:5":"when Ahab was dead","3:6":"and mustered all Israel.","3:7":"saying","3:8":"Which way shall we go up?  He answered","3:9":"and the king of Judah","3:10":"Alas! for Yahweh has called these three kings together to deliver them into the hand of Moab.","3:11":"Isn't there here a prophet of Yahweh","3:12":"The word of Yahweh is with him. So the king of Israel and Jehoshaphat and the king of Edom went down to him.","3:13":"What have I to do with you? get you to the prophets of your father","3:14":"As Yahweh of Armies lives","3:15":"when the minstrel played","3:16":"Thus says Yahweh","3:17":"You shall not see wind","3:18":"And this is but a light thing in the sight of the LORD: he will deliver the Moabites also into your hand.","3:19":"and every choice city","3:20":"about the time of offering the offering","3:21":"they gathered themselves together","3:22":"and the sun shone on the water","3:23":"This is blood; the kings are surely destroyed","3:24":"the Israelites rose up and struck the Moabites","3:25":"and filled it; and they stopped all the springs of water","3:26":"he took with him seven hundred men who drew sword","3:27":"and offered him for a burnt offering on the wall. There was great wrath against Israel:  and they departed from him","4:1":"saying","4:2":"What shall I do for you? tell me; what have you in the house?  She said","4:3":"Go","4:4":"and shut the door on you and on your sons","4:5":"and shut the door on her and on her sons; they brought [the vessels] to her","4:6":"when the vessels were full","4:7":"Go","4:8":"that Elisha passed to Shunem","4:9":"See now","4:10":"Please","4:11":"that he came there","4:12":"Call this Shunammite. When he had called her","4:13":"Say now to her","4:14":"What then is to be done for her?  Gehazi answered","4:15":"Call her.  When he had called her","4:16":"At this season","4:17":"and bore a son at that season","4:18":"it fell on a day","4:19":"My head","4:20":"and brought him to his mother","4:21":"and shut [the door] on him","4:22":"and said","4:23":"Why will you go to him today? it is neither new moon nor Sabbath.  She said","4:24":"and said to her servant","4:25":"and came to the man of God to Mount Carmel. It happened","4:26":"and ask her","4:27":"she caught hold of his feet.  Gehazi came near to thrust her away; but the man of God said","4:28":"Did I desire a son of my lord?  Didn't I say","4:29":"Gird up your waist","4:30":"As Yahweh lives","4:31":"and laid the staff on the face of the child; but there was neither voice","4:32":"behold","4:33":"and shut the door on them both","4:34":"and lay on the child","4:35":"and walked in the house once back and forth; and went up","4:36":"and said","4:37":"and fell at his feet","4:38":"Set on the great pot","4:39":"and found a wild vine","4:40":"as they were eating of the stew","4:41":"Then bring meal.  He cast it into the pot; and he said","4:42":"and brought the man of God bread of the first fruits","4:43":"What","4:44":"and they ate","5:1":"captain of the army of the king of Syria","5:2":"and had brought away captive out of the land of Israel a little maiden; and she waited on Naaman's wife.","5:3":"Would that my lord were with the prophet who is in Samaria! then would he recover him of his leprosy.","5:4":"and told his lord","5:5":"Go now","5:6":"saying","5:7":"when the king of Israel had read the letter","5:8":"when Elisha the man of God heard that the king of Israel had torn his clothes","5:9":"and stood at the door of the house of Elisha.","5:10":"saying","5:11":"and went away","5:12":"the rivers of Damascus","5:13":"and spoke to him","5:14":"and dipped [himself] seven times in the Jordan","5:15":"he and all his company","5:16":"As Yahweh lives","5:17":"If not","5:18":"and he leans on my hand","5:19":"Go in peace.  So he departed from him a little way.","5:20":"said","5:21":"he alighted from the chariot to meet him","5:22":"All is well.  My master has sent me","5:23":"Be pleased to take two talents.  He urged him","5:24":"he took them from their hand","5:25":"and stood before his master.  Elisha said to him","5:26":"Didn't my heart go with you","5:27":"and to your seed forever.  He went out from his presence a leper [as white] as snow.","6:1":"See now","6:2":"we pray you","6:3":"Be pleased","6:4":"they cut down wood.","6:5":"the axe head fell into the water; and he cried","6:6":"Where did it fall?  He showed him the place. He cut down a stick","6:7":"Take it.  So he put out his hand and took it.","6:8":"saying","6:9":"saying","6:10":"not once nor twice.","6:11":"and said to them","6:12":"No","6:13":"Go and see where he is","6:14":"and chariots","6:15":"and gone forth","6:16":"Don't be afraid; for those who are with us are more than those who are with them.","6:17":"and said","6:18":"Elisha prayed to Yahweh","6:19":"This is not the way","6:20":"when they were come into Samaria","6:21":"when he saw them","6:22":"You shall not strike them:  would you strike those whom you have taken captive with your sword and with your bow? set bread and water before them","6:23":"he sent them away","6:24":"that Benhadad king of Syria gathered all his army","6:25":"they besieged it","6:26":"there cried a woman to him","6:27":"If Yahweh doesn't help you","6:28":"What ails you?  She answered","6:29":"and ate him:  and I said to her on the next day","6:30":"when the king heard the words of the woman","6:31":"God do so to me","6:32":"and the elders were sitting with him; and [the king] sent a man from before him: but before the messenger came to him","6:33":"behold","7:1":"Hear you the word of Yahweh:  thus says Yahweh","7:2":"and said","7:3":"Why sit we here until we die?","7:4":"We will enter into the city","7:5":"to go to the camp of the Syrians; and when they were come to the outermost part of the camp of the Syrians","7:6":"and a noise of horses","7:7":"and left their tents","7:8":"they went into one tent","7:9":"We aren't doing right. This day is a day of good news","7:10":"saying","7:11":"And he called the porters; and they told it to the king's house within.","7:12":"and said to his servants","7:13":"Please let some take five of the horses that remain","7:14":"saying","7:15":"all the way was full of garments and vessels","7:16":"and plundered the camp of the Syrians. So a measure of fine flour was [sold] for a shekel","7:17":"and he died as the man of God had said","7:18":"as the man of God had spoken to the king","7:19":"and said","7:20":"and he died.","8:1":"whose son he had restored to life","8:2":"and did according to the word of the man of God; and she went with her household","8:3":"that the woman returned out of the land of the Philistines:  and she went forth to cry to the king for her house and for her land.","8:4":"saying","8:5":"as he was telling the king how he had restored to life him who was dead","8:6":"she told him.  So the king appointed to her a certain officer","8:7":"saying","8:8":"Take a present in your hand","8:9":"and took a present with him","8:10":"Go","8:11":"until he was ashamed: and the man of God wept.","8:12":"Why weeps my lord?  He answered","8:13":"But what is your servant","8:14":"and came to his master; who said to him","8:15":"that he took the coverlet","8:16":"Jehoshaphat being then king of Judah","8:17":"Thirty and two years old was he when he began to reign; and he reigned eight years in Jerusalem.","8:18":"as did the house of Ahab:  for he had the daughter of Ahab as wife; and he did that which was evil in the sight of Yahweh.","8:19":"for David his servant's sake","8:20":"and made a king over themselves.","8:21":"and all his chariots with him: and he rose up by night","8:22":"Yet Edom revolted from under the hand of Judah unto this day. Then Libnah revolted at the same time.","8:23":"and all that he did","8:24":"and was buried with his fathers in the city of David; and Ahaziah his son reigned in his place.","8:25":"In the twelfth year of Joram the son of Ahab king of Israel did Ahaziah the son of Jehoram king of Judah begin to reign.","8:26":"Two and twenty years old was Ahaziah when he began to reign; and he reigned one year in Jerusalem. And his mother's name was Athaliah","8:27":"and did that which was evil in the sight of Yahweh","8:28":"And he went with Joram the son of Ahab to the war against Hazael king of Syria in Ramothgilead; and the Syrians wounded Joram.","8:29":"when he fought against Hazael king of Syria.  Ahaziah the son of Jehoram king of Judah went down to see Joram the son of Ahab in Jezreel","9:1":"and said to him","9:2":"look out there Jehu the son of Jehoshaphat the son of Nimshi","9:3":"and pour it on his head","9:4":"even the young man the prophet","9:5":"behold","9:6":"and went into the house; and he poured the oil on his head","9:7":"that I may avenge the blood of my servants the prophets","9:8":"{or","9:9":"and like the house of Baasha the son of Ahijah.","9:10":"and there shall be none to bury her.  He opened the door","9:11":"Is all well? why came this mad fellow to you? He said to them","9:12":"It is false; tell us now.  He said","9:13":"and took every man his garment","9:14":"he and all Israel","9:15":"when he fought with Hazael king of Syria.)  Jehu said","9:16":"and went to Jezreel; for Joram lay there. Ahaziah king of Judah was come down to see Joram.","9:17":"and he spied the company of Jehu as he came","9:18":"and said","9:19":"who came to them","9:20":"saying","9:21":"Make ready.  They made ready his chariot. Joram king of Israel and Ahaziah king of Judah went out","9:22":"when Joram saw Jehu","9:23":"and fled","9:24":"and struck Joram between his arms; and the arrow went out at his heart","9:25":"Take up","9:26":"and the blood of his sons","9:27":"he fled by the way of the garden house.  Jehu followed after him","9:28":"and buried him in his tomb with his fathers in the city of David.","9:29":"And in the eleventh year of Joram the son of Ahab began Ahaziah to reign over Judah.","9:30":"Jezebel heard of it; and she painted her eyes","9:31":"she said","9:32":"and said","9:33":"Throw her down.  So they threw her down; and some of her blood was sprinkled on the wall","9:34":"he ate and drink; and he said","9:35":"and the feet","9:36":"and told him.  He said","9:37":"so that they shall not say","10:1":"and sent to Samaria","10:2":"seeing your master's sons are with you","10:3":"and set him on his father's throne","10:4":"and said","10:5":"and he who was over the city","10:6":"saying","10:7":"when the letter came to them","10:8":"and told him","10:9":"that he went out","10:10":"which Yahweh spoke concerning the house of Ahab: for Yahweh has done that which he spoke by his servant Elijah.","10:11":"and all his great men","10:12":"and went to Samaria.  As he was at the shearing house of the shepherds in the way","10:13":"and said","10:14":"Take them alive.  They took them alive","10:15":"he lighted on Jehonadab the son of Rechab coming to meet him; and he greeted him","10:16":"Come with me","10:17":"he struck all who remained to Ahab in Samaria","10:18":"and said to them","10:19":"all his worshippers","10:20":"Sanctify a solemn assembly for Baal. They proclaimed it.","10:21":"so that there was not a man left that didn't come. They came into the house of Baal; and the house of Baal was filled from one end to another.","10:22":"Bring forth vestments for all the worshippers of Baal.  He brought them forth vestments.","10:23":"and Jehonadab the son of Rechab","10:24":"and said","10:25":"as soon as he had made an end of offering the burnt offering","10:26":"and burned them.","10:27":"and broke down the house of Baal","10:28":"Thus Jehu destroyed Baal out of Israel.","10:29":"with which he made Israel to sin","10:30":"Because you have done well in executing that which is right in my eyes","10:31":"the God of Israel","10:32":"In those days the LORD began to cut Israel short: and Hazael smote them in all the coasts of Israel;","10:33":"all the land of Gilead","10:34":"and all that he did","10:35":"And Jehu slept with his fathers: and they buried him in Samaria. And Jehoahaz his son reigned in his stead.","10:36":"And the time that Jehu reigned over Israel in Samaria was twenty and eight years.","11:1":"she arose and destroyed all the seed royal.","11:2":"the daughter of king Joram","11:3":"And he was with her hid in the house of the LORD six years. And Athaliah did reign over the land.","11:4":"and brought them to him into the house of Yahweh; and he made a covenant with them","11:5":"saying","11:6":"and be a barrier.","11:7":"even all who go forth on the Sabbath","11:8":"every man with his weapons in his hand; and he who comes within the ranks","11:9":"those who were to come in on the Sabbath","11:10":"which were in the house of Yahweh.","11:11":"every man with his weapons in his hand","11:12":"and put the crown on him","11:13":"she came to the people into the house of Yahweh:","11:14":"and behold","11:15":"and said to them","11:16":"And they laid hands on her; and she went by the way by the which the horses came into the king's house: and there was she slain.","11:17":"that they should be Yahweh's people; between the king also and the people.","11:18":"and broke it down; his altars and his images broke they in pieces thoroughly","11:19":"and the Carites","11:20":"and the city was quiet. Athaliah they had slain with the sword at the king's house.","11:21":"Seven years old was Jehoash when he began to reign.","12:1":"In the seventh year of Jehu Jehoash began to reign; and forty years reigned he in Jerusalem. And his mother's name was Zibiah of Beersheba.","12:2":"And Jehoash did that which was right in the sight of the LORD all his days wherein Jehoiada the priest instructed him.","12:3":"But the high places were not taken away: the people still sacrificed and burnt incense in the high places.","12:4":"All the money of the holy things that is brought into the house of Yahweh","12:5":"every man from his acquaintance; and they shall repair the breaches of the house","12:6":"that in the three and twentieth year of king Jehoash the priests had not repaired the breaches of the house.","12:7":"and for the [other] priests","12:8":"neither repair the breaches of the house.","12:9":"and bored a hole in the lid of it","12:10":"when they saw that there was much money in the chest","12:11":"who had the oversight of the house of Yahweh: and they paid it out to the carpenters and the builders","12:12":"and for buying timber and hewn stone to repair the breaches of the house of Yahweh","12:13":"snuffers","12:14":"and repaired therewith the house of Yahweh.","12:15":"Moreover they reckoned not with the men","12:16":"and the money for the sin offerings","12:17":"and fought against Gath","12:18":"his fathers","12:19":"and all that he did","12:20":"and made a conspiracy","12:21":"and Jehozabad the son of Shomer","13:1":"king of Judah","13:2":"and followed the sins of Jeroboam the son of Nebat","13:3":"and he delivered them into the hand of Hazael king of Syria","13:4":"and Yahweh listened to him; for he saw the oppression of Israel","13:5":"so that they went out from under the hand of the Syrians; and the children of Israel lived in their tents as before.","13:6":"with which he made Israel to sin","13:7":"and ten chariots","13:8":"and all that he did","13:9":"And Jehoahaz slept with his fathers; and they buried him in Samaria: and Joash his son reigned in his stead.","13:10":"[and reigned] sixteen years.","13:11":"with which he made Israel to sin; but he walked therein.","13:12":"and all that he did","13:13":"And Joash slept with his fathers; and Jeroboam sat upon his throne: and Joash was buried in Samaria with the kings of Israel.","13:14":"and wept over him","13:15":"Take bow and arrows; and he took to him bow and arrows.","13:16":"Put your hand on the bow; and he put his hand [on it]. Elisha laid his hands on the king's hands.","13:17":"Open the window eastward; and he opened it. Then Elisha said","13:18":"Take the arrows; and he took them.  He said to the king of Israel","13:19":"and said","13:20":"and they buried him.  Now the bands of the Moabites invaded the land at the coming in of the year.","13:21":"as they were burying a man","13:22":"But Hazael king of Syria oppressed Israel all the days of Jehoahaz.","13:23":"and had compassion on them","13:24":"So Hazael king of Syria died; and Benhadad his son reigned in his stead.","13:25":"and recovered the cities of Israel.","14:1":"In the second year of Joash son of Jehoahaz king of Israel reigned Amaziah the son of Joash king of Judah.","14:2":"He was twenty and five years old when he began to reign","14:3":"yet not like David his father:  he did according to all that Joash his father had done.","14:4":"Howbeit the high places were not taken away: as yet the people did sacrifice and burnt incense on the high places.","14:5":"as soon as the kingdom was established in his hand","14:6":"as Yahweh commanded","14:7":"and took Sela by war","14:8":"the son of Jehoahaz son of Jehu","14:9":"saying","14:10":"and your heart has lifted you up: glory of it","14:11":"which belongs to Judah.","14:12":"And Judah was put to the worse before Israel; and they fled every man to their tents.","14:13":"the son of Jehoash the son of Ahaziah","14:14":"and all the vessels that were found in the house of Yahweh","14:15":"and his might","14:16":"and was buried in Samaria with the kings of Israel; and Jeroboam his son reigned in his place.","14:17":"And Amaziah the son of Joash king of Judah lived after the death of Jehoash son of Jehoahaz king of Israel fifteen years.","14:18":"aren't they written in the book of the chronicles of the kings of Judah?","14:19":"and killed him there.","14:20":"And they brought him on horses: and he was buried at Jerusalem with his fathers in the city of David.","14:21":"who was sixteen years old","14:22":"and restored it to Judah","14:23":"[and reigned] forty-one years.","14:24":"with which he made Israel to sin.","14:25":"according to the word of Yahweh","14:26":"that it was very bitter; for there was none shut up nor left at large","14:27":"And the LORD said not that he would blot out the name of Israel from under heaven: but he saved them by the hand of Jeroboam the son of Joash.","14:28":"and all that he did","14:29":"even with the kings of Israel; and Zechariah his son reigned in his place.","15:1":"In the twenty and seventh year of Jeroboam king of Israel began Azariah son of Amaziah king of Judah to reign.","15:2":"Sixteen years old was he when he began to reign","15:3":"according to all that his father Amaziah had done.","15:4":"Save that the high places were not removed: the people sacrificed and burnt incense still on the high places.","15:5":"so that he was a leper to the day of his death","15:6":"and all that he did","15:7":"So Azariah slept with his fathers; and they buried him with his fathers in the city of David: and Jotham his son reigned in his stead.","15:8":"In the thirty and eighth year of Azariah king of Judah did Zachariah the son of Jeroboam reign over Israel in Samaria six months.","15:9":"as his fathers had done:  he didn't depart from the sins of Jeroboam the son of Nebat","15:10":"and struck him before the people","15:11":"behold","15:12":"saying","15:13":"Shallum the son of Jabesh began to reign in the nine and thirtieth year of Uzziah king of Judah; and he reigned a full month in Samaria.","15:14":"and came to Samaria","15:15":"and his conspiracy which he made","15:16":"and all who were therein","15:17":"[and reigned] ten years in Samaria.","15:18":"with which he made Israel to sin.","15:19":"that his hand might be with him to confirm the kingdom in his hand.","15:20":"even of all the mighty men of wealth","15:21":"and all that he did","15:22":"And Menahem slept with his fathers; and Pekahiah his son reigned in his stead.","15:23":"[and reigned] two years.","15:24":"with which he made Israel to sin.","15:25":"his captain","15:26":"and all that he did","15:27":"[and reigned] twenty years.","15:28":"with which he made Israel to sin.","15:29":"and took Ijon","15:30":"and struck him","15:31":"and all that he did","15:32":"In the second year of Pekah the son of Remaliah king of Israel began Jotham the son of Uzziah king of Judah to reign.","15:33":"Five and twenty years old was he when he began to reign","15:34":"And he did that which was right in the sight of the LORD: he did according to all that his father Uzziah had done.","15:35":"Howbeit the high places were not removed: the people sacrificed and burned incense still in the high places. He built the higher gate of the house of the LORD.","15:36":"and all that he did","15:37":"and Pekah the son of Remaliah.","15:38":"and was buried with his fathers in the city of David his father:  and Ahaz his son reigned in his place.","16:1":"In the seventeenth year of Pekah the son of Remaliah Ahaz the son of Jotham king of Judah began to reign.","16:2":"like David his father.","16:3":"yes","16:4":"and on the hills","16:5":"but could not overcome him.","16:6":"and drove the Jews from Elath; and the Syrians came to Elath","16:7":"saying","16:8":"and in the treasures of the king's house","16:9":"and took it","16:10":"and saw the altar that was at Damascus; and king Ahaz sent to Urijah the priest the fashion of the altar","16:11":"so did Urijah the priest make it against the coming of king Ahaz from Damascus.","16:12":"the king saw the altar: and the king drew near to the altar","16:13":"and poured his drink offering","16:14":"which was before Yahweh","16:15":"saying","16:16":"according to all that king Ahaz commanded.","16:17":"and removed the basin from off them","16:18":"and the king's entry outside","16:19":"aren't they written in the book of the chronicles of the kings of Judah?","16:20":"and was buried with his fathers in the city of David:  and Hezekiah his son reigned in his place.","17:1":"[and reigned] nine years.","17:2":"yet not as the kings of Israel who were before him.","17:3":"and brought him tribute.","17:4":"and offered no tribute to the king of Assyria","17:5":"and went up to Samaria","17:6":"and carried Israel away to Assyria","17:7":"because the children of Israel had sinned against Yahweh their God","17:8":"whom Yahweh cast out from before the children of Israel","17:9":"from the tower of the watchmen to the fortified city;","17:10":"and under every green tree;","17:11":"as did the nations whom Yahweh carried away before them; and they worked wicked things to provoke Yahweh to anger;","17:12":"of which Yahweh had said to them","17:13":"and to Judah","17:14":"they would not hear","17:15":"and his covenant that he made with their fathers","17:16":"and made them molten images","17:17":"and used divination and enchantments","17:18":"and removed them out of his sight:  there was none left but the tribe of Judah only.","17:19":"but walked in the statutes of Israel which they made.","17:20":"and afflicted them","17:21":"and made them sin a great sin.","17:22":"For the children of Israel walked in all the sins of Jeroboam which he did; they departed not from them;","17:23":"as he spoke by all his servants the prophets.  So Israel was carried away out of their own land to Assyria to this day.","17:24":"and from Cuthah","17:25":"at the beginning of their dwelling there","17:26":"saying","17:27":"saying","17:28":"and taught them how they should fear Yahweh.","17:29":"and put them in the houses of the high places which the Samaritans had made","17:30":"and the men of Cuth made Nergal","17:31":"the gods of Sepharvaim.","17:32":"and made to them from among themselves priests of the high places","17:33":"and served their own gods","17:34":"neither do they after their statutes","17:35":"and charged them","17:36":"who brought you up out of the land of Egypt with great power and with an outstretched arm","17:37":"and the law and the commandment","17:38":"And the covenant that I have made with you ye shall not forget; neither shall ye fear other gods.","17:39":"But the LORD your God ye shall fear; and he shall deliver you out of the hand of all your enemies.","17:40":"but they did after their former manner.","17:41":"and served their engraved images; their children likewise","18:1":"that Hezekiah the son of Ahaz king of Judah began to reign.","18:2":"Twenty and five years old was he when he began to reign; and he reigned twenty and nine years in Jerusalem. His mother's name also was Abi","18:3":"according to all that David his father had done.","18:4":"and broke the pillars","18:5":"the God of Israel; so that after him was none like him among all the kings of Judah","18:6":"but kept his commandments","18:7":"and didn't serve him.","18:8":"from the tower of the watchmen to the fortified city.","18:9":"which was the seventh year of Hoshea son of Elah king of Israel","18:10":"which was the ninth year of Hoshea king of Israel","18:11":"and put them in Halah","18:12":"but transgressed his covenant","18:13":"and took them.","18:14":"saying","18:15":"and in the treasures of the king's house.","18:16":"and [from] the pillars which Hezekiah king of Judah had overlaid","18:17":"they came and stood by the conduit of the upper pool","18:18":"there came out to them Eliakim the son of Hilkiah","18:19":"Say you now to Hezekiah","18:20":"[There is] counsel and strength for the war.  Now on whom do you trust","18:21":"behold","18:22":"We trust in Yahweh our God; isn't that he whose high places and whose altars Hezekiah has taken away","18:23":"Please give pledges to my master the king of Assyria","18:24":"and put your trust on Egypt for chariots and for horsemen?","18:25":"Go up against this land","18:26":"and Shebnah","18:27":"Has my master sent me to your master","18:28":"and cried with a loud voice in the Jews' language","18:29":"Don't let Hezekiah deceive you; for he will not be able to deliver you out of his hand:","18:30":"saying","18:31":"Make your peace with me","18:32":"a land of grain and new wine","18:33":"Hath any of the gods of the nations delivered at all his land out of the hand of the king of Assyria?","18:34":"and of Arpad? where are the gods of Sepharvaim","18:35":"that have delivered their country out of my hand","18:36":"and answered him not a word; for the king's commandment was","18:37":"who was over the household","19:1":"when king Hezekiah heard it","19:2":"who was over the household","19:3":"Thus says Hezekiah","19:4":"whom the king of Assyria his master has sent to defy the living God","19:5":"So the servants of king Hezekiah came to Isaiah.","19:6":"Thus shall you tell your master","19:7":"I will put a spirit in him","19:8":"and found the king of Assyria warring against Libnah; for he had heard that he was departed from Lachish.","19:9":"Behold","19:10":"saying","19:11":"you have heard what the kings of Assyria have done to all lands","19:12":"which my fathers have destroyed","19:13":"and the king of Arpad","19:14":"and read it; and Hezekiah went up to the house of Yahweh","19:15":"and said","19:16":"Yahweh","19:17":"Yahweh","19:18":"but the work of men's hands","19:19":"Yahweh our God","19:20":"saying","19:21":"This is the word that the LORD hath spoken concerning him; The virgin the daughter of Zion hath despised thee","19:22":"Whom hast thou reproached and blasphemed? and against whom hast thou exalted thy voice","19:23":"and have said","19:24":"and with the sole of my feet will I dry up all the rivers of Egypt.","19:25":"and formed it of ancient times? now have I brought it to pass","19:26":"they were dismayed and confounded; they were as the grass of the field","19:27":"and your going out","19:28":"and because your arrogance is come up into my ears","19:29":"and in the second year that which springs of the same; and in the third year sow you","19:30":"and bear fruit upward.","19:31":"and out of Mount Zion those who shall escape:  the zeal of Yahweh shall perform this.","19:32":"He shall not come to this city","19:33":"by the same shall he return","19:34":"for my own sake","19:35":"that the angel of Yahweh went forth","19:36":"and went and returned","19:37":"as he was worshipping in the house of Nisroch his god","20:1":"and said to him","20:2":"and prayed to Yahweh","20:3":"Yahweh","20:4":"before Isaiah was gone out into the middle part of the city","20:5":"and tell Hezekiah the prince of my people","20:6":"and for my servant David's sake.","20:7":"Take a cake of figs.  They took and laid it on the boil","20:8":"What shall be the sign that Yahweh will heal me","20:9":"This shall be the sign to you from Yahweh","20:10":"It is a light thing for the shadow to decline ten steps:  nay","20:11":"by which it had gone down on the dial of Ahaz.","20:12":"king of Babylon","20:13":"and shown them all the house of his precious things","20:14":"and said to him","20:15":"What have they seen in your house?  Hezekiah answered","20:16":"Hear the word of Yahweh.","20:17":"the days come","20:18":"whom you shall father","20:19":"Good is the word of Yahweh which you have spoken.  He said moreover","20:20":"and all his might","20:21":"And Hezekiah slept with his fathers: and Manasseh his son reigned in his stead.","21:1":"Manasseh was twelve years old when he began to reign","21:2":"after the abominations of the nations whom Yahweh cast out before the children of Israel.","21:3":"and made an Asherah","21:4":"of which Yahweh said","21:5":"And he built altars for all the host of heaven in the two courts of the house of the LORD.","21:6":"and practiced sorcery","21:7":"that he had made","21:8":"if only they will observe to do according to all that I have commanded them","21:9":"But they hearkened not: and Manasseh seduced them to do more evil than did the nations whom the LORD destroyed before the children of Israel.","21:10":"saying","21:11":"and has done wickedly above all that the Amorites did","21:12":"the God of Israel","21:13":"and the plummet of the house of Ahab; and I will wipe Jerusalem as a man wipes a dish","21:14":"and deliver them into the hand of their enemies; and they shall become a prey and a spoil to all their enemies;","21:15":"and have provoked me to anger","21:16":"until he had filled Jerusalem from one end to another; besides his sin with which he made Judah to sin","21:17":"and all that he did","21:18":"and was buried in the garden of his own house","21:19":"Amon was twenty and two years old when he began to reign","21:20":"as did Manasseh his father.","21:21":"and served the idols that his father served","21:22":"the God of his fathers","21:23":"and put the king to death in his own house.","21:24":"And the people of the land slew all them that had conspired against king Amon; and the people of the land made Josiah his son king in his stead.","21:25":"aren't they written in the book of the chronicles of the kings of Judah?","21:26":"And he was buried in his sepulchre in the garden of Uzza: and Josiah his son reigned in his stead.","22:1":"Josiah was eight years old when he began to reign","22:2":"and walked in all the way of David his father","22:3":"that the king sent Shaphan","22:4":"that he may sum the money which is brought into the house of Yahweh","22:5":"to repair the breaches of the house","22:6":"and to the builders","22:7":"Howbeit there was no reckoning made with them of the money that was delivered into their hand","22:8":"I have found the book of the law in the house of Yahweh. Hilkiah delivered the book to Shaphan","22:9":"and brought the king word again","22:10":"saying","22:11":"when the king had heard the words of the book of the law","22:12":"and Ahikam the son of Shaphan","22:13":"inquire of Yahweh for me","22:14":"and Ahikam","22:15":"Thus says Yahweh","22:16":"Behold","22:17":"and have burned incense to other gods","22:18":"who sent you to inquire of Yahweh","22:19":"and you did humble yourself before Yahweh","22:20":"behold","23:1":"and they gathered to him all the elders of Judah and of Jerusalem.","23:2":"and all the men of Judah and all the inhabitants of Jerusalem with him","23:3":"and made a covenant before Yahweh","23:4":"and the priests of the second order","23:5":"whom the kings of Judah had ordained to burn incense in the high places in the cities of Judah","23:6":"outside of Jerusalem","23:7":"that were in the house of Yahweh","23:8":"and defiled the high places where the priests had burned incense","23:9":"but they ate unleavened bread among their brothers.","23:10":"which is in the valley of the children of Hinnom","23:11":"at the entrance of the house of Yahweh","23:12":"which the kings of Judah had made","23:13":"which were on the right hand of the mountain of corruption","23:14":"and cut down the Asherim","23:15":"and the high place which Jeroboam the son of Nebat","23:16":"he spied the tombs that were there in the mountain; and he sent","23:17":"What monument is that which I see? The men of the city told him","23:18":"Let him be; let no man move his bones. So they let his bones alone","23:19":"which the kings of Israel had made to provoke [Yahweh] to anger","23:20":"on the altars","23:21":"saying","23:22":"nor in all the days of the kings of Israel","23:23":"But in the eighteenth year of king Josiah","23:24":"and the wizards","23:25":"who turned to Yahweh with all his heart","23:26":"Yahweh didn't turn from the fierceness of his great wrath","23:27":"I will remove Judah also out of my sight","23:28":"and all that he did","23:29":"when he had seen him.","23:30":"and brought him to Jerusalem","23:31":"Jehoahaz was twenty and three years old when he began to reign; and he reigned three months in Jerusalem. And his mother's name was Hamutal","23:32":"according to all that his fathers had done.","23:33":"that he might not reign in Jerusalem; and put the land to a tribute of one hundred talents of silver","23:34":"and changed his name to Jehoiakim: but he took Jehoahaz away; and he came to Egypt","23:35":"of everyone according to his taxation","23:36":"Jehoiakim was twenty and five years old when he began to reign; and he reigned eleven years in Jerusalem. And his mother's name was Zebudah","23:37":"according to all that his fathers had done.","24:1":"and Jehoiakim became his servant three years:  then he turned and rebelled against him.","24:2":"and bands of the Syrians","24:3":"to remove them out of his sight","24:4":"And also for the innocent blood that he shed: for he filled Jerusalem with innocent blood; which the LORD would not pardon.","24:5":"and all that he did","24:6":"So Jehoiakim slept with his fathers: and Jehoiachin his son reigned in his stead.","24:7":"from the brook of Egypt to the river Euphrates","24:8":"Jehoiachin was eighteen years old when he began to reign","24:9":"according to all that his father had done.","24:10":"and the city was besieged.","24:11":"while his servants were besieging it;","24:12":"he","24:13":"and the treasures of the king's house","24:14":"and all the princes","24:15":"and the king's wives","24:16":"even seven thousand","24:17":"[Jehoiachin's] father's brother","24:18":"Zedekiah was twenty and one years old when he began to reign","24:19":"according to all that Jehoiakim had done.","24:20":"until he had cast them out from his presence. Zedekiah rebelled against the king of Babylon.","25:1":"in the tenth month","25:2":"And the city was besieged unto the eleventh year of king Zedekiah.","25:3":"so that there was no bread for the people of the land.","25:4":"and all the men of war [fled] by night by the way of the gate between the two walls","25:5":"and overtook him in the plains of Jericho; and all his army was scattered from him.","25:6":"and carried him up to the king of Babylon to Riblah; and they gave judgment on him.","25:7":"and put out the eyes of Zedekiah","25:8":"on the seventh day of the month","25:9":"and the king's house; and all the houses of Jerusalem","25:10":"who were [with] the captain of the guard","25:11":"and those who fell away","25:12":"But the captain of the guard left of the door of the poor of the land to be vinedressers and husbandmen.","25:13":"and the bases and the bronze sea that were in the house of Yahweh","25:14":"and the shovels","25:15":"and the basins","25:16":"the one sea","25:17":"and a capital of brass was on it; and the height of the capital was three cubits","25:18":"and Zephaniah the second priest","25:19":"who were found in the city; and the scribe","25:20":"and brought them to the king of Babylon to Riblah.","25:21":"and put them to death at Riblah in the land of Hamath.  So Judah was carried away captive out of his land.","25:22":"whom Nebuchadnezzar king of Babylon had left","25:23":"they and their men","25:24":"and said to them","25:25":"that Ishmael the son of Nethaniah","25:26":"both small and great","25:27":"in the twelfth month","25:28":"and set his throne above the throne of the kings who were with him in Babylon","25:29":"And changed his prison garments: and he did eat bread continually before him all the days of his life.","25:30":"there was a continual allowance given him of the king"}