{"1:1":"when David was returned from the slaughter of the Amalekites","1:2":"that behold","1:3":"From whence come you?  He said to him","1:4":"How went the matter?  Please tell me. He answered","1:5":"How know you that Saul and Jonathan his son are dead?","1:6":"As I happened by chance on Mount Gilboa","1:7":"he saw me","1:8":"Who are you?  I answered him","1:9":"Stand","1:10":"and killed him","1:11":"and tore them; and likewise all the men who were with him:","1:12":"and wept","1:13":"Whence are you? He answered","1:14":"How were you not afraid to put forth your hand to destroy Yahweh's anointed?","1:15":"and said","1:16":"Your blood be on your head; for your mouth has testified against you","1:17":"And David lamented with this lamentation over Saul and over Jonathan his son:","1:18":"it is written in the book of Jashar):","1:19":"Israel","1:20":"lest the daughters of the Philistines rejoice","1:21":"let there be no dew nor rain on you","1:22":"from the fat of the mighty","1:23":"they were not divided.  They were swifter than eagles.  They were stronger than lions.","1:24":"weep over Saul","1:25":"How are the mighty fallen in the midst of the battle! O Jonathan","1:26":"my brother Jonathan.  You have been very pleasant to me.  Your love to me was wonderful","1:27":"and the weapons of war perished!","2:1":"that David inquired of Yahweh","2:2":"and his two wives also","2:3":"every man with his household:  and they lived in the cities of Hebron.","2:4":"and there they anointed David king over the house of Judah.  They told David","2:5":"and said to them","2:6":"because you have done this thing.","2:7":"and be you valiant; for Saul your lord is dead","2:8":"captain of Saul's army","2:9":"and over the Ashurites","2:10":"Saul's son","2:11":"And the time that David was king in Hebron over the house of Judah was seven years and six months.","2:12":"and the servants of Ishbosheth the son of Saul","2:13":"and the servants of David","2:14":"Please let the young men arise and play before us.  Joab said","2:15":"and for Ishbosheth the son of Saul","2:16":"and [thrust] his sword in his fellow's side; so they fell down together: therefore that place was called Helkath Hazzurim","2:17":"and the men of Israel","2:18":"Joab","2:19":"And Asahel pursued after Abner; and in going he turned not to the right hand nor to the left from following Abner.","2:20":"and said","2:21":"Turn you aside to your right hand or to your left","2:22":"Turn you aside from following me: why should I strike you to the ground? how then should I hold up my face to Joab your brother?","2:23":"so that the spear came out behind him; and he fell down there","2:24":"that lies before Giah by the way of the wilderness of Gibeon.","2:25":"and became one band","2:26":"and said","2:27":"As God lives","2:28":"and pursued after Israel no more","2:29":"and went through all Bithron","2:30":"there lacked of David's servants nineteen men and Asahel.","2:31":"and of Abner's men","2:32":"and buried him in the tomb of his father","3:1":"but the house of Saul grew weaker and weaker.","3:2":"of Ahinoam the Jezreelitess;","3:3":"Chileab","3:4":"Adonijah the son of Haggith; and the fifth","3:5":"Ithream","3:6":"while there was war between the house of Saul and the house of David","3:7":"whose name was Rizpah","3:8":"and said","3:9":"and more also","3:10":"and to set up the throne of David over Israel and over Judah","3:11":"because he feared him.","3:12":"saying","3:13":"Well; I will make a league with you; but one thing I require of you:  that is","3:14":"Saul's son","3:15":"and took her from her husband","3:16":"weeping as he went","3:17":"saying","3:18":"saying","3:19":"and to the whole house of Benjamin.","3:20":"and twenty men with him. David made Abner and the men who were with him a feast.","3:21":"I will arise and go","3:22":"the servants of David and Joab came from a foray","3:23":"they told Joab","3:24":"and said","3:25":"that he came to deceive you","3:26":"he sent messengers after Abner","3:27":"Joab took him aside into the midst of the gate to speak with him quietly","3:28":"when David heard it","3:29":"and on all his father's house; and let there not fail from the house of Joab one who has an issue","3:30":"because he had killed their brother Asahel at Gibeon in the battle.","3:31":"and to all the people who were with him","3:32":"and wept at the grave of Abner; and all the people wept.","3:33":"and said","3:34":"nor your feet put into fetters. As a man falls before the children of iniquity","3:35":"saying","3:36":"and it pleased them; as whatever the king did pleased all the people.","3:37":"For all the people and all Israel understood that day that it was not of the king to slay Abner the son of Ner.","3:38":"Don't you know that there a prince and a great man has fallen this day in Israel?,And the king said unto his servants, Know ye not that there is a prince and a great man fallen this day in Israel?,  וַיֹּאמֶר הַמֶּלֶךְ אֶל־עֲבָדָיו הֲלוֹא תֵדְעוּ כִּי־שַׂר וְגָדוֹל נָפַל הַיּוֹם הַזֶּה בְּיִשְׂרָאֵל׃ ‬,And the king said unto his servants: Know ye not that there is a prince and a great man fallen this day in Israel?","3:39":"though anointed king; and these men the sons of Zeruiah are too hard for me.  May Yahweh reward the evil-doer according to his wickedness.,And I am this day weak, though anointed king; and these men the sons of Zeruiah be too hard for me: the LORD shall reward the doer of evil according to his wickedness.,  וְאָנֹכִי הַיּוֹם רַךְ וּמָשׁוּחַ מֶלֶךְ וְהָאֲנָשִׁים הָאֵלֶּה בְּנֵי צְרוּיָה קָשִׁים מִמֶּנִּי יְשַׁלֵּם יְהוָה לְעֹשֵׂה הָרָעָה כְּרָעָתוֹ׃ פ ‬,And I am this day weak, and just anointed king; and these men the sons of Zeruiah are too hard for me; the LORD reward the evildoer according to his wickedness.","4:1":"Saul's son","4:2":"Saul's son","4:3":"and have lived as foreigners there until this day).","4:4":"Saul's son","4:5":"Rechab and Baanah","4:6":"as though they would have fetched wheat; and they struck him in the body: and Rechab and Baanah his brother escaped.","4:7":"as he lay on his bed in his bedchamber","4:8":"and said to the king","4:9":"the sons of Rimmon the Beerothite","4:10":"saying","4:11":"when wicked men have slain a righteous person in his own house on his bed","4:12":"and they killed them","5:1":"and spoke","5:2":"when Saul was king over us","5:3":"So all the elders of Israel came to the king to Hebron; and king David made a league with them in Hebron before the LORD: and they anointed David king over Israel.","5:4":"and he reigned forty years.","5:5":"In Hebron he reigned over Judah seven years and six months: and in Jerusalem he reigned thirty and three years over all Israel and Judah.","5:6":"the inhabitants of the land","5:7":"Nevertheless David took the strong hold of Zion: the same is the city of David.","5:8":"Whoever strikes the Jebusites","5:9":"and called it the city of David. David built round about from Millo and inward.","5:10":"the God of Armies","5:11":"and cedar trees","5:12":"and that he had exalted his kingdom for his people Israel's sake.","5:13":"after he was come from Hebron; and there were yet sons and daughters born to David.","5:14":"and Shobab","5:15":"and Elishua","5:16":"and Eliada","5:17":"all the Philistines went up to seek David; and David heard of it","5:18":"The Philistines also came and spread themselves in the valley of Rephaim.","5:19":"saying","5:20":"and David struck them there; and he said","5:21":"And there they left their images","5:22":"and spread themselves in the valley of Rephaim.","5:23":"he said","5:24":"when you hear the sound of marching in the tops of the mulberry trees","5:25":"as Yahweh commanded him","6:1":"thirty thousand.","6:2":"and went with all the people who were with him","6:3":"and brought it out of the house of Abinadab that was in the hill: and Uzzah and Ahio","6:4":"which was in the hill","6:5":"and with harps","6:6":"Uzzah put forth [his hand] to the ark of God","6:7":"And the anger of the LORD was kindled against Uzzah; and God smote him there for his error; and there he died by the ark of God.","6:8":"because Yahweh had broken forth on Uzzah; and he called that place Perez Uzzah","6:9":"How shall the ark of Yahweh come to me?","6:10":"So David would not remove the ark of the LORD unto him into the city of David: but David carried it aside into the house of Obededom the Gittite.","6:11":"and all his house.","6:12":"saying","6:13":"that","6:14":"And David danced before the LORD with all his might; and David was girded with a linen ephod.","6:15":"and with the sound of the trumpet.","6:16":"as the ark of Yahweh came into the city of David","6:17":"and set it in its place","6:18":"he blessed the people in the name of Yahweh of Armies.","6:19":"even among the whole multitude of Israel","6:20":"and said","6:21":"[It was] before Yahweh","6:22":"and will be base in my own sight:  but of the handmaids of whom you have spoken","6:23":"Therefore Michal the daughter of Saul had no child unto the day of her death.","7:1":"when the king lived in his house","7:2":"See now","7:3":"Go","7:4":"that the word of Yahweh came to Nathan","7:5":"Thus says Yahweh","7:6":"even to this day","7:7":"spoke I a word with any of the tribes of Israel","7:8":"Thus says Yahweh of Armies","7:9":"and have cut off all your enemies from before you; and I will make you a great name","7:10":"and will plant them","7:11":"And as since the time that I commanded judges to be over my people Israel","7:12":"and you shall sleep with your fathers","7:13":"and I will establish the throne of his kingdom forever.","7:14":"and he shall be my son: if he commit iniquity","7:15":"as I took it from Saul","7:16":"And thine house and thy kingdom shall be established for ever before thee: thy throne shall be established for ever.","7:17":"and according to all this vision","7:18":"and sat before Yahweh; and he said","7:19":"Lord Yahweh; but you have spoken also of your servant's house for a great while to come; and this [too] after the manner of men","7:20":"Lord Yahweh.","7:21":"and according to your own heart","7:22":"Yahweh God:  for there is none like you","7:23":"even like Israel","7:24":"Yahweh","7:25":"Yahweh God","7:26":"saying","7:27":"Yahweh of Armies","7:28":"O Lord Yahweh","7:29":"that it may continue forever before you; for you","8:1":"and subdued them:  and David took the bridle of the mother city out of the hand of the Philistines.","8:2":"and measured them with the line","8:3":"king of Zobah","8:4":"and twenty thousand footmen:  and David hamstrung all the chariot horses","8:5":"David struck of the Syrians two and twenty thousand men.","8:6":"and brought tribute. Yahweh gave victory to David wherever he went.","8:7":"and brought them to Jerusalem.","8:8":"cities of Hadadezer","8:9":"","8:10":"to Greet him","8:11":"with the silver and gold that he dedicated of all the nations which he subdued;","8:12":"and of Moab","8:13":"even eighteen thousand men.","8:14":"and all the Edomites became servants to David. Yahweh gave victory to David wherever he went.","8:15":"And David reigned over all Israel; and David executed judgment and justice unto all his people.","8:16":"And Joab the son of Zeruiah was over the host; and Jehoshaphat the son of Ahilud was recorder;","8:17":"and Ahimelech the son of Abiathar","8:18":"And Benaiah the son of Jehoiada was over both the Cherethites and the Pelethites; and David's sons were chief rulers.","9:1":"Is there yet any who is left of the house of Saul","9:2":"and they called him to David; and the king said to him","9:3":"Is there not yet any of the house of Saul","9:4":"Where is he?  Ziba said to the king","9:5":"and fetched him out of the house of Machir the son of Ammiel","9:6":"the son of Jonathan","9:7":"Don't be afraid of him; for I will surely show you kindness for Jonathan your father's sake, and will restore you all the land of Saul your father; and you shall eat bread at my table continually.","9:8":"and said","9:9":"Saul's servant","9:10":"you","9:11":"According to all that my lord the king commands his servant","9:12":"whose name was Mica. All that lived in the house of Ziba were servants to Mephibosheth.","9:13":"So Mephibosheth dwelt in Jerusalem: for he did eat continually at the king's table; and was lame on both his feet.","10:1":"that the king of the children of Ammon died","10:2":"I will show kindness to Hanun the son of Nahash","10:3":"Do you think that David honors your father","10:4":"and shaved off the one half of their beards","10:5":"he sent to meet them; for the men were greatly ashamed.  The king said","10:6":"the children of Ammon sent and hired the Syrians of Beth Rehob","10:7":"he sent Joab","10:8":"and put the battle in array at the entrance of the gate:  and the Syrians of Zobah and of Rehob","10:9":"he chose of all the choice men of Israel","10:10":"And the rest of the people he delivered into the hand of Abishai his brother","10:11":"If the Syrians be too strong for me","10:12":"and let us play the man for our people","10:13":"And Joab drew nigh","10:14":"they likewise fled before Abishai","10:15":"they gathered themselves together.","10:16":"and brought out the Syrians who were beyond the River:  and they came to Helam","10:17":"and passed over the Jordan","10:18":"and forty thousand horsemen","10:19":"they made peace with Israel","11:1":"at the return of the year","11:2":"that David arose from off his bed","11:3":"Is not this Bathsheba","11:4":"and took her; and she came in to him","11:5":"and said","11:6":"[saying]","11:7":"David asked of him how Joab did","11:8":"Go down to your house","11:9":"and didn't go down to his house.","11:10":"saying","11:11":"The ark","11:12":"Stay here today also","11:13":"he ate and drink before him; and he made him drunk:  and at even he went out to lie on his bed with the servants of his lord","11:14":"that David wrote a letter to Joab","11:15":"saying","11:16":"when Joab kept watch on the city","11:17":"and fought with Joab: and there fell some of the people","11:18":"Then Joab sent and told David all the things concerning the war;","11:19":"saying","11:20":"if the king's wrath arise","11:21":"so that he died at Thebez?  Why did you go so near the wall?' then shall you say","11:22":"and came and shown David all that Joab had sent him for.","11:23":"The men prevailed against us","11:24":"and your servant Uriah the Hittite is dead also.","11:25":"Thus shall you tell Joab","11:26":"she made lamentation for her husband.","11:27":"David sent and took her home to his house","12:1":"and said to him","12:2":"","12:3":"except one little ewe lamb","12:4":"and he spared to take of his own flock and of his own herd","12:5":"and he said to Nathan","12:6":"because he did this thing","12:7":"You are the man.  This is what Yahweh, the God of Israel, says:  'I anointed you king over Israel, and I delivered you out of the hand of Saul.,And Nathan said to David, Thou art the man. Thus saith the LORD God of Israel, I anointed thee king over Israel, and I delivered thee out of the hand of Saul;,  וַיֹּאמֶר נָתָן אֶל־דָּוִד אַתָּה הָאִישׁ כֹּה־אָמַר יְהוָה אֱלֹהֵי יִשְׂרָאֵל אָנֹכִי מְשַׁחְתִּיךָ לְמֶלֶךְ עַל־יִשְׂרָאֵל וְאָנֹכִי הִצַּלְתִּיךָ מִיַּד שָׁאוּל׃ ‬,And Nathan said to David: Thou art the man. Thus saith the LORD","12:8":"and your master's wives into your bosom","12:9":"to do that which is evil in his sight?  You have struck Uriah the Hittite with the sword","12:10":"because you have despised me","12:11":"I will raise up evil against you out of your own house; and I will take your wives before your eyes","12:12":"but I will do this thing before all Israel","12:13":"I have sinned against Yahweh. Nathan said to David","12:14":"because by this deed you have given great occasion to Yahweh's enemies to blaspheme","12:15":"and it was very sick.","12:16":"and went in","12:17":"[and stood] beside him","12:18":"that the child died. The servants of David feared to tell him that the child was dead; for they said","12:19":"David perceived that the child was dead; and David said to his servants","12:20":"and washed","12:21":"What thing is this that you have done? you did fast and weep for the child","12:22":"While the child was yet alive","12:23":"why should I fast? can I bring him back again? I shall go to him","12:24":"and went in to her","12:25":"for Yahweh's sake.","12:26":"and took the royal city.","12:27":"and said","12:28":"and encamp against the city","12:29":"and went to Rabbah","12:30":"and [in it were] precious stones; and it was set on David's head. He brought forth the spoil of the city","12:31":"and put them under saws","13:1":"that Absalom the son of David had a beautiful sister","13:2":"And Amnon was so vexed","13:3":"whose name was Jonadab","13:4":"Why","13:5":"Lay you down on your bed","13:6":"and feigned himself sick:  and when the king was come to see him","13:7":"saying","13:8":"and kneaded it","13:9":"and poured them out before him; but he refused to eat.  Amnon said","13:10":"Bring the food into the chamber","13:11":"he took hold of her","13:12":"No","13:13":"where shall I carry my shame? and as for you","13:14":"he forced her","13:15":"Arise","13:16":"Not so","13:17":"and said","13:18":"and bolted the door after her.","13:19":"and tore her garment of various colors that was on her; and she laid her hand on her head","13:20":"Has Amnon your brother been with you? but now hold your peace","13:21":"he was very angry.","13:22":"because he had forced his sister Tamar.","13:23":"that Absalom had sheepshearers in Baal Hazor","13:24":"and said","13:25":"No","13:26":"If not","13:27":"and he let Amnon and all the king's sons go with him.","13:28":"saying","13:29":"and every man got him up on his mule","13:30":"while they were in the way","13:31":"and tore his garments","13:32":"the son of Shimeah","13:33":"to think that all the king's sons are dead; for Amnon only is dead.","13:34":"and looked","13:35":"Behold","13:36":"as soon as he had made an end of speaking","13:37":"and went to Talmai the son of Ammihur","13:38":"and went to Geshur","13:39":"seeing he was dead.","14:1":"Now Joab the son of Zeruiah perceived that the king's heart was toward Absalom.","14:2":"and fetched there a wise woman","14:3":"and speak on this manner to him. So Joab put the words in her mouth.","14:4":"she fell on her face to the ground","14:5":"What ails you?  She answered","14:6":"and they two strove together in the field","14:7":"the whole family is risen against your handmaid","14:8":"Go to your house","14:9":"My lord","14:10":"Whoever says anything to you","14:11":"Please let the king remember Yahweh your God","14:12":"Please let your handmaid speak a word to my lord the king.  He said","14:13":"Why then have you devised such a thing against the people of God? for in speaking this word the king is as one who is guilty","14:14":"and are as water split on the ground","14:15":"it is because the people have made me afraid: and your handmaid said","14:16":"to deliver his servant out of the hand of the man who would destroy me and my son together out of the inheritance of God.","14:17":"Please let the word of my lord the king be comfortable; for as an angel of God","14:18":"Please don't hide anything from me that I shall ask you.  The woman said","14:19":"Is the hand of Joab with you in all this? The woman answered","14:20":"according to the wisdom of an angel of God","14:21":"Behold now","14:22":"and did obeisance","14:23":"and brought Absalom to Jerusalem.","14:24":"Let him turn to his own house","14:25":"But in all Israel there was none to be so much praised as Absalom for his beauty: from the sole of his foot even to the crown of his head there was no blemish in him.","14:26":"therefore he cut it); he weighed the hair of his head at two hundred shekels","14:27":"and one daughter","14:28":"So Absalom dwelt two full years in Jerusalem","14:29":"to send him to the king; but he would not come to him:  and he sent again a second time","14:30":"Behold","14:31":"and came to Absalom to his house","14:32":"Behold","14:33":"and told him; and when he had called for Absalom","15:1":"that Absalom prepared him a chariot and horses","15:2":"and stood beside the way of the gate: and it was so","15:3":"Behold","15:4":"Oh that I were made judge in the land","15:5":"that when any man came near to do him obeisance","15:6":"And on this manner did Absalom to all Israel that came to the king for judgment: so Absalom stole the hearts of the men of Israel.","15:7":"that Absalom said to the king","15:8":"saying","15:9":"Go in peace.  So he arose","15:10":"saying","15:11":"who were invited","15:12":"David's counselor","15:13":"saying","15:14":"Arise","15:15":"Behold","15:16":"and all his household after him. The king left ten women","15:17":"and all the people after him; and they stayed in Beth Merhak.","15:18":"and all the Pelethites","15:19":"Why go you also with us? return","15:20":"should I this day make you go up and down with us","15:21":"and said","15:22":"Go and pass over.  Ittai the Gittite passed over","15:23":"and all the people passed over:  the king also himself passed over the brook Kidron","15:24":"Zadok also [came]","15:25":"Carry back the ark of God into the city: if I shall find favor in the eyes of Yahweh","15:26":"I have no delight in you; behold","15:27":"Aren't you a seer? Return into the city in peace, and your two sons with you, Ahimaaz your son, and Jonathan the son of Abiathar.,The king said also unto Zadok the priest, Art not thou a seer? return into the city in peace, and your two sons with you, Ahimaaz thy son, and Jonathan the son of Abiathar.,  וַיֹּאמֶר הַמֶּלֶךְ אֶל־צָדוֹק הַכֹּהֵן הֲרוֹאֶה אַתָּה שֻׁבָה הָעִיר בְּשָׁלוֹם וַאֲחִימַעַץ בִּנְךָ וִיהוֹנָתָן בֶּן־אֶבְיָתָר שְׁנֵי בְנֵיכֶם אִתְּכֶם׃ ‬,The king said also unto Zadok the priest: 'seest thou? return into the city in peace, and your two sons with you, Ahimaaz thy son, and Jonathan the son of Abiathar.,καὶ εἶπεν ὁ βασιλεὺς τῷ σαδωκ τῷ ἱερεῖ ἴδετε σὺ ἐπιστρέφεις εἰς τὴν πόλιν ἐν εἰρήνῃ καὶ αχιμαας ὁ υἱός σου καὶ ιωναθαν ὁ υἱὸς αβιαθαρ οἱ δύο υἱοὶ ὑμῶν μεθ' ὑμῶν,And the king said to Sadoc the priest, Behold, thou shalt return to the city in peace, and Achimaas thy son, and Jonathan the son of Abiathar, your two sons with you.,,,,","15:28":"I will stay at the fords of the wilderness","15:29":"Zadok therefore and Abiathar carried the ark of God again to Jerusalem: and they tarried there.","15:30":"and wept as he went up; and he had his head covered","15:31":"saying","15:32":"where God was worshiped","15:33":"If you pass on with me","15:34":"and tell Absalom","15:35":"that whatever thing you shall hear out of the king's house","15:36":"they have there with them their two sons","15:37":"David's friend","16:1":"behold","16:2":"What do you mean by these? Ziba said","16:3":"Where is your master's son?  Ziba said to the king","16:4":"Behold","16:5":"behold","16:6":"and at all the servants of king David: and all the people and all the mighty men were on his right hand and on his left.","16:7":"Be gone","16:8":"in whose place you have reigned; and Yahweh has delivered the kingdom into the hand of Absalom your son; and behold","16:9":"Why should this dead dog curse my lord the king? Please let me go over and take off his head.","16:10":"What have I to do with you","16:11":"and to all his servants","16:12":"and that Yahweh will requite me good for [his] cursing of me this day.","16:13":"and cursed as he went","16:14":"and all the people who were with him","16:15":"and all the people","16:16":"when Hushai the Archite","16:17":"Is this your kindness to your friend? Why didn't you go with your friend?","16:18":"No; but whom Yahweh","16:19":"whom should I serve?  Shouldn't I serve in the presence of his son? as I have served in your father's presence","16:20":"Give your counsel what we shall do.","16:21":"Go in to your father's concubines","16:22":"So they spread Absalom a tent upon the top of the house; and Absalom went in unto his father's concubines in the sight of all Israel.","16:23":"which he gave in those days","17:1":"Let me now choose out twelve thousand men","17:2":"and will make him afraid; and all the people who are with him shall flee; and I will strike the king only;","17:3":"And I will bring back all the people unto thee: the man whom thou seekest is as if all returned: so all the people shall be in peace.","17:4":"and all the elders of Israel.","17:5":"Call now Hushai the Archite also","17:6":"Absalom spoke to him","17:7":"The counsel that Ahithophel has given this time is not good.","17:8":"You know your father and his men","17:9":"he is hid now in some pit","17:10":"whose heart is as the heart of a lion","17:11":"from Dan even to Beersheba","17:12":"and we will light on him as the dew falls on the ground; and of him and of all the men who are with him we will not leave so much as one.","17:13":"if he be gotten into a city","17:14":"The counsel of Hushai the Archite is better than the counsel of Ahithophel. For Yahweh had ordained to defeat the good counsel of Ahithophel","17:15":"Thus and thus did Ahithophel counsel Absalom and the elders of Israel; and thus and thus have I counseled.","17:16":"and tell David","17:17":"Now Jonathan and Ahimaaz stayed by Enrogel; for they might not be seen to come into the city: and a wench went and told them; and they went and told king David.","17:18":"and told Absalom:  and they went both of them away quickly","17:19":"and strewed bruised grain thereon; and nothing was known.","17:20":"Where are Ahimaaz and Jonathan?  The woman said to them","17:21":"after they had departed","17:22":"and all the people who were with him","17:23":"he saddled his donkey","17:24":"he and all the men of Israel with him.","17:25":"whose name was Ithra the Israelite","17:26":"So Israel and Absalom pitched in the land of Gilead.","17:27":"when David was come to Mahanaim","17:28":"and basins","17:29":"and butter","18:1":"and set captains of thousands and captains of hundreds over them.","18:2":"a third part under the hand of Joab","18:3":"You shall not go forth:  for if we flee away","18:4":"What seems you best I will do. The king stood beside the gate","18:5":"saying","18:6":"So the people went out into the field against Israel: and the battle was in the wood of Ephraim;","18:7":"and there was a great slaughter there that day of twenty thousand men.","18:8":"For the battle was there scattered over the face of all the country: and the wood devoured more people that day than the sword devoured.","18:9":"and the mule went under the thick boughs of a great oak","18:10":"and told Joab","18:11":"Behold","18:12":"Though I should receive a thousand [pieces of] silver in my hand","18:13":"then you yourself would have set yourself against [me].","18:14":"I may not wait thus with you.  He took three darts in his hand","18:15":"and killed him.","18:16":"and the people returned from pursuing after Israel; for Joab held back the people.","18:17":"and cast him into the great pit in the forest","18:18":"which is in the king's dale; for he said","18:19":"Let me now run","18:20":"You shall not be the bearer of news this day","18:21":"Go","18:22":"But come what may","18:23":"[said he]","18:24":"and lifted up his eyes","18:25":"and told the king.  The king said","18:26":"and said","18:27":"I think the running of the foremost is like the running of Ahimaaz the son of Zadok.  The king said","18:28":"and said to the king","18:29":"Is it well with the young man Absalom? Ahimaaz answered","18:30":"Turn aside","18:31":"the Cushite came; and the Cushite said","18:32":"Is it well with the young man Absalom?  The Cushite answered","18:33":"and went up to the chamber over the gate","19:1":"Behold","19:2":"The king grieves for his son.","19:3":"as people who are ashamed steal away when they flee in battle.","19:4":"and the king cried with a loud voice","19:5":"and said","19:6":"and hate those who love you. For you have declared this day","19:7":"go forth","19:8":"and sat in the gate.  They told to all the people","19:9":"saying","19:10":"whom we anointed over us","19:11":"saying","19:12":"you are my bone and my flesh: why then are you the last to bring back the king?","19:13":"Aren't you my bone and my flesh? God do so to me","19:14":"even as [the heart of] one man; so that they sent to the king","19:15":"and came to the Jordan.  Judah came to Gilgal","19:16":"the Benjamite","19:17":"and Ziba the servant of the house of Saul","19:18":"and to do what he thought good.  Shimei the son of Gera fell down before the king","19:19":"Don't let my lord impute iniquity to me","19:20":"behold","19:21":"Shall Shimei not be put to death for this","19:22":"What have I to do with you","19:23":"You shall not die.  The king swore to him.","19:24":"nor trimmed his beard","19:25":"when he was come to Jerusalem to meet the king","19:26":"My lord","19:27":"And he hath slandered thy servant unto my lord the king; but my lord the king is as an angel of God: do therefore what is good in thine eyes.","19:28":"For all of my father's house were but dead men before my lord the king: yet didst thou set thy servant among them that did eat at thine own table. What right therefore have I yet to cry any more unto the king?","19:29":"Why speak you any more of your matters? I say","19:30":"yes","19:31":"to conduct him over the Jordan.","19:32":"even eighty years old: and he had provided the king with sustenance while he lay at Mahanaim; for he was a very great man.","19:33":"Come you over with me","19:34":"How many are the days of the years of my life","19:35":"I am this day fourscore years old: and can I discern between good and evil? can thy servant taste what I eat or what I drink? can I hear any more the voice of singing men and singing women? wherefore then should thy servant be yet a burden unto my lord the king?","19:36":"Thy servant will go a little way over Jordan with the king: and why should the king recompense it me with such a reward?","19:37":"that I may die in my own city","19:38":"Chimham shall go over with me","19:39":"and the king went over: and the king kissed Barzillai","19:40":"and Chimham went over with him: and all the people of Judah brought the king over","19:41":"all the men of Israel came to the king","19:42":"Because the king is a close relative to us:  why then are you angry for this matter? have we eaten at all at the king's cost? or has he given us any gift?","19:43":"and said","20:1":"whose name was Sheba","20:2":"and followed Sheba the son of Bichri; but the men of Judah joined with their king","20:3":"whom he had left to keep the house","20:4":"Call me the men of Judah together within three days","20:5":"So Amasa went to assemble the men of Judah: but he tarried longer than the set time which he had appointed him.","20:6":"Now will Sheba the son of Bichri do us more harm than did Absalom:  take your lord's servants","20:7":"and the Cherethites and the Pelethites","20:8":"Amasa came to meet them.  Joab was girded with his apparel of war that he had put on","20:9":"Is it well with you","20:10":"and shed out his bowels to the ground","20:11":"and said","20:12":"he carried Amasa out of the highway into the field","20:13":"all the people went on after Joab","20:14":"and to Beth Maacah","20:15":"and they cast up a mound against the city","20:16":"Hear, hear! Please say to Joab, 'Come near here, that I may speak with you.'","20:17":"Are you Joab?  He answered","20:18":"saying","20:19":"I am one of them that are peaceable and faithful in Israel: thou seekest to destroy a city and a mother in Israel: why wilt thou swallow up the inheritance of the LORD?","20:20":"Far be it","20:21":"Sheba the son of Bichri by name","20:22":"and threw it out to Joab.  He blew the trumpet","20:23":"Now Joab was over all the host of Israel: and Benaiah the son of Jehoiada was over the Cherethites and over the Pelethites:","20:24":"And Adoram was over the tribute: and Jehoshaphat the son of Ahilud was recorder:","20:25":"And Sheva was scribe: and Zadok and Abiathar were the priests:","20:26":"And Ira also the Jairite was a chief ruler about David.","21:1":"year after year; and David sought the face of Yahweh. Yahweh said","21:2":"and said to them (now the Gibeonites were not of the children of Israel","21:3":"What shall I do for you? And with what shall I make atonement","21:4":"It is no matter of silver or gold between us and Saul","21:5":"The man who consumed us","21:6":"and we will hang them up to Yahweh in Gibeah of Saul","21:7":"the son of Jonathan the son of Saul","21:8":"whom she bore to Saul","21:9":"and they hanged them in the mountain before Yahweh","21:10":"and spread it for her on the rock","21:11":"the concubine of Saul","21:12":"who had stolen them from the street of Beth Shan","21:13":"And he brought up from thence the bones of Saul and the bones of Jonathan his son; and they gathered the bones of them that were hanged.","21:14":"in the tomb of Kish his father: and they performed all that the king commanded. After that God was entreated for the land.","21:15":"and his servants with him","21:16":"who was of the sons of the giant","21:17":"and struck the Philistine","21:18":"that there was again war with the Philistines at Gob:  then Sibbecai the Hushathite killed Saph","21:19":"the staff of whose spear was like a weaver's beam.","21:20":"where was a man of great stature","21:21":"Jonathan the son of Shimei","21:22":"and by the hand of his servants.","22:1":"and out of the hand of Saul:","22:2":"Yahweh is my rock","22:3":"my rock","22:4":"who is worthy to be praised: So shall I be saved from my enemies.","22:5":"When the waves of death compassed me","22:6":"The sorrows of hell compassed me about; the snares of death prevented me;","22:7":"I called to my God. He heard my voice out of his temple.  My cry [came] into his ears.","22:8":"because he was angry.","22:9":"There went up a smoke out of his nostrils","22:10":"and came down.  Thick darkness was under his feet.","22:11":"and flew.  Yes","22:12":"and thick clouds of the skies.","22:13":"coals of fire were kindled.","22:14":"The LORD thundered from heaven","22:15":"and scattered them; lightning","22:16":"At the blast of the breath of his nostrils.","22:17":"He sent from above","22:18":"from those who hated me","22:19":"but Yahweh was my support.","22:20":"because he delighted in me.","22:21":"The LORD rewarded me according to my righteousness: according to the cleanness of my hands hath he recompensed me.","22:22":"and have not wickedly departed from my God.","22:23":"I did not depart from them.","22:24":"I was also upright before him","22:25":"According to my cleanness in his eyesight.","22:26":"With the merciful thou wilt show thyself merciful","22:27":"With the pure thou wilt show thyself pure; and with the froward thou wilt show thyself unsavory.","22:28":"But your eyes are on the haughty","22:29":"Yahweh.  Yahweh will light up my darkness.","22:30":"I run against a troop.  By my God","22:31":"his way is perfect.  The word of Yahweh is tested. He is a shield to all those who take refuge in him.","22:32":"besides Yahweh?  Who is a rock","22:33":"God is my strength and power: and he maketh my way perfect.","22:34":"and sets me on my high places.","22:35":"so that my arms bend a bow of brass.","22:36":"Thou hast also given me the shield of thy salvation: and thy gentleness hath made me great.","22:37":"Thou hast enlarged my steps under me; so that my feet did not slip.","22:38":"I have pursued mine enemies","22:39":"and struck them through","22:40":"For thou hast girded me with strength to battle: them that rose up against me hast thou subdued under me.","22:41":"that I might cut off those who hate me.","22:42":"but there was none to save; even to Yahweh","22:43":"and spread them abroad.","22:44":"Thou also hast delivered me from the strivings of my people","22:45":"they will obey me.","22:46":"and will come trembling out of their close places.","22:47":"the rock of my salvation","22:48":"who brings down peoples under me","22:49":"you lift me up above those who rise up against me.  You deliver me from the violent man.","22:50":"Yahweh","22:51":"and shows loving kindness to his anointed","23:1":"the man who was raised on high says","23:2":"The Spirit of the LORD spake by me","23:3":"the Rock of Israel spoke to me","23:4":"when the sun rises","23:5":"yet he has made with me an everlasting covenant","23:6":"because they can't be taken with the hand","23:7":"But the man that shall touch them must be fenced with iron and the staff of a spear; and they shall be utterly burned with fire in the same place.","23:8":"chief of the captains; the same was Adino the Eznite","23:9":"one of the three mighty men with David","23:10":"and struck the Philistines until his hand was weary","23:11":"where was a plot of ground full of lentils; and the people fled from the Philistines.","23:12":"and defended it","23:13":"and came to David in the harvest time to the cave of Adullam; and the troop of the Philistines was encamped in the valley of Rephaim.","23:14":"And David was then in an hold","23:15":"and said","23:16":"and drew water out of the well of Bethlehem","23:17":"Be it far from me","23:18":"the brother of Joab","23:19":"Was he not most honorable of three? therefore he was their captain: howbeit he attained not unto the first three.","23:20":"the son of a valiant man of Kabzeel","23:21":"a goodly man:  and the Egyptian had a spear in his hand; but he went down to him with a staff","23:22":"and had a name among the three mighty men.","23:23":"but he didn't attain to the [first] three.  David set him over his guard.","23:24":"","23:25":"Elika the Harodite","23:26":"Ira the son of Ikkesh the Tekoite","23:27":"Mebunnai the Hushathite","23:28":"Maharai the Netophathite","23:29":"Ittai the son of Ribai of Gibeah of the children of Benjamin","23:30":"Hiddai of the brooks of Gaash.","23:31":"Azmaveth the Barhumite","23:32":"the sons of Jashen","23:33":"Ahiam the son of Sharar the Ararite","23:34":"the son of the Maacathite","23:35":"Paarai the Arbite","23:36":"Bani the Gadite","23:37":"Naharai the Beerothite","23:38":"Gareb the Ithrite","23:39":"Uriah the Hittite: thirty and seven in all.","24:1":"and he moved David against them","24:2":"who was with him","24:3":"Now Yahweh your God add to the people","24:4":"the king's word prevailed against Joab","24:5":"and encamped in Aroer","24:6":"and to the land of Tahtim Hodshi; and they came to Dan Jaan","24:7":"and to all the cities of the Hivites","24:8":"they came to Jerusalem at the end of nine months and twenty days.","24:9":"And Joab gave up the sum of the number of the people unto the king: and there were in Israel eight hundred thousand valiant men that drew the sword; and the men of Judah were five hundred thousand men.","24:10":"I have sinned greatly in that which I have done:  but now","24:11":"the word of Yahweh came to the prophet Gad","24:12":"Thus says Yahweh","24:13":"and told him","24:14":"I am in a great strait:  let us fall now into the hand of Yahweh; for his mercies are great; and let me not fall into the hand of man.","24:15":"So the LORD sent a pestilence upon Israel from the morning even to the time appointed: and there died of the people from Dan even to Beersheba seventy thousand men.","24:16":"Yahweh repented him of the evil","24:17":"and said","24:18":"and said to him","24:19":"as Yahweh commanded.","24:20":"and saw the king and his servants coming on toward him:  and Araunah went out","24:21":"Why is my lord the king come to his servant? David said","24:22":"Let my lord the king take and offer up what seems good to him:  behold","24:23":"king","24:24":"No; but I will most certainly buy it of you at a price.  Neither will I offer burnt offerings to Yahweh my God which cost me nothing. So David bought the threshing floor and the oxen for fifty shekels of silver.","24:25":"and offered burnt offerings and peace offerings.  So Yahweh was entreated for the land"}