{"1:1":"an apostle of Jesus Christ through the will of God","1:2":"my beloved child:  Grace","1:3":"whom I serve as my forefathers did","1:4":"remembering your tears","1:5":"and your mother Eunice","1:6":"I remind you that you should stir up the gift of God which is in you through the laying on of my hands.","1:7":"but of power","1:8":"nor of me his prisoner; but endure hardship for the Good News according to the power of God","1:9":"not according to our works","1:10":"Christ Jesus","1:11":"I was appointed as a preacher","1:12":"for I know him whom I have believed","1:13":"in faith and love which is in Christ Jesus.","1:14":"guard through the Holy Spirit who dwells in us.","1:15":"that all who are in Asia turned away from me; of whom are Phygelus and Hermogenes.","1:16":"for he often refreshed me","1:17":"he sought me diligently","1:18":"you know very well.","2:1":"my child","2:2":"commit the same to faithful men","2:3":"as a good soldier of Christ Jesus.","2:4":"that he may please him who enrolled him as a soldier.","2:5":"if anyone competes in athletics","2:6":"The husbandman that laboureth must be first partaker of the fruits.","2:7":"and may the Lord give you understanding in all things.","2:8":"risen from the dead","2:9":"Wherein I suffer trouble","2:10":"that they also may obtain the salvation which is in Christ Jesus with eternal glory.","2:11":"","2:12":"we will also reign with him.  If we deny him","2:13":"he remains faithful.  He can't deny himself.,If we believe not, yet he abideth faithful: he cannot deny himself.,,,,,,,,","2:14":"charging them in the sight of the Lord","2:15":"a workman who doesn't need to be ashamed","2:16":"for they will proceed further in ungodliness","2:17":"of whom is Hymenaeus and Philetus;","2:18":"saying that the resurrection is already past","2:19":"having this seal","2:20":"but also of wood and of clay.  Some are for honor","2:21":"he will be a vessel for honor","2:22":"faith","2:23":"knowing that they generate strife.","2:24":"but be gentle towards all","2:25":"","2:26":"having been taken captive by him to his will.","3:1":"that in the last days","3:2":"lovers of money","3:3":"unforgiving","3:4":"headstrong","3:5":"but having denied the power thereof. Turn away from these","3:6":"and take captive gullible women loaded down with sins","3:7":"and never able to come to the knowledge of the truth.","3:8":"so do these also oppose the truth; men corrupted in mind","3:9":"as theirs also came to be.","3:10":"conduct","3:11":"and sufferings:  those things that happened to me at Antioch","3:12":"and all who desire to live godly in Christ Jesus will suffer persecution.","3:13":"deceiving and being deceived.","3:14":"knowing from whom you have learned them.","3:15":"you have known the sacred writings which are able to make you wise for salvation through faith","3:16":"God-breathed} is profitable for teaching","3:17":"thoroughly equipped for every good work.","4:1":"who will judge the living and the dead at his appearing and his Kingdom:","4:2":"rebuke","4:3":"but","4:4":"and turn aside to fables.","4:5":"suffer hardship","4:6":"and the time of my departure has come.","4:7":"I have fought a good fight","4:8":"there is stored up for me the crown of righteousness","4:9":"","4:10":"having loved this present world","4:11":"and bring him with you","4:12":"And Tychicus have I sent to Ephesus.","4:13":"and the books","4:14":"the coppersmith","4:15":"Of whom be thou ware also; for he hath greatly withstood our words.","4:16":"no one came to help me","4:17":"and strengthened me","4:18":"and will preserve me for his heavenly Kingdom; to whom be the glory forever and ever.  Amen.","4:19":"and the house of Onesiphorus.","4:20":"but I left Trophimus at Miletus sick.","4:21":"as do Pudens","4:22":"The Lord Jesus Christ be with thy spirit. Grace be with you. Amen."}