{"1:1":"Theophilus","1:2":"after he had given commandment through the Holy Spirit to the apostles whom he had chosen.","1:3":"by many proofs","1:4":"he charged them","1:5":"but you will be baptized in the Holy Spirit not many days from now.,For John truly baptized with water; but ye shall be baptized with the Holy Ghost not many days hence.,,,,,,,,","1:6":"when they had come together","1:7":"It isn't for you to know times or seasons which the Father has set within his own authority.,And he said unto them, It is not for you to know the times or the seasons, which the Father hath put in his own power.,,,,,,,,","1:8":"in all Judea and Samaria","1:9":"as they were looking","1:10":"behold","1:11":"You men of Galilee, why do you stand looking into the sky?  This Jesus, who was received up from you into the sky will come back in the same way as you saw him going into the sky.","1:12":"which is near Jerusalem","1:13":"they went up into the upper room","1:14":"along with the women","1:15":"Peter stood up in the midst of the disciples (and the number of names was about one hundred twenty)","1:16":"","1:17":"and received his portion in this ministry.","1:18":"and falling headlong","1:19":"' that is","1:20":"'Let his habitation be made desolate.  Let no one dwell therein;'{Psalm 69:25} and","1:21":"","1:22":"to the day that he was received up from us","1:23":"Joseph called Barsabbas","1:24":"and said","1:25":"that he might go to his own place.,That he may take part of this ministry and apostleship, from which Judas by transgression fell, that he might go to his own place.,,,,,,,,","1:26":"and the lot fell on Matthias","2:1":"they were all with one accord in one place.","2:2":"and it filled all the house where they were sitting.","2:3":"and one sat on each of them.","2:4":"and began to speak with other languages","2:5":"devout men","2:6":"the multitude came together","2:7":"saying to one another","2:8":"everyone in our own native language?","2:9":"Medes","2:10":"Pamphylia","2:11":"","2:12":"and were perplexed","2:13":"mocking","2:14":"standing up with the eleven","2:15":"as you suppose","2:16":"But this is that which was spoken by the prophet Joel;","2:17":"says God","2:18":"and on my servants and on my handmaidens in those days","2:19":"and signs on the earth beneath; blood","2:20":"and the moon into blood","2:21":"that whoever will call on the name of the Lord will be saved.'{Joel 2:28-32}","2:22":"","2:23":"being delivered up by the determined counsel and foreknowledge of God","2:24":"having freed him from the agony of death","2:25":"'I saw the Lord always before my face","2:26":"and my tongue rejoiced. Moreover my flesh also will dwell in hope;","2:27":"Hell}","2:28":"Thou hast made known to me the ways of life; thou shalt make me full of joy with thy countenance.","2:29":"","2:30":"being a prophet","2:31":"that neither was his soul left in Hades{or","2:32":"to which we all are witnesses.","2:33":"and having received from the Father the promise of the Holy Spirit","2:34":"but he says himself","2:35":"","2:36":"Therefore let all the house of Israel know assuredly","2:37":"they were cut to the heart","2:38":"Repent, and be baptized, every one of you, in the name of Jesus Christ for the forgiveness of sins, and you will receive the gift of the Holy Spirit.,Then Peter said unto them, Repent, and be baptized every one of you in the name of Jesus Christ for the remission of sins, and ye shall receive the gift of the Holy Ghost.,,,,,,,,","2:39":"and to your children","2:40":"and exhorted them","2:41":"Then they that gladly received his word were baptized: and the same day there were added unto them about three thousand souls.","2:42":"in the breaking of bread","2:43":"and many wonders and signs were done through the apostles.","2:44":"and had all things in common.","2:45":"and distributed them to all","2:46":"continuing steadfastly with one accord in the temple","2:47":"and having favor with all the people.  The Lord added to the assembly day by day those who were being saved.","3:1":"the ninth hour{3:00 PM}.","3:2":"whom they laid daily at the door of the temple which is called Beautiful","3:3":"he asked to receive gifts for the needy.","3:4":"fastening his eyes on him","3:5":"expecting to receive something from them.","3:6":"Silver and gold have I none, but what I have, that I give you.  In the name of Jesus Christ of Nazareth, get up and walk!","3:7":"and raised him up. Immediately his feet and his ankle bones received strength.","3:8":"he stood","3:9":"And all the people saw him walking and praising God:","3:10":"that it was he who used to sit begging for gifts for the needy at the Beautiful Gate of the temple. They were filled with wonder and amazement at what had happened to him.","3:11":"all the people ran together to them in the porch that is called Solomon's","3:12":"he responded to the people","3:13":"Isaac","3:14":"and asked for a murderer to be granted to you","3:15":"whom God raised from the dead","3:16":"whom you see and know.  Yes","3:17":"","3:18":"that Christ should suffer","3:19":"","3:20":"who was ordained for you before","3:21":"which God spoke long ago by the mouth of his holy prophets.","3:22":"'The Lord God will raise up a prophet for you from among your brothers","3:23":"that every soul that will not listen to that prophet will be utterly destroyed from among the people.'{Deuteronomy 18:15","3:24":"and all the prophets from Samuel and those who followed after","3:25":"and of the covenant which God made with our fathers","3:26":"having raised up his servant","4:1":"the priests and the captain of the temple and the Sadducees came to them","4:2":"Being grieved that they taught the people","4:3":"and put them in custody until the next day","4:4":"and the number of the men came to be about five thousand.","4:5":"that their rulers","4:6":"with Caiaphas","4:7":"they inquired","4:8":"filled with the Holy Spirit","4:9":"by what means this man has been healed","4:10":"and to all the people of Israel","4:11":"the builders","4:12":"for neither is there any other name under heaven","4:13":"and had perceived that they were unlearned and ignorant men","4:14":"they could say nothing against it.","4:15":"they conferred among themselves","4:16":"What shall we do to these men?  Because indeed a notable miracle has been done through them, as can be plainly seen by all who dwell in Jerusalem, and we can't deny it.,Saying, What shall we do to these men? for that indeed a notable miracle hath been done by them is manifest to all them that dwell in Jerusalem; and we cannot deny it.,,,,,,,,","4:17":"let's threaten them","4:18":"and charged them not to speak at all nor teach in the name of Jesus.","4:19":"Whether it is right in the sight of God to listen to you rather than to God, judge for yourselves,,But Peter and John answered and said unto them, Whether it be right in the sight of God to hearken unto you more than unto God, judge ye.,,,,,,,,","4:20":"","4:21":"they let them go","4:22":"For the man was above forty years old","4:23":"they came to their own company","4:24":"they lifted up their voice to God with one accord","4:25":"David","4:26":"and the rulers take council together","4:27":"","4:28":"For to do whatsoever thy hand and thy counsel determined before to be done.","4:29":"Lord","4:30":"","4:31":"the place was shaken where they were gathered together.  They were all filled with the Holy Spirit","4:32":"but they had all things in common.","4:33":"the apostles gave their testimony of the resurrection of the Lord Jesus.  Great grace was on them all.","4:34":"for as many as were owners of lands or houses sold them","4:35":"and distribution was made to each","4:36":"who by the apostles was surnamed Barnabas (which is","4:37":"sold it","5:1":"with Sapphira","5:2":"his wife also being aware of it","5:3":"Ananias, why has Satan filled your heart to lie to the Holy Spirit, and to keep back part of the price of the land?,But Peter said, Ananias, why hath Satan filled thine heart to lie to the Holy Ghost, and to keep back part of the price of the land?,,,,,,,,","5:4":"didn't it remain your own? After it was sold","5:5":"hearing these words","5:6":"and they carried him out and buried him.","5:7":"his wife","5:8":"Tell me whether you sold the land for so much. She said","5:9":"How is it that you have agreed together to tempt the Spirit of the Lord?  Behold, the feet of those who have buried your husband are at the door, and they will carry you out.","5:10":"and died. The young men came in and found her dead","5:11":"and on all who heard these things.","5:12":"And by the hands of the apostles were many signs and wonders wrought among the people; (and they were all with one accord in Solomon's porch.","5:13":"however the people honored them.","5:14":"multitudes of both men and women.","5:15":"and laid them on cots and mattresses","5:16":"bringing sick people","5:17":"and all those who were with him (which is the sect of the Sadducees)","5:18":"and put them in public custody.","5:19":"and brought them out","5:20":"Go","5:21":"they entered into the temple about daybreak","5:22":"","5:23":"Saying","5:24":"the captain of the temple","5:25":"Behold, the men whom you put in prison are in the temple, standing and teaching the people.","5:26":"and brought them without violence","5:27":"they set them before the council. The high priest questioned them","5:28":"Didn't we strictly charge you not to teach in this name? Behold, you have filled Jerusalem with your teaching, and intend to bring this man's blood on us.","5:29":"We must obey God rather than men.,Then Peter and the other apostles answered and said, We ought to obey God rather than men.,,,,,,,,","5:30":"whom you killed","5:31":"to give repentance to Israel","5:32":"whom God has given to those who obey him.,And we are his witnesses of these things; and so is also the Holy Ghost, whom God hath given to them that obey him.,,,,,,,,","5:33":"when they heard this","5:34":"a Pharisee named Gamaliel","5:35":"You men of Israel, be careful concerning these men, what you are about to do.,And said unto them, Ye men of Israel, take heed to yourselves what ye intend to do as touching these men.,,,,,,,,","5:36":"making himself out to be somebody; to whom a number of men","5:37":"Judas of Galilee rose up in the days of the enrollment","5:38":"withdraw from these men","5:39":"you will not be able to overthrow it","5:40":"they beat them and charged them not to speak in the name of Jesus","5:41":"rejoicing that they were counted worthy to suffer dishonor for Jesus' name.","5:42":"in the temple and at home","6:1":"when the number of the disciples was multiplying","6:2":"It is not appropriate for us to forsake the word of God and serve tables.,Then the twelve called the multitude of the disciples unto them, and said, It is not reason that we should leave the word of God, and serve tables.,,,,,,,,","6:3":"brothers","6:4":"","6:5":"a man full of faith and of the Holy Spirit","6:6":"they laid their hands on them.","6:7":"And the word of God increased; and the number of the disciples multiplied in Jerusalem greatly; and a great company of the priests were obedient to the faith.","6:8":"full of faith and power","6:9":"of the Alexandrians","6:10":"And they were not able to resist the wisdom and the spirit by which he spake.","6:11":"We have heard him speak blasphemous words against Moses and God.","6:12":"the elders","6:13":"This man never stops speaking blasphemous words against this holy place and the law.,And set up false witnesses, which said, This man ceaseth not to speak blasphemous words against this holy place, and the law:,,,,,,,,","6:14":"and will change the customs which Moses delivered to us.,For we have heard him say, that this Jesus of Nazareth shall destroy this place, and shall change the customs which Moses delivered us.,,,,,,,,","6:15":"fastening their eyes on him","7:1":"Are these things so?","7:2":"Brothers and fathers, listen.  The God of glory appeared to our father Abraham, when he was in Mesopotamia, before he lived in Haran,,And he said, Men, brethren, and fathers, hearken; The God of glory appeared unto our father Abraham, when he was in Mesopotamia, before he dwelt in Charran,,,,,,,,,","7:3":"'Get out of your land","7:4":"and lived in Haran. From there","7:5":"no","7:6":"and that they would be enslaved and mistreated for four hundred years.","7:7":"' said God","7:8":"and circumcised him the eighth day. Isaac became the father of Jacob","7:9":"","7:10":"and gave him favor and wisdom before Pharaoh","7:11":"and great affliction.  Our fathers found no food.","7:12":"he sent out our fathers the first time.","7:13":"and Joseph's race was revealed to Pharaoh.","7:14":"and summoned Jacob","7:15":"and he died","7:16":"and laid in the tomb that Abraham bought for a price in silver from the children of Hamor of Shechem.","7:17":"","7:18":"who didn't know Joseph.","7:19":"and mistreated our fathers","7:20":"and was exceedingly handsome. He was nourished three months in his father's house.","7:21":"Pharaoh's daughter took him up","7:22":"And Moses was learned in all the wisdom of the Egyptians","7:23":"it came into his heart to visit his brothers{The word for brothers here and where the context allows may be also correctly translated brothers and sisters or siblings.}","7:24":"he defended him","7:25":"by his hand","7:26":"","7:27":"saying","7:28":"as you killed the Egyptian yesterday?'{Exodus 2:14}","7:29":"and became a stranger in the land of Midian","7:30":"","7:31":"he wondered at the sight.  As he came close to see","7:32":"the God of Abraham","7:33":"'Take your sandals off of your feet","7:34":"and have heard their groaning.  I have come down to deliver them. Now come","7:35":"","7:36":"having worked wonders and signs in Egypt","7:37":"who said to the children of Israel","7:38":"and with our fathers","7:39":"but rejected him","7:40":"'Make us gods that will go before us","7:41":"and brought a sacrifice to the idol","7:42":"and gave them up to serve the army of the sky","7:43":"the star of your god Rephan","7:44":"","7:45":"in their turn","7:46":"and asked to find a habitation for the God of Jacob.","7:47":"But Solomon built him an house.","7:48":"the Most High doesn't dwell in temples made with hands","7:49":"and the earth a footstool for my feet. What kind of house will you build me?' says the Lord; 'or what is the place of my rest?","7:50":"Hath not my hand made all these things?","7:51":"","7:52":"of whom you have now become betrayers and murderers.","7:53":"and didn't keep it!,Who have received the law by the disposition of angels, and have not kept it.,,,,,,,,","7:54":"they were cut to the heart","7:55":"being full of the Holy Spirit","7:56":"Behold, I see the heavens opened, and the Son of Man standing at the right hand of God!","7:57":"and stopped their ears","7:58":"and stoned him. The witnesses placed their garments at the feet of a young man named Saul.","7:59":"saying","7:60":"and cried with a loud voice","8:1":"except for the apostles.","8:2":"and lamented greatly over him.","8:3":"entering into every house","8:4":"Therefore they that were scattered abroad went every where preaching the word.","8:5":"and proclaimed to them the Christ.","8:6":"when they heard and saw the signs which he did.","8:7":"crying with a loud voice.  Many who had been paralyzed and lame were healed.","8:8":"And there was great joy in that city.","8:9":"Simon by name","8:10":"from the least to the greatest","8:11":"because for a long time he had amazed them with his sorceries.","8:12":"they were baptized","8:13":"he continued with Philip.  Seeing signs and great miracles occurring","8:14":"they sent Peter and John to them","8:15":"when they had come down","8:16":"(For as yet he was fallen upon none of them: only they were baptized in the name of the Lord Jesus.)","8:17":"and they received the Holy Spirit.","8:18":"he offered them money","8:19":"Give me also this power, that whoever I lay my hands on may receive the Holy Spirit.","8:20":"May your silver perish with you, because you thought you could obtain the gift of God with money!,But Peter said unto him, Thy money perish with thee, because thou hast thought that the gift of God may be purchased with money.,,,,,,,,","8:21":"for your heart isn't right before God.","8:22":"your wickedness","8:23":"","8:24":"Pray for me to the Lord, that none of the things which you have spoken happen to me.","8:25":"when they had testified and spoken the word of the Lord","8:26":"saying","8:27":"there was a man of Ethiopia","8:28":"and was reading the prophet Isaiah.","8:29":"Go near, and join yourself to this chariot.","8:30":"and heard him reading Isaiah the prophet","8:31":"How can I, unless someone explains it to me? He begged Philip to come up and sit with him.","8:32":"He was led as a sheep to the slaughter.  As a lamb before his shearer is silent, so he doesn't open his mouth.,The place of the scripture which he read was this, He was led as a sheep to the slaughter; and like a lamb dumb before his shearer, so opened he not his mouth:,,,,,,,,","8:33":"his judgment was taken away. Who will declare His generation?  For his life is taken from the earth.{Isaiah 53:7,8},In his humiliation his judgment was taken away: and who shall declare his generation? for his life is taken from the earth.,,,,,,,,","8:34":"Who is the prophet talking about? About himself, or about someone else?","8:35":"and beginning from this Scripture","8:36":"they came to some water","8:37":"And Philip said","8:38":"and they both went down into the water","8:39":"the Spirit of the Lord caught Philip away","8:40":"he preached the Good News to all the cities","9:1":"still breathing threats and slaughter against the disciples of the Lord","9:2":"that if he found any who were of the Way","9:3":"it happened that he got close to Damascus","9:4":"and heard a voice saying to him","9:5":"Who are you, Lord?  The Lord said","9:6":"and enter into the city","9:7":"hearing the sound","9:8":"and when his eyes were opened","9:9":"and neither ate nor drank.","9:10":"Ananias!  He said","9:11":"Arise, and go to the street which is called Straight, and inquire in the house of Judah{or, Judas} for one named Saul, a man of Tarsus. For behold, he is praying,,And the Lord said unto him, Arise, and go into the street which is called Straight, and enquire in the house of Judas for one called Saul, of Tarsus: for, behold, he prayeth,,,,,,,,,","9:12":"and laying his hands on him","9:13":"Lord, I have heard from many about this man, how much evil he did to your saints at Jerusalem.,Then Ananias answered, Lord, I have heard by many of this man, how much evil he hath done to thy saints at Jerusalem:,,,,,,,,","9:14":"","9:15":"Go your way, for he is my chosen vessel to bear my name before the nations and kings, and the children of Israel.,But the Lord said unto him, Go thy way: for he is a chosen vessel unto me, to bear my name before the Gentiles, and kings, and the children of Israel:,,,,,,,,","9:16":"","9:17":"and entered into the house.  Laying his hands on him","9:18":"and he received his sight.  He arose and was baptized.","9:19":"And when he had received meat","9:20":"that he is the Son of God.","9:21":"and said","9:22":"and confounded the Jews who lived at Damascus","9:23":"the Jews conspired together to kill him","9:24":"","9:25":"and let him down through the wall","9:26":"he tried to join himself to the disciples; but they were all afraid of him","9:27":"and brought him to the apostles","9:28":"","9:29":"{The Hellenists were Hebrews who used Greek language and culture.} but they were seeking to kill him.","9:30":"they brought him down to Caesarea","9:31":"and were built up.  They were multiplied","9:32":"as Peter went throughout all those parts","9:33":"who had been bedridden for eight years","9:34":"Aeneas, Jesus Christ heals you. Get up and make your bed!  Immediately he arose.","9:35":"and they turned to the Lord.","9:36":"which when translated","9:37":"and died. When they had washed her","9:38":"the disciples","9:39":"they brought him into the upper chamber.  All the widows stood by him weeping","9:40":"and kneeled down and prayed. Turning to the body","9:41":"and raised her up.  Calling the saints and widows","9:42":"and many believed in the Lord.","9:43":"that he stayed many days in Joppa with one Simon","10:1":"Cornelius by name","10:2":"and one who feared God with all his house","10:3":"he clearly saw in a vision an angel of God coming to him","10:4":"fastening his eyes on him","10:5":"and get Simon","10:6":"a tanner","10:7":"Cornelius called two of his household servants and a devout soldier of those who waited on him continually.","10:8":"he sent them to Joppa.","10:9":"and got close to the city","10:10":"but while they were preparing","10:11":"like a great sheet let down by four corners on the earth","10:12":"wild animals","10:13":"Rise, Peter, kill and eat!","10:14":"Not so, Lord; for I have never eaten anything that is common or unclean.","10:15":"What God has cleansed, you must not call unclean.","10:16":"and immediately the vessel was received up into heaven.","10:17":"behold","10:18":"who was surnamed Peter","10:19":"the Spirit said to him","10:20":"get down","10:21":"and said","10:22":"Cornelius, a centurion, a righteous man and one who fears God, and well spoken of by all the nation of the Jews, was directed by a holy angel to invite you to his house, and to listen to what you say.","10:23":"and some of the brothers from Joppa accompanied him.","10:24":"having called together his relatives and his near friends.","10:25":"Cornelius met him","10:26":"saying","10:27":"he went in and found many gathered together.","10:28":"You yourselves know how it is an unlawful thing for a man who is a Jew to join himself or come to one of another nation, but God has shown me that I shouldn't call any man unholy or unclean.,And he said unto them, Ye know how that it is an unlawful thing for a man that is a Jew to keep company, or come unto one of another nation; but God hath shewed me that I should not call any man common or unclean.,,,,,,,,","10:29":"why did you send for me?,Therefore came I unto you without gainsaying, as soon as I was sent for: I ask therefore for what intent ye have sent for me?,,,,,,,,","10:30":"Four days ago, I was fasting until this hour, and at the ninth hour,{3:00 P. M.} I prayed in my house, and behold, a man stood before me in bright clothing,,And Cornelius said, Four days ago I was fasting until this hour; and at the ninth hour I prayed in my house, and, behold, a man stood before me in bright clothing,,,,,,,,,","10:31":"'Cornelius","10:32":"and summon Simon","10:33":"and it was good of you to come. Now therefore we are all here present in the sight of God to hear all things that have been commanded you by God.,Immediately therefore I sent to thee; and thou hast well done that thou art come. Now therefore are we all here present before God, to hear all things that are commanded thee of God.,,,,,,,,","10:34":"Truly I perceive that God doesn't show favoritism;,Then Peter opened his mouth, and said, Of a truth I perceive that God is no respecter of persons:,,,,,,,,","10:35":"But in every nation he that feareth him","10:36":"preaching good news of peace by Jesus Christ--he is Lord of all--","10:37":"which was proclaimed throughout all Judea","10:38":"how God anointed him with the Holy Spirit and with power","10:39":"and in Jerusalem; whom they also{TR omits also} killed","10:40":"and gave him to be revealed","10:41":"but to witnesses who were chosen before by God","10:42":"And he commanded us to preach unto the people","10:43":"that through his name everyone who believes in him will receive remission of sins.,To him give all the prophets witness, that through his name whosoever believeth in him shall receive remission of sins.,,,,,,,,","10:44":"the Holy Spirit fell on all those who heard the word.","10:45":"as many as came with Peter","10:46":"","10:47":"Can any man forbid water","10:48":"And he commanded them to be baptized in the name of the Lord. Then prayed they him to tarry certain days.","11:1":"And the apostles and brethren that were in Judaea heard that the Gentiles had also received the word of God.","11:2":"those who were of the circumcision contended with him","11:3":"You went in to uncircumcised men, and ate with them!","11:4":"and explained to them in order","11:5":"","11:6":"I considered","11:7":"'Rise","11:8":"'Not so","11:9":"'What God has cleansed","11:10":"and all were drawn up again into heaven.","11:11":"immediately three men stood before the house where I was","11:12":"without discriminating. These six brothers also accompanied me","11:13":"and saying to him","11:14":"you and all your house.'","11:15":"the Holy Spirit fell on them","11:16":"how he said","11:17":"when we believed in the Lord Jesus Christ","11:18":"they held their peace","11:19":"Cyprus","11:20":"men of Cyprus and Cyrene","11:21":"and a great number believed and turned to the Lord.","11:22":"","11:23":"when he had come","11:24":"and full of the Holy Spirit and of faith","11:25":"Then departed Barnabas to Tarsus","11:26":"he brought him to Antioch. It happened","11:27":"prophets came down from Jerusalem to Antioch.","11:28":"and indicated by the Spirit that there should be a great famine all over the world","11:29":"each determined to send relief to the brothers who lived in Judea;","11:30":"sending it to the elders by the hands of Barnabas and Saul.","12:1":"Herod the king stretched out his hands to oppress some of the assembly.","12:2":"the brother of John","12:3":"he proceeded to seize Peter also.  This was during the days of unleavened bread.","12:4":"he put him in prison","12:5":"but constant prayer was made by the assembly to God for him.","12:6":"Peter was sleeping between two soldiers","12:7":"an angel of the Lord stood by him","12:8":"Get dressed and put on your sandals. He did so.  He said to him","12:9":"but thought he saw a vision.","12:10":"they came to the iron gate that leads into the city","12:11":"he said","12:12":"he came to the house of Mary","12:13":"a maid named Rhoda came to answer.","12:14":"she didn't open the gate for joy","12:15":"You are crazy!  But she insisted that it was so. They said","12:16":"they saw him","12:17":"beckoning to them with his hand to be silent","12:18":"there was no small stir among the soldiers about what had become of Peter.","12:19":"and didn't find him","12:20":"and","12:21":"Herod dressed himself in royal clothing","12:22":"The voice of a god, and not of a man!","12:23":"because he didn't give God the glory","12:24":"But the word of God grew and multiplied.","12:25":"when they had fulfilled their service","13:1":"Simeon who was called Niger","13:2":"the Holy Spirit said","13:3":"when they had fasted and prayed and laid their hands on them","13:4":"being sent out by the Holy Spirit","13:5":"they proclaimed the word of God in the Jewish synagogues.  They had also John as their attendant.","13:6":"they found a certain sorcerer","13:7":"Sergius Paulus","13:8":"seeking to turn aside the proconsul from the faith.","13:9":"who is also called Paul","13:10":"Full of all deceit and all cunning, you son of the devil, you enemy of all righteousness, will you not cease to pervert the right ways of the Lord?,And said, O full of all subtilty and all mischief, thou child of the devil, thou enemy of all righteousness, wilt thou not cease to pervert the right ways of the Lord?,,,,,,,,","13:11":"behold","13:12":"when he saw what was done","13:13":"and came to Perga in Pamphylia.  John departed from them and returned to Jerusalem.","13:14":"passing on from Perga","13:15":"the rulers of the synagogue sent to them","13:16":"and beckoning with his hand said","13:17":"NU add Israel} chose our fathers","13:18":"And about the time of forty years suffered he their manners in the wilderness.","13:19":"he gave them their land for an inheritance","13:20":"And after that he gave unto them judges about the space of four hundred and fifty years","13:21":"and God gave to them Saul the son of Kish","13:22":"he raised up David to be their king","13:23":"God has brought salvation{TR","13:24":"when John had first preached the baptism of repentance to Israel.{TR","13:25":"he said","13:26":"children of the stock of Abraham","13:27":"and their rulers","13:28":"they still asked Pilate to have him killed.","13:29":"they took him down from the tree","13:30":"","13:31":"who are his witnesses to the people.","13:32":"","13:33":"their children","13:34":"","13:35":"'You will not allow your Holy One to see decay.'{Psalm 16:10}","13:36":"after he had in his own generation served the counsel of God","13:37":"But he","13:38":"brothers{The word for brothers here and where the context allows may also be correctly translated brothers and sisters or siblings.}","13:39":"from which you could not be justified by the law of Moses.","13:40":"lest that come on you which is spoken in the prophets:","13:41":"you scoffers","13:42":"the Gentiles begged that these words might be preached to them the next Sabbath.","13:43":"many of the Jews and of the devout proselytes followed Paul and Barnabas; who","13:44":"And the next sabbath day came almost the whole city together to hear the word of God.","13:45":"they were filled with jealousy","13:46":"and said","13:47":"saying","13:48":"they were glad","13:49":"And the word of the Lord was published throughout all the region.","13:50":"and stirred up a persecution against Paul and Barnabas","13:51":"and came to Iconium.","13:52":"And the disciples were filled with joy","14:1":"and so spoke that a great multitude both of Jews and of Greeks believed.","14:2":"disobedient} Jews stirred up and embittered the souls of the Gentiles against the brothers.","14:3":"speaking boldly in the Lord","14:4":"and part with the apostles.","14:5":"with their rulers","14:6":"and fled to the cities of Lycaonia","14:7":"And there they preached the gospel.","14:8":"impotent in his feet","14:9":"who","14:10":"Stand upright on your feet! He leaped up and walked.","14:11":"they lifted up their voice","14:12":"And they called Barnabas","14:13":"whose temple was in front of their city","14:14":"Barnabas and Paul","14:15":"","14:16":"Who in times past suffered all nations to walk in their own ways.","14:17":"in that he did good and gave you{TR reads us instead of you} rains from the sky and fruitful seasons","14:18":"they hardly stopped the multitudes from making a sacrifice to them.","14:19":"and having persuaded the multitudes","14:20":"he rose up","14:21":"and had made many disciples","14:22":"exhorting them to continue in the faith","14:23":"and had prayed with fasting","14:24":"and came to Pamphylia.","14:25":"they went down to Attalia.","14:26":"from where they had been committed to the grace of God for the work which they had fulfilled.","14:27":"and had gathered the assembly together","14:28":"And there they abode long time with the disciples.","15:1":"Unless you are circumcised after the custom of Moses, you can't be saved.","15:2":"they appointed Paul and Barnabas","15:3":"being sent on their way by the assembly","15:4":"they were received by the assembly and the apostles and the elders","15:5":"saying","15:6":"And the apostles and elders came together for to consider of this matter.","15:7":"Peter rose up and said to them","15:8":"who knows the heart","15:9":"cleansing their hearts by faith.","15:10":"that you should put a yoke on the neck of the disciples which neither our fathers nor we were able to bear?","15:11":"{TR adds Christ} just as they are.,But we believe that through the grace of the LORD Jesus Christ we shall be saved, even as they.,,,,,,,,","15:12":"and they listened to Barnabas and Paul reporting what signs and wonders God had done among the nations through them.","15:13":"James answered","15:14":"to take out of them a people for his name.","15:15":"","15:16":"which has fallen.  I will again build its ruins. I will set it up","15:17":"Says the Lord","15:18":"Known unto God are all his works from the beginning of the world.","15:19":"","15:20":"from sexual immorality","15:21":"being read in the synagogues every Sabbath.,For Moses of old time hath in every city them that preach him, being read in the synagogues every sabbath day.,,,,,,,,","15:22":"with the whole assembly","15:23":"","15:24":"unsettling your souls","15:25":"having come to one accord","15:26":"Men that have hazarded their lives for the name of our Lord Jesus Christ.","15:27":"who themselves will also tell you the same things by word of mouth.","15:28":"and to us","15:29":"from blood","15:30":"when they were sent off","15:31":"they rejoiced over the encouragement.","15:32":"also being prophets themselves","15:33":"they were sent back with greetings from the brothers to the apostles.","15:34":"Notwithstanding it pleased Silas to abide there still.","15:35":"teaching and preaching the word of the Lord","15:36":"Let's return now and visit our brothers in every city in which we proclaimed the word of the Lord, to see how they are doing.","15:37":"who was called Mark","15:38":"and didn't go with them to do the work.","15:39":"and sailed away to Cyprus","15:40":"and went out","15:41":"strengthening the assemblies.","16:1":"a certain disciple was there","16:2":"Which was well reported of by the brethren that were at Lystra and Iconium.","16:3":"and he took and circumcised him because of the Jews who were in those parts; for they all knew that his father was a Greek.","16:4":"they delivered the decrees to them to keep which had been ordained by the apostles and elders who were at Jerusalem.","16:5":"and increased in number daily.","16:6":"they were forbidden by the Holy Spirit to speak the word in Asia.","16:7":"they tried to go into Bithynia","16:8":"they came down to Troas.","16:9":"begging him","16:10":"immediately we sought to go out to Macedonia","16:11":"we made a straight course to Samothrace","16:12":"which is a city of Macedonia","16:13":"where we supposed there was a place of prayer","16:14":"a seller of purple","16:15":"she begged us","16:16":"as we were going to prayer","16:17":"she cried out","16:18":"becoming greatly annoyed","16:19":"they seized Paul and Silas","16:20":"they said","16:21":"being Romans.,And teach customs, which are not lawful for us to receive, neither to observe, being Romans.,,,,,,,,","16:22":"and the magistrates tore their clothes off of them","16:23":"they threw them into prison","16:24":"having received such a charge","16:25":"and the prisoners were listening to them.","16:26":"so that the foundations of the prison were shaken; and immediately all the doors were opened","16:27":"being roused out of sleep and seeing the prison doors open","16:28":"saying","16:29":"and","16:30":"Sirs, what must I do to be saved?","16:31":"Believe in the Lord Jesus Christ, and you will be saved, you and your household.","16:32":"and to all who were in his house.","16:33":"and washed their stripes","16:34":"and set food before them","16:35":"the magistrates sent the sergeants","16:36":"saying","16:37":"They have beaten us publicly, without a trial, men who are Romans, and have cast us into prison! Do they now release us secretly?  No, most certainly, but let them come themselves and bring us out!","16:38":"and they were afraid when they heard that they were Romans","16:39":"they asked them to depart from the city.","16:40":"and entered into Lydia's house. When they had seen the brothers","17:1":"they came to Thessalonica","17:2":"as was his custom","17:3":"and saying","17:4":"and joined Paul and Silas","17:5":"and gathering a crowd","17:6":"they dragged Jason and certain brothers{The word for brothers here and where the context allows may be also correctly translated brothers and sisters or siblings.} before the rulers of the city","17:7":"saying that there is another king","17:8":"And they troubled the people and the rulers of the city","17:9":"they let them go.","17:10":"they went into the Jewish synagogue.","17:11":"in that they received the word with all readiness of the mind","17:12":"and not a few men.","17:13":"they came there likewise","17:14":"and Silas and Timothy still stayed there.","17:15":"they departed.","17:16":"his spirit was provoked within him as he saw the city full of idols.","17:17":"and in the marketplace every day with those who met him.","17:18":"What does this babbler want to say?  Others said","17:19":"and brought him to the Areopagus","17:20":"","17:21":"but either to tell or to hear some new thing.","17:22":"and said","17:23":"and observed the objects of your worship","17:24":"he","17:25":"as though he needed anything","17:26":"having determined appointed seasons","17:27":"if perhaps they might reach out for him and find him","17:28":"and move","17:29":"we ought not to think that the Divine Nature is like gold","17:30":"","17:31":"in that he has raised him from the dead.,Because he hath appointed a day, in the which he will judge the world in righteousness by that man whom he hath ordained; whereof he hath given assurance unto all men, in that he hath raised him from the dead.,,,,,,,,","17:32":"some mocked; but others said","17:33":"So Paul departed from among them.","17:34":"and believed","18:1":"and came to Corinth.","18:2":"a man of Pontus by race","18:3":"he lived with them and worked","18:4":"and persuaded Jews and Greeks.","18:5":"Paul was compelled by the Spirit","18:6":"he shook out his clothing and said to them","18:7":"and went into the house of a certain man named Justus","18:8":"the ruler of the synagogue","18:9":"Don't be afraid, but speak and don't be silent;,Then spake the Lord to Paul in the night by a vision, Be not afraid, but speak, and hold not thy peace:,,,,,,,,","18:10":"and no one will attack you to harm you","18:11":"teaching the word of God among them.","18:12":"the Jews with one accord rose up against Paul and brought him before the judgment seat","18:13":"This man persuades men to worship God contrary to the law.","18:14":"Gallio said to the Jews","18:15":"look to it yourselves.  For I don't want to be a judge of these matters.,But if it be a question of words and names, and of your law, look ye to it; for I will be no judge of such matters.,,,,,,,,","18:16":"And he drave them from the judgment seat.","18:17":"the ruler of the synagogue","18:18":"having stayed after this many more days","18:19":"and he left them there; but he himself entered into the synagogue","18:20":"he declined;","18:21":"and saying","18:22":"he went up and greeted the assembly","18:23":"he departed","18:24":"an Alexandrian by race","18:25":"he spoke and taught accurately the things concerning Jesus","18:26":"they took him aside","18:27":"the brothers encouraged him","18:28":"publicly showing by the Scriptures that Jesus was the Christ.","19:1":"while Apollos was at Corinth","19:2":"Did you receive the Holy Spirit when you believed? They said to him","19:3":"Into what then were you baptized?  They said","19:4":"John indeed baptized with the baptism of repentance, saying to the people that they should believe in the one who would come after him, that is, in Jesus.","19:5":"they were baptized in the name of the Lord Jesus.","19:6":"the Holy Spirit came on them","19:7":"And all the men were about twelve.","19:8":"and spoke boldly for a period of three months","19:9":"speaking evil of the Way before the multitude","19:10":"so that all those who lived in Asia heard the word of the Lord Jesus","19:11":"","19:12":"and the evil spirits went out.","19:13":"exorcists","19:14":"a Jewish chief priest","19:15":"Jesus I know, and Paul I know, but who are you?","19:16":"and overpowered them","19:17":"both Jews and Greeks","19:18":"confessing","19:19":"and found it to be fifty thousand pieces of silver.{The 50","19:20":"So mightily grew the word of God and prevailed.","19:21":"Paul determined in the spirit","19:22":"Timothy and Erastus","19:23":"And the same time there arose no small stir about that way.","19:24":"a silversmith","19:25":"with the workmen of like occupation","19:26":"that not at Ephesus alone","19:27":"but also that the temple of the great goddess Artemis will be counted as nothing","19:28":"and cried out","19:29":"and they rushed with one accord into the theater","19:30":"the disciples didn't allow him.","19:31":"being his friends","19:32":"and some another","19:33":"the Jews putting him forward.  Alexander beckoned with his hand","19:34":"all with one voice for a time of about two hours cried out","19:35":"he said","19:36":"you ought to be quiet","19:37":"who are neither robbers of temples nor blasphemers of your goddess.","19:38":"the courts are open","19:39":"it will be settled in the regular assembly.","19:40":"there being no cause.  Concerning it","19:41":"he dismissed the assembly.","20:1":"Paul sent for the disciples","20:2":"and had encouraged them with many words","20:3":"and a plot was made against him by Jews as he was about to set sail for Syria","20:4":"And there accompanied him into Asia Sopater of Berea; and of the Thessalonians","20:5":"and were waiting for us at Troas.","20:6":"and came to them at Troas in five days","20:7":"when the disciples were gathered together to break bread","20:8":"And there were many lights in the upper chamber","20:9":"weighed down with deep sleep.  As Paul spoke still longer","20:10":"and fell upon him","20:11":"and had broken bread","20:12":"and were greatly comforted.","20:13":"intending to take Paul aboard there","20:14":"we took him aboard","20:15":"we came the following day opposite Chios. The next day we touched at Samos and stayed at Trogyllium","20:16":"that he might not have to spend time in Asia; for he was hastening","20:17":"and called to himself the elders of the assembly.","20:18":"he said to them","20:19":"with many tears","20:20":"teaching you publicly and from house to house","20:21":"and faith toward our Lord Jesus.{TR adds Christ}","20:22":"behold","20:23":"saying that bonds and afflictions wait for me.","20:24":"so that I may finish my race with joy","20:25":"","20:26":"","20:27":"For I have not shunned to declare unto you all the counsel of God.","20:28":"therefore","20:29":"vicious wolves will enter in among you","20:30":"speaking perverse things","20:31":"remembering that for a period of three years I didn't cease to admonish everyone night and day with tears.","20:32":"brothers","20:33":"or gold","20:34":"and those who were with me.","20:35":"that so laboring you ought to help the weak","20:36":"he knelt down and prayed with them all.","20:37":"and fell on Paul's neck and kissed him","20:38":"that they should see his face no more.  And they accompanied him to the ship.","21:1":"we came with a straight course to Cos","21:2":"we went aboard","21:3":"leaving it on the left hand","21:4":"we stayed there seven days. These said to Paul through the Spirit","21:5":"we departed and went on our journey.  They all","21:6":"we went on board the ship","21:7":"we arrived at Ptolemais. We greeted the brothers","21:8":"we","21:9":"And the same man had four daughters","21:10":"a certain prophet named Agabus came down from Judea.","21:11":"and taking Paul's belt","21:12":"both we and they of that place begged him not to go up to Jerusalem.","21:13":"What are you doing, weeping and breaking my heart?  For I am ready not only to be bound, but also to die at Jerusalem for the name of the Lord Jesus.","21:14":"we ceased","21:15":"And after those days we took up our carriages","21:16":"bringing one Mnason of Cyprus","21:17":"the brothers received us gladly.","21:18":"Paul went in with us to James; and all the elders were present.","21:19":"he reported one by one the things which God had worked among the Gentiles through his ministry.","21:20":"when they heard it","21:21":"that you teach all the Jews who are among the Gentiles to forsake Moses","21:22":"for they will hear that you have come.","21:23":"Do therefore this that we say to thee: We have four men which have a vow on them;","21:24":"and purify yourself with them","21:25":"we have written our decision that they should observe no such thing","21:26":"and the next day","21:27":"the Jews from Asia","21:28":"Men of Israel, help!  This is the man who teaches all men everywhere against the people, and the law, and this place. Moreover, he also brought Greeks into the temple, and has defiled this holy place!","21:29":"the Ephesian","21:30":"and the people ran together. They seized Paul and dragged him out of the temple. Immediately the doors were shut.","21:31":"news came up to the commanding officer of the regiment that all Jerusalem was in an uproar.","21:32":"and ran down to them. They","21:33":"arrested him","21:34":"and some another","21:35":"it happened that he was carried by the soldiers because of the violence of the crowd;","21:36":"crying out","21:37":"he asked the commanding officer","21:38":"who before these days stirred up to sedition and led out into the wilderness the four thousand men of the Assassins?,Art not thou that Egyptian, which before these days madest an uproar, and leddest out into the wilderness four thousand men that were murderers?,,,,,,,,","21:39":"I am a Jew, from Tarsus in Cilicia, a citizen of no insignificant city.  I beg you, allow me to speak to the people.","21:40":"Paul","22:1":"Men","22:2":"they were even more quiet.  He said","22:3":"","22:4":"binding and delivering into prisons both men and women.","22:5":"from whom also I received letters to the brothers","22:6":"as I made my journey","22:7":"and heard a voice saying to me","22:8":"'Who are you","22:9":"","22:10":"'What shall I do","22:11":"being led by the hand of those who were with me","22:12":"a devout man according to the law","22:13":"and standing by me said to me","22:14":"'The God of our fathers has appointed you to know his will","22:15":"For thou shalt be his witness unto all men of what thou hast seen and heard.","22:16":"be baptized","22:17":"","22:18":"'Hurry and get out of Jerusalem quickly","22:19":"'Lord","22:20":"your witness","22:21":"And he said unto me","22:22":"and said","22:23":"and threw off their cloaks","22:24":"ordering him to be examined by scourging","22:25":"Paul asked the centurion who stood by","22:26":"he went to the commanding officer and told him","22:27":"Tell me, are you a Roman?  He said","22:28":"I bought my citizenship for a great price.  Paul said","22:29":"and the commanding officer also was afraid when he realized that he was a Roman","22:30":"desiring to know the truth about why he was accused by the Jews","23:1":"looking steadfastly at the council","23:2":"Ananias","23:3":"God will strike you, you whitewashed wall! Do you sit to judge me according to the law, and command me to be struck contrary to the law?","23:4":"Do you malign God's high priest?","23:5":"I didn't know, brothers, that he was high priest. For it is written, 'You shall not speak evil of a ruler of your people.'{Exodus 22:28}","23:6":"he cried out in the council","23:7":"an argument arose between the Pharisees and Sadducees","23:8":"nor angel","23:9":"and some of the scribes of the Pharisees part stood up","23:10":"the commanding officer","23:11":"the Lord stood by him","23:12":"some of the Jews banded together","23:13":"And they were more than forty which had made this conspiracy.","23:14":"and said","23:15":"you with the council inform the commanding officer that he should bring him down to you tomorrow","23:16":"and he came and entered into the barracks and told Paul.","23:17":"and said","23:18":"and brought him to the commanding officer","23:19":"and going aside","23:20":"The Jews have agreed to ask you to bring Paul down to the council tomorrow, as though intending to inquire somewhat more accurately concerning him.,And he said, The Jews have agreed to desire thee that thou wouldest bring down Paul to morrow into the council, as though they would enquire somewhat of him more perfectly.,,,,,,,,","23:21":"for more than forty men lie in wait for him","23:22":"charging him","23:23":"and said","23:24":"that they might set Paul on one","23:25":"And he wrote a letter after this manner:","23:26":"","23:27":"","23:28":"I brought him down to their council.","23:29":"but to have nothing laid to his charge worthy of death or of bonds.","23:30":"I sent him to you immediately","23:31":"carrying out their orders","23:32":"and returned to the barracks.","23:33":"they also presented Paul to him.","23:34":"he asked what province he was from. When he understood that he was from Cilicia","23:35":"I will hear thee","24:1":"the high priest","24:2":"Tertullus began to accuse him","24:3":"most excellent Felix","24:4":"that I don't delay you","24:5":"an instigator of insurrections among all the Jews throughout the world","24:6":"and we arrested him.{TR adds We wanted to judge him according to our law,}","24:7":"But the chief captain Lysias came upon us","24:8":"","24:9":"affirming that these things were so.","24:10":"Paul answered","24:11":"Because that thou mayest understand","24:12":"either in the synagogues","24:13":"Neither can they prove the things whereof they now accuse me.","24:14":"that after the Way","24:15":"which these also themselves look for","24:16":"And herein do I exercise myself","24:17":"I came to bring gifts for the needy to my nation","24:18":"not with a mob","24:19":"and to make accusation","24:20":"","24:21":"'Concerning the resurrection of the dead I am being judged before you today!',Except it be for this one voice, that I cried standing among them, Touching the resurrection of the dead I am called in question by you this day.,,,,,,,,","24:22":"having more exact knowledge concerning the Way","24:23":"and should have some privileges","24:24":"Felix came with Drusilla","24:25":"self-control","24:26":"he also hoped that money would be given to him by Paul","24:27":"Felix was succeeded by Porcius Festus","25:1":"having come into the province","25:2":"and they begged him","25:3":"that he would summon him to Jerusalem; plotting to kill him on the way.","25:4":"and that he himself was about to depart shortly.","25:5":"that are in power among you go down with me, and if there is anything wrong in the man, let them accuse him.","25:6":"he went down to Caesarea","25:7":"the Jews who had come down from Jerusalem stood around him","25:8":"Neither against the law of the Jews, nor against the temple, nor against Caesar, have I sinned at all.","25:9":"desiring to gain favor with the Jews","25:10":"I am standing before Caesar's judgment seat, where I ought to be tried.  I have done no wrong to the Jews, as you also know very well.,Then said Paul, I stand at Caesar's judgment seat, where I ought to be judged: to the Jews have I done no wrong, as thou very well knowest.,,,,,,,,","25:11":"and have committed anything worthy of death","25:12":"when he had conferred with the council","25:13":"Agrippa the King and Bernice arrived at Caesarea","25:14":"Festus laid Paul's case before the king","25:15":"when I was at Jerusalem","25:16":"before the accused has met the accusers face to face","25:17":"I didn't delay","25:18":"when the accusers stood up","25:19":"and about one Jesus","25:20":"I asked whether he was willing to go to Jerusalem and there be judged concerning these matters.","25:21":"I commanded him to be kept until I could send him to Caesar.,But when Paul had appealed to be reserved unto the hearing of Augustus, I commanded him to be kept till I might send him to Caesar.,,,,,,,,","25:22":"I also would like to hear the man myself. Tomorrow, he said","25:23":"when Agrippa and Bernice had come with great pomp","25:24":"King Agrippa, and all men who are here present with us, you see this man, about whom all the multitude of the Jews petitioned me, both at Jerusalem and here, crying that he ought not to live any longer.,And Festus said, King Agrippa, and all men which are here present with us, ye see this man, about whom all the multitude of the Jews have dealt with me, both at Jerusalem, and also here, crying that he ought not to live any longer.,,,,,,,,","25:25":"and as he himself appealed to the emperor I determined to send him.","25:26":"and especially before you","25:27":"in sending a prisoner","26:1":"You may speak for yourself. Then Paul stretched out his hand","26:2":"","26:3":"Especially because I know thee to be expert in all customs and questions which are among the Jews: wherefore I beseech thee to hear me patiently.","26:4":"","26:5":"if they are willing to testify","26:6":"","26:7":"earnestly serving night and day","26:8":"if God does raise the dead?","26:9":"","26:10":"having received authority from the chief priests","26:11":"I tried to make them blaspheme.  Being exceedingly enraged against them","26:12":"","26:13":"O King","26:14":"I heard a voice saying to me in the Hebrew language","26:15":"'I am Jesus","26:16":"and stand on your feet","26:17":"and from the Gentiles","26:18":"that they may turn from darkness to light and from the power of Satan to God","26:19":"","26:20":"at Jerusalem","26:21":"and tried to kill me.","26:22":"I stand to this day testifying both to small and great","26:23":"and how","26:24":"Festus said with a loud voice","26:25":"I am not crazy, most excellent Festus, but boldly declare words of truth and reasonableness.,But he said, I am not mad, most noble Festus; but speak forth the words of truth and soberness.,,,,,,,,","26:26":"to whom also I speak freely. For I am persuaded that none of these things is hidden from him","26:27":"do you believe the prophets?  I know that you believe.,King Agrippa, believest thou the prophets? I know that thou believest.,,,,,,,,","26:28":"With a little persuasion are you trying to make me a Christian?","26:29":"I pray to God, that whether with little or with much, not only you, but also all that hear me this day, might become such as I am, except for these bonds.","26:30":"and Bernice","26:31":"they spoke one to another","26:32":"This man might have been set free if he had not appealed to Caesar.","27:1":"they delivered Paul and certain other prisoners to a centurion named Julius","27:2":"which was about to sail to places on the coast of Asia","27:3":"we touched at Sidon.  Julius treated Paul kindly","27:4":"we sailed under the lee of Cyprus","27:5":"we came to Myra","27:6":"and he put us on board.","27:7":"and had come with difficulty opposite Cnidus","27:8":"near the city of Lasea.","27:9":"because the Fast had now already gone by","27:10":"Sirs, I perceive that the voyage will be with injury and much loss, not only of the cargo and the ship, but also of our lives.","27:11":"Nevertheless the centurion believed the master and the owner of the ship","27:12":"the majority advised going to sea from there","27:13":"supposing that they had obtained their purpose","27:14":"a stormy wind beat down from shore","27:15":"and couldn't face the wind","27:16":"we were able","27:17":"they used cables to help reinforce the ship.  Fearing that they would run aground on the Syrtis sand bars","27:18":"the next day they began to throw things overboard.","27:19":"they threw out the ship's tackle with their own hands.","27:20":"and no small storm pressed on us","27:21":"Paul stood up in the middle of them","27:22":"for there will be no loss of life among you","27:23":"belonging to the God whose I am and whom I serve","27:24":"'Don't be afraid","27:25":"sirs","27:26":"","27:27":"as we were driven back and forth in the Adriatic Sea","27:28":"and found twenty fathoms.{20 fathoms = 120 feet = 36.6 meters} After a little while","27:29":"they let go four anchors from the stern","27:30":"and had lowered the boat into the sea","27:31":"Unless these stay in the ship, you can't be saved.","27:32":"and let it fall off.","27:33":"Paul begged them all to take some food","27:34":"for this is for your safety; for not a hair will perish from any of your heads.,Wherefore I pray you to take some meat: for this is for your health: for there shall not an hair fall from the head of any of you.,,,,,,,,","27:35":"and had taken bread","27:36":"and they also took food.","27:37":"we were two hundred seventy-six souls on the ship.","27:38":"they lightened the ship","27:39":"they didn't recognize the land","27:40":"they left them in the sea","27:41":"they ran the vessel aground.  The bow struck and remained immovable","27:42":"so that none of them would swim out and escape.","27:43":"desiring to save Paul","27:44":"some on planks","28:1":"then they{NU reads we} learned that the island was called Malta.","28:2":"and received us all","28:3":"a viper came out because of the heat","28:4":"they said one to another","28:5":"and wasn't harmed.","28:6":"but when they watched for a long time and saw nothing bad happen to him","28:7":"named Publius","28:8":"prayed","28:9":"the rest also who had diseases in the island came","28:10":"and when we sailed","28:11":"we set sail in a ship of Alexandria which had wintered in the island","28:12":"we stayed there three days.","28:13":"a south wind sprang up","28:14":"{The word for brothers here and where context allows may also be correctly translated brothers and sisters or siblings.} and were entreated to stay with them for seven days.  So we came to Rome.","28:15":"when they heard of us","28:16":"the centurion delivered the prisoners to the captain of the guard","28:17":"he said to them","28:18":"when they had examined me","28:19":"I was constrained to appeal to Caesar","28:20":"","28:21":"We neither received letters from Judea concerning you, nor did any of the brothers come here and report or speak any evil of you.,And they said unto him, We neither received letters out of Judaea concerning thee, neither any of the brethren that came shewed or spake any harm of thee.,,,,,,,,","28:22":"as concerning this sect","28:23":"many people came to him at his lodging.  He explained to them","28:24":"and some disbelieved.","28:25":"they departed after Paul had spoken one word","28:26":"'Go to this people","28:27":"hear with their ears","28:28":"Be it known therefore unto you","28:29":"the Jews departed","28:30":"and received all who were coming to him","28:31":"and teaching the things concerning the Lord Jesus Christ with all boldness"}