{"1:1":"who was among the herdsmen of Tekoa","1:2":"And he said","1:3":"","1:4":"and it will devour the palaces of Ben Hadad.","1:5":"and cut off the inhabitant from the valley of Aven","1:6":"","1:7":"and it will devour its palaces.","1:8":"and him who holds the scepter from Ashkelon; and I will turn my hand against Ekron; and the remnant of the Philistines will perish","1:9":"","1:10":"and it will devour its palaces.,But I will send a fire on the wall of Tyrus, which shall devour the palaces thereof., וְשִׁלַּחְתִּי אֵשׁ בְּחוֹמַת צֹר וְאָכְלָה אַרְמְנֹתֶיהָ׃ פ ‬,So will I send a fire on the wall of Tyre, and it shall devour the palaces thereof.,καὶ ἐξαποστελῶ πῦρ ἐπὶ τὰ τείχη τύρου καὶ καταφάγεται θεμέλια αὐτῆς,And I will send forth a fire on the walls of Tyre, and it shall devour the foundations of it.,,,,","1:11":"","1:12":"and it will devour the palaces of Bozrah.,But I will send a fire upon Teman, which shall devour the palaces of Bozrah., וְשִׁלַּחְתִּי אֵשׁ בְּתֵימָן וְאָכְלָה אַרְמְנוֹת בָּצְרָה׃ פ ‬,So will I send a fire upon Teman, and it shall devour the palaces of Bozrah.,καὶ ἐξαποστελῶ πῦρ εἰς θαιμαν καὶ καταφάγεται θεμέλια τειχέων αὐτῆς,And I will send forth a fire upon Thaman, and it shall devour the foundations of her walls.,,,,","1:13":"","1:14":"and it will devour its palaces","1:15":"he and his princes together","2:1":"","2:2":"and it will devour the palaces of Kerioth; and Moab will die with tumult","2:3":"and will kill all its princes with him","2:4":"","2:5":"and it will devour the palaces of Jerusalem.,But I will send a fire upon Judah, and it shall devour the palaces of Jerusalem., וְשִׁלַּחְתִּי אֵשׁ בִּיהוּדָה וְאָכְלָה אַרְמְנוֹת יְרוּשָׁלִָם׃ פ ‬,So will I send a fire upon Judah, And it shall devour the palaces of Jerusalem.,καὶ ἐξαποστελῶ πῦρ ἐπὶ ιουδαν καὶ καταφάγεται θεμέλια ιερουσαλημ,And I will send a fire on Juda, and it shall devour the foundations of Jerusalem.,,,,","2:6":"","2:7":"and deny justice to the oppressed; and a man and his father use the same maiden","2:8":"And they lay themselves down upon clothes laid to pledge by every altar","2:9":"whose height was like the height of the cedars","2:10":"and led you forty years in the wilderness","2:11":"and some of your young men for Nazirites.  Isn't this true","2:12":"","2:13":"I will crush you in your place","2:14":"Therefore the flight shall perish from the swift","2:15":"Neither shall he stand that handleth the bow; and he that is swift of foot shall not deliver himself: neither shall he that rideth the horse deliver himself.","2:16":"says Yahweh.,And he that is courageous among the mighty shall flee away naked in that day, saith the LORD., וְאַמִּיץ לִבּוֹ בַּגִּבּוֹרִים עָרוֹם יָנוּס בַּיּוֹם־הַהוּא נְאֻם־יְהוָה׃ פ ‬,And he that is courageous among the mighty Shall flee away naked in that day, Saith the LORD.,καὶ εὑρήσει τὴν καρδίαν αὐτοῦ ἐν δυναστείαις ὁ γυμνὸς διώξεται ἐν ἐκείνῃ τῇ ἡμέρᾳ λέγει κύριος,And the strong shall find no confidence in power: the naked shall flee away in that day, saith the Lord.,,,,","3:1":"children of Israel","3:2":"You only have I known of all the families of the earth: therefore I will punish you for all your iniquities.","3:3":"unless they have agreed?","3:4":"when he has no prey? Does a young lion cry out of his den","3:5":"where no snare is set for him?  Does a snare spring up from the ground","3:6":"without the people being afraid?  Does evil happen to a city","3:7":"unless he reveals his secret to his servants the prophets.","3:8":"The lion hath roared","3:9":"and in the palaces in the land of Egypt","3:10":"Who hoard plunder and loot in their palaces.","3:11":"Therefore thus saith the Lord GOD; An adversary there shall be even round about the land; and he shall bring down thy strength from thee","3:12":"Thus saith the LORD; As the shepherd taketh out of the mouth of the lion two legs","3:13":"the God of Armies.","3:14":"","3:15":"and the great houses will have an end","4:1":"you cows of Bashan","4:2":"The days shall come on you that they will take you away with hooks, and the last of you with fish hooks.,The Lord GOD hath sworn by his holiness, that, lo, the days shall come upon you, that he will take you away with hooks, and your posterity with fishhooks., נִשְׁבַּע אֲדֹנָי יְהוִה בְּקָדְשׁוֹ כִּי הִנֵּה יָמִים בָּאִים עֲלֵיכֶם וְנִשָּׂא אֶתְכֶם בְּצִנּוֹת וְאַחֲרִיתְכֶן בְּסִירוֹת דּוּגָה׃ ‬,The Lord GOD hath sworn by His holiness: Lo, surely the days shall come upon you, That ye shall be taken away with hooks, And your residue with fish-hooks.,ὀμνύει κύριος κατὰ τῶν ἁγίων αὐτοῦ διότι ἰδοὺ ἡμέραι ἔρχονται ἐφ' ὑμᾶς καὶ λήμψονται ὑμᾶς ἐν ὅπλοις καὶ τοὺς μεθ' ὑμῶν εἰς λέβητας ὑποκαιομένους ἐμβαλοῦσιν ἔμπυροι λοιμοί,The Lord swears by his holiness, that, behold, the days come upon you, when they shall take you with weapons, and fiery destroyers shall cast those with you into boiling caldrons.,,,,","4:3":"everyone straight before her; and you will cast yourselves into Harmon","4:4":"","4:5":"and proclaim free will offerings and brag about them: for this pleases you","4:6":"And I also have given you cleanness of teeth in all your cities","4:7":"","4:8":"and were not satisfied:  yet you haven't returned to me","4:9":"I have smitten you with blasting and mildew: when your gardens and your vineyards and your fig trees and your olive trees increased","4:10":"I have sent among you the pestilence after the manner of Egypt: your young men have I slain with the sword","4:11":"I have overthrown some of you","4:12":"","4:13":"behold","5:1":"O house of Israel.","5:2":"The virgin of Israel is fallen; she shall no more rise: she is forsaken upon her land; there is none to raise her up.","5:3":"For thus saith the Lord GOD; The city that went out by a thousand shall leave an hundred","5:4":"","5:5":"nor enter into Gilgal","5:6":"and you will live; lest he break out like fire in the house of Joseph","5:7":"and cast down righteousness to the earth:","5:8":"and turns the shadow of death into the morning","5:9":"so that destruction comes on the fortress.","5:10":"and they abhor him who speaks blamelessly.","5:11":"and take taxes from him of wheat:  You have built houses of hewn stone","5:12":"and how great are your sins-- you who afflict the just","5:13":"for it is an evil time.","5:14":"and not evil","5:15":"love good","5:16":"the God of Armies","5:17":"says Yahweh.,And in all vineyards shall be wailing: for I will pass through thee, saith the LORD., וּבְכָל־כְּרָמִים מִסְפֵּד כִּי־אֶעֱבֹר בְּקִרְבְּךָ אָמַר יְהוָה׃ ס ‬,And in all vineyards shall be lamentation; For I will pass through the midst of thee, Saith the LORD.,καὶ ἐν πάσαις ὁδοῖς κοπετός διότι διελεύσομαι διὰ μέσου σου εἶπεν κύριος,And there shall be lamentation in all the ways; because I will pass through the midst of thee, saith the Lord.,,,,","5:18":"","5:19":"and a bear met him; Or he went into the house and leaned his hand on the wall","5:20":"and not light? Even very dark","5:21":"I despise your feasts","5:22":"though you offer me your burnt offerings and meal offerings","5:23":"Take thou away from me the noise of thy songs; for I will not hear the melody of thy viols.","5:24":"and righteousness like a mighty stream.","5:25":"","5:26":"the star of your god","5:27":"says Yahweh, whose name is the God of Armies.,Therefore will I cause you to go into captivity beyond Damascus, saith the LORD, whose name is The God of hosts., וְהִגְלֵיתִי אֶתְכֶם מֵהָלְאָה לְדַמָּשֶׂק אָמַר יְהוָה אֱלֹהֵי־צְבָאוֹת שְׁמוֹ׃ פ ‬,Therefore will I cause you to go into captivity beyond Damascus, saith He, whose name is the LORD God of hosts.,καὶ μετοικιῶ ὑμᾶς ἐπέκεινα δαμασκοῦ λέγει κύριος ὁ θεὸς ὁ παντοκράτωρ ὄνομα αὐτῷ,And I will carry you away beyond Damascus, saith the Lord, the Almighty God is his name.,,,,","6:1":"and to those who are secure on the mountain of Samaria","6:2":"and see; and from there go to Hamath the great; then go down to Gath of the Philistines.  are they better than these kingdoms? or is their border greater than your border?","6:3":"and cause the seat of violence to come near;","6:4":"and stretch themselves on their couches","6:5":"like David;","6:6":"and anoint themselves with the best oils; but they are not grieved for the affliction of Joseph.","6:7":"Therefore now shall they go captive with the first that go captive","6:8":"the God of Armies:  I abhor the pride of Jacob, and detest his fortresses. Therefore I will deliver up the city with all that is in it.,The Lord GOD hath sworn by himself, saith the LORD the God of hosts, I abhor the excellency of Jacob, and hate his palaces: therefore will I deliver up the city with all that is therein., נִשְׁבַּע אֲדֹנָי יְהוִה בְּנַפְשׁוֹ נְאֻם־יְהוָה אֱלֹהֵי צְבָאוֹת מְתָאֵב אָנֹכִי אֶת־גְּאוֹן יַעֲקֹב וְאַרְמְנֹתָיו שָׂנֵאתִי וְהִסְגַּרְתִּי עִיר וּמְלֹאָהּ׃ ‬,The Lord GOD hath sworn by Himself, Saith the LORD, the God of hosts: I abhor the pride of Jacob, And hate his palaces; And I will deliver up the city with all that is therein.,ὅτι ὤμοσεν κύριος καθ' ἑαυτοῦ διότι βδελύσσομαι ἐγὼ πᾶσαν τὴν ὕβριν ιακωβ καὶ τὰς χώρας αὐτοῦ μεμίσηκα καὶ ἐξαρῶ πόλιν σὺν πᾶσιν τοῖς κατοικοῦσιν αὐτήν,For the Lord has sworn by himself, saying, Because I abhor all the pride of Jacob, I do also hate his countries, and I will cut off his city with all who inhabit it.,,,,","6:9":"if there remain ten men in one house","6:10":"","6:11":"","6:12":"and the fruit of righteousness into bitterness;","6:13":"who say","6:14":"behold","7:1":"he formed locusts in the beginning of the shooting up of the latter growth; and behold","7:2":"when they made an end of eating the grass of the land","7:3":"The LORD repented for this: It shall not be","7:4":"the Lord Yahweh called for judgment by fire; and it dried up the great deep","7:5":"Lord Yahweh, stop, I beg you!  How could Jacob stand? For he is small.","7:6":"The LORD repented for this: This also shall not be","7:7":"the Lord stood beside a wall made by a plumb line","7:8":"Amos, what do you see?  I said","7:9":"the sanctuaries of Israel will be laid waste; and I will rise against the house of Jeroboam with the sword.,And the high places of Isaac shall be desolate, and the sanctuaries of Israel shall be laid waste; and I will rise against the house of Jeroboam with the sword., וְנָשַׁמּוּ בָּמוֹת יִשְׂחָק וּמִקְדְּשֵׁי יִשְׂרָאֵל יֶחֱרָבוּ וְקַמְתִּי עַל־בֵּית יָרָבְעָם בֶּחָרֶב׃ פ ‬,And the high places of Isaac shall be desolate, And the sanctuaries of Israel shall be laid waste; And I will rise against the house of Jeroboam with the sword.,καὶ ἀφανισθήσονται βωμοὶ τοῦ γέλωτος καὶ αἱ τελεταὶ τοῦ ισραηλ ἐξερημωθήσονται καὶ ἀναστήσομαι ἐπὶ τὸν οἶκον ιεροβοαμ ἐν ῥομφαίᾳ,And the joyful altars shall be abolished, and the sacrifices of Israel shall be set aside; and I will rise up against the house of Jeroboam with the sword.,,,,","7:10":"saying","7:11":"'Jeroboam will die by the sword","7:12":"You seer, go, flee away into the land of Judah, and there eat bread, and prophesy there:,Also Amaziah said unto Amos, O thou seer, go, flee thee away into the land of Judah, and there eat bread, and prophesy there:, וַיֹּאמֶר אֲמַצְיָה אֶל־עָמוֹס חֹזֶה לֵךְ בְּרַח־לְךָ אֶל־אֶרֶץ יְהוּדָה וֶאֱכָל־שָׁם לֶחֶם וְשָׁם תִּנָּבֵא׃ ‬,Also Amaziah said unto Amos: O thou seer","7:13":"and it is a royal house!,But prophesy not again any more at Bethel: for it is the king's chapel, and it is the king's court., וּבֵית־אֵל לֹא־תוֹסִיף עוֹד לְהִנָּבֵא כִּי מִקְדַּשׁ־מֶלֶךְ הוּא וּבֵית מַמְלָכָה הוּא׃ ס ‬,but prophesy not again any more at Beth-el, for it is the king's sanctuary, and it is a royal house.","7:14":"I was no prophet, neither was I a prophet's son; but I was a herdsman, and a farmer of sycamore figs;,Then answered Amos, and said to Amaziah, I was no prophet, neither was I a prophet's son; but I was an herdman, and a gatherer of sycomore fruit:, וַיַּעַן עָמוֹס וַיֹּאמֶר אֶל־אֲמַצְיָה לֹא־נָבִיא אָנֹכִי וְלֹא בֶן־נָבִיא אָנֹכִי כִּי־בוֹקֵר אָנֹכִי וּבוֹלֵס שִׁקְמִים׃ ‬,Then answered Amos, and said to Amaziah: I was no prophet","7:15":"and Yahweh said to me","7:16":"Don't prophesy against Israel","7:17":"and your sons and your daughters shall fall by the sword","8:1":"a basket of summer fruit.","8:2":"Amos, what do you see?  I said","8:3":"says the Lord Yahweh.  The dead bodies will be many. In every place they will throw them out with silence.","8:4":"you who desire to swallow up the needy","8:5":"'When will the new moon be gone","8:6":"and the needy for a pair of shoes","8:7":"Surely I will never forget any of their works.,The LORD hath sworn by the excellency of Jacob, Surely I will never forget any of their works., נִשְׁבַּע יְהוָה בִּגְאוֹן יַעֲקֹב אִם־אֶשְׁכַּח לָנֶצַח כָּל־מַעֲשֵׂיהֶם׃ ‬,The LORD hath sworn by the pride of Jacob: Surely I will never forget any of their works.,ὀμνύει κύριος καθ' ὑπερηφανίας ιακωβ εἰ ἐπιλησθήσεται εἰς νεῖκος πάντα τὰ ἔργα ὑμῶν,The Lord swears against the pride of Jacob, None of your works shall ever be forgotten.,,,,","8:8":"and everyone mourn who dwells in it?  Yes","8:9":"says the Lord Yahweh, that I will cause the sun to go down at noon","8:10":"and all your songs into lamentation; and I will make you wear sackcloth on all your bodies","8:11":"the days come","8:12":"and from the north even to the east; they will run back and forth to seek the word of Yahweh","8:13":"In that day shall the fair virgins and young men faint for thirst.","8:14":"and say","9:1":"and he said","9:2":"there my hand will take them; and though they climb up to heaven","9:3":"I will search and take them out there; and though they be hid from my sight in the bottom of the sea","9:4":"there I will command the sword","9:5":"Yahweh of Armies","9:6":"and has founded his vault on the earth; he who calls for the waters of the sea","9:7":"children of Israel? says Yahweh.  Haven't I brought up Israel out of the land of Egypt","9:8":"the eyes of the Lord Yahweh are on the sinful kingdom","9:9":"","9:10":"who say","9:11":"and close up its breaches","9:12":"and all the nations who are called by my name","9:13":"that the plowman shall overtake the reaper, and the one treading grapes him who sows seed; and sweet wine will drip from the mountains, and flow from the hills.,Behold, the days come, saith the LORD, that the plowman shall overtake the reaper, and the treader of grapes him that soweth seed; and the mountains shall drop sweet wine, and all the hills shall melt., הִנֵּה יָמִים בָּאִים נְאֻם־יְהוָה וְנִגַּשׁ חוֹרֵשׁ בַּקֹּצֵר וְדֹרֵךְ עֲנָבִים בְּמֹשֵׁךְ הַזָּרַע וְהִטִּיפוּ הֶהָרִים עָסִיס וְכָל־הַגְּבָעוֹת תִּתְמוֹגַגְנָה׃ ‬,Behold, the days come, saith the LORD, That the plowman shall overtake the reaper, And the treader of grapes him that soweth seed; And the mountains shall drop sweet wine, And all the hills shall melt.,ἰδοὺ ἡμέραι ἔρχονται λέγει κύριος καὶ καταλήμψεται ὁ ἀλοητὸς τὸν τρύγητον καὶ περκάσει ἡ σταφυλὴ ἐν τῷ σπόρῳ καὶ ἀποσταλάξει τὰ ὄρη γλυκασμόν καὶ πάντες οἱ βουνοὶ σύμφυτοι ἔσονται,Behold, the days come, saith the Lord, when the harvest shall overtake the vintage, and the grapes shall ripen at seedtime; and the mountains shall drop sweet wine, and all the hills shall be planted.,,,,","9:14":"and they will rebuild the ruined cities","9:15":"and they will no more be plucked up out of their land which I have given them"}