{"1:1":"an apostle of Christ Jesus through the will of God","1:2":"and the Lord Jesus Christ.","1:3":"praying always for you","1:4":"and of the love which you have toward all the saints","1:5":"of which you heard before in the word of the truth of the Good News","1:6":"as it does in you also","1:7":"who is a faithful servant of Christ on our behalf","1:8":"Who also declared unto us your love in the Spirit.","1:9":"we also","1:10":"to please him in all respects","1:11":"according to the might of his glory","1:12":"who made us fit to be partakers of the inheritance of the saints in light;","1:13":"and translated us into the Kingdom of the Son of his love;","1:14":"{TR adds through his blood,} the forgiveness of our sins;","1:15":"the firstborn of all creation.","1:16":"in the heavens and on the earth","1:17":"and in him all things are held together.","1:18":"the assembly","1:19":"For it pleased the Father that in him should all fulness dwell;","1:20":"by him","1:21":"being in past times alienated and enemies in your mind in your evil works","1:22":"to present you holy and without blemish and blameless before him","1:23":"grounded and steadfast","1:24":"and fill up on my part that which is lacking of the afflictions of Christ in my flesh for his body's sake","1:25":"according to the stewardship of God which was given me toward you","1:26":"","1:27":"which is Christ in you","1:28":"admonishing every man and teaching every man in all wisdom","1:29":"striving according to his working","2:1":"and for those at Laodicea","2:2":"they being knit together in love","2:3":"In whom are hid all the treasures of wisdom and knowledge.","2:4":"And this I say","2:5":"yet am I with you in the spirit","2:6":"the Lord","2:7":"and established in the faith","2:8":"after the tradition of men","2:9":"","2:10":"who is the head of all principality and power;","2:11":"in the putting off of the body of the sins of the flesh","2:12":"in which you were also raised with him through faith in the working of God","2:13":"having forgiven us all our trespasses","2:14":"nailing it to the cross;","2:15":"he made a show of them openly","2:16":"or in drinking","2:17":"Which are a shadow of things to come; but the body is of Christ.","2:18":"dwelling in the things which he has not seen","2:19":"from whom all the body","2:20":"why","2:21":"(Touch not; taste not; handle not;","2:22":"according to the precepts and doctrines of men?","2:23":"and humility","3:1":"seek the things that are above","3:2":"not on the things that are on the earth.","3:3":"and your life is hidden with Christ in God.","3:4":"our life","3:5":"uncleanness","3:6":"For which things' sake the wrath of God cometh on the children of disobedience:","3:7":"when you lived in them;","3:8":"wrath","3:9":"seeing that you have put off the old man with his doings","3:10":"who is being renewed in knowledge after the image of his Creator","3:11":"circumcision and uncircumcision","3:12":"as God's chosen ones","3:13":"and forgiving each other","3:14":"walk in love","3:15":"to which also you were called in one body; and be thankful.","3:16":"hymns","3:17":"in word or in deed","3:18":"be in subjection to your husbands","3:19":"love your wives","3:20":"obey your parents in all things","3:21":"don't provoke your children","3:22":"obey in all things those who are your masters according to the flesh","3:23":"work heartily","3:24":"Knowing that of the Lord ye shall receive the reward of the inheritance: for ye serve the Lord Christ.","3:25":"and there is no partiality.","4:1":"give to your servants that which is just and equal","4:2":"watching therein with thanksgiving;","4:3":"that God may open to us a door for the word","4:4":"That I may make it manifest","4:5":"redeeming the time.","4:6":"seasoned with salt","4:7":"the beloved brother","4:8":"that he may know your circumstances and comfort your hearts","4:9":"the faithful and beloved brother","4:10":"my fellow prisoner greets you","4:11":"who are of the circumcision. These are my only fellow workers for the Kingdom of God","4:12":"who is one of you","4:13":"that he has great zeal for you","4:14":"the beloved physician","4:15":"and Nymphas","4:16":"cause it to be read also in the assembly of the Laodiceans; and that you also read the letter from Laodicea.","4:17":"Take heed to the ministry which you have received in the Lord, that you fulfill it.","4:18":"Paul"}