{"1:1":"and besieged it.","1:2":"with part of the vessels of the house of God; and he carried them into the land of Shinar to the house of his god: and he brought the vessels into the treasure house of his god.","1:3":"that he should bring in [certain] of the children of Israel","1:4":"but well-favored","1:5":"and of the wine which he drank","1:6":"of the children of Judah","1:7":"[of] Shadrach; and to Mishael","1:8":"nor with the wine which he drank: therefore he requested of the prince of the eunuchs that he might not defile himself.","1:9":"Now God had brought Daniel into favour and tender love with the prince of the eunuchs.","1:10":"I fear my lord the king","1:11":"Hananiah","1:12":"I beg you","1:13":"and the face of the youths who eat of the king's dainties; and as you see","1:14":"and proved them ten days.","1:15":"and they were fatter in flesh","1:16":"and the wine that they should drink","1:17":"God gave them knowledge and skill in all learning and wisdom:  and Daniel had understanding in all visions and dreams.","1:18":"the prince of the eunuchs brought them in before Nebuchadnezzar.","1:19":"Hananiah","1:20":"concerning which the king inquired of them","1:21":"And Daniel continued even unto the first year of king Cyrus.","2:1":"Nebuchadnezzar dreamed dreams; and his spirit was troubled","2:2":"and the enchanters","2:3":"I have dreamed a dream","2:4":"O king","2:5":"The thing is gone from me: if you don't make known to me the dream and the interpretation of it","2:6":"you shall receive of me gifts and rewards and great honor: therefore show me the dream and the interpretation of it.","2:7":"Let the king tell his servants the dream","2:8":"I know of a certainty that you would gain time","2:9":"there is but one law for you; for you have prepared lying and corrupt words to speak before me","2:10":"and said","2:11":"and there is no other who can show it before the king","2:12":"and commanded to destroy all the wise men of Babylon.","2:13":"and the wise men were to be slain; and they sought Daniel and his companions to be slain.","2:14":"who was gone forth to kill the wise men of Babylon;","2:15":"Why is the decree so urgent from the king?  Then Arioch made the thing known to Daniel.","2:16":"and desired of the king that he would appoint him a time","2:17":"and made the thing known to Hananiah","2:18":"That they would desire mercies of the God of heaven concerning this secret; that Daniel and his fellows should not perish with the rest of the wise men of Babylon.","2:19":"Then was the secret revealed unto Daniel in a night vision. Then Daniel blessed the God of heaven.","2:20":"Blessed be the name of God forever and ever; for wisdom and might are his.","2:21":"and sets up kings; he gives wisdom to the wise","2:22":"and the light dwells with him.","2:23":"and praise you","2:24":"whom the king had appointed to destroy the wise men of Babylon; he went and said thus to him: Don't destroy the wise men of Babylon; bring me in before the king","2:25":"and said thus to him","2:26":"whose name was Belteshazzar","2:27":"and said","2:28":"and he has made known to the king Nebuchadnezzar what shall be in the latter days. Your dream","2:29":"O king","2:30":"this secret is not revealed to me for any wisdom that I have more than any living","2:31":"O king","2:32":"its head was of fine gold","2:33":"its feet part of iron","2:34":"which struck the image on its feet that were of iron and clay","2:35":"the clay","2:36":"This is the dream; and we will tell the interpretation thereof before the king.","2:37":"O king","2:38":"the animals of the field and the birds of the sky has he given into your hand","2:39":"which shall bear rule over all the earth.","2:40":"because iron breaks in pieces and subdues all things; and as iron that crushes all these","2:41":"part of potters' clay","2:42":"and part of clay","2:43":"they shall mingle themselves with the seed of men; but they shall not cling to one another","2:44":"nor shall the sovereignty of it be left to another people; but it shall break in pieces and consume all these kingdoms","2:45":"and that it broke in pieces the iron","2:46":"and worshiped Daniel","2:47":"and said","2:48":"and gave him many great gifts","2:49":"and he appointed Shadrach","3:1":"whose height was sixty cubits","3:2":"the deputies","3:3":"the deputies","3:4":"To you it is commanded","3:5":"flute","3:6":"And whoso falleth not down and worshippeth shall the same hour be cast into the midst of a burning fiery furnace.","3:7":"when all the peoples heard the sound of the horn","3:8":"and brought accusation against the Jews.","3:9":"O king","3:10":"O king","3:11":"And whoso falleth not down and worshippeth","3:12":"Meshach","3:13":"Meshach","3:14":"Is it on purpose","3:15":"flute","3:16":"Meshach","3:17":"our God whom we serve is able to deliver us from the burning fiery furnace; and he will deliver us out of your hand","3:18":"be it known to you","3:19":"and the form of his visage was changed against Shadrach","3:20":"Meshach","3:21":"their tunics","3:22":"and the furnace exceeding hot","3:23":"Shadrach","3:24":"and rose up in haste:  he spoke and said to his counselors","3:25":"Look","3:26":"Shadrach","3:27":"the deputies","3:28":"Blessed be the God of Shadrach","3:29":"that every people","3:30":"Meshach","4:1":"to all the peoples","4:2":"I thought it good to shew the signs and wonders that the high God hath wrought toward me.","4:3":"and his dominion is from generation to generation.","4:4":"Nebuchadnezzar","4:5":"I saw a dream which made me afraid","4:6":"that they might make known to me the interpretation of the dream.","4:7":"the enchanters","4:8":"whose name was Belteshazzar","4:9":"master of the magicians","4:10":"and behold","4:11":"and was strong","4:12":"and the fruit of it much","4:13":"and behold","4:14":"and said thus","4:15":"even with a band of iron and brass","4:16":"and let an animal's heart be given to him; and let seven times pass over him.","4:17":"and the demand by the word of the holy ones; to the intent that the living may know that the Most High rules in the kingdom of men","4:18":"king Nebuchadnezzar","4:19":"whose name was Belteshazzar","4:20":"which grew","4:21":"and the fruit of it much","4:22":"O king","4:23":"and saying","4:24":"O king","4:25":"and your dwelling shall be with the animals of the field","4:26":"after that you shall have known that the heavens do rule.","4:27":"O king","4:28":"All this came upon the king Nebuchadnezzar.","4:29":"At the end of twelve months he walked in the palace of the kingdom of Babylon.","4:30":"Is not this great Babylon","4:31":"there fell a voice from the sky","4:32":"and gives it to whoever he will.","4:33":"and ate grass as oxen","4:34":"Nebuchadnezzar","4:35":"and among the inhabitants of the earth; and none can stay his hand","4:36":"my majesty and brightness returned to me; and my counselors and my lords sought to me; and I was established in my kingdom","4:37":"Nebuchadnezzar","5:1":"and drank wine before the thousand.","5:2":"while he tasted the wine","5:3":"his wives and his concubines","5:4":"and praised the gods of gold","5:5":"and wrote over against the lampstand on the plaster of the wall of the king's palace:  and the king saw the part of the hand that wrote.","5:6":"and his thoughts troubled him; and the joints of his thighs were loosened","5:7":"the Chaldeans","5:8":"nor make known to the king the interpretation.","5:9":"and his face was changed in him","5:10":"O king","5:11":"in whom is the spirit of the holy gods; and in the days of your father light and understanding and wisdom","5:12":"and knowledge","5:13":"Are you that Daniel","5:14":"that the spirit of the gods is in you","5:15":"the enchanters","5:16":"that you can give interpretations","5:17":"Let your gifts be to yourself","5:18":"the Most High God gave Nebuchadnezzar your father the kingdom","5:19":"all the peoples","5:20":"and his spirit was hardened so that he dealt proudly","5:21":"and his heart was made like the animals'","5:22":"Belshazzar","5:23":"and you and your lords","5:24":"and this writing was inscribed.","5:25":"MENE","5:26":"and brought it to an end;","5:27":"and are found wanting.","5:28":"and given to the Medes and Persians.","5:29":"and they clothed Daniel with purple","5:30":"In that night was Belshazzar the king of the Chaldeans slain.","5:31":"being about sixty-two years old.","6:1":"who should be throughout the whole kingdom;","6:2":"of whom Daniel was one; that these satraps might give account to them","6:3":"because an excellent spirit was in him; and the king thought to set him over the whole realm.","6:4":"because he was faithful","6:5":"We shall not find any occasion against this Daniel","6:6":"and said thus to him","6:7":"the deputies and the satraps","6:8":"O king","6:9":"Wherefore king Darius signed the writing and the decree.","6:10":"he went into his house (now his windows were open in his chamber toward Jerusalem) and he kneeled on his knees three times a day","6:11":"and found Daniel making petition and supplication before his God.","6:12":"and spoke before the king concerning the king's interdict:  Haven't you signed an interdict","6:13":"That Daniel","6:14":"when he heard these words","6:15":"and said to the king","6:16":"and they brought Daniel","6:17":"and laid on the mouth of the den; and the king sealed it with his own signet","6:18":"and passed the night fasting; neither were instruments of music brought before him: and his sleep fled from him.","6:19":"and went in haste to the den of lions.","6:20":"he cried with a lamentable voice; the king spoke and said to Daniel","6:21":"O king","6:22":"and has shut the lions' mouths","6:23":"and commanded that they should take Daniel up out of the den.  So Daniel was taken up out of the den","6:24":"and they brought those men who had accused Daniel","6:25":"nations","6:26":"that in all the dominion of my kingdom men tremble and fear before the God of Daniel; for he is the living God","6:27":"and he works signs and wonders in heaven and in earth","6:28":"and in the reign of Cyrus the Persian.","7:1":"In the first year of Belshazzar king of Babylon Daniel had a dream and visions of his head upon his bed: then he wrote the dream","7:2":"I saw in my vision by night","7:3":"diverse one from another.","7:4":"and had eagle's wings: I saw until the wings of it were plucked","7:5":"another animal","7:6":"and behold","7:7":"and","7:8":"and behold","7:9":"and one who was ancient of days sat: his clothing was white as snow","7:10":"and ten thousand times ten thousand stood before him:  the judgment was set","7:11":"and its body destroyed","7:12":"their dominion was taken away: yet their lives were prolonged for a season and a time.","7:13":"and behold","7:14":"and glory","7:15":"Daniel","7:16":"and asked him the truth concerning all this.  So he told me","7:17":"which are four","7:18":"and possess the kingdom forever","7:19":"which was diverse from all of them","7:20":"and the other [horn] which came up","7:21":"and the same horn made war with the saints","7:22":"and judgment was given to the saints of the Most High","7:23":"The fourth animal shall be a fourth kingdom on earth","7:24":"out of this kingdom shall ten kings arise: and another shall arise after them; and he shall be diverse from the former","7:25":"and shall wear out the saints of the Most High; and he shall think to change the times and the law; and they shall be given into his hand until a time and times and half a time.","7:26":"and they shall take away his dominion","7:27":"and the greatness of the kingdoms under the whole sky","7:28":"Daniel","8:1":"even to me","8:2":"that when I saw","8:3":"and saw","8:4":"and northward","8:5":"behold","8:6":"which I saw standing before the river","8:7":"and he was moved with anger against him","8:8":"the great horn was broken; and instead of it there came up four notable [horns] toward the four winds of the sky.","8:9":"which grew exceeding great","8:10":"even to the army of the sky; and some of the army and of the stars it cast down to the ground","8:11":"it magnified itself","8:12":"and it did [its pleasure] and prospered.","8:13":"How long shall be the vision [concerning] the continual [burnt offering]","8:14":"To two thousand and three hundred evenings [and] mornings; then shall the sanctuary be cleansed.","8:15":"when I","8:16":"which called","8:17":"I was frightened","8:18":"I fell into a deep sleep with my face toward the ground; but he touched me","8:19":"Behold","8:20":"that had the two horns","8:21":"And the rough goat is the king of Grecia: and the great horn that is between his eyes is the first king.","8:22":"in the place where four stood up","8:23":"when the transgressors are come to the full","8:24":"but not by his own power; and he shall destroy wonderfully","8:25":"and in [their] security shall he destroy many:  he shall also stand up against the prince of princes; but he shall be broken without hand.","8:26":"And the vision of the evening and the morning which was told is true: wherefore shut thou up the vision; for it shall be for many days.","8:27":"Daniel","9:1":"of the seed of the Medes","9:2":"Daniel","9:3":"to seek by prayer and petitions","9:4":"and made confession","9:5":"and have dealt perversely","9:6":"who spoke in your name to our kings","9:7":"righteousness belongs to you","9:8":"to us belongs confusion of face","9:9":"To the Lord our God belong mercies and forgivenesses","9:10":"to walk in his laws","9:11":"all Israel have transgressed your law","9:12":"which he spoke against us","9:13":"all this evil is come on us: yet have we not entreated the favor of Yahweh our God","9:14":"and brought it on us; for Yahweh our God is righteous in all his works which he does","9:15":"Lord our God","9:16":"according to all your righteousness","9:17":"our God","9:18":"turn your ear","9:19":"hear; Lord","9:20":"and praying","9:21":"while I was speaking in prayer","9:22":"and talked with me","9:23":"and I am come to tell you; for you are greatly beloved: therefore consider the matter","9:24":"to finish disobedience","9:25":"that from the going forth of the commandment to restore and to build Jerusalem to the Anointed One","9:26":"and shall have nothing:  and the people of the prince who shall come shall destroy the city and the sanctuary; and the end of it shall be with a flood","9:27":"and that determined","10:1":"whose name was called Belteshazzar; and the thing was true","10:2":"Daniel","10:3":"neither came flesh nor wine into my mouth","10:4":"as I was by the side of the great river","10:5":"and looked","10:6":"and his face as the appearance of lightning","10:7":"Daniel","10:8":"and saw this great vision","10:9":"then was I fallen into a deep sleep on my face","10:10":"a hand touched me","10:11":"Daniel","10:12":"Don't be afraid","10:13":"behold","10:14":"Now I am come to make thee understand what shall befall thy people in the latter days: for yet the vision is for many days.","10:15":"I set my face toward the ground","10:16":"one in the likeness of the sons of men touched my lips: then I opened my mouth","10:17":"immediately there remained no strength in me","10:18":"and he strengthened me.","10:19":"Greatly beloved man, don't be afraid: peace be to you, be strong, yes, be strong.  When he spoke to me","10:20":"Do you know why I have come to you? Now I will return to fight with the prince of Persia. When I go forth, behold, the prince of Greece shall come.,Then said he, Knowest thou wherefore I come unto thee? and now will I return to fight with the prince of Persia: and when I am gone forth, lo, the prince of Grecia shall come., וַיֹּאמֶר הֲיָדַעְתָּ לָמָּה־בָּאתִי אֵלֶיךָ וְעַתָּה אָשׁוּב לְהִלָּחֵם עִם־שַׂר פָּרָס וַאֲנִי יוֹצֵא וְהִנֵּה שַׂר־יָוָן בָּא׃ ‬,Then said he: Knowest thou wherefore I come unto thee? and now will I return to fight with the prince of Persia; and when I go forth, lo, the prince of Greece shall come.,καὶ εἶπεν πρός με γινώσκεις τί ἦλθον πρὸς σέ καὶ νῦν ἐπιστρέψω διαμάχεσθαι μετὰ τοῦ στρατηγοῦ βασιλέως τῶν περσῶν καὶ ἐγὼ ἐξεπορευόμην καὶ ἰδοὺ στρατηγὸς ἑλλήνων εἰσεπορεύετο,And he said, Knowest thou, wherefore I am come to thee? and now I will return to fight with the prince of the Persians: and I was going in, and the prince of the Greeks came.,,,,","10:21":"but Michael your prince.,But I will shew thee that which is noted in the scripture of truth: and there is none that holdeth with me in these things, but Michael your prince., אֲבָל אַגִּיד לְךָ אֶת־הָרָשׁוּם בִּכְתָב אֱמֶת וְאֵין אֶחָד מִתְחַזֵּק עִמִּי עַל־אֵלֶּה כִּי אִם־מִיכָאֵל שַׂרְכֶם׃ פ ‬,Howbeit I will declare unto thee that which is inscribed in the writing of truth; and there is none that holdeth with me against these, except Michael your prince.,καὶ μάλα ὑποδείξω σοι τὰ πρῶτα ἐν ἀπογραφῇ ἀληθείας καὶ οὐθεὶς ἦν ὁ βοηθῶν μετ' ἐμοῦ ὑπὲρ τούτων ἀλλ' ἢ μιχαηλ ὁ ἄγγελος,But I will tell thee that which is ordained in the scripture of truth: and there is no one that holds with me in these matters but Michael your prince.,,,,","11:1":"","11:2":"there shall stand up yet three kings in Persia; and the fourth shall be far richer than they all:  and when he has grown strong through his riches","11:3":"who shall rule with great dominion","11:4":"his kingdom shall be broken","11:5":"and [one] of his princes; and he shall be strong above him","11:6":"nor his arm; but she shall be given up","11:7":"who shall come to the army","11:8":"with their molten images","11:9":"but he shall return into his own land.","11:10":"and shall assemble a multitude of great forces","11:11":"and shall come forth and fight with him","11:12":"and his heart shall be exalted; and he shall cast down tens of thousands","11:13":"and shall set forth a multitude greater than the former; and he shall come on at the end of the times","11:14":"And in those times there shall many stand up against the king of the south: also the robbers of thy people shall exalt themselves to establish the vision; but they shall fall.","11:15":"and cast up a mound","11:16":"and none shall stand before him; and he shall stand in the glorious land","11:17":"and with him equitable conditions; and he shall perform them: and he shall give him the daughter of women","11:18":"and shall take many:  but a prince shall cause the reproach offered by him to cease; yes","11:19":"and shall not be found.","11:20":"neither in anger","11:21":"to whom they had not given the honor of the kingdom: but he shall come in time of security","11:22":"and shall be broken; yes","11:23":"and shall become strong","11:24":"nor his fathers' fathers; he shall scatter among them prey","11:25":"And he shall stir up his power and his courage against the king of the south with a great army; and the king of the south shall be stirred up to battle with a very great and mighty army; but he shall not stand: for they shall forecast devices against him.","11:26":"they who eat of his dainties shall destroy him","11:27":"their hearts shall be to do mischief","11:28":"and return to his own land.","11:29":"and come into the south; but it shall not be in the latter time as it was in the former.","11:30":"and shall return","11:31":"and they shall profane the sanctuary","11:32":"and do [exploits].","11:33":"by captivity and by spoil","11:34":"they shall be helped with a little help; but many shall join themselves to them with flatteries.","11:35":"to refine them","11:36":"and magnify himself above every god","11:37":"nor the desire of women","11:38":"and silver","11:39":"and shall divide the land for a price.","11:40":"with chariots","11:41":"and many [countries] shall be overthrown; but these shall be delivered out of his hand: Edom","11:42":"He shall stretch forth his hand also upon the countries: and the land of Egypt shall not escape.","11:43":"and over all the precious things of Egypt; and the Libyans and the Ethiopians shall be at his steps.","11:44":"But tidings out of the east and out of the north shall trouble him: therefore he shall go forth with great fury to destroy","11:45":"and none shall help him.","12:1":"","12:2":"some to everlasting life","12:3":"And they that be wise shall shine as the brightness of the firmament; and they that turn many to righteousness as the stars for ever and ever.","12:4":"Daniel","12:5":"Daniel","12:6":"who was above the waters of the river","12:7":"who was above the waters of the river","12:8":"but I didn't understand:  then said I","12:9":"Go your way","12:10":"and make themselves white","12:11":"and the abomination that makes desolate set up","12:12":"and comes to the one thousand three hundred thirty-five days.","12:13":"and shall stand in your lot"}