{"1:1":"in the Arabah over against Suph","1:2":"(There are eleven days' journey from Horeb by the way of mount Seir unto Kadeshbarnea.)","1:3":"in the eleventh month","1:4":"who lived in Heshbon","1:5":"in the land of Moab","1:6":"saying","1:7":"and take your journey","1:8":"I have set the land before you:  go in and possess the land which Yahweh swore to your fathers","1:9":"saying","1:10":"and behold","1:11":"the God of your fathers","1:12":"and your burden","1:13":"and I will make them heads over you.","1:14":"and said","1:15":"wise men","1:16":"saying","1:17":"you shall bring to me","1:18":"And I commanded you at that time all the things which ye should do.","1:19":"and went through all that great and terrible wilderness which you saw","1:20":"You are come to the hill country of the Amorites","1:21":"Yahweh your God has set the land before you: go up","1:22":"and said","1:23":"one man for every tribe:","1:24":"and came to the valley of Eshcol","1:25":"and brought it down to us","1:26":"but rebelled against the commandment of Yahweh your God:","1:27":"and said","1:28":"saying","1:29":"Don't dread","1:30":"he will fight for you","1:31":"where you have seen how that Yahweh your God bore you","1:32":"","1:33":"to seek you out a place to pitch your tents in","1:34":"and was angry","1:35":"which I swore to give to your fathers","1:36":"and to his children","1:37":"saying","1:38":"who stands before you","1:39":"whom you said should be a prey","1:40":"turn you","1:41":"We have sinned against Yahweh","1:42":"Tell them","1:43":"and you didn't listen; but you rebelled against the commandment of Yahweh","1:44":"who lived in that hill country","1:45":"nor gave ear to you.","1:46":"according to the days that you abode [there].","2:1":"and took our journey into the wilderness by the way to the Red Sea{or","2:2":"saying","2:3":"Ye have compassed this mountain long enough: turn you northward.","2:4":"saying","2:5":"no","2:6":"that you may eat; and you shall also buy water of them for money","2:7":"For the LORD thy God hath blessed thee in all the works of thy hand: he knoweth thy walking through this great wilderness: these forty years the LORD thy God hath been with thee; thou hast lacked nothing.","2:8":"who dwell in Seir","2:9":"Don't bother Moab","2:10":"a people great","2:11":"as the Anakim; but the Moabites call them Emim.","2:12":"but the children of Esau succeeded them; and they destroyed them from before them","2:13":"and get you over the brook Zered.  We went over the brook Zered.","2:14":"until we were come over the brook Zered","2:15":"to destroy them from the midst of the camp","2:16":"when all the men of war were consumed and dead from among the people","2:17":"saying","2:18":"the border of Moab:","2:19":"don't bother them","2:20":"","2:21":"and many","2:22":"who dwell in Seir","2:23":"who lived in villages as far as Gaza","2:24":"take your journey","2:25":"who shall hear the report of you","2:26":"saying","2:27":"I will turn neither to the right hand nor to the left.","2:28":"that I may eat; and give me water for money","2:29":"and the Moabites who dwell in Ar","2:30":"and made his heart obstinate","2:31":"Behold","2:32":"he and all his people","2:33":"and his sons","2:34":"and utterly destroyed every inhabited city","2:35":"with the spoil of the cities which we had taken.","2:36":"which is on the edge of the valley of the Arnon","2:37":"and the cities of the hill country","3:1":"and went up the way to Bashan:  and Og the king of Bashan came out against us","3:2":"Don't fear him; for I have delivered him","3:3":"the king of Bashan","3:4":"all the region of Argob","3:5":"gates","3:6":"as we did to Sihon king of Heshbon","3:7":"and the spoil of the cities","3:8":"from the valley of the Arnon to Mount Hermon;","3:9":"and the Amorites call it Senir;)","3:10":"and all Gilead","3:11":"his bedstead was a bedstead of iron; isn't it in Rabbah of the children of Ammon? nine cubits was the length of it","3:12":"which is by the valley of the Arnon","3:13":"and all Bashan","3:14":"to the border of the Geshurites and the Maacathites","3:15":"And I gave Gilead unto Machir.","3:16":"the middle of the valley","3:17":"and the Jordan and the border [of it]","3:18":"saying","3:19":"and your little ones","3:20":"as to you","3:21":"saying","3:22":"he it is who fights for you.","3:23":"saying","3:24":"you have begun to show your servant your greatness","3:25":"that goodly mountain","3:26":"and didn't listen to me; and Yahweh said to me","3:27":"and lift up your eyes westward","3:28":"and encourage him","3:29":"So we abode in the valley over against Bethpeor.","4:1":"Israel","4:2":"neither shall you diminish from it","4:3":"Yahweh your God has destroyed them from the midst of you.","4:4":"But ye that did cleave unto the LORD your God are alive every one of you this day.","4:5":"I have taught you statutes and ordinances","4:6":"who shall hear all these statutes","4:7":"that has a god so near to them","4:8":"that has statutes and ordinances so righteous as all this law","4:9":"and keep your soul diligently","4:10":"when Yahweh said to me","4:11":"with darkness","4:12":"but you saw no form; only [you heard] a voice.","4:13":"which he commanded you to perform","4:14":"that you might do them in the land where you go over to possess it.","4:15":"Take ye therefore good heed unto yourselves; for ye saw no manner of similitude on the day that the LORD spake unto you in Horeb out of the midst of the fire:","4:16":"and make yourself an engraved image in the form of any figure","4:17":"the likeness of any winged bird that flies in the sky","4:18":"the likeness of any fish that is in the water under the earth;","4:19":"and when you see the sun and the moon and the stars","4:20":"and brought you forth out of the iron furnace","4:21":"and swore that I should not go over the Jordan","4:22":"I must not go over the Jordan; but you shall go over","4:23":"lest you forget the covenant of Yahweh your God","4:24":"a jealous God.","4:25":"and children's children","4:26":"that you shall soon utterly perish from off the land whereunto you go over the Jordan to possess it; you shall not prolong your days on it","4:27":"and you shall be left few in number among the nations","4:28":"the work of men's hands","4:29":"and you shall find him","4:30":"and all these things are come on you","4:31":"neither destroy you","4:32":"which were before you","4:33":"as you have heard","4:34":"by trials","4:35":"that you might know that Yahweh he is God; there is none else besides him.","4:36":"that he might instruct you:  and on earth he made you to see his great fire; and you heard his words out of the midst of the fire.","4:37":"therefore he chose their seed after them","4:38":"to bring you in","4:39":"and lay it to your heart","4:40":"and his commandments","4:41":"Then Moses severed three cities on this side Jordan toward the sunrising;","4:42":"who kills his neighbor unawares","4:43":"Bezer in the wilderness","4:44":"And this is the law which Moses set before the children of Israel:","4:45":"and the statutes","4:46":"in the valley over against Beth Peor","4:47":"and the land of Og king of Bashan","4:48":"which is on the edge of the valley of the Arnon","4:49":"even to the sea of the Arabah","5:1":"and said to them","5:2":"The LORD our God made a covenant with us in Horeb.","5:3":"but with us","5:4":"","5:5":"to show you the word of Yahweh:  for you were afraid because of the fire","5:6":"","5:7":"Thou shalt have none other gods before me.","5:8":"","5:9":"nor serve them; for I","5:10":"And showing mercy unto thousands of them that love me and keep my commandments.","5:11":"","5:12":"","5:13":"and do all your work;","5:14":"you","5:15":"and Yahweh your God brought you out of there by a mighty hand and by an outstretched arm:  therefore Yahweh your God commanded you to keep the Sabbath day.","5:16":"","5:17":"","5:18":"","5:19":"","5:20":"","5:21":"Neither shalt thou desire thy neighbor's wife","5:22":"of the cloud","5:23":"when you heard the voice out of the midst of the darkness","5:24":"Behold","5:25":"then we shall die.","5:26":"that has heard the voice of the living God speaking out of the midst of the fire","5:27":"and hear all that Yahweh our God shall say: and speak you to us all that Yahweh our God shall speak to you; and we will hear it","5:28":"when you spoke to me; and Yahweh said to me","5:29":"that they would fear me","5:30":"Return you to your tents.","5:31":"stand you here by me","5:32":"Ye shall observe to do therefore as the LORD your God hath commanded you: ye shall not turn aside to the right hand or to the left.","5:33":"that you may live","6:1":"the statutes","6:2":"to keep all his statutes and his commandments","6:3":"Israel","6:4":"Israel:  Yahweh is our God; Yahweh is one:","6:5":"and with all your soul","6:6":"which I command you this day","6:7":"and shall talk of them when you sit in your house","6:8":"and they shall be for symbols between your eyes.","6:9":"and on your gates.","6:10":"when Yahweh your God shall bring you into the land which he swore to your fathers","6:11":"which you didn't fill","6:12":"who brought you forth out of the land of Egypt","6:13":"and shall swear by his name.","6:14":"of the gods of the peoples who are round about you;","6:15":"and he destroy you from off the face of the earth.","6:16":"as you tempted him in Massah.","6:17":"and his testimonies","6:18":"and that you may go in and possess the good land which Yahweh swore to your fathers","6:19":"as Yahweh has spoken.","6:20":"saying","6:21":"We were Pharaoh's bondservants in Egypt:  and Yahweh brought us out of Egypt with a mighty hand;","6:22":"on Pharaoh","6:23":"that he might bring us in","6:24":"to fear Yahweh our God","6:25":"if we observe to do all this commandment before Yahweh our God","7:1":"and shall cast out many nations before you","7:2":"and you shall strike them; then you shall utterly destroy them: you shall make no covenant with them","7:3":"nor his daughter shall you take to your son.","7:4":"that they may serve other gods:  so will the anger of Yahweh be kindled against you","7:5":"and dash in pieces their pillars","7:6":"above all peoples who are on the face of the earth.","7:7":"nor choose you","7:8":"and because he would keep the oath which he swore to your fathers","7:9":"he is God","7:10":"to destroy them: he will not be slack to him who hates him","7:11":"and the statutes","7:12":"because you listen to these ordinances","7:13":"and bless you","7:14":"or among your livestock.","7:15":"which you know","7:16":"And thou shalt consume all the people which the LORD thy God shall deliver thee; thine eye shall have no pity upon them: neither shalt thou serve their gods; for that will be a snare unto thee.","7:17":"These nations are more than I; how can I dispossess them?","7:18":"and to all Egypt;","7:19":"and the signs","7:20":"until those who are left","7:21":"a great and awesome God.","7:22":"lest the animals of the field increase on you.","7:23":"and will confuse them with a great confusion","7:24":"and you shall make their name to perish from under the sky: there shall no man be able to stand before you","7:25":"nor take it to you","7:26":"and become a devoted thing like it:  you shall utterly detest it","8:1":"that you may live","8:2":"that he might humble you","8:3":"and allowed you to hunger","8:4":"neither did your foot swell","8:5":"so Yahweh your God chastens you.","8:6":"to walk in his ways","8:7":"a land of brooks of water","8:8":"and vines and fig trees and pomegranates; a land of olive trees and honey;","8:9":"you shall not lack anything in it; a land whose stones are iron","8:10":"and you shall bless Yahweh your God for the good land which he has given you.","8:11":"in not keeping his commandments","8:12":"when you have eaten and are full","8:13":"and your silver and your gold is multiplied","8:14":"and you forget Yahweh your God","8:15":"[in which were] fiery serpents and scorpions","8:16":"which your fathers didn't know; that he might humble you","8:17":"My power and the might of my hand has gotten me this wealth.","8:18":"for it is he who gives you power to get wealth; that he may establish his covenant which he swore to your fathers","8:19":"if you shall forget Yahweh your God","8:20":"so shall you perish; because you wouldn't listen to the voice of Yahweh your God.","9:1":"Israel:  you are to pass over the Jordan this day","9:2":"the sons of the Anakim","9:3":"that Yahweh your God is he who goes over before you as a devouring fire; he will destroy them","9:4":"after that Yahweh your God has thrust them out from before you","9:5":"or for the uprightness of your heart","9:6":"that Yahweh your God doesn't give you this good land to possess it for your righteousness; for you are a stiff-necked people.","9:7":"don't forget","9:8":"and Yahweh was angry with you to destroy you.","9:9":"even the tables of the covenant which Yahweh made with you","9:10":"which Yahweh spoke with you on the mountain out of the midst of the fire in the day of the assembly.","9:11":"that Yahweh gave me the two tables of stone","9:12":"Arise","9:13":"saying","9:14":"that I may destroy them","9:15":"and the mountain was burning with fire:  and the two tables of the covenant were in my two hands.","9:16":"and behold","9:17":"and cast them out of my two hands","9:18":"as at the first","9:19":"with which Yahweh was angry against you to destroy you. But Yahweh listened to me that time also.","9:20":"And the LORD was very angry with Aaron to have destroyed him: and I prayed for Aaron also the same time.","9:21":"the calf which you had made","9:22":"and at Massah","9:23":"saying","9:24":"Ye have been rebellious against the LORD from the day that I knew you.","9:25":"because Yahweh had said he would destroy you.","9:26":"and said","9:27":"Abraham","9:28":"Because Yahweh was not able to bring them into the land which he promised to them","9:29":"which you brought out by your great power and by your outstretched arm.","10:1":"Hew you two tables of stone like the first","10:2":"and you shall put them in the ark.","10:3":"and hewed two tables of stone like the first","10:4":"according to the first writing","10:5":"and put the tables in the ark which I had made; and there they are as Yahweh commanded me.","10:6":"and there he was buried; and Eleazar his son ministered in the priest's office in his place.","10:7":"a land of brooks of water.","10:8":"to bear the ark of the covenant of Yahweh","10:9":"according as Yahweh your God spoke to him.)","10:10":"as at the first time","10:11":"Arise","10:12":"Israel","10:13":"and his statutes","10:14":"to Yahweh your God belongs heaven and the heaven of heavens","10:15":"and he chose their seed after them","10:16":"and be no more stiff-necked.","10:17":"he is God of gods","10:18":"and loves the foreigner","10:19":"Love ye therefore the stranger: for ye were strangers in the land of Egypt.","10:20":"and by his name shall you swear.","10:21":"and he is your God","10:22":"Thy fathers went down into Egypt with threescore and ten persons; and now the LORD thy God hath made thee as the stars of heaven for multitude.","11:1":"and keep his charge","11:2":"and who have not seen the chastisement of Yahweh your God","11:3":"and his works","11:4":"to their horses","11:5":"until you came to this place;","11:6":"the sons of Eliab","11:7":"But your eyes have seen all the great acts of the LORD which he did.","11:8":"that you may be strong","11:9":"which Yahweh swore to your fathers to give to them and to their seed","11:10":"where you go in to possess it","11:11":"where you go over to possess it","11:12":"from the beginning of the year even to the end of the year.","11:13":"if you shall listen diligently to my commandments which I command you this day","11:14":"the former rain and the latter rain","11:15":"and you shall eat and be full.","11:16":"lest your heart be deceived","11:17":"and he shut up the sky","11:18":"and they shall be for symbols between your eyes.","11:19":"talking of them","11:20":"and on your gates;","11:21":"and the days of your children","11:22":"to do it","11:23":"and you shall dispossess nations greater and mightier than yourselves.","11:24":"and Lebanon","11:25":"as he has spoken to you.","11:26":"I set before you this day a blessing and a curse:","11:27":"if you shall listen to the commandments of Yahweh your God","11:28":"if you shall not listen to the commandments of Yahweh your God","11:29":"when Yahweh your God shall bring you into the land where you go to possess it","11:30":"behind the way of the going down of the sun","11:31":"and you shall possess it","11:32":"And ye shall observe to do all the statutes and judgments which I set before you this day.","12:1":"the God of your fathers","12:2":"on the high mountains","12:3":"and dash in pieces their pillars","12:4":"Ye shall not do so unto the LORD your God.","12:5":"to put his name there","12:6":"and your sacrifices","12:7":"and you shall rejoice in all that you put your hand to","12:8":"every man whatever is right in his own eyes;","12:9":"which Yahweh your God gives you.","12:10":"and dwell in the land which Yahweh your God causes you to inherit","12:11":"to cause his name to dwell there","12:12":"you","12:13":"Take heed to thyself that thou offer not thy burnt offerings in every place that thou seest:","12:14":"there you shall offer your burnt offerings","12:15":"you may kill and eat flesh within all your gates","12:16":"Only ye shall not eat the blood; ye shall pour it upon the earth as water.","12:17":"or of your new wine","12:18":"you","12:19":"Take heed to thyself that thou forsake not the Levite as long as thou livest upon the earth.","12:20":"as he has promised you","12:21":"to put his name there","12:22":"so you shall eat of it: the unclean and the clean may eat of it alike.","12:23":"Only be sure that thou eat not the blood: for the blood is the life; and thou mayest not eat the life with the flesh.","12:24":"Thou shalt not eat it; thou shalt pour it upon the earth as water.","12:25":"and with your children after you","12:26":"and your vows","12:27":"the flesh and the blood","12:28":"that it may go well with you","12:29":"where you go in to dispossess them","12:30":"after that they are destroyed from before you; and that you not inquire after their gods","12:31":"which he hates","12:32":"that shall you observe to do: you shall not add thereto","13:1":"or a dreamer of dreams","13:2":"of which he spoke to you","13:3":"or to that dreamer of dreams:  for Yahweh your God proves you","13:4":"and fear him","13:5":"or that dreamer of dreams","13:6":"the son of your mother","13:7":"near to you","13:8":"nor listen to him; neither shall your eye pity him","13:9":"and afterwards the hand of all the people.","13:10":"because he has sought to draw you away from Yahweh your God","13:11":"and fear","13:12":"which Yahweh your God gives you to dwell there","13:13":"and have drawn away the inhabitants of their city","13:14":"and make search","13:15":"destroying it utterly","13:16":"and shall burn with fire the city","13:17":"and show you mercy","13:18":"to keep all his commandments which I command you this day","14:1":"nor make any baldness between your eyes for the dead.","14:2":"and Yahweh has chosen you to be a people for his own possession","14:3":"Thou shalt not eat any abominable thing.","14:4":"the sheep","14:5":"and the gazelle","14:6":"and has the hoof cloven in two","14:7":"or of those who have the hoof cloven:  the camel","14:8":"because it has a split hoof but doesn't chew the cud","14:9":"These ye shall eat of all that are in the waters: all that have fins and scales shall ye eat:","14:10":"And whatsoever hath not fins and scales ye may not eat; it is unclean unto you.","14:11":"Of all clean birds ye shall eat.","14:12":"and the vulture","14:13":"and the falcon","14:14":"","14:15":"and the owl","14:16":"and the great owl","14:17":"and the vulture","14:18":"and the heron after its kind","14:19":"And every creeping thing that flieth is unclean unto you: they shall not be eaten.","14:20":"But of all clean fowls ye may eat.","14:21":"that he may eat it; or you may sell it to a foreigner:  for you are a holy people to Yahweh your God. You shall not boil a kid in its mother's milk.","14:22":"that which comes forth from the field year by year.","14:23":"in the place which he shall choose","14:24":"so that you are not able to carry it","14:25":"and bind up the money in your hand","14:26":"for oxen","14:27":"you shall not forsake him; for he has no portion nor inheritance with you.","14:28":"and shall lay it up within your gates:","14:29":"because he has no portion nor inheritance with you","15:1":"At the end of every seven years thou shalt make a release.","15:2":"And this is the manner of the release: Every creditor that lendeth ought unto his neighbor shall release it; he shall not exact it of his neighbor","15:3":"Of a foreigner thou mayest exact it again: but that which is thine with thy brother thine hand shall release;","15:4":"Save when there shall be no poor among you; for the LORD shall greatly bless thee in the land which the LORD thy God giveth thee for an inheritance to possess it:","15:5":"to observe to do all this commandment which I command you this day.","15:6":"as he promised you: and you shall lend to many nations","15:7":"one of your brothers","15:8":"and shall surely lend him sufficient for his need [in that] which he wants.","15:9":"saying","15:10":"and your heart shall not be grieved when you give to him; because that for this thing Yahweh your God will bless you in all your work","15:11":"saying","15:12":"a Hebrew man","15:13":"you shall not let him go empty:","15:14":"and out of your threshing floor","15:15":"and Yahweh your God redeemed you:  therefore I command you this thing today.","15:16":"if he tell you","15:17":"and thrust it through his ear to the door","15:18":"when you let him go free from you; for to the double of the hire of a hireling has he served you six years:  and Yahweh your God will bless you in all that you do.","15:19":"nor shear the firstborn of your flock.","15:20":"you and your household.","15:21":"[as if it be] lame or blind","15:22":"as the gazelle","15:23":"Only thou shalt not eat the blood thereof; thou shalt pour it upon the ground as water.","16:1":"and keep the Passover to Yahweh your God; for in the month of Abib Yahweh your God brought you forth out of Egypt by night.","16:2":"of the flock and the herd","16:3":"even the bread of affliction; for you came forth out of the land of Egypt in haste: that you may remember the day when you came forth out of the land of Egypt all the days of your life.","16:4":"which you sacrifice the first day at even","16:5":"which Yahweh your God gives you;","16:6":"to cause his name to dwell in","16:7":"and go to your tents.","16:8":"Six days thou shalt eat unleavened bread: and on the seventh day shall be a solemn assembly to the LORD thy God: thou shalt do no work therein.","16:9":"Seven weeks shalt thou number unto thee: begin to number the seven weeks from such time as thou beginnest to put the sickle to the corn.","16:10":"which you shall give","16:11":"you","16:12":"And thou shalt remember that thou wast a bondman in Egypt: and thou shalt observe and do these statutes.","16:13":"after that you have gathered in from your threshing floor and from your winepress:","16:14":"you","16:15":"and in all the work of your hands","16:16":"and in the feast of weeks","16:17":"according to the blessing of Yahweh your God which he has given you.","16:18":"which Yahweh your God gives you","16:19":"and pervert the words of the righteous.","16:20":"that you may live","16:21":"which you shall make you.","16:22":"Neither shalt thou set thee up any image; which the LORD thy God hateth.","17:1":"or a sheep","17:2":"within any of your gates which Yahweh your God gives you","17:3":"and worshiped them","17:4":"and you have heard of it","17:5":"who has done this evil thing","17:6":"or three witnesses","17:7":"and afterward the hand of all the people. So you shall put away the evil from the midst of you.","17:8":"between blood and blood","17:9":"and to the judge who shall be in those days:  and you shall inquire; and they shall show you the sentence of judgment.","17:10":"And thou shalt do according to the sentence","17:11":"and according to the judgment which they shall tell you","17:12":"in not listening to the priest who stands to minister there before Yahweh your God","17:13":"and fear","17:14":"and shall possess it","17:15":"whom Yahweh your God shall choose:  one from among your brothers shall you set king over you; you may not put a foreigner over you","17:16":"nor cause the people to return to Egypt","17:17":"that his heart not turn away:  neither shall he greatly multiply to himself silver and gold.","17:18":"when he sits on the throne of his kingdom","17:19":"and he shall read therein all the days of his life; that he may learn to fear Yahweh his God","17:20":"and that he not turn aside from the commandment","18:1":"[even] all the tribe of Levi","18:2":"as he has spoken to them.","18:3":"from those who offer a sacrifice","18:4":"of your new wine","18:5":"to stand to minister in the name of Yahweh","18:6":"where he lives as a foreigner","18:7":"as all his brothers the Levites do","18:8":"besides that which comes of the sale of his patrimony.","18:9":"you shall not learn to do after the abominations of those nations.","18:10":"one who uses divination","18:11":"or a consulter with a familiar spirit","18:12":"For all that do these things are an abomination unto the LORD: and because of these abominations the LORD thy God doth drive them out from before thee.","18:13":"Thou shalt be perfect with the LORD thy God.","18:14":"that you shall dispossess","18:15":"of your brothers","18:16":"saying","18:17":"They have well said that which they have spoken.","18:18":"like you; and I will put my words in his mouth","18:19":"that whoever will not listen to my words which he shall speak in my name","18:20":"who shall speak a word presumptuously in my name","18:21":"How shall we know the word which Yahweh has not spoken?","18:22":"if the thing doesn't follow","19:1":"whose land Yahweh your God gives you","19:2":"which Yahweh your God gives you to possess it.","19:3":"and divide the borders of your land","19:4":"that shall flee there and live: whoever kills his neighbor unawares","19:5":"and his hand fetches a stroke with the axe to cut down the tree","19:6":"while his heart is hot","19:7":"saying","19:8":"as he has sworn to your fathers","19:9":"which I command you this day","19:10":"which Yahweh your God gives you for an inheritance","19:11":"and lie in wait for him","19:12":"and deliver him into the hand of the avenger of blood","19:13":"but you shall put away the innocent blood from Israel","19:14":"which they of old time have set","19:15":"or for any sin","19:16":"","19:17":"between whom the controversy is","19:18":"behold","19:19":"as he had thought to do to his brother: so shall you put away the evil from the midst of you.","19:20":"and fear","19:21":"eye for eye","20:1":"and see horses","20:2":"when you draw near to the battle","20:3":"Hear","20:4":"to fight for you against your enemies","20:5":"saying","20:6":"and has not used the fruit of it? let him go and return to his house","20:7":"and has not taken her? let him go and return to his house","20:8":"and they shall say","20:9":"when the officers have made an end of speaking to the people","20:10":"then proclaim peace to it.","20:11":"if it make you answer of peace","20:12":"but will make war against you","20:13":"you shall strike every male of it with the edge of the sword:","20:14":"and the little ones","20:15":"which are not of the cities of these nations.","20:16":"that Yahweh your God gives you for an inheritance","20:17":"and the Amorite","20:18":"which they have done to their gods; so would you sin against Yahweh your God.","20:19":"in making war against it to take it","20:20":"you shall destroy and cut them down; and you shall build bulwarks against the city that makes war with you","21:1":"lying in the field","21:2":"and they shall measure to the cities which are round about him who is slain:","21:3":"that the city which is nearest to the slain man","21:4":"which is neither plowed nor sown","21:5":"and to bless in the name of Yahweh; and according to their word shall every controversy and every stroke be.","21:6":"who are nearest to the slain man","21:7":"Our hands have not shed this blood","21:8":"Yahweh","21:9":"when you shall do that which is right in the eyes of Yahweh.","21:10":"and Yahweh your God delivers them into your hands","21:11":"and you have a desire to her","21:12":"and pare her nails;","21:13":"and shall remain in your house","21:14":"if you have no delight in her","21:15":"the one beloved","21:16":"in the day that he causes his sons to inherit that which he has","21:17":"the son of the hated","21:18":"who will not obey the voice of his father","21:19":"and bring him out to the elders of his city","21:20":"This our son is stubborn and rebellious","21:21":"and fear.","21:22":"and he be put to death","21:23":"but you shall surely bury him the same day; for he who is hanged is accursed of God; that you don't defile your land which Yahweh your God gives you for an inheritance.","22:1":"and hide yourself from them:  you shall surely bring them again to your brother.","22:2":"or if you don't know him","22:3":"which he has lost","22:4":"and hide yourself from them: you shall surely help him to lift them up again.","22:5":"neither shall a man put on women's clothing; for whoever does these things is an abomination to Yahweh your God.","22:6":"in any tree or on the ground","22:7":"but the young you may take to yourself; that it may be well with you","22:8":"then you shall make a battlement for your roof","22:9":"lest the whole fruit be forfeited","22:10":"Thou shalt not plow with an ox and an ass together.","22:11":"wool and linen together.","22:12":"tassles} on the four borders of your cloak","22:13":"and goes in to her","22:14":"and brings up an evil name on her","22:15":"and her mother","22:16":"I gave my daughter to this man to wife","22:17":"he has laid shameful things [to her charge]","22:18":"And the elders of that city shall take that man and chastise him;","22:19":"and give them to the father of the young lady","22:20":"that the tokens of virginity were not found in the young lady;","22:21":"and the men of her city shall stone her to death with stones","22:22":"then they shall both of them die","22:23":"and a man find her in the city","22:24":"and you shall stone them to death with stones; the lady","22:25":"and the man force her","22:26":"and kills him","22:27":"the pledged to be married lady cried","22:28":"who is not pledged to be married","22:29":"and she shall be his wife","22:30":"and shall not uncover his father's skirt.","23:1":"or has his privy member cut off","23:2":"A bastard shall not enter into the congregation of the LORD; even to his tenth generation shall he not enter into the congregation of the LORD.","23:3":"An Ammonite or Moabite shall not enter into the congregation of the LORD; even to their tenth generation shall they not enter into the congregation of the LORD for ever:","23:4":"when you came forth out of Egypt","23:5":"because Yahweh your God loved you.","23:6":"Thou shalt not seek their peace nor their prosperity all thy days for ever.","23:7":"because you lived as a foreigner in his land.","23:8":"The children that are begotten of them shall enter into the congregation of the LORD in their third generation.","23:9":"then you shall keep you from every evil thing.","23:10":"who is not clean by reason of that which happens him by night","23:11":"when evening comes on","23:12":"where you shall go forth abroad:","23:13":"when you sit down abroad","23:14":"to deliver you","23:15":"Thou shalt not deliver unto his master the servant which is escaped from his master unto thee:","23:16":"in the midst of you","23:17":"neither shall there be a sodomite of the sons of Israel.","23:18":"or the wages of a dog","23:19":"interest of food","23:20":"that Yahweh your God may bless you in all that you put your hand to","23:21":"you shall not be slack to pay it:  for Yahweh your God will surely require it of you; and it would be sin in you.","23:22":"it shall be no sin in you.","23:23":"a freewill offering","23:24":"then you may eat of grapes your fill at your own pleasure; but you shall not put any in your vessel.","23:25":"then you may pluck the ears with your hand; but you shall not move a sickle to your neighbor's standing grain.","24:1":"and marries her","24:2":"she may go and be another man's [wife].","24:3":"and write her a bill of divorce","24:4":"who sent her away","24:5":"he shall not go out in the army","24:6":"No man shall take the nether or the upper millstone to pledge: for he taketh a man's life to pledge.","24:7":"and he deal with him as a slave","24:8":"that you observe diligently","24:9":"by the way as you came forth out of Egypt.","24:10":"you shall not go into his house to get his pledge.","24:11":"and the man to whom you do lend shall bring forth the pledge outside to you.","24:12":"you shall not sleep with his pledge;","24:13":"that he may sleep in his garment","24:14":"whether he be of your brothers","24:15":"neither shall the sun go down on it; for he is poor","24:16":"neither shall the children be put to death for the fathers: every man shall be put to death for his own sin.","24:17":"[or] to the fatherless","24:18":"and Yahweh your God redeemed you there:  therefore I command you to do this thing.","24:19":"and have forgot a sheaf in the field","24:20":"you shall not go over the boughs again:  it shall be for the foreigner","24:21":"you shall not glean it after you:  it shall be for the foreigner","24:22":"And thou shalt remember that thou wast a bondman in the land of Egypt: therefore I command thee to do this thing.","25:1":"and they come to judgment","25:2":"if the wicked man be worthy to be beaten","25:3":"he shall not exceed; lest","25:4":"Thou shalt not muzzle the ox when he treadeth out the corn.","25:5":"and one of them die","25:6":"that the firstborn whom she bears shall succeed in the name of his brother who is dead","25:7":"then his brother's wife shall go up to the gate to the elders","25:8":"and speak to him: and if he stand","25:9":"and loose his shoe from off his foot","25:10":"The house of him who has his shoe untied.","25:11":"and the wife of the one draws near to deliver her husband out of the hand of him who strikes him","25:12":"your eye shall have no pity.","25:13":"a great and a small.","25:14":"a great and a small.","25:15":"But thou shalt have a perfect and just weight","25:16":"[even] all who do unrighteously","25:17":"Remember what Amalek did unto thee by the way","25:18":"and struck the hindmost of you","25:19":"when Yahweh your God has given you rest from all your enemies round about","26:1":"when you are come in to the land which Yahweh your God gives you for an inheritance","26:2":"which you shall bring in from your land that Yahweh your God gives you; and you shall put it in a basket","26:3":"and tell him","26:4":"and set it down before the altar of Yahweh your God.","26:5":"A Syrian ready to perish was my father; and he went down into Egypt","26:6":"and afflicted us","26:7":"the God of our fathers","26:8":"and with an outstretched arm","26:9":"and has given us this land","26:10":"behold","26:11":"and to your house","26:12":"which is the year of tithing","26:13":"I have put away the holy things out of my house","26:14":"neither have I put away of it","26:15":"from heaven","26:16":"and with all your soul.","26:17":"and that you would walk in his ways","26:18":"as he has promised you","26:19":"in praise","27:1":"saying","27:2":"that you shall set yourself up great stones","27:3":"when you are passed over; that you may go in to the land which Yahweh your God gives you","27:4":"when you are passed over the Jordan","27:5":"an altar of stones:  you shall lift up no iron [tool] on them.","27:6":"Thou shalt build the altar of the LORD thy God of whole stones: and thou shalt offer burnt offerings thereon unto the LORD thy God:","27:7":"and shall eat there; and you shall rejoice before Yahweh your God.","27:8":"And thou shalt write upon the stones all the words of this law very plainly.","27:9":"saying","27:10":"and do his commandments and his statutes","27:11":"saying","27:12":"when you are passed over the Jordan:  Simeon","27:13":"Gad","27:14":"and tell all the men of Israel with a loud voice","27:15":"an abomination to Yahweh","27:16":"Amen.","27:17":"Amen.","27:18":"Amen.","27:19":"fatherless","27:20":"because he has uncovered his father's skirt.  All the people shall say","27:21":"Amen.","27:22":"the daughter of his father","27:23":"Amen.","27:24":"Amen.","27:25":"Amen.","27:26":"Amen.","28:1":"if you shall listen diligently to the voice of Yahweh your God","28:2":"and overtake you","28:3":"and blessed shall you be in the field.","28:4":"and the fruit of your ground","28:5":"Blessed shall be thy basket and thy store.","28:6":"and blessed shall you be when you go out.","28:7":"and shall flee before you seven ways.","28:8":"and in all that you put your hand to; and he will bless you in the land which Yahweh your God gives you.","28:9":"as he has sworn to you; if you shall keep the commandments of Yahweh your God","28:10":"And all people of the earth shall see that thou art called by the name of the LORD; and they shall be afraid of thee.","28:11":"in the fruit of your body","28:12":"to give the rain of your land in its season","28:13":"and not the tail; and you shall be above only","28:14":"to the right hand","28:15":"if you will not listen to the voice of Yahweh your God","28:16":"and cursed shall you be in the field.","28:17":"Cursed shall be thy basket and thy store.","28:18":"and the fruit of your ground","28:19":"and cursed shall you be when you go out.","28:20":"confusion","28:21":"until he has consumed you from off the land","28:22":"and with fever","28:23":"and the earth that is under you shall be iron.","28:24":"until you are destroyed.","28:25":"and shall flee seven ways before them:  and you shall be tossed back and forth among all the kingdoms of the earth.","28:26":"and to the animals of the earth; and there shall be none to frighten them away.","28:27":"and with the tumors","28:28":"and with blindness","28:29":"as the blind gropes in darkness","28:30":"and another man shall lie with her: you shall build a house","28:31":"and you shall not eat of it:  your donkey shall be violently taken away from before your face","28:32":"and fail with longing for them all the day:  and there shall be nothing in the power of your hand.","28:33":"and all your labors","28:34":"So that thou shalt be mad for the sight of thine eyes which thou shalt see.","28:35":"and in the legs","28:36":"and your king whom you shall set over you","28:37":"a proverb","28:38":"and shall gather little in; for the locust shall consume it.","28:39":"but you shall neither drink of the wine","28:40":"but you shall not anoint yourself with the oil; for your olive shall cast [its fruit].","28:41":"but they shall not be yours; for they shall go into captivity.","28:42":"All thy trees and fruit of thy land shall the locust consume.","28:43":"The stranger that is within thee shall get up above thee very high; and thou shalt come down very low.","28:44":"and you shall not lend to him: he shall be the head","28:45":"and shall pursue you","28:46":"and on your seed forever.","28:47":"and with gladness of heart","28:48":"in hunger","28:49":"from the end of the earth","28:50":"that shall not regard the person of the old","28:51":"and the fruit of your ground","28:52":"until your high and fortified walls come down","28:53":"the flesh of your sons and of your daughters","28:54":"and very delicate","28:55":"because he has nothing left him","28:56":"who would not adventure to set the sole of her foot on the ground for delicateness and tenderness","28:57":"and toward her children whom she shall bear; for she shall eat them for want of all things secretly","28:58":"that you may fear this glorious and fearful name","28:59":"and the plagues of your seed","28:60":"which you were afraid of; and they shall cleave to you.","28:61":"and every plague","28:62":"whereas you were as the stars of the sky for multitude; because you didn't listen to the voice of Yahweh your God.","28:63":"and to multiply you","28:64":"from the one end of the earth even to the other end of the earth; and there you shall serve other gods","28:65":"and there shall be no rest for the sole of your foot:  but Yahweh will give you there a trembling heart","28:66":"and shall have no assurance of your life.","28:67":"Would it were even! and at even you shall say","28:68":"by the way of which I said to you","29:1":"besides the covenant which he made with them in Horeb.","29:2":"and said to them","29:3":"the signs","29:4":"and eyes to see","29:5":"and your shoe has not grown old on your foot.","29:6":"neither have you drunk wine or strong drink; that you may know that I am Yahweh your God.","29:7":"Sihon the king of Heshbon","29:8":"and gave it for an inheritance to the Reubenites","29:9":"and do them","29:10":"your tribes","29:11":"your wives","29:12":"and into his oath","29:13":"and that he may be to you a God","29:14":"","29:15":"and also with him who is not here with us this day","29:16":"and how we came through the midst of the nations through which you passed;","29:17":"and their idols","29:18":"or woman","29:19":"when he hears the words of this curse","29:20":"but then the anger of Yahweh and his jealousy will smoke against that man","29:21":"according to all the curses of the covenant that is written in this book of the law.","29:22":"your children who shall rise up after you","29:23":"and salt","29:24":"Why has Yahweh done thus to this land? what means the heat of this great anger?","29:25":"Because they forsook the covenant of Yahweh","29:26":"and worshiped them","29:27":"to bring on it all the curse that is written in this book;","29:28":"and in wrath","29:29":"that we may do all the words of this law.","30:1":"when all these things are come on you","30:2":"and shall obey his voice according to all that I command you this day","30:3":"and have compassion on you","30:4":"from there will Yahweh your God gather you","30:5":"and you shall possess it; and he will do you good","30:6":"and the heart of your seed","30:7":"and on those who hate you","30:8":"and do all his commandments which I command you this day.","30:9":"in the fruit of your body","30:10":"to keep his commandments and his statutes which are written in this book of the law; if you turn to Yahweh your God with all your heart","30:11":"it is not too hard for you","30:12":"that you should say","30:13":"that you should say","30:14":"in your mouth","30:15":"I have set before you this day life and good","30:16":"to walk in his ways","30:17":"and you will not hear","30:18":"that you shall surely perish; you shall not prolong your days in the land","30:19":"that I have set before you life and death","30:20":"to obey his voice","31:1":"And Moses went and spake these words unto all Israel.","31:2":"I am one hundred twenty years old this day; I can no more go out and come in:  and Yahweh has said to me","31:3":"he will go over before you; he will destroy these nations from before you","31:4":"the kings of the Amorites","31:5":"and you shall do to them according to all the commandment which I have commanded you.","31:6":"don't be afraid","31:7":"and said to him in the sight of all Israel","31:8":"he it is who does go before you; he will be with you","31:9":"and delivered it to the priests the sons of Levi","31:10":"saying","31:11":"you shall read this law before all Israel in their hearing.","31:12":"the men and the women and the little ones","31:13":"who have not known","31:14":"Behold","31:15":"And the LORD appeared in the tabernacle in a pillar of a cloud: and the pillar of the cloud stood over the door of the tabernacle.","31:16":"Behold","31:17":"and I will forsake them","31:18":"in that they are turned to other gods.","31:19":"and teach you it the children of Israel:  put it in their mouths","31:20":"flowing with milk and honey","31:21":"when many evils and troubles are come on them","31:22":"and taught it the children of Israel.","31:23":"and said","31:24":"when Moses had made an end of writing the words of this law in a book","31:25":"who bore the ark of the covenant of Yahweh","31:26":"and put it by the side of the ark of the covenant of Yahweh your God","31:27":"and your stiff neck:  behold","31:28":"and your officers","31:29":"and turn aside from the way which I have commanded you; and evil will happen to you in the latter days; because you will do that which is evil in the sight of Yahweh","31:30":"until they were finished.","32:1":"you heavens","32:2":"as the small rain on the tender grass","32:3":"Because I will publish the name of the LORD: ascribe ye greatness unto our God.","32:4":"his work is perfect","32:5":"[they are] not his children","32:6":"foolish people and unwise? Isn't he your father who has bought you?  He has made you","32:7":"and he will show you; your elders","32:8":"when he separated the children of men","32:9":"For the LORD's portion is his people; Jacob is the lot of his inheritance.","32:10":"in the waste howling wilderness. He surrounded him.  He cared for him.  He kept him as the apple of his eye.","32:11":"that flutters over her young","32:12":"So the LORD alone did lead him","32:13":"oil out of the flinty rock;","32:14":"and milk of the flock","32:15":"and kicked.  You have grown fat. You have grown thick.  You have become sleek. Then he forsook God who made him","32:16":"They provoked him to jealousy with strange gods","32:17":"[which were] no God","32:18":"you are unmindful","32:19":"and abhorred [them]","32:20":"I will hide my face from them.  I will see what their end shall be; for they are a very perverse generation","32:21":"They have moved me to jealousy with that which is not God; they have provoked me to anger with their vanities: and I will move them to jealousy with those which are not a people; I will provoke them to anger with a foolish nation.","32:22":"Burns to the lowest Sheol","32:23":"I will heap mischiefs upon them; I will spend mine arrows upon them.","32:24":"and devoured with burning heat and bitter destruction.  I will send the teeth of animals on them","32:25":"and in the chambers","32:26":"I would scatter them afar.  I would make the memory of them to cease from among men;","32:27":"lest their adversaries should judge wrongly","32:28":"For they are a nation void of counsel","32:29":"that they understood this","32:30":"and two put ten thousand to flight","32:31":"even our enemies themselves being judges.","32:32":"of the fields of Gomorrah. Their grapes are grapes of gall","32:33":"The cruel venom of asps.","32:34":"sealed up among my treasures?","32:35":"and recompense","32:36":"and have compassion on his servants","32:37":"Where are their gods","32:38":"And drank the wine of their drink offering?  Let them rise up and help you! Let them be your protection.","32:39":"even I","32:40":"And say","32:41":"My hand take hold on judgment; I will render vengeance to my adversaries","32:42":"from the head of the leaders of the enemy.","32:43":"you nations","32:44":"he and Joshua the son of Nun.","32:45":"And Moses made an end of speaking all these words to all Israel:","32:46":"Set your heart to all the words which I testify to you this day","32:47":"and through this thing you shall prolong your days in the land","32:48":"saying","32:49":"to Mount Nebo","32:50":"and be gathered to your people","32:51":"in the wilderness of Zin; because you didn't sanctify me in the midst of the children of Israel.","32:52":"Yet thou shalt see the land before thee; but thou shalt not go thither unto the land which I give the children of Israel.","33:1":"with which Moses the man of God blessed the children of Israel before his death.","33:2":"Yahweh came from Sinai","33:3":"he loves the people.  All his saints are in your hand. They sat down at your feet; [Everyone] shall receive of your words.","33:4":"An inheritance for the assembly of Jacob.","33:5":"When the heads of the people were gathered","33:6":"and not die; Nor let his men be few.","33:7":"Hear","33:8":"Your Thummim and your Urim are with your godly one","33:9":"and of his mother","33:10":"and Israel your law. They shall put incense before you","33:11":"bless his substance.  Accept the work of his hands. Strike through the hips of those who rise up against him","33:12":"The beloved of Yahweh shall dwell in safety by him.  He covers him all the day long. He dwells between his shoulders.","33:13":"His land is blessed by Yahweh","33:14":"for the precious things of the growth of the moons","33:15":"for the precious things of the everlasting hills","33:16":"the good will of him who lived in the bush{i. e. the burning bush of Exodus 3:3-4.}. Let [the blessing] come on the head of Joseph","33:17":"majesty is his.  His horns are the horns of the wild ox.  With them he shall push the peoples all of them","33:18":"Rejoice","33:19":"for they shall draw out the abundance of the seas","33:20":"He who enlarges Gad is blessed. He dwells as a lioness","33:21":"for there was the lawgiver's portion reserved.  He came [with] the heads of the people. He executed the righteousness of Yahweh","33:22":"Dan is a lion's cub that leaps out of Bashan.","33:23":"Naphtali","33:24":"Asher is blessed with children. Let him be acceptable to his brothers.  Let him dip his foot in oil.","33:25":"so shall your strength be.","33:26":"Jeshurun","33:27":"and said","33:28":"In a land of grain and new wine.  Yes","33:29":"Israel.  Who is like you","34:1":"to the top of Pisgah","34:2":"and the land of Ephraim and Manasseh","34:3":"and the Plain of the valley of Jericho the city of palm trees","34:4":"This is the land which I swore to Abraham","34:5":"according to the word of Yahweh.","34:6":"And he buried him in a valley in the land of Moab","34:7":"nor his natural force abated.","34:8":"And the children of Israel wept for Moses in the plains of Moab thirty days: so the days of weeping and mourning for Moses were ended.","34:9":"and did as Yahweh commanded Moses.","34:10":"whom Yahweh knew face to face","34:11":"which Yahweh sent him to do in the land of Egypt","34:12":"and in all the great terror"}