{"1:1":"the son of David","1:2":"Vanity of vanities","1:3":"What profit hath a man of all his labour which he taketh under the sun?","1:4":"and another generation comes; but the earth remains forever.","1:5":"and the sun goes down","1:6":"and turns around to the north. It turns around continually as it goes","1:7":"yet the sea is not full. To the place where the rivers flow","1:8":"nor the ear filled with hearing.","1:9":"The thing that hath been","1:10":"Behold, this is new? It has been long ago","1:11":"among those that shall come after.","1:12":"the Preacher","1:13":"And I gave my heart to seek and search out by wisdom concerning all things that are done under heaven: this sore travail hath God given to the sons of man to be exercised therewith.","1:14":"all is vanity and a chasing after wind.","1:15":"That which is crooked cannot be made straight: and that which is wanting cannot be numbered.","1:16":"Behold, I have obtained for myself great wisdom above all who were before me in Jerusalem. Yes, my heart has had great experience of wisdom and knowledge.","1:17":"and to know madness and folly. I perceived that this also was a chasing after wind.","1:18":"For in much wisdom is much grief: and he that increaseth knowledge increaseth sorrow.","2:1":"Come now, I will test you with mirth: therefore enjoy pleasure; and behold","2:2":"It is foolishness; and of mirth","2:3":"my heart yet guiding me with wisdom","2:4":"I made me great works; I builded me houses; I planted me vineyards:","2:5":"and I planted trees in them of all kinds of fruit.","2:6":"to water from it the forest where trees were reared.","2:7":"and had servants born in my house.  I also had great possessions of herds and flocks","2:8":"and the treasure of kings and of the provinces.  I got myself male and female singers","2:9":"and increased more than all who were before me in Jerusalem.  My wisdom also remained with me.","2:10":"I didn't keep from them. I didn't withhold my heart from any joy","2:11":"and at the labor that I had labored to do; and behold","2:12":"madness","2:13":"as far as light excels darkness.","2:14":"and the fool walks in darkness-- and yet I perceived that one event happens to them all.","2:15":"As it happens to the fool, so will it happen even to me; and why was I then more wise? Then said I in my heart that this also is vanity.","2:16":"even as of the fool","2:17":"because the work that is worked under the sun was grievous to me; for all is vanity and a chasing after wind.","2:18":"seeing that I must leave it to the man who comes after me.","2:19":"and in which I have shown myself wise under the sun. This also is vanity.","2:20":"Therefore I went about to cause my heart to despair of all the labour which I took under the sun.","2:21":"with knowledge","2:22":"and of the striving of his heart","2:23":"and his travail is grief; yes","2:24":"and make his soul enjoy good in his labor. This also I saw","2:25":"or who can have enjoyment","2:26":"God gives wisdom","3:1":"and a time for every purpose under heaven:","3:2":"and a time to die; a time to plant","3:3":"and a time to heal; a time to break down","3:4":"and a time to laugh; a time to mourn","3:5":"and a time to gather stones together; a time to embrace","3:6":"and a time to lose; a time to keep","3:7":"and a time to sew; a time to keep silence","3:8":"and a time to hate; a time for war","3:9":"What profit hath he that worketh in that wherein he laboureth?","3:10":"I have seen the travail","3:11":"yet so that man can't find out the work that God has done from the beginning even to the end.","3:12":"and to do good as long as they live.","3:13":"and enjoy good in all his labor","3:14":"it shall be forever. Nothing can be added to it","3:15":"and that which is to be has been long ago:  and God seeks again that which is passed away.","3:16":"in the place of justice","3:17":"God will judge the righteous and the wicked; for there is a time there for every purpose and for every work.","3:18":"As for the sons of men, God tests them, so that they may see that they themselves are like animals.,I said in mine heart concerning the estate of the sons of men, that God might manifest them, and that they might see that they themselves are beasts., אָמַרְתִּי אֲנִי בְּלִבִּי עַל־דִּבְרַת בְּנֵי הָאָדָם לְבָרָם הָאֱלֹהִים וְלִרְאוֹת שְׁהֶם־בְּהֵמָה הֵמָּה לָהֶם׃ ‬,I said in my heart: It is because of the sons of men","3:19":"so the other dies.  Yes","3:20":"and all turn to dust again.","3:21":"whether it goes upward","3:22":"than that a man should rejoice in his works; for that is his portion: for who can bring him to see what will be after him?","4:1":"the tears of those who were oppressed","4:2":"Wherefore I praised the dead which are already dead more than the living which are yet alive.","4:3":"better than them both is him who has not yet been","4:4":"Again","4:5":"The fool foldeth his hands together","4:6":"with quietness","4:7":"Then I returned","4:8":"and he has neither son nor brother. There is no end to all of his labor","4:9":"because they have a good reward for their labor.","4:10":"the one will lift up his fellow; but woe to him who is alone when he falls","4:11":"if two lie together","4:12":"two shall withstand him; and a threefold cord is not quickly broken.","4:13":"Better is a poor and a wise child than an old and foolish king","4:14":"even in his kingdom he was born poor.","4:15":"that they were with the youth","4:16":"even of all them over whom he was--yet those who come after shall not rejoice in him. Surely this also is vanity and a chasing after wind.","5:1":"for they don't know that they do evil.","5:2":"and don't let your heart be hasty to utter anything before God; for God is in heaven","5:3":"so a fool's speech with a multitude of words.","5:4":"don't defer to pay it; for he has no pleasure in fools.  Pay that which you vow.","5:5":"than that you should vow and not pay.","5:6":"and destroy the work of your hands?","5:7":"as well as in many words:  but you must fear God.","5:8":"and the violent taking away of justice and righteousness in a district","5:9":"Moreover the profit of the earth is for all: the king himself is served by the field.","5:10":"with increase:  this also is vanity.","5:11":"those who eat them are increased; and what advantage is there to its owner","5:12":"whether he eats little or much; but the abundance of the rich will not allow him to sleep.","5:13":"There is a sore evil which I have seen under the sun","5:14":"and if he has fathered a son","5:15":"naked shall he go again as he came","5:16":"that in all points as he came","5:17":"he is frustrated","5:18":"that which I have seen to be good and proper is for one to eat and to drink","5:19":"and has given him power to eat of it","5:20":"For he shall not much remember the days of his life; because God answereth him in the joy of his heart.","6:1":"and it is heavy on men:","6:2":"wealth","6:3":"and lives many years","6:4":"and departs in darkness","6:5":"Moreover he hath not seen the sun","6:6":"though he live a thousand years twice told","6:7":"and yet the appetite is not filled.","6:8":"that knows how to walk before the living?","6:9":"Better is the sight of the eyes than the wandering of the desire: this is also vanity and vexation of spirit.","6:10":"its name was given long ago; and it is known what man is; neither can he contend with him who is mightier than he.","6:11":"Seeing there be many things that increase vanity","6:12":"all the days of his vain life which he spends like a shadow? For who can tell a man what will be after him under the sun?","7:1":"A good name is better than precious ointment; and the day of death than the day of one's birth.","7:2":"and the living should take this to heart.","7:3":"Sorrow is better than laughter: for by the sadness of the countenance the heart is made better.","7:4":"The heart of the wise is in the house of mourning; but the heart of fools is in the house of mirth.","7:5":"than for a man to hear the song of fools.","7:6":"so is the laughter of the fool.  This also is vanity.","7:7":"Surely oppression maketh a wise man mad; and a gift destroyeth the heart.","7:8":"Better is the end of a thing than the beginning thereof: and the patient in spirit is better than the proud in spirit.","7:9":"for anger rests in the bosom of fools.","7:10":"Why were the former days better than these? For you do not ask wisely about this.","7:11":"it is more excellent for those who see the sun.","7:12":"even as money is a defense; but the excellency of knowledge is that wisdom preserves the life of him who has it.","7:13":"for who can make that straight","7:14":"and in the day of adversity consider; yes","7:15":"and there is a wicked man who lives long in his evil-doing.","7:16":"neither make yourself overly wise. Why should you destroy yourself?","7:17":"neither be foolish.  Why should you die before your time?","7:18":"also from that don't withdraw your hand; for he who fears God will come forth from them all.","7:19":"Wisdom strengtheneth the wise more than ten mighty men which are in the city.","7:20":"who does good and doesn't sin.","7:21":"lest you hear your servant curse you;","7:22":"For oftentimes also thine own heart knoweth that thou thyself likewise hast cursed others.","7:23":"I will be wise; but it was far from me.","7:24":"is far off and exceedingly deep. Who can find it out?","7:25":"and my heart sought to know and to search out","7:26":"whose hands are chains.  Whoever pleases God shall escape from her; but the sinner will be ensnared by her.","7:27":"this have I found","7:28":"Which yet my soul seeketh","7:29":"this only have I found:  that God made man upright; but they search for many schemes.","8:1":"and the hardness of his face is changed.","8:2":"Keep the king's command! because of the oath to God.","8:3":"for he does whatever pleases him","8:4":"What are you doing?","8:5":"and his wise heart will know the time and procedure.","8:6":"although the misery of man is heavy on him.","8:7":"For he knoweth not that which shall be: for who can tell him when it shall be?","8:8":"There is no man that hath power over the spirit to retain the spirit; neither hath he power in the day of death: and there is no discharge in that war; neither shall wickedness deliver those that are given to it.","8:9":"and applied my mind to every work that is done under the sun.  There is a time in which one man has power over another to his hurt.","8:10":"And so I saw the wicked buried","8:11":"therefore the heart of the sons of men is fully set in them to do evil.","8:12":"and lives long","8:13":"neither shall he lengthen days like a shadow; because he doesn't fear God.","8:14":"that there are righteous men to whom it happens according to the work of the wicked.  Again","8:15":"because a man has no better thing under the sun","8:16":"and to see the business that is done on the earth (for also there is that neither day nor night sees sleep with his eyes)","8:17":"that man can't find out the work that is done under the sun","9:1":"even to explore all this: that the righteous","9:2":"to the clean","9:3":"that there is one event to all:  yes also","9:4":"For to him that is joined to all the living there is hope: for a living dog is better than a dead lion.","9:5":"but the dead don't know anything","9:6":"their hatred","9:7":"and drink your wine with a merry heart; for God has already accepted your works.","9:8":"and don't let your head lack oil.","9:9":"which he has given you under the sun","9:10":"do it with your might; for there is no work","9:11":"and saw under the sun","9:12":"and as the birds that are caught in the snare","9:13":"and it seemed great to me.","9:14":"and few men within it; and a great king came against it","9:15":"and he by his wisdom delivered the city; yet no man remembered that same poor man.","9:16":"Wisdom is better than strength.  Nevertheless the poor man's wisdom is despised","9:17":"The words of wise men are heard in quiet more than the cry of him that ruleth among fools.","9:18":"Wisdom is better than weapons of war: but one sinner destroyeth much good.","10:1":"Dead flies cause the ointment of the apothecary to send forth a stinking savour: so doth a little folly him that is in reputation for wisdom and honour.","10:2":"but a fool's heart at his left.","10:3":"when the fool walks by the way","10:4":"don't leave your place; for gentleness lays great offenses to rest.","10:5":"the sort of error which proceeds from the ruler.","10:6":"and the rich sit in a low place.","10:7":"and princes walking like servants on the earth.","10:8":"He that diggeth a pit shall fall into it; and whoso breaketh an hedge","10:9":"Whoso removeth stones shall be hurt therewith; and he that cleaveth wood shall be endangered thereby.","10:10":"and one doesn't sharpen the edge","10:11":"then is there no profit for the charmer's tongue.","10:12":"The words of a wise man's mouth are gracious; but the lips of a fool will swallow up himself.","10:13":"The beginning of the words of his mouth is foolishness: and the end of his talk is mischievous madness.","10:14":"who can tell him?","10:15":"The labour of the foolish wearieth every one of them","10:16":"land","10:17":"land","10:18":"By much slothfulness the building decayeth; and through idleness of the hands the house droppeth through.","10:19":"and wine makes the life glad; and money is the answer for all things.","10:20":"no","11:1":"Cast thy bread upon the waters: for thou shalt find it after many days.","11:2":"yes","11:3":"they empty themselves on the earth; and if a tree falls toward the south","11:4":"He that observeth the wind shall not sow; and he that regardeth the clouds shall not reap.","11:5":"nor how the bones grow in the womb of her who is with child; even so you don't know the work of God who does all.","11:6":"and in the evening don't withhold your hand; for you don't know which will prosper","11:7":"and a pleasant thing it is for the eyes to see the sun.","11:8":"if a man lives many years","11:9":"young man","11:10":"and put away evil from your flesh; for youth and the dawn of life are vanity.","12:1":"before the evil days come","12:2":"the light","12:3":"and the strong men shall bow themselves","12:4":"and one shall rise up at the voice of a bird","12:5":"they shall be afraid of heights","12:6":"or the golden bowl is broken","12:7":"and the spirit returns to God who gave it.","12:8":"says the Preacher.  All is vanity!","12:9":"because the Preacher was wise","12:10":"and that which was written blamelessly","12:11":"which are given from one shepherd.","12:12":"my son","12:13":"and keep his commandments; for this is the whole duty of man.","12:14":"with every hidden thing"}