{"1:1":"an apostle of Christ Jesus through the will of God","1:2":"Grace be to you","1:3":"who has blessed us with every spiritual blessing in the heavenly places in Christ;","1:4":"that we would be holy and without blemish before him in love;","1:5":"according to the good pleasure of his desire","1:6":"by which he freely bestowed favor on us in the Beloved","1:7":"the forgiveness of our trespasses","1:8":"","1:9":"according to his good pleasure which he purposed in him","1:10":"to sum up all things in Christ","1:11":"having been foreordained according to the purpose of him who works all things after the counsel of his will;","1:12":"we who had before hoped in Christ:","1:13":"having heard the word of the truth","1:14":"to the redemption of God's own possession","1:15":"having heard of the faith in the Lord Jesus which is among you","1:16":"making mention of you in my prayers","1:17":"the Father of glory","1:18":"that you may know what is the hope of his calling","1:19":"according to that working of the strength of his might","1:20":"when he raised him from the dead","1:21":"and authority","1:22":"and gave him to be head over all things for the assembly","1:23":"the fullness of him who fills all in all.","2:1":"","2:2":"according to the prince of the powers of the air","2:3":"doing the desires of the flesh and of the mind","2:4":"being rich in mercy","2:5":"made us alive together with Christ (by grace you have been saved)","2:6":"and made us to sit with him in the heavenly places in Christ Jesus","2:7":"That in the ages to come he might shew the exceeding riches of his grace in his kindness toward us through Christ Jesus.","2:8":"and that not of yourselves; it is the gift of God","2:9":"that no one would boast.","2:10":"created in Christ Jesus for good works","2:11":"the Gentiles in the flesh","2:12":"alienated from the commonwealth of Israel","2:13":"But now in Christ Jesus ye who sometimes were far off are made nigh by the blood of Christ.","2:14":"who made both one","2:15":"the law of commandments contained in ordinances","2:16":"having killed the hostility thereby.","2:17":"And came and preached peace to you which were afar off","2:18":"For through him we both have access by one Spirit unto the Father.","2:19":"but you are fellow citizens with the saints","2:20":"Christ Jesus himself being the chief cornerstone;","2:21":"fitted together","2:22":"In whom ye also are builded together for an habitation of God through the Spirit.","3:1":"Paul","3:2":"If ye have heard of the dispensation of the grace of God which is given me to you-ward:","3:3":"as I wrote before in few words","3:4":"when you read","3:5":"as it has now been revealed to his holy apostles and prophets in the Spirit;","3:6":"and fellow members of the body","3:7":"according to the gift of that grace of God which was given me according to the working of his power.","3:8":"the very least of all saints","3:9":"who created all things through Jesus Christ;","3:10":"","3:11":"According to the eternal purpose which he purposed in Christ Jesus our Lord:","3:12":"In whom we have boldness and access with confidence by the faith of him.","3:13":"which are your glory.","3:14":"I bow my knees to the Father of our Lord Jesus Christ","3:15":"","3:16":"according to the riches of his glory","3:17":"being rooted and grounded in love","3:18":"","3:19":"that you may be filled with all the fullness of God.","3:20":"according to the power that works in us","3:21":"Unto him be glory in the church by Christ Jesus throughout all ages","4:1":"the prisoner in the Lord","4:2":"with patience","4:3":"Endeavouring to keep the unity of the Spirit in the bond of peace.","4:4":"and one Spirit","4:5":"one faith","4:6":"who is over all","4:7":"But unto every one of us is given grace according to the measure of the gift of Christ.","4:8":"When he ascended on high, he led captivity captive, and gave gifts to men.{Psalm 68:18}","4:9":"He ascended, what is it but that he also first descended into the lower parts of the earth?","4:10":"that he might fill all things.","4:11":"prophets; and some","4:12":"to the work of serving","4:13":"and of the knowledge of the Son of God","4:14":"tossed back and forth and carried about with every wind of doctrine","4:15":"we may grow up in all things into him","4:16":"being fitted and knit together through that which every joint supplies","4:17":"and testify in the Lord","4:18":"alienated from the life of God","4:19":"to work all uncleanness with greediness.","4:20":"But ye have not so learned Christ;","4:21":"and were taught in him","4:22":"as concerning your former way of life","4:23":"","4:24":"who in the likeness of God has been created in righteousness and holiness of truth.","4:25":"putting away falsehood","4:26":"","4:27":"Neither give place to the devil.","4:28":"working with his hands the thing that is good","4:29":"but such as is good for building up as the need may be","4:30":"in whom you were sealed for the day of redemption.","4:31":"wrath","4:32":"tenderhearted","5:1":"as beloved children.","5:2":"even as Christ also loved you","5:3":"and all uncleanness","5:4":"nor foolish talking","5:5":"that no sexually immoral person","5:6":"the wrath of God comes on the children of disobedience.","5:7":"Be not ye therefore partakers with them.","5:8":"but are now light in the Lord. Walk as children of light","5:9":"","5:10":"Proving what is acceptable unto the Lord.","5:11":"but rather even reprove them.","5:12":"it is a shame even to speak of.","5:13":"when they are reproved","5:14":"Awake, you who sleep, and arise from the dead, and Christ will shine on you.","5:15":"not as unwise","5:16":"because the days are evil.","5:17":"but understand what the will of the Lord is.","5:18":"in which is dissipation","5:19":"hymns","5:20":"to God","5:21":"Submitting yourselves one to another in the fear of God.","5:22":"be subject to your own husbands","5:23":"and Christ also is the head of the assembly","5:24":"so let the wives also be to their own husbands in everything.","5:25":"love your wives","5:26":"having cleansed it by the washing of water with the word","5:27":"not having spot or wrinkle or any such thing; but that it should be holy and without blemish.","5:28":"So ought men to love their wives as their own bodies. He that loveth his wife loveth himself.","5:29":"even as the Lord also does the assembly;","5:30":"of his flesh and bones.","5:31":"For this cause shall a man leave his father and mother","5:32":"but I speak concerning Christ and of the assembly.","5:33":"Nevertheless let every one of you in particular so love his wife even as himself; and the wife see that she reverence her husband.","6:1":"obey your parents in the Lord","6:2":"Honour thy father and mother; which is the first commandment with promise;","6:3":"That it may be well with thee","6:4":"don't provoke your children to wrath","6:5":"be obedient to those who according to the flesh are your masters","6:6":"as men pleasers; but as servants of Christ","6:7":"as to the Lord","6:8":"he will receive the same again from the Lord","6:9":"do the same things to them","6:10":"be strong in the Lord","6:11":"that you may be able to stand against the wiles of the devil.","6:12":"but against the principalities","6:13":"put on the whole armor of God","6:14":"having the utility belt of truth buckled around your waist","6:15":"And your feet shod with the preparation of the gospel of peace;","6:16":"taking up the shield of faith","6:17":"and the sword of the Spirit","6:18":"praying at all times in the Spirit","6:19":"that utterance may be given to me in opening my mouth","6:20":"as I ought to speak.","6:21":"how I am doing","6:22":"that you may know our state","6:23":"and love with faith","6:24":"Grace be with all them that love our Lord Jesus Christ in sincerity. Amen."}