{"1:1":"over one hundred twenty-seven provinces)","1:2":"when the King Ahasuerus sat on the throne of his kingdom","1:3":"he made a feast for all his princes and his servants; the power of Persia and Media","1:4":"even one hundred eighty days.","1:5":"the king made a seven day feast for all the people who were present in Shushan the palace","1:6":"green","1:7":"including royal wine in abundance","1:8":"the drinking was not compulsory; for so the king had instructed all the officials of his house","1:9":"Also Vashti the queen made a feast for the women in the royal house which belonged to king Ahasuerus.","1:10":"when the heart of the king was merry with wine","1:11":"to show the people and the princes her beauty; for she was beautiful.","1:12":"and his anger burned in him.","1:13":"who knew the times","1:14":"Shethar","1:15":"What shall we do unto the queen Vashti according to law","1:16":"Vashti the queen has not done wrong to just the king, but also to all the princes, and to all the people who are in all the provinces of the King Ahasuerus.,And Memucan answered before the king and the princes, Vashti the queen hath not done wrong to the king only, but also to all the princes, and to all the people that are in all the provinces of the king Ahasuerus.,  וַיֹּאמֶר *מומכן **מְמוּכָן לִפְנֵי הַמֶּלֶךְ וְהַשָּׂרִים לֹא עַל־הַמֶּלֶךְ לְבַדּוֹ עָוְתָה וַשְׁתִּי הַמַּלְכָּה כִּי עַל־כָּל־הַשָּׂרִים וְעַל־כָּל־הָעַמִּים אֲשֶׁר בְּכָל־מְדִינוֹת הַמֶּלֶךְ אֲחַשְׁוֵרוֹשׁ׃ ‬,And Memucan answered before the king and the princes: Vashti the queen hath not done wrong to the king only","1:17":"causing them to show contempt for their husbands","1:18":"the princesses of Persia and Media who have heard of the queen's deed will tell all the king's princes. This will cause much contempt and wrath.","1:19":"let a royal commandment go from him","1:20":"all the wives will give their husbands honor","1:21":"and the king did according to the word of Memucan:","1:22":"into every province according to its writing","2:1":"when the wrath of King Ahasuerus was pacified","2:2":"Let beautiful young virgins be sought for the king.,Then said the king's servants that ministered unto him, Let there be fair young virgins sought for the king:,  וַיֹּאמְרוּ נַעֲרֵי־הַמֶּלֶךְ מְשָׁרְתָיו יְבַקְשׁוּ לַמֶּלֶךְ נְעָרוֹת בְּתוּלוֹת טוֹבוֹת מַרְאֶה׃ ‬,Then said the king's servants that ministered unto him: Let there be sought for the king young virgins fair to look on;","2:3":"that they may gather together all the beautiful young virgins to the citadel of Susa","2:4":"καὶ ἡ γυνή ἣ ἂν ἀρέσῃ τῷ βασιλεῖ βασιλεύσει ἀντὶ αστιν καὶ ἤρεσεν τῷ βασιλεῖ τὸ πρᾶγμα καὶ ἐποίησεν οὕτως","2:5":"whose name was Mordecai","2:6":"whom Nebuchadnezzar the king of Babylon had carried away.","2:7":"that is","2:8":"when the king's commandment and his decree was heard","2:9":"and she obtained kindness from him. He quickly gave her cosmetics and her portions of food","2:10":"because Mordecai had instructed her that she should not make it known.","2:11":"to find out how Esther did","2:12":"six months with oil of myrrh","2:13":"Then thus came every maiden unto the king; whatsoever she desired was given her to go with her out of the house of the women unto the king's house.","2:14":"and on the next day she returned into the second women's house","2:15":"the daughter of Abihail the uncle of Mordecai","2:16":"which is the month Tebeth","2:17":"and she obtained favor and kindness in his sight more than all the virgins; so that he set the royal crown on her head","2:18":"even Esther's feast; and he proclaimed a holiday in the provinces","2:19":"Mordecai was sitting in the king's gate.","2:20":"as Mordecai had charged her; for Esther obeyed Mordecai","2:21":"while Mordecai was sitting in the king's gate","2:22":"who informed Esther the queen; and Esther informed the king in Mordecai's name.","2:23":"and it was found to be so","3:1":"and advanced him","3:2":"and paid homage to Haman; for the king had so commanded concerning him.  But Mordecai didn't bow down or pay him homage.","3:3":"who were in the king's gate","3:4":"when they spoke daily to him","3:5":"nor pay him homage","3:6":"for they had made known to him Mordecai's people. Therefore Haman sought to destroy all the Jews who were throughout the whole kingdom of Ahasuerus","3:7":"which is the month Nisan","3:8":"There is a certain people scattered abroad and dispersed among the peoples in all the provinces of your kingdom, and their laws are different than other people's. They don't keep the king's laws. Therefore it is not for the king's profit to allow them to remain.,And Haman said unto king Ahasuerus, There is a certain people scattered abroad and dispersed among the people in all the provinces of thy kingdom; and their laws are diverse from all people; neither keep they the king's laws: therefore it is not for the king's profit to suffer them.,  וַיֹּאמֶר הָמָן לַמֶּלֶךְ אֲחַשְׁוֵרוֹשׁ יֶשְׁנוֹ עַם־אֶחָד מְפֻזָּר וּמְפֹרָד בֵּין הָעַמִּים בְּכֹל מְדִינוֹת מַלְכוּתֶךָ וְדָתֵיהֶם שֹׁנוֹת מִכָּל־עָם וְאֶת־דָּתֵי הַמֶּלֶךְ אֵינָם עֹשִׂים וְלַמֶּלֶךְ אֵין־שֹׁוֶה לְהַנִּיחָם׃ ‬,And Haman said unto king Ahasuerus: There is a certain people scattered abroad and dispersed among the peoples in all the provinces of thy kingdom; and their laws are diverse from those of every people; neither keep they the king's laws; therefore it profiteth not the king to suffer them.","3:9":"let it be written that they be destroyed; and I will pay ten thousand talents of silver into the hands of those who are in charge of the king's business","3:10":"and gave it to Haman the son of Hammedatha the Agagite","3:11":"The silver is given to you, the people also, to do with them as it seems good to you.","3:12":"on the thirteenth day of the month; and all that Haman commanded was written to the king's satraps","3:13":"to destroy","3:14":"that the decree should be given out in every province","3:15":"and the decree was given out in the citadel of Susa. The king and Haman sat down to drink; but the city of Shushan was perplexed.","4:1":"Mordecai tore his clothes","4:2":"for no one is allowed inside the king's gate clothed with sackcloth.","4:3":"wherever the king's commandment and his decree came","4:4":"and the queen was exceedingly grieved.  She sent clothing to Mordecai","4:5":"one of the king's eunuchs","4:6":"to city square which was before the king's gate.","4:7":"and the exact sum of the money that Haman had promised to pay to the king's treasuries for the destruction of the Jews.","4:8":"to show it to Esther","4:9":"And Hatach came and told Esther the words of Mordecai.","4:10":"and gave him a message to Mordecai:","4:11":"All the king's servants","4:12":"And they told to Mordecai Esther's words.","4:13":"Don't think to yourself that you will escape in the king's house any more than all the Jews.,Then Mordecai commanded to answer Esther, Think not with thyself that thou shalt escape in the king's house, more than all the Jews.,  וַיֹּאמֶר מָרְדֳּכַי לְהָשִׁיב אֶל־אֶסְתֵּר אַל־תְּדַמִּי בְנַפְשֵׁךְ לְהִמָּלֵט בֵּית־הַמֶּלֶךְ מִכָּל־הַיְּהוּדִים׃ ‬,Then Mordecai bade them to return answer unto Esther: Think not with thyself that thou shalt escape in the king's house","4:14":"then relief and deliverance will come to the Jews from another place","4:15":"","4:16":"Go","4:17":"and did according to all that Esther had commanded him.","5:1":"and stood in the inner court of the king's house","5:2":"she obtained favor in his sight; and the king held out to Esther the golden scepter that was in his hand. So Esther came near","5:3":"What would you like, queen Esther?  What is your request?  It shall be given you even to the half of the kingdom.","5:4":"If it seems good to the king, let the king and Haman come today to the banquet that I have prepared for him.","5:5":"Bring Haman quickly, so that it may be done as Esther has said.  So the king and Haman came to the banquet that Esther had prepared.","5:6":"What is your petition?  It shall be granted you.  What is your request? Even to the half of the kingdom it shall be performed.","5:7":"My petition and my request is this.,Then answered Esther, and said, My petition and my request is;,  וַתַּעַן אֶסְתֵּר וַתֹּאמַר שְׁאֵלָתִי וּבַקָּשָׁתִי׃ ‬,Then answered Esther, and said: My petition and my request is","5:8":"and if it please the king to grant my petition and to perform my request","5:9":"but when Haman saw Mordecai in the king's gate","5:10":"and went home. There","5:11":"the multitude of his children","5:12":"Yes, Esther the queen let no man come in with the king to the banquet that she had prepared but myself; and tomorrow I am also invited by her together with the king.,Haman said moreover, Yea, Esther the queen did let no man come in with the king unto the banquet that she had prepared but myself; and to morrow am I invited unto her also with the king.,  וַיֹּאמֶר הָמָן אַף לֹא־הֵבִיאָה אֶסְתֵּר הַמַּלְכָּה עִם־הַמֶּלֶךְ אֶל־הַמִּשְׁתֶּה אֲשֶׁר־עָשָׂתָה כִּי אִם־אוֹתִי וְגַם־לְמָחָר אֲנִי קָרוּא־לָהּ עִם־הַמֶּלֶךְ׃ ‬,Haman said moreover: Yea","5:13":"so long as I see Mordecai the Jew sitting at the king's gate.,Yet all this availeth me nothing, so long as I see Mordecai the Jew sitting at the king's gate.,  וְכָל־זֶה אֵינֶנּוּ שֹׁוֶה לִי בְּכָל־עֵת אֲשֶׁר אֲנִי רֹאֶה אֶת־מָרְדֳּכַי הַיְּהוּדִי יוֹשֵׁב בְּשַׁעַר הַמֶּלֶךְ׃ ‬,Yet all this availeth me nothing, so long as I see Mordecai the Jew sitting at the king's gate.","5:14":"Let a gallows be made fifty cubits high, and in the morning speak to the king about hanging Mordecai on it. Then go in merrily with the king to the banquet. This pleased Haman","6:1":"the king couldn't sleep.  He commanded the book of records of the chronicles to be brought","6:2":"two of the king's eunuchs","6:3":"What honor and dignity has been bestowed on Mordecai for this?  Then the king's servants who attended him said","6:4":"Who is in the court?  Now Haman had come into the outer court of the king's house","6:5":"Behold, Haman stands in the court. The king said","6:6":"What shall be done to the man whom the king delights to honor? Now Haman said in his heart","6:7":"For the man whom the king delights to honor,,And Haman answered the king, For the man whom the king delighteth to honour,,  וַיֹּאמֶר הָמָן אֶל־הַמֶּלֶךְ אִישׁ אֲשֶׁר הַמֶּלֶךְ חָפֵץ בִּיקָרוֹ׃ ‬,And Haman said unto the king: For the man whom the king delighteth to honour","6:8":"and the horse that the king rides on","6:9":"that they may array the man whom the king delights to honor with them","6:10":"Hurry and take the clothing and the horse, as you have said, and do this for Mordecai the Jew, who sits at the king's gate.  Let nothing fail of all that you have spoken.","6:11":"and arrayed Mordecai","6:12":"but Haman hurried to his house","6:13":"If Mordecai, before whom you have begun to fall, is of Jewish descent, you will not prevail against him, but you will surely fall before him.","6:14":"the king's eunuchs came","7:1":"So the king and Haman came to banquet with Esther the queen.","7:2":"What is your petition, queen Esther?  It shall be granted you.  What is your request?  Even to the half of the kingdom it shall be performed.","7:3":"If I have found favor in your sight, O king, and if it please the king, let my life be given me at my petition, and my people at my request.,Then Esther the queen answered and said, If I have found favour in thy sight, O king, and if it please the king, let my life be given me at my petition, and my people at my request:,  וַתַּעַן אֶסְתֵּר הַמַּלְכָּה וַתֹּאמַר אִם־מָצָאתִי חֵן בְּעֵינֶיךָ הַמֶּלֶךְ וְאִם־עַל־הַמֶּלֶךְ טוֹב תִּנָּתֶן־לִי נַפְשִׁי בִּשְׁאֵלָתִי וְעַמִּי בְּבַקָּשָׁתִי׃ ‬,Then Esther the queen answered and said: If I have found favour in thy sight","7:4":"I and my people","7:5":"Who is he, and where is he who dared presume in his heart to do so?","7:6":"An adversary and an enemy, even this wicked Haman!  Then Haman was afraid before the king and the queen.","7:7":"And the king arising from the banquet of wine in his wrath went into the palace garden: and Haman stood up to make request for his life to Esther the queen; for he saw that there was evil determined against him by the king.","7:8":"Will he even assault the queen in front of me in the house?  As the word went out of the king's mouth","7:9":"one of the eunuchs who were with the king said","7:10":"So they hanged Haman on the gallows that he had prepared for Mordecai. Then was the king's wrath pacified.","8:1":"King Ahasuerus gave the house of Haman","8:2":"which he had taken from Haman","8:3":"and fell down at his feet","8:4":"and stood before the king.","8:5":"If it pleases the king, and if I have found favor in his sight, and the thing seem right to the king, and I am pleasing in his eyes, let it be written to reverse the letters devised by Haman, the son of Hammedatha the Agagite, which he wrote to destroy the Jews who are in all the king's provinces.,And said, If it please the king, and if I have favour in his sight, and the thing seem right before the king, and I be pleasing in his eyes, let it be written to reverse the letters devised by Haman the son of Hammedatha the Agagite, which he wrote to destroy the Jews which are in all the king's provinces:,  וַתֹּאמֶר אִם־עַל־הַמֶּלֶךְ טוֹב וְאִם־מָצָאתִי חֵן לְפָנָיו וְכָשֵׁר הַדָּבָר לִפְנֵי הַמֶּלֶךְ וְטוֹבָה אֲנִי בְּעֵינָיו יִכָּתֵב לְהָשִׁיב אֶת־הַסְּפָרִים מַחֲשֶׁבֶת הָמָן בֶּן־הַמְּדָתָא הָאֲגָגִי אֲשֶׁר כָּתַב לְאַבֵּד אֶת־הַיְּהוּדִים אֲשֶׁר בְּכָל־מְדִינוֹת הַמֶּלֶךְ׃ ‬,And she said: If it please the king","8:6":"πῶς γὰρ δυνήσομαι ἰδεῖν τὴν κάκωσιν τοῦ λαοῦ μου καὶ πῶς δυνήσομαι σωθῆναι ἐν τῇ ἀπωλείᾳ τῆς πατρίδος μου","8:7":"See, I have given Esther the house of Haman, and him they have hanged on the gallows, because he laid his hand on the Jews.,Then the king Ahasuerus said unto Esther the queen and to Mordecai the Jew, Behold, I have given Esther the house of Haman, and him they have hanged upon the gallows, because he laid his hand upon the Jews.,  וַיֹּאמֶר הַמֶּלֶךְ אֲחַשְׁוֵרֹשׁ לְאֶסְתֵּר הַמַּלְכָּה וּלְמָרְדֳּכַי הַיְּהוּדִי הִנֵּה בֵית־הָמָן נָתַתִּי לְאֶסְתֵּר וְאֹתוֹ תָּלוּ עַל־הָעֵץ עַל אֲשֶׁר־שָׁלַח יָדוֹ *ביהודיים **בַּיְּהוּדִים׃ ‬,Then the king Ahasuerus said unto Esther the queen and to Mordecai the Jew: Behold","8:8":"as it pleases you","8:9":"in the third month Sivan","8:10":"and sealed it with the king's ring","8:11":"the king granted the Jews who were in every city to gather themselves together","8:12":"on the thirteenth day of the twelfth month","8:13":"that the decree should be given out in every province","8:14":"hastened and pressed on by the king's commandment. The decree was given out in the citadel of Susa.","8:15":"and with a great crown of gold","8:16":"gladness","8:17":"and in every city","9:1":"which is the month Adar","9:2":"to lay hands on those who wanted to harm them.  No one could withstand them","9:3":"the satraps","9:4":"and his fame went out throughout all the provinces; for the man Mordecai grew greater and greater.","9:5":"and with slaughter and destruction","9:6":"the Jews killed and destroyed five hundred men.","9:7":"Dalphon","9:8":"Adalia","9:9":"Arisai","9:10":"the Jew's enemy","9:11":"the number of those who were slain in the citadel of Susa was brought before the king.","9:12":"The Jews have slain and destroyed five hundred men in the citadel of Susa, including the ten sons of Haman; what then have they done in the rest of the king's provinces!  Now what is your petition? It shall be granted you.  What is your further request? It shall be done.","9:13":"If it pleases the king, let it be granted to the Jews who are in Shushan to do tomorrow also according to this day's decree, and let Haman's ten sons be hanged on the gallows.","9:14":"And the king commanded it so to be done: and the decree was given at Shushan; and they hanged Haman's ten sons.","9:15":"and killed three hundred men in Shushan; but they didn't lay their hand on the spoil.","9:16":"defended their lives","9:17":"On the thirteenth day of the month Adar; and on the fourteenth day of the same rested they","9:18":"they rested","9:19":"who live in the unwalled towns","9:20":"and sent letters to all the Jews who were in all the provinces of the king Ahasuerus","9:21":"","9:22":"and the month which was turned to them from sorrow to gladness","9:23":"as Mordecai had written to them;","9:24":"the Agagite","9:25":"he commanded by letters that his wicked device","9:26":"and of that which they had seen concerning this matter","9:27":"and imposed on themselves","9:28":"every family","9:29":"the daughter of Abihail","9:30":"to the hundred twenty-seven provinces of the kingdom of Ahasuerus","9:31":"as Mordecai the Jew and Esther the queen had decreed","9:32":"And the decree of Esther confirmed these matters of Purim; and it was written in the book.","10:1":"and on the islands of the sea.","10:2":"and the full account of the greatness of Mordecai","10:3":"and great among the Jews"}