{"1:1":"in the fourth [month]","1:2":"which was the fifth year of king Jehoiachin's captivity","1:3":"the son of Buzi","1:4":"and behold","1:5":"Also out of the midst thereof came the likeness of four living creatures. And this was their appearance; they had the likeness of a man.","1:6":"and each one of them had four wings.","1:7":"And their feet were straight feet; and the sole of their feet was like the sole of a calf's foot: and they sparkled like the colour of burnished brass.","1:8":"And they had the hands of a man under their wings on their four sides; and they four had their faces and their wings.","1:9":"Their wings were joined one to another; they turned not when they went; they went every one straight forward.","1:10":"they had the face of a man; and they four had the face of a lion on the right side; and they four had the face of an ox on the left side; they four had also the face of an eagle.","1:11":"and two covered their bodies.","1:12":"they went; they didn't turn when they went.","1:13":"their appearance was like burning coals of fire","1:14":"And the living creatures ran and returned as the appearance of a flash of lightning.","1:15":"behold","1:16":"The appearance of the wheels and their work was like unto the colour of a beryl: and they four had one likeness: and their appearance and their work was as it were a wheel in the middle of a wheel.","1:17":"they went in their four directions: they didn't turn when they went.","1:18":"they were high and dreadful; and they four had their rims full of eyes round about.","1:19":"the wheels went beside them; and when the living creatures were lifted up from the earth","1:20":"they went; there was the spirit to go: and the wheels were lifted up beside them; for the spirit of the living creature was in the wheels.","1:21":"these went; and when those stood","1:22":"like the awesome crystal to look on","1:23":"the one toward the other:  each one had two which covered on this side","1:24":"I heard the noise of their wings like the noise of great waters","1:25":"they let down their wings.","1:26":"as the appearance of a sapphire{or","1:27":"as the appearance of fire within it round about","1:28":"so was the appearance of the brightness round about. This was the appearance of the likeness of the glory of Yahweh. When I saw it","2:1":"Son of man","2:2":"and set me on my feet; and I heard him who spoke to me.","2:3":"Son of man","2:4":"Thus says the Lord Yahweh.","2:5":"whether they will hear","2:6":"son of man","2:7":"whether they will hear","2:8":"son of man","2:9":"behold","2:10":"and mourning","3:1":"Son of man","3:2":"and he caused me to eat the scroll.","3:3":"Son of man","3:4":"Son of man","3:5":"but to the house of Israel;","3:6":"whose words you can not understand.  Surely","3:7":"But the house of Israel will not hearken unto thee; for they will not hearken unto me: for all the house of Israel are impudent and hardhearted.","3:8":"I have made your face hard against their faces","3:9":"neither be dismayed at their looks","3:10":"Son of man","3:11":"get you to them of the captivity","3:12":"and I heard behind me the voice of a great rushing","3:13":"and the noise of the wheels beside them","3:14":"and took me away; and I went in bitterness","3:15":"that lived by the river Chebar","3:16":"that the word of Yahweh came to me","3:17":"I have made you a watchman to the house of Israel: therefore hear the word at my mouth","3:18":"You shall surely die; and you give him no warning","3:19":"and he doesn't turn from his wickedness","3:20":"when a righteous man does turn from his righteousness","3:21":"that the righteous not sin","3:22":"Arise","3:23":"and went forth into the plain:  and behold","3:24":"and set me on my feet; and he spoke with me","3:25":"son of man","3:26":"that you shall be mute","3:27":"I will open your mouth","4:1":"son of man","4:2":"and build forts against it","4:3":"and set it for a wall of iron between you and the city:  and set your face toward it","4:4":"and lay the iniquity of the house of Israel on it; [according to] the number of the days that you shall lie on it","4:5":"even three hundred ninety days: so shall you bear the iniquity of the house of Israel.","4:6":"when you have accomplished these","4:7":"with your arm uncovered; and you shall prophesy against it.","4:8":"I lay bands on you","4:9":"and barley","4:10":"twenty shekels a day:  from time to time shall you eat it.","4:11":"the sixth part of a hin: from time to time shall you drink.","4:12":"and you shall bake it in their sight with dung that comes out of man.","4:13":"Even thus shall the children of Israel eat their bread unclean","4:14":"Ah Lord Yahweh! behold","4:15":"Behold","4:16":"Son of man","4:17":"and be dismayed one with another","5:1":"son of man","5:2":"when the days of the siege are fulfilled; and you shall take a third part","5:3":"and bind them in your skirts.","5:4":"and cast them into the midst of the fire","5:5":"and countries are round about her.","5:6":"and against my statutes more than the countries that are round about her; for they have rejected my ordinances","5:7":"and have not walked in my statutes","5:8":"I","5:9":"and whereunto I will not do any more the like","5:10":"and the sons shall eat their fathers; and I will execute judgments on you; and the whole remnant of you will I scatter to all the winds.","5:11":"as I live","5:12":"and with famine shall they be consumed in the midst of you; and a third part shall fall by the sword round about you; and a third part I will scatter to all the winds","5:13":"and I will cause my wrath toward them to rest","5:14":"in the sight of all that pass by.","5:15":"an instruction and an astonishment","5:16":"that are for destruction","5:17":"and they shall bereave you; and pestilence and blood shall pass through you; and I will bring the sword on you:  I","6:1":"saying","6:2":"set your face toward the mountains of Israel","6:3":"You mountains of Israel","6:4":"and your incense altars shall be broken; and I will cast down your slain men before your idols.","6:5":"And I will lay the dead carcases of the children of Israel before their idols; and I will scatter your bones round about your altars.","6:6":"and the high places shall be desolate; that your altars may be laid waste and made desolate","6:7":"and you shall know that I am Yahweh.","6:8":"in that you shall have some that escape the sword among the nations","6:9":"how that I have been broken with their lewd heart","6:10":"And they shall know that I am the LORD","6:11":"and stamp with your foot","6:12":"He that is far off shall die of the pestilence; and he that is near shall fall by the sword; and he that remaineth and is besieged shall die by the famine: thus will I accomplish my fury upon them.","6:13":"when their slain men shall be among their idols round about their altars","6:14":"and make the land desolate and waste","7:1":"saying","7:2":"son of man","7:3":"and I will send my anger on you","7:4":"neither will I have pity; but I will bring your ways on you","7:5":"an only evil; behold","7:6":"the end is come; it awakes against you; behold","7:7":"inhabitant of the land: the time is come","7:8":"and accomplish my anger against you","7:9":"neither will I have pity: I will bring on you according to your ways; and your abominations shall be in the midst of you; and you shall know that I","7:10":"the day","7:11":"nor of their multitude","7:12":"the day draws near:  don't let the buyer rejoice","7:13":"although they be yet alive:  for the vision is touching the whole multitude of it","7:14":"and have made all ready; but none goes to the battle; for my wrath is on all the multitude of it.","7:15":"and the pestilence and the famine within: he who is in the field shall die with the sword: and he who is in the city","7:16":"and shall be on the mountains like doves of the valleys","7:17":"and all knees shall be weak as water.","7:18":"and horror shall cover them; and shame shall be on all faces","7:19":"and their gold shall be as an unclean thing; their silver and their gold shall not be able to deliver them in the day of the wrath of Yahweh: they shall not satisfy their souls","7:20":"he set it in majesty; but they made the images of their abominations [and] their detestable things therein:  therefore have I made it to them as an unclean thing.","7:21":"and to the wicked of the earth for a spoil; and they shall profane it.","7:22":"and they shall profane my secret [place]; and robbers shall enter into it","7:23":"and the city is full of violence.","7:24":"and they shall possess their houses:  I will also make the pride of the strong to cease; and their holy places shall be profaned.","7:25":"and there shall be none.","7:26":"and rumor shall be on rumor; and they shall seek a vision of the prophet; but the law shall perish from the priest","7:27":"and the prince shall be clothed with desolation","8:1":"in the sixth [month]","8:2":"and behold","8:3":"and took me by a lock of my head; and the Spirit lifted me up between earth and the sky","8:4":"the glory of the God of Israel was there","8:5":"Son of man","8:6":"Son of man","8:7":"behold","8:8":"Son of man","8:9":"Go in","8:10":"every form of creeping things","8:11":"every man with his censer in his hand; and the odor of the cloud of incense went up.","8:12":"Son of man","8:13":"You shall again see yet other great abominations which they do.","8:14":"there sat the women weeping for Tammuz.","8:15":"Have you seen [this]","8:16":"at the door of the temple of Yahweh","8:17":"Have you seen [this]","8:18":"neither will I have pity; and though they cry in my ears with a loud voice","9:1":"saying","9:2":"six men came from the way of the upper gate","9:3":"whereupon it was","9:4":"Go through the midst of the city","9:5":"Go you through the city after him","9:6":"the young man and the virgin","9:7":"Defile the house","9:8":"while they were smiting","9:9":"The iniquity of the house of Israel and Judah is exceedingly great","9:10":"my eye shall not spare","9:11":"the man clothed in linen","10:1":"and see","10:2":"and said","10:3":"when the man went in; and the cloud filled the inner court.","10:4":"[and stood] over the threshold of the house; and the house was filled with the cloud","10:5":"as the voice of God Almighty when he speaks.","10:6":"when he commanded the man clothed in linen","10:7":"and took [of it]","10:8":"And there appeared in the cherubims the form of a man's hand under their wings.","10:9":"and behold","10:10":"they four had one likeness","10:11":"they went in their four directions: they didn't turn as they went","10:12":"and their backs","10:13":"they were called in my hearing","10:14":"and the second face was the face of a man","10:15":"And the cherubims were lifted up. This is the living creature that I saw by the river of Chebar.","10:16":"the wheels went beside them; and when the cherubim lifted up their wings to mount up from the earth","10:17":"these stood; and when they mounted up","10:18":"and stood over the cherubim.","10:19":"and mounted up from the earth in my sight when they went forth","10:20":"This is the living creature that I saw under the God of Israel by the river of Chebar; and I knew that they were the cherubims.","10:21":"and every one four wings; and the likeness of the hands of a man was under their wings.","10:22":"they were the faces which I saw by the river Chebar","11:1":"and brought me to the east gate of Yahweh's house","11:2":"Son of man","11:3":"[The time] is not near to build houses: this [city] is the caldron","11:4":"prophesy","11:5":"and he said to me","11:6":"and you have filled the streets of it with the slain.","11:7":"they are the flesh","11:8":"says the Lord Yahweh.","11:9":"and deliver you into the hands of strangers","11:10":"Ye shall fall by the sword; I will judge you in the border of Israel; and ye shall know that I am the LORD.","11:11":"neither shall you be the flesh in the midst of it; I will judge you in the border of Israel;","11:12":"neither have you executed my ordinances","11:13":"when I prophesied","11:14":"saying","11:15":"your brothers","11:16":"Thus says the Lord Yahweh:  Whereas I have removed them far off among the nations","11:17":"Thus says the Lord Yahweh:  I will gather you from the peoples","11:18":"and they shall take away all the detestable things of it and all the abominations of it from there.","11:19":"and I will put a new spirit within you; and I will take the stony heart out of their flesh","11:20":"and keep my ordinances","11:21":"I will bring their way on their own heads","11:22":"and the wheels were beside them; and the glory of the God of Israel was over them above.","11:23":"and stood on the mountain which is on the east side of the city.","11:24":"and brought me in the vision by the Spirit of God into Chaldea","11:25":"Then I spake unto them of the captivity all the things that the LORD had shewed me.","12:1":"saying","12:2":"you dwell in the midst of the rebellious house","12:3":"you son of man","12:4":"as stuff for removing; and you shall go forth yourself at even in their sight","12:5":"and carry out thereby.","12:6":"and carry it forth in the dark; you shall cover your face","12:7":"as stuff for removing","12:8":"saying","12:9":"has not the house of Israel","12:10":"Thus says the Lord Yahweh:  This burden [concerns] the prince in Jerusalem","12:11":"I am your sign:  like as I have done","12:12":"and shall go forth:  they shall dig through the wall to carry out thereby:  he shall cover his face","12:13":"and he shall be taken in my snare; and I will bring him to Babylon to the land of the Chaldeans; yet shall he not see it","12:14":"and all his bands; and I will draw out the sword after them.","12:15":"when I shall disperse them among the nations","12:16":"from the famine","12:17":"saying","12:18":"eat your bread with quaking","12:19":"Thus says the Lord Yahweh concerning the inhabitants of Jerusalem","12:20":"and the land shall be a desolation; and you shall know that I am Yahweh.","12:21":"saying","12:22":"what is this proverb that you have in the land of Israel","12:23":"Thus says the Lord Yahweh:  I will make this proverb to cease","12:24":"For there shall be no more any vain vision nor flattering divination within the house of Israel.","12:25":"and the word that I shall speak shall be performed; it shall be no more deferred: for in your days","12:26":"saying","12:27":"behold","12:28":"Thus says the Lord Yahweh:  There shall none of my words be deferred any more","13:1":"saying","13:2":"prophesy against the prophets of Israel who prophesy","13:3":"Woe to the foolish prophets","13:4":"your prophets have been like foxes in the waste places.","13:5":"neither built up the wall for the house of Israel","13:6":"who say","13:7":"and haven't you spoken a lying divination","13:8":"and seen lies","13:9":"and who divine lies:  they shall not be in the council of my people","13:10":"even because they have seduced my people","13:11":"that it shall fall: there shall be an overflowing shower; and you","13:12":"when the wall is fallen","13:13":"and great hailstones in wrath to consume it.","13:14":"and bring it down to the ground","13:15":"and on those who have daubed it with whitewash; and I will tell you","13:16":"the prophets of Israel who prophesy concerning Jerusalem","13:17":"son of man","13:18":"Thus says the Lord Yahweh:  Woe to the women who sew pillows on all elbows","13:19":"to kill the souls who should not die","13:20":"I am against your pillows","13:21":"and deliver my people out of your hand","13:22":"whom I have not made sad; and strengthened the hands of the wicked","13:23":"nor practice divination.  I will deliver my people out of your hand; and you shall know that I am Yahweh.","14:1":"and sat before me.","14:2":"saying","14:3":"these men have taken their idols into their heart","14:4":"and tell them","14:5":"because they are all estranged from me through their idols.","14:6":"Thus says the Lord Yahweh:  Return you","14:7":"or of the strangers who sojourn in Israel","14:8":"and will make him an astonishment","14:9":"I","14:10":"And they shall bear the punishment of their iniquity: the punishment of the prophet shall be even as the punishment of him that seeketh unto him;","14:11":"neither defile themselves any more with all their transgressions; but that they may be my people","14:12":"saying","14:13":"when a land sins against me by committing a trespass","14:14":"Noah","14:15":"and they ravage it","14:16":"as I live","14:17":"and say","14:18":"as I live","14:19":"and pour out my wrath on it in blood","14:20":"Daniel","14:21":"the sword","14:22":"behold","14:23":"when you see their way and their doings; and you shall know that I have not done without cause all that I have done in it","15:1":"saying","15:2":"what is the vine tree more than any tree","15:3":"Shall wood be taken thereof to do any work? or will men take a pin of it to hang any vessel thereon?","15:4":"it is cast into the fire for fuel; the fire has devoured both the ends of it","15:5":"when it was whole","15:6":"which I have given to the fire for fuel","15:7":"but the fire shall devour them; and you shall know that I am Yahweh","15:8":"because they have committed a trespass","16:1":"saying","16:2":"cause Jerusalem to know her abominations;","16:3":"Thus says the Lord Yahweh to Jerusalem:  Your birth and your birth is of the land of the Canaanite; the Amorite was your father","16:4":"in the day you were born your navel was not cut","16:5":"to do any of these things to you","16:6":"and saw you weltering in your blood","16:7":"and you increased and grew great","16:8":"and looked at you","16:9":"I thoroughly washed away your blood from you","16:10":"and shod you with sealskin","16:11":"and I put bracelets on your hands","16:12":"and earrings in your ears","16:13":"and silk","16:14":"through my majesty which I had put on you","16:15":"and played the prostitute because of your renown","16:16":"and made for yourselves high places decked with various colors","16:17":"which I had given you","16:18":"and covered them","16:19":"fine flour","16:20":"whom you have borne to me","16:21":"and delivered them up","16:22":"when you were naked and bare","16:23":"(woe","16:24":"and have made you a lofty place in every street.","16:25":"and have made your beauty an abomination","16:26":"your neighbors","16:27":"I have stretched out my hand over you","16:28":"because you were insatiable; yes","16:29":"to Chaldea; and yet you weren't satisfied with this.","16:30":"says the Lord Yahweh","16:31":"and make your lofty place in every street","16:32":"But as a wife that committeth adultery","16:33":"and bribe them","16:34":"in that none follows you to play the prostitute; and whereas you give hire","16:35":"prostitute","16:36":"Because your filthiness was poured out","16:37":"I will gather all your lovers","16:38":"as women who break wedlock and shed blood are judged; and I will bring on you the blood of wrath and jealousy.","16:39":"and they shall throw down your vaulted place","16:40":"and they shall stone you with stones","16:41":"and execute judgments on you in the sight of many women; and I will cause you to cease from playing the prostitute","16:42":"and my jealousy shall depart from you","16:43":"but have raged against me in all these things; therefore","16:44":"everyone who uses proverbs shall use [this] proverb against you","16:45":"who loathes her husband and her children; and you are the sister of your sisters","16:46":"who dwells at your left hand","16:47":"nor done after their abominations; but","16:48":"says the Lord Yahweh","16:49":"this was the iniquity of your sister Sodom: pride","16:50":"and committed abomination before me: therefore I took them away as I saw [good].","16:51":"and have justified your sisters by all your abominations which you have done.","16:52":"bear you your own shame","16:53":"the captivity of Sodom and her daughters","16:54":"and may be ashamed because of all that you have done","16:55":"Sodom and her daughters","16:56":"","16:57":"as at the time of the reproach of the daughters of Syria","16:58":"says Yahweh.","16:59":"who have despised the oath in breaking the covenant.","16:60":"and I will establish to you an everlasting covenant.","16:61":"and be ashamed","16:62":"And I will establish my covenant with thee; and thou shalt know that I am the LORD:","16:63":"and be confounded","17:1":"saying","17:2":"put forth a riddle","17:3":"Thus says the Lord Yahweh:  A great eagle with great wings and long feathers","17:4":"and carried it to a land of traffic; he set it in a city of merchants.","17:5":"and planted it in a fruitful soil; he placed it beside many waters; he set it as a willow tree.","17:6":"and became a spreading vine of low stature","17:7":"this vine did bend its roots toward him","17:8":"that it might bring forth branches","17:9":"Thus says the Lord Yahweh:  Shall it prosper? shall he not pull up the roots of it","17:10":"behold","17:11":"saying","17:12":"Don't you know what these things mean? tell them","17:13":"and made a covenant with him; he also brought him under an oath","17:14":"that it might not lift itself up","17:15":"that they might give him horses and much people. Shall he prosper? shall he escape who does such things? shall he break the covenant","17:16":"says the Lord Yahweh","17:17":"when they cast up mounds and build forts","17:18":"he had given his hand","17:19":"surely my oath that he has despised","17:20":"and he shall be taken in my snare","17:21":"and those who remain shall be scattered toward every wind: and you shall know that I","17:22":"and will set it; I will crop off from the topmost of its young twigs a tender one","17:23":"and bear fruit","17:24":"Yahweh","18:1":"saying","18:2":"that you use this proverb concerning the land of Israel","18:3":"says the Lord Yahweh","18:4":"all souls are mine; as the soul of the father","18:5":"and does that which is lawful and right","18:6":"neither has lifted up his eyes to the idols of the house of Israel","18:7":"but has restored to the debtor his pledge","18:8":"neither has taken any increase","18:9":"and has kept my ordinances","18:10":"a shedder of blood","18:11":"but even has eaten on the mountains","18:12":"has taken by robbery","18:13":"and has taken increase; shall he then live? he shall not live:  he has done all these abominations; he shall surely die; his blood shall be on him.","18:14":"behold","18:15":"neither has lifted up his eyes to the idols of the house of Israel","18:16":"has not taken anything to pledge","18:17":"who has not received interest nor increase","18:18":"because he cruelly oppressed","18:19":"Why does not the son bear the iniquity of the father? when the son has done that which is lawful and right","18:20":"he shall die:  the son shall not bear the iniquity of the father","18:21":"and keep all my statutes","18:22":"All his transgressions that he hath committed","18:23":"and live?","18:24":"and commits iniquity","18:25":"The way of the Lord is not equal. Hear now","18:26":"and commits iniquity","18:27":"when the wicked man turns away from his wickedness that he has committed","18:28":"and turns away from all his transgressions that he has committed","18:29":"The way of the Lord is not equal. house of Israel","18:30":"house of Israel","18:31":"in which you have transgressed; and make you a new heart and a new spirit: for why will you die","18:32":"says the Lord Yahweh:  therefore turn yourselves","19:1":"take up a lamentation for the princes of Israel","19:2":"What was your mother?  A lioness:  she couched among lions","19:3":"and he learned to catch the prey; he devoured men.","19:4":"The nations also heard of him; he was taken in their pit","19:5":"and her hope was lost","19:6":"and he learned to catch the prey; he devoured men.","19:7":"and laid waste their cities; and the land was desolate","19:8":"Then the nations set against him on every side from the provinces","19:9":"and brought him to the king of Babylon; they brought him into strongholds","19:10":"in your blood","19:11":"and their stature was exalted among the thick boughs","19:12":"it was cast down to the ground","19:13":"in a dry and thirsty land.","19:14":"it has devoured its fruit","20:1":"in the fifth [month]","20:2":"saying","20:3":"speak to the elders of Israel","20:4":"son of man","20:5":"Thus says the Lord Yahweh:  In the day when I chose Israel","20:6":"to bring them forth out of the land of Egypt into a land that I had searched out for them","20:7":"Cast you away every man the abominations of his eyes","20:8":"and would not listen to me; they did not every man cast away the abominations of their eyes","20:9":"that it should not be profaned in the sight of the nations","20:10":"and brought them into the wilderness.","20:11":"and shown them my ordinances","20:12":"to be a sign between me and them","20:13":"and they rejected my ordinances","20:14":"that it should not be profaned in the sight of the nations","20:15":"that I would not bring them into the land which I had given them","20:16":"and didn't walk in my statutes","20:17":"and I didn't destroy them","20:18":"Don't you walk in the statutes of your fathers","20:19":"and keep my ordinances","20:20":"that you may know that I am Yahweh your God.","20:21":"neither kept my ordinances to do them","20:22":"and worked for my name's sake","20:23":"that I would scatter them among the nations","20:24":"but had rejected my statutes","20:25":"and ordinances in which they should not live;","20:26":"in that they caused to pass through [the fire] all that opens the womb","20:27":"son of man","20:28":"which I swore to give to them","20:29":"What means the high place whereunto you go? So the name of it is called Bamah to this day.","20:30":"Thus says the Lord Yahweh:  Do you pollute yourselves after the manner of your fathers? and play you the prostitute after their abominations?","20:31":"when you make your sons to pass through the fire","20:32":"in that you say","20:33":"says the Lord Yahweh","20:34":"and will gather you out of the countries in which you are scattered","20:35":"and there will I enter into judgment with you face to face.","20:36":"so will I enter into judgment with you","20:37":"and I will bring you into the bond of the covenant;","20:38":"and those who disobey against me; I will bring them forth out of the land where they sojourn","20:39":"house of Israel","20:40":"in the mountain of the height of Israel","20:41":"when I bring you out from the peoples","20:42":"when I shall bring you into the land of Israel","20:43":"and all your doings","20:44":"when I have dealt with you for my name's sake","20:45":"saying","20:46":"set your face toward the south","20:47":"Hear the word of Yahweh:  Thus says the Lord Yahweh","20:48":"Yahweh","20:49":"Ah Lord Yahweh! they say of me","21:1":"saying","21:2":"set your face toward Jerusalem","21:3":"Thus says Yahweh:  Behold","21:4":"therefore shall my sword go forth out of its sheath against all flesh from the south to the north:","21:5":"Yahweh","21:6":"you son of man; with the breaking of your thighs and with bitterness shall you sigh before their eyes.","21:7":"when they tell you","21:8":"saying","21:9":"prophesy","21:10":"it condemns every tree.","21:11":"that it may be handled: the sword","21:12":"son of man; for it is on my people","21:13":"Because it is a trial","21:14":"son of man","21:15":"that their heart may melt","21:16":"go to the right","21:17":"and I will cause my wrath to rest:  I","21:18":"saying","21:19":"you son of man","21:20":"and to Judah in Jerusalem the fortified.","21:21":"at the head of the two ways","21:22":"to set battering rams","21:23":"who have sworn oaths to them; but he brings iniquity to memory","21:24":"in that your transgressions are uncovered","21:25":"deadly wounded wicked one","21:26":"and take off the crown; this [shall be] no more the same; exalt that which is low","21:27":"overturn","21:28":"son of man","21:29":"while they divine lies to you","21:30":"in the land of your birth","21:31":"skillful to destroy.","21:32":"Yahweh","22:1":"saying","22:2":"son of man","22:3":"Thus says the Lord Yahweh:  A city that sheds blood in the midst of her","22:4":"and are defiled in your idols which you have made; and you have caused your days to draw near","22:5":"and those who are far from you","22:6":"the princes of Israel","22:7":"In thee have they set light by father and mother: in the midst of thee have they dealt by oppression with the stranger: in thee have they vexed the fatherless and the widow.","22:8":"and have profaned my Sabbaths.","22:9":"In thee are men that carry tales to shed blood: and in thee they eat upon the mountains: in the midst of thee they commit lewdness.","22:10":"In thee have they discovered their fathers' nakedness: in thee have they humbled her that was set apart for pollution.","22:11":"his father's daughter.","22:12":"and you have greedily gained of your neighbors by oppression","22:13":"therefore","22:14":"or can your hands be strong","22:15":"and disperse you through the countries; and I will consume your filthiness out of you.","22:16":"in the sight of the nations; and you shall know that I am Yahweh.","22:17":"saying","22:18":"the house of Israel is become dross to me: all of them are brass and tin and iron and lead","22:19":"therefore","22:20":"to blow the fire on it","22:21":"I will gather you","22:22":"so shall you be melted in the midst of it; and you shall know that I","22:23":"saying","22:24":"tell her","22:25":"like a roaring lion ravening the prey:  they have devoured souls; they take treasure and precious things; they have made her widows many in the midst of it.","22:26":"and have profaned my holy things:  they have made no distinction between the holy and the common","22:27":"to shed blood","22:28":"seeing false visions","22:29":"and exercised robbery; yes","22:30":"who should build up the wall","22:31":"says the Lord Yahweh.","23:1":"saying","23:2":"there were two women","23:3":"and there was handled the bosom of their virginity.","23:4":"and Oholibah her sister: and they became mine","23:5":"on the Assyrians [her] neighbors","23:6":"governors and rulers","23:7":"the choicest men of Assyria all of them; and on whoever she doted","23:8":"and they handled the bosom of her virginity; and they poured out their prostitution on her.","23:9":"into the hand of the Assyrians","23:10":"These discovered her nakedness: they took her sons and her daughters","23:11":"yet was she more corrupt in her doting than she","23:12":"governors and rulers","23:13":"Then I saw that she was defiled","23:14":"the images of the Chaldeans portrayed with vermilion","23:15":"with flowing turbans on their heads","23:16":"and sent messengers to them into Chaldea.","23:17":"and they defiled her with their prostitution","23:18":"and uncovered her nakedness: then my soul was alienated from her","23:19":"remembering the days of her youth","23:20":"whose flesh is as the flesh of donkeys","23:21":"in the handling of your bosom by the Egyptians for the breasts of your youth.","23:22":"Oholibah","23:23":"Pekod and Shoa and Koa","23:24":"chariots","23:25":"and they shall deal with you in fury; they shall take away your nose and your ears; and your residue shall fall by the sword:  they shall take your sons and your daughters; and your residue shall be devoured by the fire.","23:26":"and take away your beautiful jewels.","23:27":"and your prostitution [brought] from the land of Egypt; so that you shall not lift up your eyes to them","23:28":"I will deliver you into the hand of them whom you hate","23:29":"and shall take away all your labor","23:30":"because you have played the prostitute after the nations","23:31":"Thou hast walked in the way of thy sister; therefore will I give her cup into thine hand.","23:32":"which is deep and large; you will be ridiculed and held in derision; it contains much.","23:33":"with the cup of astonishment and desolation","23:34":"and you shall gnaw the broken pieces of it","23:35":"and cast me behind your back","23:36":"will you judge Oholah and Oholibah? then declare to them their abominations.","23:37":"and blood is in their hands; and with their idols have they committed adultery; and they have also caused their sons","23:38":"and have profaned my Sabbaths.","23:39":"then they came the same day into my sanctuary to profane it; and behold","23:40":"to whom a messenger was sent","23:41":"with a table prepared before it","23:42":"and beautiful crowns on their heads.","23:43":"Now will they play the prostitute with her","23:44":"as they go in to a prostitute: so went they in to Oholah and to Oholibah","23:45":"they shall judge them with the judgment of adulteresses","23:46":"and will give them to be tossed back and forth and robbed.","23:47":"and dispatch them with their swords; they shall kill their sons and their daughters","23:48":"that all women may be taught not to do after your lewdness.","23:49":"and you shall bear the sins of your idols; and you shall know that I am the Lord Yahweh.","24:1":"in the ninth year","24:2":"write you the name of the day","24:3":"and tell them","24:4":"even every good piece","24:5":"and also a pile [of wood] for the bones under [the caldron]; make it boil well; yes","24:6":"to the caldron whose rust is therein","24:7":"to cover it with dust.","24:8":"I have set her blood on the bare rock","24:9":"Therefore thus saith the Lord GOD; Woe to the bloody city! I will even make the pile for fire great.","24:10":"make the fire hot","24:11":"that it may be hot","24:12":"She hath wearied herself with lies","24:13":"you shall not be cleansed from your filthiness any more","24:14":"Yahweh","24:15":"saying","24:16":"behold","24:17":"but not aloud","24:18":"So I spake unto the people in the morning: and at even my wife died; and I did in the morning as I was commanded.","24:19":"Won't you tell us what these things are to us","24:20":"The word of Yahweh came to me","24:21":"Thus says the Lord Yahweh:  Behold","24:22":"nor eat the bread of men.","24:23":"and your shoes on your feet: you shall not mourn nor weep; but you shall pine away in your iniquities","24:24":"then shall you know that I am the Lord Yahweh.","24:25":"son of man","24:26":"to cause you to hear it with your ears?","24:27":"and you shall speak","25:1":"saying","25:2":"set your face toward the children of Ammon","25:3":"Hear the word of the Lord Yahweh:  Thus says the Lord Yahweh","25:4":"behold","25:5":"and the children of Ammon a resting place for flocks:  and you shall know that I am Yahweh.","25:6":"and stamped with the feet","25:7":"behold","25:8":"Behold","25:9":"behold","25:10":"[to go] against the children of Ammon; and I will give them for a possession","25:11":"And I will execute judgments upon Moab; and they shall know that I am the LORD.","25:12":"and has greatly offended","25:13":"I will stretch out my hand on Edom","25:14":"says the Lord Yahweh.","25:15":"and have taken vengeance with despite of soul to destroy with perpetual enmity;","25:16":"Behold","25:17":"when I shall lay my vengeance on them.","26:1":"in the first [day] of the month","26:2":"because Tyre has said against Jerusalem","26:3":"Behold","26:4":"and break down her towers: I will also scrape her dust from her","26:5":"says the Lord Yahweh; and she shall become a spoil to the nations.","26:6":"And her daughters which are in the field shall be slain by the sword; and they shall know that I am the LORD.","26:7":"I will bring on Tyre Nebuchadnezzar king of Babylon","26:8":"and cast up a mound against you","26:9":"and with his axes he shall break down your towers.","26:10":"and of the wagons","26:11":"With the hoofs of his horses shall he tread down all thy streets: he shall slay thy people by the sword","26:12":"and make a prey of your merchandise; and they shall break down your walls","26:13":"And I will cause the noise of thy songs to cease; and the sound of thy harps shall be no more heard.","26:14":"says the Lord Yahweh.","26:15":"when the wounded groan","26:16":"and lay aside their robes","26:17":"and tell you","26:18":"the islands that are in the sea shall be dismayed at your departure.","26:19":"like the cities that are not inhabited; when I shall bring up the deep on you","26:20":"to the people of old time","26:21":"and you shall no more have any being; though you are sought for","27:1":"saying","27:2":"son of man","27:3":"you who dwell at the entry of the sea","27:4":"Thy borders are in the midst of the seas","27:5":"They have made all thy ship boards of fir trees of Senir: they have taken cedars from Lebanon to make masts for thee.","27:6":"from the islands of Kittim.","27:7":"that it might be to you for a banner; blue and purple from the islands of Elishah was your awning.","27:8":"Tyre","27:9":"The ancients of Gebal and the wise men thereof were in thee thy calkers: all the ships of the sea with their mariners were in thee to occupy thy merchandise.","27:10":"your men of war: they hanged the shield and helmet in you; they set forth your comeliness.","27:11":"and valorous men were in your towers; they hanged their shields on your walls round about; they have perfected your beauty.","27:12":"iron","27:13":"Tubal","27:14":"They of the house of Togarmah traded in thy fairs with horses and horsemen and mules.","27:15":"The men of Dedan were thy merchants; many isles were the merchandise of thine hand: they brought thee for a present horns of ivory and ebony.","27:16":"purple","27:17":"and the land of Israel","27:18":"by reason of the multitude of all kinds of riches","27:19":"cassia","27:20":"Dedan was thy merchant in precious clothes for chariots.","27:21":"and all the princes of Kedar","27:22":"they were your traffickers; they traded for your wares with the chief of all spices","27:23":"the traffickers of Sheba","27:24":"in wrappings of blue and embroidered work","27:25":"and made very glorious in the heart of the seas.","27:26":"Thy rowers have brought thee into great waters: the east wind hath broken thee in the midst of the seas.","27:27":"and your wares","27:28":"The suburbs shall shake at the sound of the cry of thy pilots.","27:29":"the mariners","27:30":"and shall cry bitterly","27:31":"and gird them with sackcloth","27:32":"and lament over you","27:33":"you filled many peoples; you did enrich the kings of the earth with the multitude of your riches and of your merchandise.","27:34":"your merchandise and all your company did fall in the midst of you.","27:35":"and their kings are horribly afraid; they are troubled in their face.","27:36":"and you shall nevermore have any being.","28:1":"saying","28:2":"tell the prince of Tyre","28:3":"you are wiser than Daniel; there is no secret that is hidden from you;","28:4":"and have gotten gold and silver into your treasures;","28:5":"and your heart is lifted up because of your riches--","28:6":"","28:7":"behold","28:8":"in the heart of the seas.","28:9":"I am God? but you are man","28:10":"says the Lord Yahweh.","28:11":"saying","28:12":"take up a lamentation over the king of Tyre","28:13":"the garden of God; every precious stone adorned you:  ruby","28:14":"[so that] you were on the holy mountain of God; you have walked up and down in the midst of the stones of fire.","28:15":"until unrighteousness was found in you.","28:16":"and you have sinned:  therefore I have cast you as profane out of the mountain of God; and I have destroyed you","28:17":"that they may see you.","28:18":"in the unrighteousness of your traffic","28:19":"and you shall nevermore have any being.","28:20":"saying","28:21":"set your face toward Sidon","28:22":"Thus says the Lord Yahweh:  Behold","28:23":"and blood into her streets; and the wounded shall fall in the midst of her","28:24":"nor a hurting thorn of any that are round about them","28:25":"and shall be sanctified in them in the sight of the nations","28:26":"they shall build houses","29:1":"in the tenth month","29:2":"","29:3":"'Thus says the Lord Yahweh:  Behold, I am against you, Pharaoh king of Egypt, the great monster that lies in the midst of his rivers, that has said, 'My river is my own, and I have made it for myself.',Speak, and say, Thus saith the Lord GOD; Behold, I am against thee, Pharaoh king of Egypt, the great dragon that lieth in the midst of his rivers, which hath said, My river is mine own, and I have made it for myself., דַּבֵּר וְאָמַרְתָּ כֹּה־אָמַר אֲדֹנָי יְהוִה הִנְנִי עָלֶיךָ פַּרְעֹה מֶלֶךְ־מִצְרַיִם הַתַּנִּים הַגָּדוֹל הָרֹבֵץ בְּתוֹךְ יְאֹרָיו אֲשֶׁר אָמַר לִי יְאֹרִי וַאֲנִי עֲשִׂיתִנִי׃ ‬,speak, and say: Thus saith the Lord GOD: Behold, I am against thee, Pharaoh King of Egypt, The great dragon that lieth In the midst of his rivers, That hath said: My river is mine own, And I have made it for myself.,υἱὲ ἀνθρώπου στήρισον τὸ πρόσωπόν σου ἐπὶ φαραω βασιλέα αἰγύπτου καὶ προφήτευσον ἐπ' αὐτὸν καὶ ἐπ' αἴγυπτον ὅλην,and say, Thus saith the Lord; Behold, I am against Pharao, the great dragon that lies in the midst of his rivers, that says, The rivers are mine, and I made them.,,,,","29:4":"and I will make the fish of your rivers stick to your scales; and I will bring you up out of the midst of your rivers","29:5":"you and all the fish of your rivers.  You'll fall on the open field. You won't be brought together","29:6":"because they have been a staff of reed to the house of Israel.","29:7":"you broke","29:8":"","29:9":"'The river is mine","29:10":"behold","29:11":"nor foot of animal shall pass through it","29:12":"and will disperse them through the countries.,And I will make the land of Egypt desolate in the midst of the countries that are desolate, and her cities among the cities that are laid waste shall be desolate forty years: and I will scatter the Egyptians among the nations, and will disperse them through the countries., וְנָתַתִּי אֶת־אֶרֶץ מִצְרַיִם שְׁמָמָה בְּתוֹךְ אֲרָצוֹת נְשַׁמּוֹת וְעָרֶיהָ בְּתוֹךְ עָרִים מָחֳרָבוֹת תִּהְיֶיןָ שְׁמָמָה אַרְבָּעִים שָׁנָה וַהֲפִצֹתִי אֶת־מִצְרַיִם בַּגּוֹיִם וְזֵרִיתִים בָּאֲרָצוֹת׃ פ ‬,And I will make the land of Egypt desolate in the midst of the countries that are desolate, and her cities among the cities that are laid waste shall be desolate forty years; and I will scatter the Egyptians among the nations, and will disperse them through the countries.,οὐ μὴ διέλθῃ ἐν αὐτῇ ποὺς ἀνθρώπου καὶ ποὺς κτήνους οὐ μὴ διέλθῃ αὐτήν καὶ οὐ κατοικηθήσεται τεσσαράκοντα ἔτη,And I will cause her land to be utterly destroyed in the midst of a land that is desolate, and her cities shall be desolate forty years in the midst of cities that are desolate: and I will disperse Egypt among the nations, and will utterly scatter them into the countries.,,,,","29:13":"","29:14":"and will cause them to return into the land of Pathros","29:15":"that they shall no more rule over the nations.","29:16":"bringing iniquity to memory","29:17":"in the first [month]","29:18":"Nebuchadnezzar king of Babylon caused his army to serve a great service against Tyre:  every head was made bald","29:19":"I will give the land of Egypt to Nebuchadnezzar king of Babylon; and he shall carry off her multitude","29:20":"because they worked for me","29:21":"and I will give you the opening of the mouth in the midst of them; and they shall know that I am Yahweh.","30:1":"saying","30:2":"prophesy","30:3":"even the day of Yahweh is near; it shall be a day of clouds","30:4":"and anguish shall be in Ethiopia","30:5":"and Put","30:6":"says the Lord Yahweh.","30:7":"And they shall be desolate in the midst of the countries that are desolate","30:8":"when I have set a fire in Egypt","30:9":"as in the day of Egypt; for","30:10":"by the hand of Nebuchadnezzar king of Babylon.","30:11":"the terrible of the nations","30:12":"and will sell the land into the hand of evil men; and I will make the land desolate","30:13":"and I will cause the images to cease from Memphis; and there shall be no more a prince from the land of Egypt: and I will put a fear in the land of Egypt.","30:14":"and will set a fire in Zoan","30:15":"the stronghold of Egypt; and I will cut off the multitude of No.","30:16":"and No shall be broken up; and Memphis [shall have] adversaries in the daytime.","30:17":"The young men of Aven and of Pibeseth shall fall by the sword: and these cities shall go into captivity.","30:18":"when I shall break there the yokes of Egypt","30:19":"Thus will I execute judgments in Egypt: and they shall know that I am the LORD.","30:20":"in the first [month]","30:21":"I have broken the arm of Pharaoh king of Egypt; and behold","30:22":"I am against Pharaoh king of Egypt","30:23":"and will disperse them through the countries.","30:24":"and put my sword in his hand:  but I will break the arms of Pharaoh","30:25":"when I shall put my sword into the hand of the king of Babylon","30:26":"and disperse them through the countries; and they shall know that I am Yahweh.","31:1":"in the third [month]","31:2":"tell Pharaoh king of Egypt","31:3":"the Assyrian was a cedar in Lebanon with beautiful branches","31:4":"the deep made it to grow: the rivers of it ran round about its plantation; and it sent out its channels to all the trees of the field.","31:5":"and its branches became long by reason of many waters","31:6":"All the fowls of heaven made their nests in his boughs","31:7":"in the length of its branches; for its root was by many waters.","31:8":"and the plane trees were not as its branches; nor was any tree in the garden of God like it in its beauty.","31:9":"so that all the trees of Eden","31:10":"and he has set his top among the thick boughs","31:11":"I have therefore delivered him into the hand of the mighty one of the heathen; he shall surely deal with him: I have driven him out for his wickedness.","31:12":"the terrible of the nations","31:13":"and all the animals of the field shall be on his branches;","31:14":"neither set their top among the thick boughs","31:15":"and I restrained the rivers of it; and the great waters were stayed; and I caused Lebanon to mourn for him","31:16":"when I cast him down to Sheol with those who descend into the pit; and all the trees of Eden","31:17":"those who were his arm","31:18":"with those who are slain by the sword. This is Pharaoh and all his multitude","32:1":"in the twelfth month","32:2":"take up a lamentation over Pharaoh king of Egypt","32:3":"Thus saith the Lord GOD; I will therefore spread out my net over thee with a company of many people; and they shall bring thee up in my net.","32:4":"I will cast you forth on the open field","32:5":"and fill the valleys with your height.","32:6":"even to the mountains; and the watercourses shall be full of you.","32:7":"I will cover the heavens","32:8":"and set darkness on your land","32:9":"when I shall bring your destruction among the nations","32:10":"I will make many peoples amazed at you","32:11":"For thus saith the Lord GOD; The sword of the king of Babylon shall come upon thee.","32:12":"and all the multitude of it shall be destroyed.","32:13":"nor the hoofs of animals trouble them.","32:14":"and cause their rivers to run like oil","32:15":"a land destitute of that of which it was full","32:16":"and over all her multitude","32:17":"in the fifteenth [day] of the month","32:18":"wail for the multitude of Egypt","32:19":"and be laid with the uncircumcised.","32:20":"They shall fall in the midst of them that are slain by the sword: she is delivered to the sword: draw her and all her multitudes.","32:21":"they lie still","32:22":"fallen by the sword;","32:23":"and her company is round about her grave; all of them slain","32:24":"fallen by the sword","32:25":"slain by the sword; for their terror was caused in the land of the living","32:26":"Tubal","32:27":"who are gone down to Sheol with their weapons of war","32:28":"and shall lie with those who are slain by the sword.","32:29":"her kings and all her princes","32:30":"all of them","32:31":"and shall be comforted over all his multitude","32:32":"with those who are slain by the sword","33:1":"saying","33:2":"speak to the children of your people","33:3":"when he sees the sword come on the land","33:4":"and doesn't take warning","33:5":"and didn't take warning; his blood shall be on him; whereas if he had taken warning","33:6":"and doesn't blow the trumpet","33:7":"son of man","33:8":"O wicked man","33:9":"if you warn the wicked of his way to turn from it","33:10":"son of man","33:11":"As I live","33:12":"son of man","33:13":"that he shall surely live; if he trust to his righteousness","33:14":"when I say to the wicked","33:15":"give again that which he had taken by robbery","33:16":"None of his sins that he hath committed shall be mentioned unto him: he hath done that which is lawful and right; he shall surely live.","33:17":"The way of the Lord is not equal:  but as for them","33:18":"and commits iniquity","33:19":"and does that which is lawful and right","33:20":"The way of the Lord is not equal. House of Israel","33:21":"in the tenth [month]","33:22":"before he who was escaped came; and he had opened my mouth","33:23":"saying","33:24":"they who inhabit those waste places in the land of Israel speak","33:25":"Thus says the Lord Yahweh:  You eat with the blood","33:26":"you work abomination","33:27":"Thus says the Lord Yahweh:  As I live","33:28":"so that none shall pass through.","33:29":"when I have made the land a desolation and an astonishment","33:30":"son of man","33:31":"and they sit before you as my people","33:32":"you are to them as a very lovely song of one who has a pleasant voice","33:33":"(behold","34:1":"saying","34:2":"prophesy against the shepherds of Israel","34:3":"and you clothe you with the wool","34:4":"neither have you healed that which was sick","34:5":"because there was no shepherd; and they became food to all the animals of the field","34:6":"and on every high hill: yes","34:7":"you shepherds","34:8":"says the Lord Yahweh","34:9":"you shepherds","34:10":"I am against the shepherds; and I will require my sheep at their hand","34:11":"I myself","34:12":"so will I seek out my sheep; and I will deliver them out of all places where they have been scattered in the cloudy and dark day.","34:13":"and gather them from the countries","34:14":"I will feed them in a good pasture","34:15":"and I will cause them to lie down","34:16":"and will bring back that which was driven away","34:17":"O my flock","34:18":"but you must tread down with your feet the residue of your pasture? and to have drunk of the clear waters","34:19":"they eat that which you have trodden with your feet","34:20":"I","34:21":"and push all the diseased with your horns","34:22":"and they shall no more be a prey; and I will judge between sheep and sheep.","34:23":"and he shall feed them","34:24":"Yahweh","34:25":"and will cause evil animals to cease out of the land; and they shall dwell securely in the wilderness","34:26":"And I will make them and the places round about my hill a blessing; and I will cause the shower to come down in his season; there shall be showers of blessing.","34:27":"and the earth shall yield its increase","34:28":"neither shall the animals of the earth devour them; but they shall dwell securely","34:29":"and they shall be no more consumed with famine in the land","34:30":"Yahweh","34:31":"the sheep of my pasture","35:1":"saying","35:2":"set your face against Mount Seir","35:3":"Thus says the Lord Yahweh:  Behold","35:4":"and you shall be desolate; and you shall know that I am Yahweh.","35:5":"and have given over the children of Israel to the power of the sword in the time of their calamity","35:6":"as I live","35:7":"Thus will I make mount Seir most desolate","35:8":"And I will fill his mountains with his slain men: in thy hills","35:9":"and your cities shall not be inhabited; and you shall know that I am Yahweh.","35:10":"These two nations and these two countries shall be mine","35:11":"as I live","35:12":"Yahweh","35:13":"and have multiplied your words against me:  I have heard it.","35:14":"I will make you desolate.","35:15":"because it was desolate","36:1":"son of man","36:2":"Aha! and","36:3":"and say","36:4":"you mountains of Israel","36:5":"and against all Edom","36:6":"and tell the mountains and to the hills","36:7":"[saying]","36:8":"mountains of Israel","36:9":"behold","36:10":"all the house of Israel","36:11":"and will do better [to you] than at your beginnings: and you shall know that I am Yahweh.","36:12":"I will cause men to walk on you","36:13":"You [land] are a devourer of men","36:14":"neither bereave your nation any more","36:15":"neither shall you bear the reproach of the peoples any more","36:16":"saying","36:17":"when the house of Israel lived in their own land","36:18":"and because they had defiled it with their idols;","36:19":"and they were dispersed through the countries:  according to their way and according to their doings I judged them.","36:20":"where they went","36:21":"which the house of Israel had profaned among the nations","36:22":"Thus says the Lord Yahweh:  I don't do [this] for your sake","36:23":"which has been profaned among the nations","36:24":"and gather you out of all the countries","36:25":"and you shall be clean: from all your filthiness","36:26":"and a new spirit will I put within you; and I will take away the stony heart out of your flesh","36:27":"and cause you to walk in my statutes","36:28":"and I will be your God.","36:29":"and will multiply it","36:30":"and the increase of the field","36:31":"and your doings that were not good; and you shall loathe yourselves in your own sight for your iniquities and for your abominations.","36:32":"says the Lord Yahweh","36:33":"I will cause the cities to be inhabited","36:34":"whereas it was a desolation in the sight of all who passed by.","36:35":"This land that was desolate is become like the garden of Eden; and the waste and desolate and ruined cities are fortified and inhabited.","36:36":"Yahweh","36:37":"moreover","36:38":"as the flock of Jerusalem in her appointed feasts","37:1":"and he brought me out in the Spirit of Yahweh","37:2":"there were very many in the open valley; and behold","37:3":"Son of man","37:4":"Prophesy over these bones","37:5":"I will cause breath to enter into you","37:6":"and will bring up flesh on you","37:7":"there was a noise","37:8":"and","37:9":"Prophesy to the wind","37:10":"and the breath came into them","37:11":"Son of man","37:12":"and tell them","37:13":"when I have opened your graves","37:14":"and you shall live","37:15":"saying","37:16":"son of man","37:17":"that they may become one in your hand.","37:18":"saying","37:19":"Thus says the Lord Yahweh:  Behold","37:20":"And the sticks whereon thou writest shall be in thine hand before their eyes.","37:21":"Thus says the Lord Yahweh:  Behold","37:22":"on the mountains of Israel; and one king shall be king to them all; and they shall be no more two nations","37:23":"nor with their detestable things","37:24":"and observe my statutes","37:25":"in which your fathers lived; and they shall dwell therein","37:26":"and multiply them","37:27":"and they shall be my people.","37:28":"when my sanctuary shall be in the midst of them forevermore.","38:1":"saying","38:2":"set your face toward Gog","38:3":"Thus says the Lord Yahweh:  Behold","38:4":"and put hooks into your jaws","38:5":"Cush","38:6":"and all his hordes; the house of Togarmah in the uttermost parts of the north","38:7":"yes","38:8":"that is gathered out of many peoples","38:9":"you shall come like a storm","38:10":"that things shall come into your mind","38:11":"I will go up to the land of unwalled villages; I will go to those who are at rest","38:12":"and against the people who are gathered out of the nations","38:13":"and Dedan","38:14":"son of man","38:15":"you","38:16":"as a cloud to cover the land:  it shall happen in the latter days","38:17":"who prophesied in those days for [many] years that I would bring you against them?","38:18":"when Gog shall come against the land of Israel","38:19":"Surely in that day there shall be a great shaking in the land of Israel;","38:20":"and the birds of the sky","38:21":"says the Lord Yahweh:  every man's sword shall be against his brother.","38:22":"and on his hordes","38:23":"and sanctify myself","39:1":"son of man","39:2":"and will lead you on","39:3":"and will cause your arrows to fall out of your right hand.","39:4":"you","39:5":"says the Lord Yahweh.","39:6":"and on those who dwell securely in the islands; and they shall know that I am Yahweh.","39:7":"the Holy One in Israel.","39:8":"it comes","39:9":"and shall make fires of the weapons and burn them","39:10":"neither cut down any out of the forests; for they shall make fires of the weapons; and they shall plunder those who plundered them","39:11":"that I will give to Gog a place for burial in Israel","39:12":"that they may cleanse the land.","39:13":"all the people of the land shall bury them; and it shall be to them a renown in the day that I shall be glorified","39:14":"who shall pass through the land","39:15":"then shall he set up a sign by it","39:16":"And also the name of the city shall be Hamonah. Thus shall they cleanse the land.","39:17":"son of man","39:18":"and drink the blood of the princes of the earth","39:19":"and drink blood until you be drunken","39:20":"with mighty men","39:21":"and my hand that I have laid on them.","39:22":"from that day and forward.","39:23":"and I hid my face from them:  so I gave them into the hand of their adversaries","39:24":"According to their uncleanness and according to their transgressions have I done unto them","39:25":"and have mercy on the whole house of Israel; and I will be jealous for my holy name.","39:26":"and all their trespasses by which they have trespassed against me","39:27":"and gathered them out of their enemies' lands","39:28":"in that I caused them to go into captivity among the nations","39:29":"says the Lord Yahweh.","40:1":"in the beginning of the year","40:2":"and set me down on a very high mountain","40:3":"behold","40:4":"Son of man","40:5":"a wall on the outside of the house round about","40:6":"and went up the steps of it:  and he measured the threshold of the gate","40:7":"and one reed broad; and [the space] between the lodges was five cubits; and the threshold of the gate by the porch of the gate toward the house was one reed.","40:8":"one reed.","40:9":"eight cubits; and the posts of it","40:10":"and three on that side; they three were of one measure: and the posts had one measure on this side and on that side.","40:11":"ten cubits; and the length of the gate","40:12":"one cubit [on this side]","40:13":"a breadth of twenty-five cubits; door against door.","40:14":"sixty cubits; and the court [reached] to the posts","40:15":"And from the face of the gate of the entrance unto the face of the porch of the inner gate were fifty cubits.","40:16":"and to their posts within the gate round about","40:17":"there were chambers and a pavement","40:18":"answerable to the length of the gates","40:19":"one hundred cubits","40:20":"he measured the length of it and the breadth of it.","40:21":"and the breadth twenty-five cubits.","40:22":"and the arches of it","40:23":"[both] on the north and on the east; and he measured from gate to gate one hundred cubits.","40:24":"a gate toward the south: and he measured the posts of it and the arches of it according to these measures.","40:25":"like those windows:  the length was fifty cubits","40:26":"and the arches of it were before them; and it had palm trees","40:27":"And there was a gate in the inner court toward the south: and he measured from gate to gate toward the south an hundred cubits.","40:28":"And he brought me to the inner court by the south gate: and he measured the south gate according to these measures;","40:29":"and the posts of it","40:30":"twenty-five cubits long","40:31":"And the arches thereof were toward the utter court; and palm trees were upon the posts thereof: and the going up to it had eight steps.","40:32":"And he brought me into the inner court toward the east: and he measured the gate according to these measures.","40:33":"and the posts of it","40:34":"on this side","40:35":"And he brought me to the north gate","40:36":"the posts of it","40:37":"on this side","40:38":"And the chambers and the entries thereof were by the posts of the gates","40:39":"and two tables on that side","40:40":"as one goes up to the entry of the gate toward the north","40:41":"and four tables on that side","40:42":"of hewn stone","40:43":"a handbreadth long","40:44":"which was at the side of the north gate; and their prospect was toward the south; one at the side of the east gate having the prospect toward the north.","40:45":"This chamber","40:46":"the keepers of the charge of the altar: these are the sons of Zadok","40:47":"one hundred cubits long","40:48":"and measured each post of the porch","40:49":"and the breadth eleven cubits; even by the steps by which they went up to it: and there were pillars by the posts","41:1":"and measured the posts","41:2":"and five cubits on the other side:  and he measured the length of it","41:3":"and measured each post of the entrance","41:4":"twenty cubits","41:5":"six cubits; and the breadth of every side chamber","41:6":"one over another","41:7":"And there was an enlarging","41:8":"I saw also the height of the house round about: the foundations of the side chambers were a full reed of six great cubits.","41:9":"which was for the side chambers","41:10":"And between the chambers was the wideness of twenty cubits round about the house on every side.","41:11":"one door toward the north","41:12":"and the length of it ninety cubits.","41:13":"one hundred cubits long; and the separate place","41:14":"and of the separate place toward the east","41:15":"and the galleries of it on the one side and on the other side","41:16":"and the closed windows","41:17":"even to the inner house","41:18":"and every cherub had two faces;","41:19":"and the face of a young lion toward the palm tree on the other side.  [thus was it] made through all the house round about:","41:20":"From the ground unto above the door were cherubims and palm trees made","41:21":"the door posts were squared; and as for the face of the sanctuary","41:22":"three cubits high","41:23":"And the temple and the sanctuary had two doors.","41:24":"two turning leaves: two [leaves] for the one door","41:25":"on the doors of the temple","41:26":"on the sides of the porch: thus were the side chambers of the house","42:1":"the way toward the north:  and he brought me into the chamber that was over against the separate place","42:2":"and the breadth was fifty cubits.","42:3":"and over against the pavement which belonged to the outer court","42:4":"a way of one cubit; and their doors were toward the north.","42:5":"more than from the lower and the middle","42:6":"and they didn't have pillars as the pillars of the courts:  therefore [the uppermost] was straitened more than the lowest and the middle from the ground.","42:7":"toward the outer court before the chambers","42:8":"before the temple were one hundred cubits.","42:9":"as one goes into them from the outer court.","42:10":"before the separate place","42:11":"and according to their doors.","42:12":"even the way directly before the wall toward the east","42:13":"The north chambers and the south chambers","42:14":"then shall they not go out of the holy place into the outer court","42:15":"he brought me forth by the way of the gate whose prospect is toward the east","42:16":"with the measuring reed round about.","42:17":"He measured the north side","42:18":"He measured the south side","42:19":"and measured five hundred reeds with the measuring reed.","42:20":"the length five hundred","43:1":"even the gate that looks toward the east.","43:2":"the glory of the God of Israel came from the way of the east:  and his voice was like the sound of many waters; and the earth shined with his glory.","43:3":"even according to the vision that I saw when I came to destroy the city; and the visions were like the vision that I saw by the river Chebar; and I fell on my face.","43:4":"And the glory of the LORD came into the house by the way of the gate whose prospect is toward the east.","43:5":"and brought me into the inner court; and behold","43:6":"And I heard him speaking unto me out of the house; and the man stood by me.","43:7":"Son of man","43:8":"and their doorpost beside my doorpost","43:9":"and the dead bodies of their kings","43:10":"son of man","43:11":"make known to them the form of the house","43:12":"this is the law of the house.","43:13":"and the breadth a cubit","43:14":"and the breadth one cubit; and from the lesser ledge to the greater ledge shall be four cubits","43:15":"So the altar shall be four cubits; and from the altar and upward shall be four horns.","43:16":"square in the four sides of it.","43:17":"And the settle shall be fourteen cubits long and fourteen broad in the four squares thereof; and the border about it shall be half a cubit; and the bottom thereof shall be a cubit about; and his stairs shall look toward the east.","43:18":"Son of man","43:19":"who are near to me","43:20":"and put it on the four horns of it","43:21":"and it shall be burnt in the appointed place of the house","43:22":"as they did cleanse it with the bull.","43:23":"you shall offer a young bull without blemish","43:24":"and the priests shall cast salt on them","43:25":"and a ram out of the flock","43:26":"Seven days shall they purge the altar and purify it; and they shall consecrate themselves.","43:27":"it shall be that on the eighth day","44:1":"which looks toward the east; and it was shut.","44:2":"This gate shall be shut; it shall not be opened","44:3":"he shall sit therein as prince to eat bread before Yahweh; he shall enter by the way of the porch of the gate","44:4":"and behold","44:5":"Son of man","44:6":"even to the house of Israel","44:7":"uncircumcised in heart and uncircumcised in flesh","44:8":"And ye have not kept the charge of mine holy things: but ye have set keepers of my charge in my sanctuary for yourselves.","44:9":"No foreigner","44:10":"when Israel went astray","44:11":"having oversight at the gates of the house","44:12":"and became a stumbling block of iniquity to the house of Israel; therefore have I lifted up my hand against them","44:13":"to execute the office of priest to me","44:14":"for all the service of it","44:15":"the sons of Zadok","44:16":"and they shall come near to my table","44:17":"when they enter in at the gates of the inner court","44:18":"and shall have linen breeches on their waists; they shall not gird themselves with [anything that causes] sweat.","44:19":"even into the outer court to the people","44:20":"nor allow their locks to grow long; they shall only cut off the hair of their heads.","44:21":"when they enter into the inner court.","44:22":"nor her who is put away; but they shall take virgins of the seed of the house of Israel","44:23":"and cause them to discern between the unclean and the clean.","44:24":"And in controversy they shall stand in judgment; and they shall judge it according to my judgments: and they shall keep my laws and my statutes in all mine assemblies; and they shall hallow my sabbaths.","44:25":"or for mother","44:26":"they shall reckon to him seven days.","44:27":"into the inner court","44:28":"And it shall be unto them for an inheritance: I am their inheritance: and ye shall give them no possession in Israel: I am their possession.","44:29":"and the sin offering","44:30":"and every offering of everything","44:31":"or is torn","45:1":"when you shall divide by lot the land for inheritance","45:2":"square round about; and fifty cubits for the suburbs of it round about.","45:3":"and a breadth of ten thousand:  and in it shall be the sanctuary","45:4":"the ministers of the sanctuary","45:5":"and ten thousand in breadth","45:6":"and twenty-five thousand long","45:7":"in front of the holy offering and in front of the possession of the city","45:8":"In the land shall be his possession in Israel: and my princes shall no more oppress my people; and the rest of the land shall they give to the house of Israel according to their tribes.","45:9":"princes of Israel: remove violence and spoil","45:10":"and a just ephah","45:11":"that the bath may contain the tenth part of a homer","45:12":"And the shekel shall be twenty gerahs: twenty shekels","45:13":"This is the oblation that ye shall offer; the sixth part of an ephah of an homer of wheat","45:14":"of the bath of oil","45:15":"out of two hundred","45:16":"All the people of the land shall give this oblation for the prince in Israel.","45:17":"and the meal offerings","45:18":"in the first [day] of the month","45:19":"and put it on the door posts of the house","45:20":"and for him who is simple:  so shall you make atonement for the house.","45:21":"in the fourteenth day of the month","45:22":"And upon that day shall the prince prepare for himself and for all the people of the land a bullock for a sin offering.","45:23":"seven bulls and seven rams without blemish daily the seven days; and a male goat daily for a sin offering.","45:24":"an ephah for a bull","45:25":"in the fifteenth day of the month","46:1":"and on the day of the new moon it shall be opened.","46:2":"and shall stand by the post of the gate; and the priests shall prepare his burnt offering and his peace offerings","46:3":"Likewise the people of the land shall worship at the door of this gate before the LORD in the sabbaths and in the new moons.","46:4":"And the burnt offering that the prince shall offer unto the LORD in the sabbath day shall be six lambs without blemish","46:5":"and the meal offering for the lambs as he is able to give","46:6":"and six lambs","46:7":"an ephah for the bull","46:8":"he shall go in by the way of the porch of the gate","46:9":"he who enters by the way of the north gate to worship shall go forth by the way of the south gate; and he who enters by the way of the south gate shall go forth by the way of the north gate:  he shall not return by the way of the gate by which he came in","46:10":"when they go in","46:11":"and an ephah for a ram","46:12":"a burnt offering or peace offerings as a freewill offering to Yahweh","46:13":"Thou shalt daily prepare a burnt offering unto the LORD of a lamb of the first year without blemish: thou shalt prepare it every morning.","46:14":"the sixth part of an ephah","46:15":"and the meal offering","46:16":"it is his inheritance","46:17":"it shall be his to the year of liberty; then it shall return to the prince; but as for his inheritance","46:18":"to thrust them out of their possession; he shall give inheritance to his sons out of his own possession","46:19":"which was at the side of the gate","46:20":"This is the place where the priests shall boil the trespass offering and the sin offering","46:21":"and caused me to pass by the four corners of the court; and behold","46:22":"forty [cubits] long and thirty broad:  these four in the corners were of one measure.","46:23":"round about the four","46:24":"These are the boiling houses","47:1":"waters issued out from under the threshold of the house eastward; (for the forefront of the house was toward the east;) and the waters came down from under","47:2":"and led me round by the way outside to the outer gate","47:3":"he measured one thousand cubits","47:4":"and caused me to pass through the waters","47:5":"waters to swim in","47:6":"Son of man","47:7":"behold","47:8":"These waters issue forth toward the eastern region","47:9":"that every living creature which swarms","47:10":"that fishermen shall stand by it: from En Gedi even to En Eglaim shall be a place for the spreading of nets; their fish shall be after their kinds","47:11":"and the marshes of it","47:12":"on this side and on that side","47:13":"by which you shall divide the land for inheritance according to the twelve tribes of Israel:  Joseph [shall have two] portions.","47:14":"one as well as another; for I swore to give it to your fathers:  and this land shall fall to you for inheritance.","47:15":"from the great sea","47:16":"Berothah","47:17":"shall be Hazar Enon at the border of Damascus; and on the north northward is the border of Hamath. This is the north side.","47:18":"between Hauran and Damascus and Gilead","47:19":"to the brook [of Egypt]","47:20":"from the [south] border as far as over against the entrance of Hamath. This is the west side.","47:21":"So shall ye divide this land unto you according to the tribes of Israel.","47:22":"that you shall divide it by lot for an inheritance to you and to the strangers who sojourn among you","47:23":"that in what tribe the stranger sojourns","48:1":"beside the way of Hethlon to the entrance of Hamath","48:2":"from the east side to the west side","48:3":"from the east side even to the west side","48:4":"from the east side to the west side","48:5":"from the east side to the west side","48:6":"from the east side even to the west side","48:7":"from the east side to the west side","48:8":"from the east side to the west side","48:9":"and ten thousand in breadth.","48:10":"even for the priests","48:11":"who have kept my charge","48:12":"a thing most holy","48:13":"the Levites shall have twenty-five thousand in length","48:14":"nor exchange it","48:15":"in front of the twenty-five thousand","48:16":"and the south side four thousand and five hundred","48:17":"and toward the south two hundred fifty","48:18":"answerable to the holy offering","48:19":"out of all the tribes of Israel","48:20":"with the possession of the city.","48:21":"on the one side and on the other of the holy offering and of the possession of the city; in front of the twenty-five thousand of the offering toward the east border","48:22":"and from the possession of the city","48:23":"Benjamin","48:24":"from the east side to the west side","48:25":"from the east side to the west side","48:26":"from the east side to the west side","48:27":"from the east side to the west side","48:28":"at the south side southward","48:29":"and these are their several portions","48:30":"And these are the goings out of the city on the north side","48:31":"three gates northward:  the gate of Reuben","48:32":"and three gates:  even the gate of Joseph","48:33":"and three gates:  the gate of Simeon","48:34":"with their three gates:  the gate of Gad","48:35":"Yahweh is there."}