{"1:1":"an apostle (not from men","1:2":"to the assemblies of Galatia:","1:3":"and our Lord Jesus Christ","1:4":"that he might deliver us out of this present evil age","1:5":"To whom be glory for ever and ever. Amen.","1:6":"I marvel that ye are so soon removed from him that called you into the grace of Christ unto another gospel:","1:7":"and want to pervert the Good News of Christ.","1:8":"or an angel from heaven","1:9":"so I now say again:  if any man preaches to you any good news other than that which you received","1:10":"or of God?  Or am I striving to please men?  For if I were still pleasing men","1:11":"brothers","1:12":"nor was I taught it","1:13":"how that beyond measure I persecuted the assembly of God","1:14":"being more exceedingly zealous for the traditions of my fathers.","1:15":"who separated me from my mother's womb","1:16":"that I might preach him among the Gentiles","1:17":"but I went away into Arabia.  Then I returned to Damascus.","1:18":"and stayed with him fifteen days.","1:19":"except James","1:20":"behold","1:21":"Afterwards I came into the regions of Syria and Cilicia;","1:22":"","1:23":"But they had heard only","1:24":"And they glorified God in me.","2:1":"taking Titus also with me.","2:2":"and I laid before them the Good News which I preach among the Gentiles","2:3":"who was with me","2:4":"who stole in to spy out our liberty which we have in Christ Jesus","2:5":"not for an hour","2:6":"it makes no difference to me; God doesn't show partiality to man)--they","2:7":"when they saw that I had been entrusted with the Good News for the uncircumcision","2:8":"(For he that wrought effectually in Peter to the apostleship of the circumcision","2:9":"James and Cephas and John","2:10":"Only they would that we should remember the poor; the same which I also was forward to do.","2:11":"I resisted him to his face","2:12":"he ate with the Gentiles. But when they came","2:13":"And the other Jews dissembled likewise with him; insomuch that Barnabas also was carried away with their dissimulation.","2:14":"I said to Peter before them all","2:15":"","2:16":"even we believed in Christ Jesus","2:17":"while we sought to be justified in Christ","2:18":"I prove myself a law-breaker.","2:19":"through the law","2:20":"and it is no longer I that live","2:21":"then Christ died for nothing!,I do not frustrate the grace of God: for if righteousness come by the law, then Christ is dead in vain.,,,,,,,,","3:1":"who has bewitched you not to obey the truth","3:2":"or by hearing of faith?","3:3":"are you now completed in the flesh?","3:4":"if it is indeed in vain?","3:5":"and works miracles among you","3:6":"Even as Abraham believed God","3:7":"the same are children of Abraham.","3:8":"foreseeing that God would justify the Gentiles by faith","3:9":"those who are of faith are blessed with the faithful Abraham.","3:10":"Cursed is everyone who doesn't continue in all things that are written in the book of the law, to do them.{Deuteronomy 27:26}","3:11":"for","3:12":"but","3:13":"having become a curse for us.  For it is written","3:14":"That the blessing of Abraham might come on the Gentiles through Jesus Christ; that we might receive the promise of the Spirit through faith.","3:15":"speaking of human terms","3:16":"To seeds, as of many","3:17":"the law","3:18":"it is no more of promise; but God has granted it to Abraham by promise.","3:19":"until the seed should come to whom the promise has been made. It was ordained through angels by the hand of a mediator.","3:20":"but God is one.","3:21":"most certainly righteousness would have been of the law.","3:22":"that the promise by faith in Jesus Christ might be given to those who believe.","3:23":"we were kept in custody under the law","3:24":"that we might be justified by faith.","3:25":"we are no longer under a tutor.","3:26":"through faith in Christ Jesus.","3:27":"For as many of you as have been baptized into Christ have put on Christ.","3:28":"there is neither slave nor free man","3:29":"then you are Abraham's seed and heirs according to promise.","4:1":"he is no different from a bondservant","4:2":"But is under tutors and governors until the time appointed of the father.","4:3":"when we were children","4:4":"God sent out his Son","4:5":"that we might receive the adoption of children.","4:6":"God sent out the Spirit of his Son into your hearts","4:7":"but a son; and if a son","4:8":"not knowing God","4:9":"or rather to be known by God","4:10":"months","4:11":"that I might have wasted my labor for you.","4:12":"brothers","4:13":"Ye know how through infirmity of the flesh I preached the gospel unto you at the first.","4:14":"you didn't despise nor reject; but you received me as an angel of God","4:15":"if possible","4:16":"have I become your enemy by telling you the truth?","4:17":"they desire to alienate you","4:18":"and not only when I am present with you.","4:19":"of whom I am again in travail until Christ is formed in you--","4:20":"and to change my tone","4:21":"you that desire to be under the law","4:22":"one by the handmaid","4:23":"the son by the handmaid was born according to the flesh","4:24":"for these are two covenants. One is from Mount Sinai","4:25":"and answers to the Jerusalem that exists now","4:26":"which is the mother of us all.","4:27":"Rejoice, you barren who don't bear. Break forth and shout, you that don't travail. For more are the children of the desolate than of her who has a husband.{Isaiah 54:1}","4:28":"brothers","4:29":"he who was born according to the flesh persecuted him who was born according to the Spirit","4:30":"Nevertheless what saith the scripture? Cast out the bondwoman and her son: for the son of the bondwoman shall not be heir with the son of the freewoman.","4:31":"brothers","5:1":"and don't be entangled again with a yoke of bondage.","5:2":"I","5:3":"I testify again to every man who receives circumcision","5:4":"you who desire to be justified by the law.  You have fallen away from grace.","5:5":"through the Spirit","5:6":"nor uncircumcision","5:7":"Ye did run well; who did hinder you that ye should not obey the truth?","5:8":"This persuasion cometh not of him that calleth you.","5:9":"A little leaven leaveneth the whole lump.","5:10":"whoever he is.","5:11":"brothers","5:12":"I would they were even cut off which trouble you.","5:13":"brothers","5:14":"in this: You shall love your neighbor as yourself.{Leviticus 19:18}","5:15":"be careful that you don't consume one another.","5:16":"walk by the Spirit","5:17":"and the Spirit against the flesh; and these are contrary to one another","5:18":"you are not under the law.","5:19":"which are: adultery","5:20":"sorcery","5:21":"murders","5:22":"joy","5:23":"and self-control. Against such things there is no law.","5:24":"And they that are Christ's have crucified the flesh with the affections and lusts.","5:25":"let's also walk by the Spirit.","5:26":"provoking one another","6:1":"even if a man is caught in some fault","6:2":"and so fulfill the law of Christ.","6:3":"he deceives himself.","6:4":"and then he will take pride in himself and not in his neighbor.","6:5":"For every man shall bear his own burden.","6:6":"Let him that is taught in the word communicate unto him that teacheth in all good things.","6:7":"for whatever a man sows","6:8":"For he that soweth to his flesh shall of the flesh reap corruption; but he that soweth to the Spirit shall of the Spirit reap life everlasting.","6:9":"for we will reap in due season","6:10":"as we have opportunity","6:11":"Ye see how large a letter I have written unto you with mine own hand.","6:12":"they compel you to be circumcised; only that they may not be persecuted for the cross of Christ.","6:13":"but they desire to have you circumcised","6:14":"except in the cross of our Lord Jesus Christ","6:15":"nor uncircumcision","6:16":"peace and mercy be on them","6:17":"let no one cause me any trouble","6:18":"brothers.  Amen."}