{"1:1":"in the sixth month","1:2":"Thus speaketh the LORD of hosts","1:3":"the prophet","1:4":"while this house lieth waste?","1:5":"Now therefore thus saith the LORD of hosts; Consider your ways.","1:6":"and bring in little.  You eat","1:7":"","1:8":"bring wood","1:9":"Because of my house that lies waste, while each of you is busy with his own house.,Ye looked for much, and, lo it came to little; and when ye brought it home, I did blow upon it. Why? saith the LORD of hosts. Because of mine house that is waste, and ye run every man unto his own house., פָּנֹה אֶל־הַרְבֵּה וְהִנֵּה לִמְעָט וַהֲבֵאתֶם הַבַּיִת וְנָפַחְתִּי בוֹ יַעַן מֶה נְאֻם יְהוָה צְבָאוֹת יַעַן בֵּיתִי אֲשֶׁר־הוּא חָרֵב וְאַתֶּם רָצִים אִישׁ לְבֵיתוֹ׃ ‬,Ye looked for much, and, lo, it came to little; and when ye brought it home, I did blow upon it. Why? saith the LORD of hosts. Because of My house that lieth waste, while ye run every man for his own house.,ἐπεβλέψατε εἰς πολλά καὶ ἐγένετο ὀλίγα καὶ εἰσηνέχθη εἰς τὸν οἶκον καὶ ἐξεφύσησα αὐτά διὰ τοῦτο τάδε λέγει κύριος παντοκράτωρ ἀνθ' ὧν ὁ οἶκός μού ἐστιν ἔρημος ὑμεῖς δὲ διώκετε ἕκαστος εἰς τὸν οἶκον αὐτοῦ,Ye looked for much, and there came little; and it was brought into the house, and I blew it away. Therefore thus saith the Lord Almighty, Because my house is desolate, and ye run everyone into his own house;,,,,","1:10":"and the earth withholds its fruit.","1:11":"on the mountains","1:12":"the son of Shealtiel","1:13":"Yahweh's messenger","1:14":"the son of Shealtiel","1:15":"in the sixth month","2:1":"in the twenty-first day of the month","2:2":"","2:3":"Who is left among you that saw this house in her first glory? and how do ye see it now? is it not in your eyes in comparison of it as nothing?","2:4":"Zerubbabel","2:5":"and my Spirit lived among you. 'Don't be afraid.'","2:6":"it is a little while","2:7":"and I will fill this house with glory","2:8":"and the gold is mine","2:9":"' says Yahweh of Armies; 'and in this place will I give peace","2:10":"in the second year of Darius","2:11":"saying:","2:12":"and with his fold touches bread","2:13":"If one who is unclean by reason of a dead body touch any of these, will it be unclean? The priests answered","2:14":"'So is this people, and so is this nation before me,' says Yahweh; 'and so is every work of their hands. That which they offer there is unclean.,Then answered Haggai, and said, So is this people, and so is this nation before me, saith the LORD; and so is every work of their hands; and that which they offer there is unclean., וַיַּעַן חַגַּי וַיֹּאמֶר כֵּן הָעָם־הַזֶּה וְכֵן־הַגּוֹי הַזֶּה לְפָנַי נְאֻם־יְהוָה וְכֵן כָּל־מַעֲשֵׂה יְדֵיהֶם וַאֲשֶׁר יַקְרִיבוּ שָׁם טָמֵא הוּא׃ ‬,Then answered Haggai, and said: 'so is this people, and so is this nation before me, saith the LORD; and so is every work of their hands; and that which they offer there is unclean.,καὶ ἀπεκρίθη αγγαιος καὶ εἶπεν οὕτως ὁ λαὸς οὗτος καὶ οὕτως τὸ ἔθνος τοῦτο ἐνώπιον ἐμοῦ λέγει κύριος καὶ οὕτως πάντα τὰ ἔργα τῶν χειρῶν αὐτῶν καὶ ὃς ἐὰν ἐγγίσῃ ἐκεῖ μιανθήσεται ἕνεκεν τῶν λημμάτων αὐτῶν τῶν ὀρθρινῶν ὀδυνηθήσονται ἀπὸ προσώπου πόνων αὐτῶν καὶ ἐμισεῖτε ἐν πύλαις ἐλέγχοντας,2:15 And Aggaeus answered and said, So is this people, and so is this nation before me, saith the Lord; and so are all the works of their hands: and whosoever shall approach them, shall be defiled because of their early burdens: they shall be pained because of their toils; and ye have hated him that reproved in the gates.,,,,","2:15":"please consider from this day and backward","2:16":"when one came to a heap of twenty measures","2:17":"mildew","2:18":"please","2:19":"the vine","2:20":"saying","2:21":"","2:22":"and those who ride in them. The horses and their riders will come down","2:23":"says Yahweh of Armies"}