{"1:1":"having in the past spoken to the fathers through the prophets at many times and in various ways","1:2":"whom he appointed heir of all things","1:3":"the very image of his substance","1:4":"as he has inherited a more excellent name than they have.","1:5":"You are my Son. Today have I become your father?{Psalm 2:7} and again","1:6":"when he brings in the firstborn into the world he says","1:7":"Who makes his angels winds, and his servants a flame of fire.{Psalm 104:4}","1:8":"Your throne, O God, is forever and ever. The scepter of uprightness is the scepter of your Kingdom.,But unto the Son he saith, Thy throne, O God, is for ever and ever: a sceptre of righteousness is the sceptre of thy kingdom.,,,,,,,,","1:9":"and hated iniquity; therefore God","1:10":"You, Lord, in the beginning, laid the foundation of the earth. The heavens are the works of your hands.,And, Thou, Lord, in the beginning hast laid the foundation of the earth; and the heavens are the works of thine hands:,,,,,,,,","1:11":"but you continue.  They all will grow old like a garment does.","1:12":"you will roll them up","1:13":"Sit at my right hand, until I make your enemies the footstool of your feet?{Psalm 110:1}","1:14":"sent out to do service for the sake of those who will inherit salvation?","2:1":"lest perhaps we drift away.","2:2":"and every transgression and disobedience received a just recompense;","2:3":"was confirmed to us by those who heard;","2:4":"both by signs and wonders","2:5":"of which we speak","2:6":"saying","2:7":"Thou madest him a little lower than the angels; thou crownedst him with glory and honour","2:8":"","2:9":"Jesus","2:10":"for whom are all things","2:11":"for which cause he is not ashamed to call them brothers{The word for brothers here and where context allows may also be correctly translated brothers and sisters or siblings.}","2:12":"I will declare your name to my brothers.  In the midst of the congregation I will sing your praise.{Psalm 22:22}","2:13":"I will put my trust in him.{Isaiah 8:17} Again","2:14":"he also himself in like manner partook of the same","2:15":"And deliver them who through fear of death were all their lifetime subject to bondage.","2:16":"he doesn't give help to angels","2:17":"that he might become a merciful and faithful high priest in things pertaining to God","2:18":"he is able to help those who are tempted.","3:1":"holy brothers","3:2":"as also was Moses in all his house.","3:3":"inasmuch as he who built the house has more honor than the house.","3:4":"For every house is builded by some man; but he that built all things is God.","3:5":"for a testimony of those things which were afterward to be spoken","3:6":"if we hold fast our confidence and the glorying of our hope firm to the end.","3:7":"even as the Holy Spirit says","3:8":"as in the provocation","3:9":"and saw my works for forty years.","3:10":"and said","3:11":"'They will not enter into my rest.'{Psalm 95:7-11},So I sware in my wrath, They shall not enter into my rest.),,,,,,,,","3:12":"brothers","3:13":"so long as it is called today; lest any one of you be hardened by the deceitfulness of sin.","3:14":"if we hold fast the beginning of our confidence firm to the end:","3:15":"Today if you will hear his voice, don't harden your hearts, as in the rebellion.{Psalm 95:7-8}","3:16":"when they heard","3:17":"whose bodies fell in the wilderness?","3:18":"but to those who were disobedient?","3:19":"So we see that they could not enter in because of unbelief.","4:1":"lest perhaps anyone of you should seem to have come short of a promise of entering into his rest.","4:2":"even as they also did","4:3":"even as he has said","4:4":"God rested on the seventh day from all his works;{Genesis 2:2}","4:5":"They will not enter into my rest.{Psalm 95:11}","4:6":"and they to whom the good news was before preached failed to enter in because of disobedience","4:7":"today","4:8":"he would not have spoken afterward of another day.","4:9":"There remaineth therefore a rest to the people of God.","4:10":"as God did from his.","4:11":"lest anyone fall after the same example of disobedience.","4:12":"and active","4:13":"but all things are naked and laid open before the eyes of him with whom we have to do.","4:14":"who has passed through the heavens","4:15":"but one who has been in all points tempted like we are","4:16":"that we may receive mercy","5:1":"being taken from among men","5:2":"because he himself is also surrounded with weakness.","5:3":"he must offer sacrifices for sins for the people","5:4":"but he is called by God","5:5":"but it was he who said to him","5:6":"You are a priest forever, after the order of Melchizedek.{Psalm 110:4}","5:7":"in the days of his flesh","5:8":"yet learned obedience by the things which he suffered.","5:9":"he became to all of those who obey him the author of eternal salvation","5:10":"Called of God an high priest after the order of Melchisedec.","5:11":"and hard to interpret","5:12":"you again need to have someone teach you the rudiments of the first principles of the oracles of God. You have come to need milk","5:13":"for he is a baby.","5:14":"who by reason of use have their senses exercised to discern good and evil.","6:1":"let us press on to perfection--not laying again a foundation of repentance from dead works","6:2":"of laying on of hands","6:3":"if God permits.","6:4":"and were made partakers of the Holy Spirit","6:5":"and the powers of the age to come","6:6":"it is impossible to renew them again to repentance; seeing they crucify the Son of God for themselves again","6:7":"and brings forth a crop suitable for them for whose sake it is also tilled","6:8":"it is rejected and near being cursed","6:9":"beloved","6:10":"so as to forget your work and the labor of love which you showed toward his name","6:11":"","6:12":"but imitators of those who through faith and patience inherited the promises.","6:13":"since he could swear by none greater","6:14":"Surely blessing I will bless you, and multiplying I will multiply you.{Genesis 22:17}","6:15":"having patiently endured","6:16":"and in every dispute of theirs the oath is final for confirmation.","6:17":"being determined to show more abundantly to the heirs of the promise the immutability of his counsel","6:18":"in which it is impossible for God to lie","6:19":"a hope both sure and steadfast and entering into that which is within the veil;","6:20":"having become a high priest forever after the order of Melchizedek.","7:1":"king of Salem","7:2":"by interpretation","7:3":"without mother","7:4":"to whom even Abraham","7:5":"that is","7:6":"and has blessed him who has the promises.","7:7":"And without all contradiction the less is blessed of the better.","7:8":"but there one receives tithes of whom it is testified that he lives.","7:9":"who receives tithes","7:10":"For he was yet in the loins of his father","7:11":"what further need was there for another priest to arise after the order of Melchizedek","7:12":"there is of necessity a change made also in the law.","7:13":"from which no one has officiated at the altar.","7:14":"about which tribe Moses spoke nothing concerning priesthood.","7:15":"if after the likeness of Melchizedek there arises another priest","7:16":"not after the law of a fleshly commandment","7:17":"You are a priest forever, according to the order of Melchizedek.{Psalm 110:4}","7:18":"For there is verily a disannulling of the commandment going before for the weakness and unprofitableness thereof.","7:19":"and a bringing in of a better hope","7:20":"And inasmuch as not without an oath he was made priest:","7:21":"but he with an oath by him that says of him","7:22":"Jesus has become the collateral of a better covenant.","7:23":"indeed","7:24":"because he lives forever","7:25":"seeing that he lives forever to make intercession for them.","7:26":"guiltless","7:27":"like those high priests","7:28":"but the word of the oath which came after the law appoints a Son forever who has been perfected.","8:1":"the main point is this. We have such a high priest","8:2":"and of the true tabernacle","8:3":"For every high priest is ordained to offer gifts and sacrifices: wherefore it is of necessity that this man have somewhat also to offer.","8:4":"he would not be a priest at all","8:5":"even as Moses was warned by God when he was about to make the tabernacle","8:6":"by so much as he is also the mediator of a better covenant","8:7":"then no place would have been sought for a second.","8:8":"he said","8:9":"in the day that I took them by the hand to lead them out of the land of Egypt; for they didn't continue in my covenant","8:10":"","8:11":"{TR reads neighbor instead of fellow citizen} and every man his brother","8:12":"","8:13":"A new covenant, he has made the first old. But that which is becoming old and grows aged is near to vanishing away.","9:1":"and an earthly sanctuary.","9:2":"the table","9:3":"","9:4":"and the ark of the covenant overlaid on all sides with gold","9:5":"of which things we can't speak now in detail.","9:6":"the priests go in continually into the first tabernacle","9:7":"once in the year","9:8":"that the way into the Holy Place wasn't yet revealed while the first tabernacle was still standing;","9:9":"where gifts and sacrifices are offered that are incapable","9:10":"imposed until a time of reformation.","9:11":"through the greater and more perfect tabernacle","9:12":"but through his own blood","9:13":"and the ashes of a heifer sprinkling those who have been defiled","9:14":"who through the eternal Spirit offered himself without blemish to God","9:15":"since a death has occurred for the redemption of the transgressions that were under the first covenant","9:16":"there must of necessity be the death of him who made it.","9:17":"for it is never in force while he who made it lives.","9:18":"Whereupon neither the first testament was dedicated without blood.","9:19":"he took the blood of the calves and the goats","9:20":"This is the blood of the covenant which God has commanded you.{Exodus 24:8}","9:21":"Moreover he sprinkled with blood both the tabernacle","9:22":"nearly everything is cleansed with blood","9:23":"It was therefore necessary that the patterns of things in the heavens should be purified with these; but the heavenly things themselves with better sacrifices than these.","9:24":"which are representations of the true","9:25":"as the high priest enters into the holy place year by year with blood not his own","9:26":"he has been revealed to put away sin by the sacrifice of himself.","9:27":"and after this","9:28":"having been offered once to bear the sins of many","10:1":"having a shadow of the good to come","10:2":"because the worshippers","10:3":"But in those sacrifices there is a remembrance again made of sins every year.","10:4":"For it is not possible that the blood of bulls and of goats should take away sins.","10:5":"he says","10:6":"In burnt offerings and sacrifices for sin thou hast had no pleasure.","10:7":"'Behold","10:8":"Sacrifices and offerings and whole burnt offerings and sacrifices for sin you didn't desire, neither had pleasure in them (those which are offered according to the law)","10:9":"Behold, I have come to do your will. He takes away the first","10:10":"By the which will we are sanctified through the offering of the body of Jesus Christ once for all.","10:11":"which can never take away sins","10:12":"when he had offered one sacrifice for sins forever","10:13":"From henceforth expecting till his enemies be made his footstool.","10:14":"For by one offering he hath perfected for ever them that are sanctified.","10:15":"for after saying","10:16":"","10:17":"And their sins and iniquities will I remember no more.","10:18":"there is no more offering for sin.","10:19":"brothers","10:20":"a new and living way","10:21":"","10:22":"having our hearts sprinkled from an evil conscience","10:23":"Let us hold fast the profession of our faith without wavering; (for he is faithful that promised;)","10:24":"","10:25":"as the custom of some is","10:26":"there remains no more a sacrifice for sins","10:27":"and a fierceness of fire which will devour the adversaries.","10:28":"He that despised Moses' law died without mercy under two or three witnesses:","10:29":"do you think","10:30":"Vengeance belongs to me, says the Lord","10:31":"It is a fearful thing to fall into the hands of the living God.","10:32":"in which","10:33":"being exposed to both reproaches and oppressions; and partly","10:34":"and joyfully accepted the plundering of your possessions","10:35":"which has a great reward.","10:36":"having done the will of God","10:37":"","10:38":"my soul has no pleasure in him.{Habakkuk 2:3-4},Now the just shall live by faith: but if any man draw back, my soul shall have no pleasure in him.,,,,,,,,","10:39":"but of those who have faith to the saving of the soul.","11:1":"proof of things not seen.","11:2":"the elders obtained testimony.","11:3":"we understand that the universe has been framed by the word of God","11:4":"Abel offered to God a more excellent sacrifice than Cain","11:5":"Enoch was taken away","11:6":"for he who comes to God must believe that he exists","11:7":"Noah","11:8":"Abraham","11:9":"he lived as an alien in the land of promise","11:10":"whose builder and maker is God.","11:11":"even Sarah herself received power to conceive","11:12":"and as innumerable as the sand which is by the sea shore","11:13":"not having received the promises","11:14":"For they that say such things declare plainly that they seek a country.","11:15":"they would have had enough time to return.","11:16":"that is","11:17":"Abraham","11:18":"In Isaac will your seed be called;{Genesis 21:12}","11:19":"he also did receive him back from the dead.","11:20":"Isaac blessed Jacob and Esau","11:21":"Jacob","11:22":"Joseph","11:23":"Moses","11:24":"Moses","11:25":"than to enjoy the pleasures of sin for a time;","11:26":"Esteeming the reproach of Christ greater riches than the treasures in Egypt: for he had respect unto the recompence of the reward.","11:27":"he left Egypt","11:28":"he kept the Passover","11:29":"they passed through the Red Sea as on dry land. When the Egyptians tried to do so","11:30":"the walls of Jericho fell down","11:31":"Rahab the prostitute","11:32":"Barak","11:33":"through faith subdued kingdoms","11:34":"{Daniel 3:1-30} escaped the edge of the sword","11:35":"not accepting their deliverance","11:36":"yes","11:37":"afflicted","11:38":"wandering in deserts","11:39":"having had testimony given to them through their faith","11:40":"so that apart from us they should not be made perfect.","12:1":"seeing we are surrounded by so great a cloud of witnesses","12:2":"the author and perfecter of faith","12:3":"that you don't grow weary","12:4":"striving against sin;","12:5":"My son, don't take lightly the chastening of the Lord, nor faint when you are reproved by him;,And ye have forgotten the exhortation which speaketh unto you as unto children, My son, despise not thou the chastening of the Lord, nor faint when thou art rebuked of him:,,,,,,,,","12:6":"he chastens","12:7":"for what son is there whom his father doesn't discipline?","12:8":"of which all have been made partakers","12:9":"we had the fathers of our flesh to chasten us","12:10":"for a few days","12:11":"Now no chastening for the present seemeth to be joyous","12:12":"lift up the hands that hang down and the feeble knees","12:13":"{Proverbs 4:26} so that which is lame may not be dislocated","12:14":"and the sanctification without which no man will see the Lord","12:15":"and many be defiled by it;","12:16":"or profane person","12:17":"he was rejected","12:18":"and that burned with fire","12:19":"and the voice of words; which those who heard it begged that not one more word should be spoken to them","12:20":"If even an animal touches the mountain, it shall be stoned{TR adds or shot with an arrow [see Exodus 19:12-13]};{Exodus 19:12-13}","12:21":"that Moses said","12:22":"and to the city of the living God","12:23":"to God the Judge of all","12:24":"the mediator of a new covenant","12:25":"how much more will we not escape who turn away from him who warns from heaven","12:26":"but now he has promised","12:27":"Yet once more, signifies the removing of those things that are shaken","12:28":"receiving a Kingdom that can't be shaken","12:29":"For our God is a consuming fire.","13:1":"Let brotherly love continue.","13:2":"for in doing so","13:3":"as bound with them; and those who are ill-treated","13:4":"and let the bed be undefiled:  but God will judge the sexually immoral and adulterers.","13:5":"content with such things as you have","13:6":"The Lord is my helper. I will not fear.  What can man do to me?{Psalm 118:6-7}","13:7":"men who spoke to you the word of God","13:8":"today","13:9":"for it is good that the heart be established by grace","13:10":"We have an altar","13:11":"whose blood is brought into the holy place by the high priest as an offering for sin","13:12":"that he might sanctify the people through his own blood","13:13":"bearing his reproach.","13:14":"but we seek that which is to come.","13:15":"then","13:16":"for with such sacrifices God is well pleased.","13:17":"for they watch on behalf of your souls","13:18":"for we are persuaded that we have a good conscience","13:19":"that I may be restored to you sooner.","13:20":"who brought again from the dead the great shepherd of the sheep with the blood of an eternal covenant","13:21":"working in you that which is well pleasing in his sight","13:22":"brothers","13:23":"with whom","13:24":"Salute all them that have the rule over you","13:25":"Grace be with you all. Amen."}