{"1:1":"which he saw concerning Judah and Jerusalem","1:2":"heavens","1:3":"and the donkey his master's crib; but Israel doesn't know","1:4":"a people loaded with iniquity","1:5":"that you revolt more and more? The whole head is sick","1:6":"welts","1:7":"and it is desolate","1:8":"like a hut in a field of melons","1:9":"we would have been as Sodom; we would have been like Gomorrah.","1:10":"you rulers of Sodom!  Listen to the law of our God","1:11":"","1:12":"who has required this at your hand","1:13":"Sabbaths","1:14":"Your new moons and your appointed feasts my soul hateth: they are a trouble unto me; I am weary to bear them.","1:15":"I will hide my eyes from you. Yes","1:16":"make yourself clean.  Put away the evil of your doings from before my eyes.  Cease to do evil.","1:17":"","1:18":"","1:19":"you shall eat the good of the land;","1:20":"you shall be devoured with the sword; for the mouth of Yahweh has spoken it.,But if ye refuse and rebel, ye shall be devoured with the sword: for the mouth of the LORD hath spoken it., וְאִם־תְּמָאֲנוּ וּמְרִיתֶם חֶרֶב תְּאֻכְּלוּ כִּי פִּי יְהוָה דִּבֵּר׃ ס ‬,But if ye refuse and rebel, Ye shall be devoured with the sword; For the mouth of the LORD hath spoken.,καὶ ἐὰν θέλητε καὶ εἰσακούσητέ μου τὰ ἀγαθὰ τῆς γῆς φάγεσθε,but if ye be not willing, nor hearken to me, a sword shall devour you: for the mouth of the Lord has spoken this.,,,,","1:21":"but now murderers.","1:22":"your wine mixed with water.","1:23":"and companions of thieves. Everyone loves bribes","1:24":"Yahweh of Armies","1:25":"thoroughly purge away your dross","1:26":"and your counselors as at the beginning.  Afterward you shall be called 'The city of righteousness","1:27":"and her converts with righteousness.","1:28":"and those who forsake Yahweh shall be consumed.","1:29":"and you shall be confounded for the gardens that you have chosen.","1:30":"and as a garden that has no water.","1:31":"and his work like a spark. They will both burn together","2:1":"The word that Isaiah the son of Amoz saw concerning Judah and Jerusalem.","2:2":"that the mountain of Yahweh's house shall be established on the top of the mountains","2:3":"Come, let's go up to the mountain of Yahweh, to the house of the God of Jacob; and he will teach us of his ways, and we will walk in his paths. For out of Zion the law shall go forth","2:4":"and will decide concerning many peoples; and they shall beat their swords into plowshares","2:5":"come","2:6":"the house of Jacob","2:7":"neither is there any end of their treasures.  Their land also is full of horses","2:8":"that which their own fingers have made.","2:9":"and mankind is humbled; therefore don't forgive them.","2:10":"and hide in the dust","2:11":"the haughtiness of men will be bowed down","2:12":"and for all that is lifted up; and it shall be brought low:","2:13":"that are high and lifted up","2:14":"for all the hills that are lifted up","2:15":"for every fortified wall","2:16":"and for all pleasant imagery.","2:17":"and the haughtiness of men shall be brought low; and Yahweh alone shall be exalted in that day.","2:18":"And the idols he shall utterly abolish.","2:19":"and into the holes of the earth","2:20":"men shall cast away their idols of silver","2:21":"and into the clefts of the ragged rocks","2:22":"whose breath is in his nostrils; for of what account is he?","3:1":"behold","3:2":"the man of war","3:3":"the honorable man","3:4":"and children shall rule over them.","3:5":"everyone by another","3:6":"saying","3:7":"saying","3:8":"and Judah is fallen; because their tongue and their doings are against Yahweh","3:9":"The shew of their countenance doth witness against them; and they declare their sin as Sodom","3:10":"Say ye to the righteous","3:11":"Woe unto the wicked! it shall be ill with him: for the reward of his hands shall be given him.","3:12":"children are their oppressors","3:13":"and stands to judge the peoples.","3:14":"and their leaders:  It is you who have eaten up the vineyard. The spoil of the poor is in your houses.,The LORD will enter into judgment with the ancients of his people, and the princes thereof: for ye have eaten up the vineyard; the spoil of the poor is in your houses., יְהוָה בְּמִשְׁפָּט יָבוֹא עִם־זִקְנֵי עַמּוֹ וְשָׂרָיו וְאַתֶּם בִּעַרְתֶּם הַכֶּרֶם גְּזֵלַת הֶעָנִי בְּבָתֵּיכֶם׃ ‬,The LORD will enter into judgment With the elders of His people, and the princes thereof: It is ye that have eaten up the vineyard; The spoil of the poor is in your houses;","3:15":"and grind the face of the poor? says the Lord, Yahweh of Armies.,What mean ye that ye beat my people to pieces, and grind the faces of the poor? saith the Lord GOD of hosts., מלכם* **מַה־**לָּכֶם‪[a]‬ תְּדַכְּאוּ עַמִּי וּפְנֵי עֲנִיִּים תִּטְחָנוּ נְאֻם־אֲדֹנָי יְהוִה צְבָאוֹת׃ ס ‬,What mean ye that ye crush My people, And grind the face of the poor? Saith the Lord","3:16":"Because the daughters of Zion are haughty, and walk with outstretched necks and flirting eyes, walking to trip as they go, jingling ornaments on their feet;,Moreover the LORD saith, Because the daughters of Zion are haughty, and walk with stretched forth necks and wanton eyes, walking and mincing as they go, and making a tinkling with their feet:, וַיֹּאמֶר יְהוָה יַעַן כִּי גָבְהוּ בְּנוֹת צִיּוֹן וַתֵּלַכְנָה *נטוות **נְטוּיוֹת גָּרוֹן וּמְשַׂקְּרוֹת עֵינָיִם הָלוֹךְ וְטָפֹף תֵּלַכְנָה וּבְרַגְלֵיהֶם תְּעַכַּסְנָה׃ ‬,Moreover the LORD said: Because the daughters of Zion are haughty, And walk with stretched-forth necks And wanton eyes, Walking and mincing as they go, And making a tinkling with their feet;,τί ὑμεῖς ἀδικεῖτε τὸν λαόν μου καὶ τὸ πρόσωπον τῶν πτωχῶν καταισχύνετε 3:16 τάδε λέγει κύριος ἀνθ' ὧν ὑψώθησαν αἱ θυγατέρες σιων καὶ ἐπορεύθησαν ὑψηλῷ τραχήλῳ καὶ ἐν νεύμασιν ὀφθαλμῶν καὶ τῇ πορείᾳ τῶν ποδῶν ἅμα σύρουσαι τοὺς χιτῶνας καὶ τοῖς ποσὶν ἅμα παίζουσαι,Thus saith the Lord, Because the daughters of Sion are haughty, and have walked with an outstretched neck, and with winking of the eyes, and motion of the feet, at the same time drawing their garments in trains, and at the same time sporting with their feet:,,,,","3:17":"and Yahweh will make their scalps bald.,Therefore the LORD will smite with a scab the crown of the head of the daughters of Zion, and the LORD will discover their secret parts., וְשִׂפַּח אֲדֹנָי קָדְקֹד בְּנוֹת צִיּוֹן וַיהוָה פָּתְהֵן יְעָרֶה׃ ס ‬,Therefore the Lord will smite with a scab \fThe crown of the head of the daughters of Zion, And the LORD will lay bare their secret parts.,τάδε λέγει κύριος ἀνθ' ὧν ὑψώθησαν αἱ θυγατέρες σιων καὶ ἐπορεύθησαν ὑψηλῷ τραχήλῳ καὶ ἐν νεύμασιν ὀφθαλμῶν καὶ τῇ πορείᾳ τῶν ποδῶν ἅμα σύρουσαι τοὺς χιτῶνας καὶ τοῖς ποσὶν ἅμα παίζουσαι,therefore the Lord will humble the chief daughters of Sion, and the Lord will expose their form in that day;,,,,","3:18":"the headbands","3:19":"the bracelets","3:20":"the ankle chains","3:21":"the nose rings","3:22":"the capes","3:23":"the fine linen garments","3:24":"there shall be rottenness; instead of a belt","3:25":"and your mighty in the war.","3:26":"And her gates shall lament and mourn; and she being desolate shall sit upon the ground.","4:1":"saying","4:2":"Yahweh's branch will be beautiful and glorious","4:3":"that he who is left in Zion","4:4":"and shall have purged the blood of Jerusalem from its midst","4:5":"and over her assemblies","4:6":"and for a refuge and for a shelter from storm and from rain.","5:1":"Now will I sing to my wellbeloved a song of my beloved touching his vineyard. My wellbeloved hath a vineyard in a very fruitful hill:","5:2":"gathered out its stones","5:3":"","5:4":"that I have not done in it?  Why","5:5":"and it will be eaten up. I will break down its wall of it","5:6":"but it will grow briers and thorns.  I will also command the clouds that they rain no rain on it.,And I will lay it waste: it shall not be pruned, nor digged; but there shall come up briers and thorns: I will also command the clouds that they rain no rain upon it., וַאֲשִׁיתֵהוּ בָתָה לֹא יִזָּמֵר וְלֹא יֵעָדֵר וְעָלָה שָׁמִיר וָשָׁיִת וְעַל הֶעָבִים אֲצַוֶּה מֵהַמְטִיר עָלָיו מָטָר׃ ‬,And I will lay it waste: It shall not be pruned nor hoed, But there shall come up briers and thorns; I will also command the clouds That they rain no rain upon it.,νῦν δὲ ἀναγγελῶ ὑμῖν τί ποιήσω τῷ ἀμπελῶνί μου ἀφελῶ τὸν φραγμὸν αὐτοῦ καὶ ἔσται εἰς διαρπαγήν καὶ καθελῶ τὸν τοῖχον αὐτοῦ καὶ ἔσται εἰς καταπάτημα,And I will forsake my vineyard; and it shall not be pruned, nor dug, and thorns shall come up upon it as on barren land; and I will command the clouds to rain no rain upon it.,,,,","5:7":"and the men of Judah his pleasant plant:  and he looked for justice","5:8":"who lay field to field","5:9":"Yahweh of Armies says:  Surely many houses will be desolate, even great and beautiful, unoccupied.,In mine ears said the LORD of hosts, Of a truth many houses shall be desolate, even great and fair, without inhabitant., בְּאָזְנָי יְהוָה צְבָאוֹת אִם־לֹא בָּתִּים רַבִּים לְשַׁמָּה יִהְיוּ גְּדֹלִים וְטוֹבִים מֵאֵין יוֹשֵׁב׃ ‬,In mine ears said the LORD of hosts: Of a truth many houses shall be desolate, Even great and fair, without inhabitant.,οὐαὶ οἱ συνάπτοντες οἰκίαν πρὸς οἰκίαν καὶ ἀγρὸν πρὸς ἀγρὸν ἐγγίζοντες ἵνα τοῦ πλησίον ἀφέλωνταί τι μὴ οἰκήσετε μόνοι ἐπὶ τῆς γῆς,For these things have reached the ears of the Lord of hosts: for though many houses should be built, many and fair houses shall be desolate, and there shall be no inhabitants in them.,,,,","5:10":"ten yokes","5:11":"that they may follow strong drink; who stay late into the night","5:12":"lyre","5:13":"and their multitudes are parched with thirst.","5:14":"and opened its mouth without measure; and their glory","5:15":"mankind is humbled","5:16":"and God the Holy One is sanctified in righteousness.","5:17":"and strangers will eat the ruins of the rich.","5:18":"and wickedness as with cart rope;","5:19":"Let him make speed, let him hasten his work, that we may see it; and let the counsel of the Holy One of Israel draw near and come, that we may know it!","5:20":"and good evil; who put darkness for light","5:21":"and prudent in their own sight!","5:22":"and champions at mixing strong drink;","5:23":"but deny justice for the innocent!","5:24":"and as the dry grass sinks down in the flame","5:25":"and he has stretched out his hand against them","5:26":"and he will whistle for them from the end of the earth. Behold","5:27":"nor the latchet of their shoes be broken:","5:28":"and all their bows bent.  Their horses' hoofs will be like flint","5:29":"they shall roar","5:30":"darkness and distress. The light is darkened in its clouds.","6:1":"I saw the Lord sitting on a throne","6:2":"Above it stood the seraphims: each one had six wings; with twain he covered his face","6:3":"and said","6:4":"and the house was filled with smoke.","6:5":"Woe is me!  For I am undone, because I am a man of unclean lips, and I dwell in the midst of a people of unclean lips: for my eyes have seen the King, Yahweh of Armies!","6:6":"having a live coal in his hand","6:7":"and said","6:8":"saying","6:9":"Go, and tell this people, 'You hear indeed, but don't understand; and you see indeed, but don't perceive.',And he said, Go, and tell this people, Hear ye indeed, but understand not; and see ye indeed, but perceive not., וַיֹּאמֶר לֵךְ וְאָמַרְתָּ לָעָם הַזֶּה שִׁמְעוּ שָׁמוֹעַ וְאַל־תָּבִינוּ וּרְאוּ רָאוֹ וְאַל־תֵּדָעוּ׃ ‬,And He said: Go","6:10":"and shut their eyes; lest they see with their eyes","6:11":"Lord, how long?  He answered","6:12":"and the forsaken places are many in the midst of the land.","6:13":"that also will in turn be consumed: as a terebinth","7:1":"the son of Uzziah","7:2":"saying","7:3":"Go out now to meet Ahaz, you, and Shearjashub your son, at the end of the conduit of the upper pool, on the highway of the fuller's field.,Then said the LORD unto Isaiah, Go forth now to meet Ahaz, thou, and Shearjashub thy son, at the end of the conduit of the upper pool in the highway of the fuller's field;, וַיֹּאמֶר יְהוָה אֶל־יְשַׁעְיָהוּ צֵא־נָא לִקְרַאת אָחָז אַתָּה וּשְׁאָר יָשׁוּב בְּנֶךָ אֶל־קְצֵה תְּעָלַת הַבְּרֵכָה הָעֶלְיוֹנָה אֶל־מְסִלַּת שְׂדֵה כוֹבֵס׃ ‬,Then said the LORD unto Isaiah: Go forth now to meet Ahaz","7:4":"'Be careful","7:5":"Ephraim","7:6":"Let us go up against Judah","7:7":"Thus saith the Lord GOD","7:8":"and the head of Damascus is Rezin; and within sixty-five years Ephraim shall be broken in pieces","7:9":"and the head of Samaria is Remaliah's son.  If you will not believe","7:10":"saying","7:11":"Ask thee a sign of the LORD thy God; ask it either in the depth","7:12":"I will not ask, neither will I tempt Yahweh.","7:13":"Listen now, house of David:  Is it not enough for you to try the patience of men, that you will try the patience of my God also?,And he said, Hear ye now, O house of David; Is it a small thing for you to weary men, but will ye weary my God also?, וַיֹּאמֶר שִׁמְעוּ־נָא בֵּית דָּוִד הַמְעַט מִכֶּם הַלְאוֹת אֲנָשִׁים כִּי תַלְאוּ גַּם אֶת־אֱלֹהָי׃ ‬,And he said: Hear ye now","7:14":"the virgin will conceive","7:15":"and choose the good.","7:16":"and choose the good","7:17":"on your people","7:18":"and for the bee that is in the land of Assyria.","7:19":"and shall all rest in the desolate valleys","7:20":"even with the king of Assyria","7:21":"and two sheep;","7:22":"that because of the abundance of milk which they shall give he shall eat butter:  for everyone will eat butter and honey that is left in the midst of the land.","7:23":"shall be for briers and thorns.","7:24":"because all the land will be briers and thorns.","7:25":"you shall not come there for fear of briers and thorns; but it shall be for the sending forth of oxen","8:1":"Take a large tablet, and write on it with a man's pen, 'For Maher Shalal Hash Baz;{Maher Shalal Hash Baz means quick to the plunder","8:2":"and Zechariah the son of Jeberechiah.,And I took unto me faithful witnesses to record, Uriah the priest, and Zechariah the son of Jeberechiah., וְאָעִידָה לִּי עֵדִים נֶאֱמָנִים אֵת אוּרִיָּה הַכֹּהֵן וְאֶת־זְכַרְיָהוּ בֶּן יְבֶרֶכְיָהוּ׃ ‬,and I will take unto Me faithful witnesses to record, Uriah the priest, and Zechariah the son of Jeberechiah.","8:3":"and she conceived","8:4":"'My father","8:5":"saying","8:6":"","8:7":"behold","8:8":"Immanuel.","8:9":"you peoples","8:10":"and it will be brought to nothing; speak the word","8:11":"and instructed me not to walk in the way of this people","8:12":"","8:13":"Sanctify the LORD of hosts himself; and let him be your fear","8:14":"but for both houses of Israel","8:15":"fall","8:16":"Bind up the testimony","8:17":"who hides his face from the house of Jacob","8:18":"I and the children whom Yahweh has given me are for signs and for wonders in Israel from Yahweh of Armies","8:19":"Consult with those who have familiar spirits and with the wizards, who chirp and who mutter: shouldn't a people consult with their God?  Should they consult the dead on behalf of the living?","8:20":"surely there is no morning for them.","8:21":"sore distressed and hungry; and it will happen that when they are hungry","8:22":"and see distress","9:1":"he brought into contempt the land of Zebulun and the land of Naphtali; but in the latter time he has made it glorious","9:2":"on them the light has shined.","9:3":"as men rejoice when they divide the spoil.","9:4":"and the staff of his shoulder","9:5":"and the garments rolled in blood","9:6":"Counselor","9:7":"on the throne of David","9:8":"and it falls on Israel.","9:9":"including Ephraim and the inhabitants of Samaria","9:10":"The bricks are fallen down","9:11":"and will stir up his enemies","9:12":"and the Philistines behind; and they will devour Israel with open mouth.  For all this","9:13":"neither have they sought Yahweh of Armies.","9:14":"palm branch and reed","9:15":"and the prophet who teaches lies is the tail.","9:16":"For the leaders of this people cause them to err; and they that are led of them are destroyed.","9:17":"neither will he have compassion on their fatherless and widows; for everyone is profane and an evil-doer","9:18":"it kindles in the thickets of the forest","9:19":"the land is burnt up; and the people are the fuel for the fire. No one spares his brother.","9:20":"and be hungry; and he will eat on the left hand","9:21":"Ephraim; and Ephraim","10:1":"and to the writers who write oppressive decrees;","10:2":"and to rob the poor among my people of their rights","10:3":"and in the desolation which will come from afar?  To whom will you flee for help? Where will you leave your wealth?","10:4":"and will fall under the slain.  For all this his anger is not turned away","10:5":"the rod of my anger","10:6":"and against the people who anger me will I give him a charge to take the spoil and to take the prey","10:7":"neither does his heart think so; but it is in his heart to destroy","10:8":"Aren't all of my princes kings?,For he saith, Are not my princes altogether kings?, כִּי יֹאמַר הֲלֹא שָׂרַי יַחְדָּו מְלָכִים׃ ‬,For he saith: Are not my princes all of them kings?","10:9":"","10:10":"whose engraved images exceeded those of Jerusalem and of Samaria;","10:11":"as I have done to Samaria and her idols","10:12":"when the Lord has performed his whole work on Mount Zion and on Jerusalem","10:13":"By the strength of my hand I have done it, and by my wisdom; for I have understanding:  and I have removed the boundaries of the peoples, and have robbed their treasures. Like a valiant man I have brought down their rulers.,For he saith, By the strength of my hand I have done it, and by my wisdom; for I am prudent: and I have removed the bounds of the people, and have robbed their treasures, and I have put down the inhabitants like a valiant man:, כִּי אָמַר בְּכֹחַ יָדִי עָשִׂיתִי וּבְחָכְמָתִי כִּי נְבֻנוֹתִי וְאָסִיר גְּבוּלֹת עַמִּים *ועתידתיהם **וַעֲתוּדוֹתֵיהֶם שׁוֹשֵׂתִי וְאוֹרִיד כַּאבִּיר יוֹשְׁבִים׃ ‬,For he hath said: By the strength of my hand I have done it, And by my wisdom, for I am prudent; In that I have removed the bounds of the peoples, And have robbed their treasures, And have brought down as one mighty the inhabitants;,καὶ ἔσται ὅταν συντελέσῃ κύριος πάντα ποιῶν ἐν τῷ ὄρει σιων καὶ ἐν ιερουσαλημ ἐπάξει ἐπὶ τὸν νοῦν τὸν μέγαν τὸν ἄρχοντα τῶν ἀσσυρίων καὶ ἐπὶ τὸ ὕψος τῆς δόξης τῶν ὀφθαλμῶν αὐτοῦ,For he said, I will act in strength, and in the wisdom of my understanding I will remove the boundaries of nations, and will spoil their strength.,,,,","10:14":"and like one gathers eggs that are abandoned","10:15":"or as if a staff should lift up someone who is not wood.","10:16":"Yahweh of Armies","10:17":"and his Holy One for a flame; and it will burn and devour his thorns and his briers in one day.","10:18":"and of his fruitful field","10:19":"so that a child could write their number.","10:20":"and those who have escaped from the house of Jacob will no more again lean on him who struck them","10:21":"even the remnant of Jacob","10:22":"Israel","10:23":"Yahweh of Armies","10:24":"Yahweh of Armies","10:25":"and the indignation against you will be accomplished","10:26":"as in the slaughter of Midian at the rock of Oreb. His rod will be over the sea","10:27":"that his burden will depart from off your shoulder","10:28":"He is come to Aiath","10:29":"They are gone over the passage: they have taken up their lodging at Geba; Ramah is afraid; Gibeah of Saul is fled.","10:30":"daughter of Gallim!  Listen","10:31":"Madmenah is removed; the inhabitants of Gebim gather themselves to flee.","10:32":"the hill of Jerusalem.","10:33":"the Lord","10:34":"and Lebanon will fall by the Mighty One.","11:1":"and a branch out of his roots will bear fruit.","11:2":"the spirit of counsel and might","11:3":"neither decide by the hearing of his ears;","11:4":"and decide with equity for the humble of the earth.  He will strike the earth with the rod of his mouth; and with the breath of his lips he will kill the wicked.","11:5":"and faithfulness the belt of his waist.","11:6":"and the leopard will lie down with the young goat; The calf","11:7":"And the cow and the bear shall feed; their young ones shall lie down together: and the lion shall eat straw like the ox.","11:8":"and the weaned child will put his hand on the viper's den.","11:9":"as the waters cover the sea.","11:10":"who stands as a banner of the peoples; and his resting place will be glorious.","11:11":"from Egypt","11:12":"and will assemble the outcasts of Israel","11:13":"and those who persecute Judah will be cut off.  Ephraim won't envy Judah","11:14":"and the children of Ammon will obey them.","11:15":"and will split it into seven streams","11:16":"like there was for Israel in the day that he came up out of the land of Egypt.","12:1":"I will give thanks to you, Yahweh; for though you were angry with me, your anger has turned away and you comfort me.,And in that day thou shalt say, O LORD, I will praise thee: though thou wast angry with me, thine anger is turned away, and thou comfortedst me., וְאָמַרְתָּ בַּיּוֹם הַהוּא אוֹדְךָ יְהוָה כִּי אָנַפְתָּ בִּי יָשֹׁב אַפְּךָ וּתְנַחֲמֵנִי׃ ‬,And in that day thou shalt say: I will give thanks unto Thee","12:2":"God is my salvation.  I will trust","12:3":"Therefore with joy shall ye draw water out of the wells of salvation.","12:4":"Give thanks to Yahweh!  Call on his name. Declare his doings among the peoples.  Proclaim that his name is exalted!,And in that day shall ye say, Praise the LORD, call upon his name, declare his doings among the people, make mention that his name is exalted., וַאֲמַרְתֶּם בַּיּוֹם הַהוּא הוֹדוּ לַיהוָה קִרְאוּ בִשְׁמוֹ הוֹדִיעוּ בָעַמִּים עֲלִילֹתָיו הַזְכִּירוּ כִּי נִשְׂגָּב שְׁמוֹ׃ ‬,And in that day shall ye say: Give thanks unto the LORD","12:5":"for he has done excellent things! Let this be known in all the earth!","12:6":"you inhabitant of Zion; for the Holy One of Israel is great in the midst of you!,Cry out and shout, thou inhabitant of Zion: for great is the Holy One of Israel in the midst of thee., צַהֲלִי וָרֹנִּי יוֹשֶׁבֶת צִיּוֹן כִּי־גָדוֹל בְּקִרְבֵּךְ קְדוֹשׁ יִשְׂרָאֵל׃ פ ‬,Cry aloud and shout, thou inhabitant of Zion, For great is the Holy One of Israel in the midst of thee.","13:1":"which Isaiah the son of Amoz saw:","13:2":"that they may go into the gates of the nobles.","13:3":"I have called my mighty men for my anger","13:4":"as of a great people; the noise of an uproar of the kingdoms of the nations gathered together!  Yahweh of Armies is mustering the army for the battle.","13:5":"from the uttermost part of heaven","13:6":"Howl ye; for the day of the LORD is at hand; it shall come as a destruction from the Almighty.","13:7":"and everyone's heart will melt.","13:8":"And they shall be afraid: pangs and sorrows shall take hold of them; they shall be in pain as a woman that travaileth: they shall be amazed one at another; their faces shall be as flames.","13:9":"the day of Yahweh comes","13:10":"and the moon will not cause its light to shine.","13:11":"and the wicked for their iniquity.  I will cause the arrogance of the proud to cease","13:12":"even a person than the pure gold of Ophir.","13:13":"and the earth will be shaken out of its place in the wrath of Yahweh of Armies","13:14":"and like sheep that no one gathers","13:15":"Every one that is found shall be thrust through; and every one that is joined unto them shall fall by the sword.","13:16":"and their wives raped.","13:17":"I will stir up the Medes against them","13:18":"Their bows also shall dash the young men to pieces; and they shall have no pity on the fruit of the womb; their eyes shall not spare children.","13:19":"the glory of kingdoms","13:20":"neither will it be lived in from generation to generation.  The Arabian will not pitch a tent there","13:21":"and their houses will be full of jackals.  Ostriches will dwell there","13:22":"and jackals in the pleasant palaces.  Her time is near to come","14:1":"and will yet choose Israel","14:2":"and bring them to their place. The house of Israel will possess them in Yahweh's land for servants and for handmaids.  They will take as captives those whose captives they were; and they shall rule over their oppressors.","14:3":"from your trouble","14:4":"and say","14:5":"the scepter of the rulers","14:6":"who ruled the nations in anger","14:7":"and is quiet.  They break out song.","14:8":"the fir trees rejoice with you","14:9":"even all the rulers of the earth. It has raised up from their thrones all the kings of the nations.","14:10":"Have you also become as weak as we are?  Have you become like us?","14:11":"with the sound of your stringed instruments.  Maggots are spread out under you","14:12":"morning star","14:13":"I will ascend into heaven! I will exalt my throne above the stars of God!  I will sit on the mountain of assembly, in the far north!,For thou hast said in thine heart, I will ascend into heaven, I will exalt my throne above the stars of God: I will sit also upon the mount of the congregation, in the sides of the north:, וְאַתָּה אָמַרְתָּ בִלְבָבְךָ הַשָּׁמַיִם אֶעֱלֶה מִמַּעַל לְכוֹכְבֵי־אֵל אָרִים כִּסְאִי וְאֵשֵׁב בְּהַר־מוֹעֵד בְּיַרְכְּתֵי צָפוֹן׃ ‬,And thou saidst in thy heart: I will ascend into heaven","14:14":"σὺ δὲ εἶπας ἐν τῇ διανοίᾳ σου εἰς τὸν οὐρανὸν ἀναβήσομαι ἐπάνω τῶν ἄστρων τοῦ οὐρανοῦ θήσω τὸν θρόνον μου καθιῶ ἐν ὄρει ὑψηλῷ ἐπὶ τὰ ὄρη τὰ ὑψηλὰ τὰ πρὸς βορρᾶν","14:15":"to the depths of the pit.","14:16":"saying","14:17":"and overthrew its cities; who didn't release his prisoners to their home?,That made the world as a wilderness, and destroyed the cities thereof; that opened not the house of his prisoners?, שָׂם תֵּבֵל כַּמִּדְבָּר וְעָרָיו הָרָס אֲסִירָיו לֹא־פָתַח בָּיְתָה׃ ‬,That made the world as a wilderness, And destroyed the cities thereof; That opened not the house of his prisoners?","14:18":"sleep in glory","14:19":"clothed with the slain","14:20":"because you have destroyed your land.  You have killed your people.  The seed of evil-doers will not be named forever.","14:21":"that they not rise up and possess the earth","14:22":"and cut off from Babylon name and remnant, and son and son's son, says Yahweh.","14:23":"I will also make it a possession for the bittern","14:24":"saying","14:25":"and tread him under foot on my mountains.  Then his yoke will leave them","14:26":"This is the purpose that is purposed upon the whole earth: and this is the hand that is stretched out upon all the nations.","14:27":"and who can stop it? His hand is stretched out","14:28":"In the year that king Ahaz died was this burden.","14:29":"O Philistia","14:30":"and the needy will lie down in safety; and I will kill your root with famine","14:31":"gate!  Cry","14:32":"and in her the afflicted of his people will take refuge.","15:1":"Ar of Moab is laid waste","15:2":"and to Dibon","15:3":"they dress themselves in sackcloth. In their streets and on their housetops","15:4":"And Heshbon shall cry","15:5":"to Eglath Shelishiyah; for they go up by the ascent of Luhith with weeping; for in the way of Horonaim","15:6":"the tender grass fails","15:7":"and that which they have stored up","15:8":"and its wailing to Beer Elim.","15:9":"a lion on those of Moab who escape","16:1":"to the mountain of the daughter of Zion.","16:2":"as a scattered nest","16:3":"Take counsel","16:4":"be a hiding place for him from the face of the destroyer. For the extortioner is brought to nothing.  Destruction ceases. The oppressors are consumed out of the land.","16:5":"in the tent of David","16:6":"that he is very proud; even of his arrogance","16:7":"utterly stricken.","16:8":"which reached even to Jazer","16:9":"Heshbon","16:10":"and joy out of the fruitful field; and in the vineyards there will be no singing","16:11":"and my inward parts for Kir Heres.","16:12":"when he wearies himself on the high place","16:13":"This is the word that the LORD hath spoken concerning Moab since that time.","16:14":"saying","17:1":"","17:2":"which shall lie down","17:3":"and the kingdom from Damascus","17:4":"","17:5":"and his arm reaps the grain.  Yes","17:6":"like the shaking of an olive tree","17:7":"people will look to their Maker","17:8":"the work of their hands; neither shall they respect that which their fingers have made","17:9":"their strong cities will be like the forsaken places in the woods and on the mountain top","17:10":"and have not remembered the rock of your strength.  Therefore you plant pleasant plants","17:11":"you hedge it in.  In the morning","17:12":"the uproar of many peoples","17:13":"and they will flee far off","17:14":"behold","18:1":"the land of the rustling of wings","18:2":"even in vessels of papyrus on the waters","18:3":"and you dwellers on the earth","18:4":"I will be still, and I will see in my dwelling place, like clear heat in sunshine, like a cloud of dew in the heat of harvest.","18:5":"when the blossom is over","18:6":"and for the animals of the earth. The ravenous birds will summer on them","18:7":"a present will be brought to Yahweh of Armies from a people tall and smooth","19:1":"","19:2":"and they will fight everyone against his brother","19:3":"the charmers","19:4":"says the Lord, Yahweh of Armies.,And the Egyptians will I give over into the hand of a cruel lord; and a fierce king shall rule over them, saith the Lord, the LORD of hosts., וְסִכַּרְתִּי אֶת־מִצְרַיִם בְּיַד אֲדֹנִים קָשֶׁה וּמֶלֶךְ עַז יִמְשָׁל־בָּם נְאֻם הָאָדוֹן יְהוָה צְבָאוֹת׃ ‬,And I will give over the Egyptians Iinto the hand of a cruel lord; And a fierce king shall rule over them, Saith the Lord, the LORD of hosts.,καὶ ταραχθήσεται τὸ πνεῦμα τῶν αἰγυπτίων ἐν αὐτοῖς καὶ τὴν βουλὴν αὐτῶν διασκεδάσω καὶ ἐπερωτήσουσιν τοὺς θεοὺς αὐτῶν καὶ τὰ ἀγάλματα αὐτῶν καὶ τοὺς ἐκ τῆς γῆς φωνοῦντας καὶ τοὺς ἐγγαστριμύθους,And I will deliver Egypt into the hands of men, of cruel lords; and cruel kings shall rule over them: thus saith the Lord of hosts.,,,,","19:5":"and the river will be wasted and become dry.","19:6":"And they shall turn the rivers far away; and the brooks of defence shall be emptied and dried up: the reeds and flags shall wither.","19:7":"by the brink of the Nile","19:8":"and all those who fish in the Nile will mourn","19:9":"and those who weave white cloth","19:10":"And they shall be broken in the purposes thereof","19:11":"I am the son of the wise, the son of ancient kings?","19:12":"Where are they? where are thy wise men? and let them tell thee now","19:13":"who are the cornerstone of her tribes.","19:14":"like a drunken man staggers in his vomit.","19:15":"which head or tail","19:16":"which he shakes over them.","19:17":"because of the plans of Yahweh of Armies","19:18":"there will be five cities in the land of Egypt that speak the language of Canaan","19:19":"there will be an altar to Yahweh in the midst of the land of Egypt","19:20":"and he will send them a savior and a defender","19:21":"and the Egyptians will know Yahweh in that day.  Yes","19:22":"striking and healing. They will return to Yahweh","19:23":"and the Assyrian shall come into Egypt","19:24":"Israel will be the third with Egypt and with Assyria","19:25":"saying","20:1":"when Sargon the king of Assyria sent him","20:2":"saying","20:3":"As my servant Isaiah has walked naked and barefoot three years for a sign and a wonder concerning Egypt and concerning Ethiopia,,And the LORD said, Like as my servant Isaiah hath walked naked and barefoot three years for a sign and wonder upon Egypt and upon Ethiopia;, וַיֹּאמֶר יְהוָה כַּאֲשֶׁר הָלַךְ עַבְדִּי יְשַׁעְיָהוּ עָרוֹם וְיָחֵף שָׁלֹשׁ שָׁנִים אוֹת וּמוֹפֵת עַל־מִצְרַיִם וְעַל־כּוּשׁ׃ ‬,And the LORD said: Like as My servant Isaiah hath walked naked and barefoot to be for three years a sign and a wonder upon Egypt and upon Ethiopia","20:4":"young and old","20:5":"because of Ethiopia their expectation","20:6":"'Behold","21:1":"it comes from the wilderness","21:2":"and the destroyer destroys. Go up","21:3":"like the pains of a woman in labor. I am in so much pain that I can't hear.  I so am dismayed that I can't see.","21:4":"My heart panted","21:5":"you princes","21:6":"Go, set a watchman.  Let him declare what he sees.,For thus hath the LORD said unto me, Go, set a watchman, let him declare what he seeth., כִּי כֹה אָמַר אֵלַי אֲדֹנָי לֵךְ הַעֲמֵד הַמְצַפֶּה אֲשֶׁר יִרְאֶה יַגִּיד׃ ‬,For thus hath the Lord said unto me: Go, set a watchman; let him declare what he seeth!,ἑτοίμασον τὴν τράπεζαν πίετε φάγετε ἀναστάντες οἱ ἄρχοντες ἑτοιμάσατε θυρεούς,For thus said the Lord to me, Go and station a watchman for thyself, and declare whatever thou shalt see.,,,,","21:7":"horsemen in pairs","21:8":"O Lord","21:9":"here comes a troop of men","21:10":"and the grain of my floor! That which I have heard from Yahweh of Armies, the God of Israel, I have declared to you.,O my threshing, and the corn of my floor: that which I have heard of the LORD of hosts, the God of Israel, have I declared unto you., מְדֻשָׁתִי וּבֶן־גָּרְנִי אֲשֶׁר שָׁמַעְתִּי מֵאֵת יְהוָה צְבָאוֹת אֱלֹהֵי יִשְׂרָאֵל הִגַּדְתִּי לָכֶם׃ ס ‬,O thou my threshing, and the winnowing of my floor, That which I have heard from the LORD of hosts, The God of Israel, have I declared unto you.,καὶ ἰδοὺ αὐτὸς ἔρχεται ἀναβάτης συνωρίδος καὶ ἀποκριθεὶς εἶπεν πέπτωκεν βαβυλών καὶ πάντα τὰ ἀγάλματα αὐτῆς καὶ τὰ χειροποίητα αὐτῆς συνετρίβησαν εἰς τὴν γῆν,Hear, ye that are left, and ye that are in pain, hear what things I have heard of the Lord of hosts which the God of Israel has declared to us.,,,,","21:11":"Watchman, what of the night?  Watchman, what of the night?","21:12":"The morning comes, and also the night. If you will inquire, inquire.  Come back again.","21:13":"you caravans of Dedanites.","21:14":"The inhabitants of the land of Tema brought water to him that was thirsty","21:15":"from the drawn sword","21:16":"Within a year, as a worker bound by contract would count it, all the glory of Kedar will fail,,For thus hath the LORD said unto me, Within a year, according to the years of an hireling, and all the glory of Kedar shall fail:, כִּי־כֹה אָמַר אֲדֹנָי אֵלָי בְּעוֹד שָׁנָה כִּשְׁנֵי שָׂכִיר וְכָלָה כָּל־כְּבוֹד קֵדָר׃ ‬,For thus hath the Lord said unto me: Within a year","21:17":"the mighty men of the children of Kedar","22:1":"that you have all gone up to the housetops?","22:2":"a tumultuous city","22:3":"All thy rulers are fled together","22:4":"Look away from me.  I will weep bitterly. Don't labor to comfort me for the destruction of the daughter of my people.,Therefore said I, Look away from me; I will weep bitterly, labour not to comfort me, because of the spoiling of the daughter of my people., עַל־כֵּן אָמַרְתִּי שְׁעוּ מִנִּי אֲמָרֵר בַּבֶּכִי אַל־תָּאִיצוּ לְנַחֲמֵנִי עַל־שֹׁד בַּת־עַמִּי׃ ‬,Therefore said I: Look away from me","22:5":"and of treading down","22:6":"with chariots of men and horsemen; and Kir uncovered the shield.","22:7":"and the horsemen set themselves in array at the gate.","22:8":"And he discovered the covering of Judah","22:9":"that they were many; and you gathered together the waters of the lower pool.","22:10":"and you broke down the houses to fortify the wall.","22:11":"neither did you have respect for him who purposed it long ago.","22:12":"the Lord","22:13":"joy and gladness","22:14":"Surely this iniquity will not be forgiven you until you die, says the Lord","22:15":"Yahweh of Armies","22:16":"that you have dug out a tomb here?'  Cutting himself out a tomb on high","22:17":"Yahweh will overcome you and hurl you away violently. Yes","22:18":"and throw you like a ball into a large country.  There you will die","22:19":"And I will drive thee from thy station","22:20":"","22:21":"and strengthen him with your belt.  I will commit your government into his hand; and he will be a father to the inhabitants of Jerusalem","22:22":"and no one will shut.  He will shut","22:23":"And I will fasten him as a nail in a sure place; and he shall be for a glorious throne to his father's house.","22:24":"the offspring and the issue","22:25":"the nail that was fastened in a sure place will give way.  It will be cut down, and fall. The burden that was on it will be cut off, for Yahweh has spoken it.","23:1":"you ships of Tarshish!  For it is laid waste","23:2":"you inhabitants of the coast","23:3":"the seed of the Shihor","23:4":"Sidon; for the sea has spoken","23:5":"they will be in anguish at the report of Tyre.","23:6":"you inhabitants of the coast!","23:7":"whose antiquity is of ancient days","23:8":"the giver of crowns","23:9":"to stain the pride of all glory","23:10":"daughter of Tarshish. There is no restraint any more.","23:11":"He stretched out his hand over the sea","23:12":"You shall rejoice no more, you oppressed virgin daughter of Sidon.  Arise, pass over to Kittim. Even there you will have no rest.","23:13":"the land of the Chaldeans.  This people was not. The Assyrians founded it for those who dwell in the wilderness. They set up their towers.  They overthrew its palaces. They made it a ruin.","23:14":"you ships of Tarshish","23:15":"according to the days of one king. After the end of seventy years it will be to Tyre like in the song of the prostitute.","23:16":"you prostitute that has been forgotten.  Make sweet melody.  Sing many songs","23:17":"and she shall return to her wages","23:18":"to eat sufficiently","24:1":"Yahweh makes the earth empty","24:2":"so with the priest; as with the servant","24:3":"The land shall be utterly emptied","24:4":"The earth mourneth and fadeth away","24:5":"because they have transgressed the laws","24:6":"and those who dwell therein are found guilty.  Therefore the inhabitants of the earth are burned","24:7":"The new wine mourneth","24:8":"The mirth of tabrets ceaseth","24:9":"They shall not drink wine with a song; strong drink shall be bitter to them that drink it.","24:10":"that no man may come in.","24:11":"There is a crying for wine in the streets; all joy is darkened","24:12":"and the gate is struck with destruction.","24:13":"as the shaking of an olive tree","24:14":"They shall lift up their voice","24:15":"even the name of Yahweh","24:16":"I pine away! I pine away! woe is me!  The treacherous have dealt treacherously. Yes","24:17":"the pit","24:18":"and the foundations of the earth tremble.","24:19":"The earth is utterly broken down","24:20":"and will sway back and forth like a hammock.  Its disobedience will be heavy on it","24:21":"and the kings of the earth on the earth.","24:22":"as prisoners are gathered in the pit","24:23":"and the sun ashamed; for Yahweh of Armies will reign on Mount Zion","25:1":"you are my God.  I will exalt you!  I will praise your name","25:2":"a fortified city into a ruin","25:3":"Therefore shall the strong people glorify thee","25:4":"a stronghold to the needy in his distress","25:5":"the song of the dreaded ones will be brought low.","25:6":"Yahweh of Armies will make all peoples a feast of fat things","25:7":"and the veil that is spread over all nations.","25:8":"for Yahweh has spoken it.","25:9":"Behold, this is our God!  We have waited for him, and he will save us!  This is Yahweh!  We have waited for him.  We will be glad and rejoice in his salvation!","25:10":"even like straw is trodden down in the water of the dunghill.","25:11":"like one who swims spreads out hands to swim","25:12":"laid low","26:1":"this song will be sung in the land of Judah:  We have a strong city.  God appoints salvation for walls and bulwarks.,In that day shall this song be sung in the land of Judah; We have a strong city; salvation will God appoint for walls and bulwarks., בַּיּוֹם הַהוּא יוּשַׁר הַשִּׁיר־הַזֶּה בְּאֶרֶץ יְהוּדָה עִיר עָז־לָנוּ יְשׁוּעָה יָשִׁית חוֹמוֹת וָחֵל׃ ‬,In that day shall this song be sung in the land of Judah: We have a strong city; Walls and bulwarks doth He appoint for salvation.,καὶ τὸ ὕψος τῆς καταφυγῆς τοῦ τοίχου σου ταπεινώσει καὶ καταβήσεται ἕως τοῦ ἐδάφους,In that day they shall sing this song in the land of Judea; Behold a strong city; and he shall make salvation its wall and bulwark.,,,,","26:2":"that the righteous nation may enter: the one which keeps faith.","26:3":"because he trusts in you.","26:4":"Yahweh","26:5":"the lofty city. He lays it low.  He lays it low even to the ground. He brings it even to the dust.","26:6":"and the steps of the needy.,The foot shall tread it down, even the feet of the poor, and the steps of the needy., תִּרְמְסֶנָּה רָגֶל רַגְלֵי עָנִי פַּעֲמֵי דַלִּים׃ ‬,The foot shall tread it down, Even the feet of the poor, and the steps of the needy.,ὃς ταπεινώσας κατήγαγες τοὺς ἐνοικοῦντας ἐν ὑψηλοῖς πόλεις ὀχυρὰς καταβαλεῖς καὶ κατάξεις ἕως ἐδάφους,And the feet of the meek and lowly shall trample them.,,,,","26:7":"The way of the just is uprightness: thou","26:8":"in the way of your judgments","26:9":"with my spirit within me will I seek you earnestly; for when your judgments are in the earth","26:10":"yet he will not learn righteousness.  In the land of uprightness he will deal wrongfully","26:11":"your hand is lifted up","26:12":"you will ordain peace for us","26:13":"other lords besides you have had dominion over us","26:14":"and caused all memory of them to perish.","26:15":"O Yahweh.  You have increased the nation!  You are glorified!  You have enlarged all the borders of the land.","26:16":"in trouble they have visited you.  They poured out a prayer when your chastening was on them.","26:17":"who draws near the time of her delivery","26:18":"it seems","26:19":"you who dwell in the dust; for your dew is like the dew of herbs","26:20":"my people","26:21":"behold","27:1":"Yahweh with his hard and great and strong sword will punish leviathan","27:2":"sing to her","27:3":"Yahweh","27:4":"but if I should find briers and thorns","27:5":"that he may make peace with me.  Let him make peace with me.,Or let him take hold of my strength, that he may make peace with me; and he shall make peace with me., אוֹ יַחֲזֵק בְּמָעוּזִּי יַעֲשֶׂה שָׁלוֹם לִי שָׁלוֹם יַעֲשֶׂה־לִּי׃ ‬,Or else let him take hold of My strength, That he may make peace with Me; yea, let him make peace with Me.,οὐκ ἔστιν ἣ οὐκ ἐπελάβετο αὐτῆς τίς με θήσει φυλάσσειν καλάμην ἐν ἀγρῷ διὰ τὴν πολεμίαν ταύτην ἠθέτηκα αὐτήν τοίνυν διὰ τοῦτο ἐποίησεν κύριος ὁ θεὸς πάντα ὅσα συνέταξεν κατακέκαυμαι,I am burnt up; they that dwell in her shall cry, Let us make peace with him, let us make peace,,,,,","27:6":"Jacob will take root.  Israel will blossom and bud. They will fill the surface of the world with fruit.","27:7":"Hath he smitten him","27:8":"when you send them away","27:9":"by this the iniquity of Jacob will be forgiven","27:10":"a habitation deserted and forsaken","27:11":"they will be broken off. The women will come and set them on fire","27:12":"that Yahweh will thresh from the flowing stream of the Euphrates to the brook of Egypt; and you will be gathered one by one","27:13":"and those who were outcasts in the land of Egypt","28:1":"and to the fading flower of his glorious beauty","28:2":"the Lord has a mighty and strong one.  Like a storm of hail","28:3":"The crown of pride","28:4":"which is on the head of the fertile valley","28:5":"Yahweh of Armies will become a crown of glory","28:6":"and strength to those who turn back the battle at the gate.","28:7":"and stagger with strong drink. The priest and the prophet reel with strong drink. They are swallowed up by wine.  They stagger with strong drink. They err in vision.  They stumble in judgment.","28:8":"For all tables are full of vomit and filthiness","28:9":"and drawn from the breasts?","28:10":"precept on precept; line on line","28:11":"For with stammering lips and another tongue will he speak to this people.","28:12":"This is the resting place.  Give rest to weary; and This is the refreshing; yet they would not hear.","28:13":"precept on precept; line on line","28:14":"you scoffers","28:15":"Because ye have said","28:16":"Behold, I lay in Zion for a foundation a stone, a tried stone, a precious cornerstone of a sure foundation.  He who believes shall not act hastily.,Therefore thus saith the Lord GOD, Behold, I lay in Zion for a foundation a stone, a tried stone, a precious corner stone, a sure foundation: he that believeth shall not make haste., לָכֵן כֹּה אָמַר אֲדֹנָי יְהוִה הִנְנִי יִסַּד בְּצִיּוֹן אָבֶן אֶבֶן בֹּחַן פִּנַּת יִקְרַת מוּסָד מוּסָּד הַמַּאֲמִין לֹא יָחִישׁ׃ ‬,Therefore thus saith the Lord GOD: Behold, I lay in Zion for a foundation a stone, A tried stone, a costly corner-stone of sure foundation; He that believeth shall not make haste.,ὅτι εἴπατε ἐποιήσαμεν διαθήκην μετὰ τοῦ ᾅδου καὶ μετὰ τοῦ θανάτου συνθήκας καταιγὶς φερομένη ἐὰν παρέλθῃ οὐ μὴ ἔλθῃ ἐφ' ἡμᾶς ἐθήκαμεν ψεῦδος τὴν ἐλπίδα ἡμῶν καὶ τῷ ψεύδει σκεπασθησόμεθα,Therefore thus saith the Lord, even the Lord, Behold, I lay for the foundations of Sion a costly stone, a choice, a corner-stone, a precious stone, for its foundations; and he that believes on him shall by no means be ashamed.,,,,","28:17":"and righteousness the plumb line.  The hail will sweep away the refuge of lies","28:18":"and your agreement with Sheol shall not stand.  When the overflowing scourge passes through","28:19":"it will seize you; for morning by morning it will pass through","28:20":"and the blanket is too narrow to wrap oneself in.","28:21":"his unusual work","28:22":"lest your bonds be made strong; for I have heard a decree of destruction from the Lord","28:23":"and hear my voice!  Listen","28:24":"Doth the plowman plow all day to sow? doth he open and break the clods of his ground?","28:25":"doesn't he plant the dill","28:26":"and teaches him.","28:27":"neither is a cart wheel turned over the cumin; but the dill is beaten out with a stick","28:28":"his horses don't grind it.","28:29":"who is wonderful in counsel","29:1":"the city where David encamped! Add year to year; let the feasts come around;","29:2":"and there will be mourning and lamentation.  She shall be to me as an altar hearth{or","29:3":"and will lay siege against you with posted troops.  I will raise siege works against you.","29:4":"and will speak out of the ground. Your speech will mumble out of the dust.  Your voice will be as of one who has a familiar spirit","29:5":"and the multitude of the ruthless ones like chaff that blows away. Yes","29:6":"with earthquake","29:7":"even all who fight against her and her stronghold","29:8":"and behold","29:9":"but not with wine; they stagger","29:10":"and has closed your eyes","29:11":"which men deliver to one who is educated","29:12":"saying","29:13":"Because this people draws near with their mouth and with their lips to honor me, but they have removed their heart far from me, and their fear of me is a commandment of men which has been taught;,Wherefore the Lord said, Forasmuch as this people draw near me with their mouth, and with their lips do honour me, but have removed their heart far from me, and their fear toward me is taught by the precept of men:, וַיֹּאמֶר אֲדֹנָי יַעַן כִּי נִגַּשׁ הָעָם הַזֶּה בְּפִיו וּבִשְׂפָתָיו כִּבְּדוּנִי וְלִבּוֹ רִחַק מִמֶּנִּי וַתְּהִי יִרְאָתָם אֹתִי מִצְוַת אֲנָשִׁים מְלֻמָּדָה׃ ‬,And the Lord said: Forasmuch as this people draw near, And with their mouth and with their lips do honour Me, But have removed their heart far from Me, And their fear of Me is a command-ment of men learned by rote;,καὶ δοθήσεται τὸ βιβλίον τοῦτο εἰς χεῖρας ἀνθρώπου μὴ ἐπισταμένου γράμματα καὶ ἐρεῖ αὐτῷ ἀνάγνωθι τοῦτο καὶ ἐρεῖ οὐκ ἐπίσταμαι γράμματα,And the Lord has said, This people draw nigh to me with their mouth, and they honour me with their lips, but their heart is far from me: but in vain do they worship me, teaching the commandments and doctrines of men.,,,,","29:14":"behold","29:15":"and whose works are in the dark","29:16":"He didn't make me; or the thing formed say of him who formed it","29:17":"and Lebanon will be turned into a fruitful field","29:18":"the deaf will hear the words of the book","29:19":"and the poor among men will rejoice in the Holy One of Israel.","29:20":"and the scoffer ceases","29:21":"and lay a snare for the arbiter in the gate","29:22":"who redeemed Abraham","29:23":"the work of my hands","29:24":"and those who grumble will receive instruction.,They also that erred in spirit shall come to understanding, and they that murmured shall learn doctrine., וְיָדְעוּ תֹעֵי־רוּחַ בִּינָה וְרוֹגְנִים יִלְמְדוּ־לֶקַח׃ ‬,They also that err in spirit shall come to understanding, And they that murmur shall learn instruction.,ἀλλ' ὅταν ἴδωσιν τὰ τέκνα αὐτῶν τὰ ἔργα μου δι' ἐμὲ ἁγιάσουσιν τὸ ὄνομά μου καὶ ἁγιάσουσιν τὸν ἅγιον ιακωβ καὶ τὸν θεὸν τοῦ ισραηλ φοβηθήσονται,And they that erred in spirit shall know understanding, and the murmurers shall learn obedience, and the stammering tongues shall learn to speak peace.,,,,","30:1":"who take counsel, but not from me; and who make an alliance, but not with my Spirit, that they may add sin to sin,,Woe to the rebellious children, saith the LORD, that take counsel, but not of me; and that cover with a covering, but not of my spirit, that they may add sin to sin:, הוֹי בָּנִים סוֹרְרִים נְאֻם־יְהוָה לַעֲשׂוֹת עֵצָה וְלֹא מִנִּי וְלִנְסֹךְ מַסֵּכָה וְלֹא רוּחִי לְמַעַן סְפוֹת חַטָּאת עַל־חַטָּאת׃ ‬,Woe to the rebellious children, saith the LORD, That take counsel, but not of Me; And that form projects, but not of My spirit, That they may add sin to sin;,καὶ γνώσονται οἱ τῷ πνεύματι πλανώμενοι σύνεσιν οἱ δὲ γογγύζοντες μαθήσονται ὑπακούειν καὶ αἱ γλώσσαι αἱ ψελλίζουσαι μαθήσονται λαλεῖν εἰρήνην,Woe to the apostate children, saith the Lord: ye have framed counsel, not by me, and covenants not by my Spirit, to add sins to sins:,,,,","30:2":"and have not asked my advice; to strengthen themselves in the strength of Pharaoh","30:3":"and the refuge in the shadow of Egypt your confusion.","30:4":"and their ambassadors have come to Hanes.","30:5":"that are not a help nor profit","30:6":"of the lioness and the lion","30:7":"and to no purpose; therefore have I called her Rahab who sits still.","30:8":"write it before them on a tablet","30:9":"lying children","30:10":"Don't see! and to the prophets","30:11":"οἱ λέγοντες τοῖς προφήταις μὴ ἀναγγέλλετε ἡμῖν καὶ τοῖς τὰ ὁράματα ὁρῶσιν μὴ λαλεῖτε ἡμῖν ἀλλὰ ἡμῖν λαλεῖτε καὶ ἀναγγέλλετε ἡμῖν ἑτέραν πλάνησιν","30:12":"Because you despise this word, and trust in oppression and perverseness, and rely on it;,Wherefore thus saith the Holy One of Israel, Because ye despise this word, and trust in oppression and perverseness, and stay thereon:, לָכֵן כֹּה אָמַר קְדוֹשׁ יִשְׂרָאֵל יַעַן מָאָסְכֶם בַּדָּבָר הַזֶּה וַתִּבְטְחוּ בְּעֹשֶׁק וְנָלוֹז וַתִּשָּׁעֲנוּ עָלָיו׃ ‬,Wherefore thus saith the Holy One of Israel: Because ye despise this word, And trust in oppression and perverseness, And stay thereon;,καὶ ἀποστρέψατε ἡμᾶς ἀπὸ τῆς ὁδοῦ ταύτης ἀφέλετε ἀφ' ἡμῶν τὸν τρίβον τοῦτον καὶ ἀφέλετε ἀφ' ἡμῶν τὸν ἅγιον τοῦ ισραηλ,Therefore thus saith the Holy One of Israel, Because ye have refused to obey these words, and have trusted in falsehood; and because thou hast murmured, and been confident in this respect:,,,,","30:13":"swelling out in a high wall","30:14":"breaking it in pieces without sparing","30:15":"the Holy One of Israel","30:16":"No, for we will flee on horses; therefore you will flee; and","30:17":"you will flee until you are left like a beacon on the top of a mountain","30:18":"that he may be gracious to you; and therefore he will be exalted","30:19":"he will answer you.","30:20":"yet your teachers won't be hidden anymore","30:21":"and when you turn to the left","30:22":"and the plating of your molten images of gold. You shall cast them away as an unclean thing.  You shall tell it","30:23":"with which you will sow the ground; and bread of the increase of the ground will be rich and plentiful.  In that day","30:24":"which has been winnowed with the shovel and with the fork.","30:25":"when the towers fall.","30:26":"and the light of the sun will be seven times brighter","30:27":"the name of Yahweh comes from far away","30:28":"to sift the nations with the sieve of destruction; and a bridle that leads to ruin will be in the jaws of the peoples.","30:29":"as in the night when a holy feast is kept; and gladness of heart","30:30":"and will show the descent of his arm","30:31":"For through the voice of the LORD shall the Assyrian be beaten down","30:32":"which Yahweh will lay on him","30:33":"for the king it is made ready.  He has made its pyre deep and large with fire and much wood.  Yahweh's breath","31:1":"and rely on horses","31:2":"and will bring disaster","31:3":"and not God; and their horses flesh","31:4":"As the lion and the young lion growling over his prey, if a multitude of shepherds is called together against him, will not be dismayed at their voice, nor abase himself for the noise of them, so Yahweh of Armies will come down to fight on Mount Zion and on its heights.,For thus hath the LORD spoken unto me, Like as the lion and the young lion roaring on his prey, when a multitude of shepherds is called forth against him, he will not be afraid of their voice, nor abase himself for the noise of them: so shall the LORD of hosts come down to fight for mount Zion, and for the hill thereof., כִּי כֹה אָמַר־יְהוָה אֵלַי כַּאֲשֶׁר יֶהְגֶּה הָאַרְיֵה וְהַכְּפִיר עַל־טַרְפּוֹ אֲשֶׁר יִקָּרֵא עָלָיו מְלֹא רֹעִים מִקּוֹלָם לֹא יֵחָת וּמֵהֲמוֹנָם לֹא יַעֲנֶה כֵּן יֵרֵד יְהוָה צְבָאוֹת לִצְבֹּא עַל־הַר־צִיּוֹן וְעַל־גִּבְעָתָהּ׃ ‬,For thus saith the LORD unto me: Like as the lion, or the young lion, growling over his prey, Though a multitude of shepherds be called forth against him, Will not be dismayed at their voice, Nor abase himself for the noise of them; So will the LORD of hosts come down To fight upon mount Zion, and upon the hill thereof.,αἰγύπτιον ἄνθρωπον καὶ οὐ θεόν ἵππων σάρκας καὶ οὐκ ἔστιν βοήθεια ὁ δὲ κύριος ἐπάξει τὴν χεῖρα αὐτοῦ ἐπ' αὐτούς καὶ κοπιάσουσιν οἱ βοηθοῦντες καὶ ἅμα πάντες ἀπολοῦνται,For thus said the Lord to me, As a lion would roar, or a lion's whelp over prey which he has taken, and cry over it, until the mountains are filled with his voice, and the animals are awe-struck and tremble at the fierceness of his wrath: so the Lord of hosts shall descend to fight upon the mount Sion, even upon her mountains.,,,,","31:5":"so Yahweh of Armies will protect Jerusalem. He will protect and deliver it.  He will pass over and preserve it.,As birds flying, so will the LORD of hosts defend Jerusalem; defending also he will deliver it; and passing over he will preserve it., כְּצִפֳּרִים עָפוֹת כֵּן יָגֵן יְהוָה צְבָאוֹת עַל־יְרוּשָׁלִָם גָּנוֹן וְהִצִּיל פָּסֹחַ וְהִמְלִיט׃ ‬,As birds hovering, So will the LORD of hosts protect Jerusalem; He will deliver it as He protecteth it, He will rescue it as He passeth over.,ὅτι οὕτως εἶπέν μοι κύριος ὃν τρόπον ἐὰν βοήσῃ ὁ λέων ἢ ὁ σκύμνος ἐπὶ τῇ θήρᾳ ᾗ ἔλαβεν καὶ κεκράξῃ ἐπ' αὐτῇ ἕως ἂν ἐμπλησθῇ τὰ ὄρη τῆς φωνῆς αὐτοῦ καὶ ἡττήθησαν καὶ τὸ πλῆθος τοῦ θυμοῦ ἐπτοήθησαν οὕτως καταβήσεται κύριος σαβαωθ ἐπιστρατεῦσαι ἐπὶ τὸ ὄρος τὸ σιων ἐπὶ τὰ ὄρη αὐτῆς,As birds flying, so shall the Lord of hosts defend; he shall defend Jerusalem, and he shall rescue, and save and deliver.,,,,","31:6":"children of Israel.","31:7":"For in that day every man shall cast away his idols of silver","31:8":"","31:9":"and his princes will be afraid of the banner","32:1":"a king shall reign in righteousness","32:2":"and a covert from the storm","32:3":"and the ears of those who hear will listen.","32:4":"and the tongue of the stammerers will be ready to speak plainly.","32:5":"nor the scoundrel be highly respected.","32:6":"and his heart will work iniquity","32:7":"even when the needy speaks right.","32:8":"But the liberal deviseth liberal things; and by liberal things shall he stand.","32:9":"you women who are at ease!  Hear my voice! You careless daughters","32:10":"you careless women; for the vintage shall fail.  The harvest won't come.","32:11":"you women who are at ease!  Be troubled","32:12":"for the fruitful vine.","32:13":"on all the houses of joy in the joyous city.","32:14":"a delight for wild donkeys","32:15":"and the wilderness becomes a fruitful field","32:16":"Then judgment shall dwell in the wilderness","32:17":"quietness and confidence forever.","32:18":"in safe dwellings","32:19":"and the city is leveled completely.","32:20":"who send out the feet of the ox and the donkey.","33:1":"but you weren't destroyed; and who betray","33:2":"be gracious to us.  We have waited for you. Be our strength every morning","33:3":"the peoples have fled. When you lift yourself up","33:4":"And your spoil shall be gathered like the gathering of the caterpiller: as the running to and fro of locusts shall he run upon them.","33:5":"for he dwells on high.  He has filled Zion with justice and righteousness.","33:6":"abundance of salvation","33:7":"their valiant ones cry outside; the ambassadors of peace weep bitterly.","33:8":"The highways lie waste","33:9":"and Bashan and Carmel are stripped bare.","33:10":"","33:11":"Ye shall conceive chaff","33:12":"like thorns that are cut down and burned in the fire.","33:13":"you who are far off","33:14":"The sinners in Zion are afraid; fearfulness hath surprised the hypocrites. Who among us shall dwell with the devouring fire? who among us shall dwell with everlasting burnings?","33:15":"and speaks blamelessly; He who despises the gain of oppressions","33:16":"He shall dwell on high: his place of defence shall be the munitions of rocks: bread shall be given him; his waters shall be sure.","33:17":"Thine eyes shall see the king in his beauty: they shall behold the land that is very far off.","33:18":"Thine heart shall meditate terror. Where is the scribe? where is the receiver? where is he that counted the towers?","33:19":"a people of a deep speech that you can't comprehend","33:20":"the city of our appointed festivals. Your eyes will see Jerusalem","33:21":"a place of broad rivers and streams","33:22":"For the LORD is our judge","33:23":"Thy tacklings are loosed; they could not well strengthen their mast","33:24":"I am sick.  The people who dwell therein will be forgiven their iniquity.","34:1":"you nations","34:2":"and angry with all their armies.  He has utterly destroyed them. He has given them over for slaughter.","34:3":"and the stench of their dead bodies will come up; and the mountains will melt in their blood.","34:4":"and all its armies will fade away","34:5":"it will come down on Edom","34:6":"with the blood of lambs and goats","34:7":"and the young bulls with the mighty bulls; and their land will be drunken with blood","34:8":"a year of recompense for the cause of Zion.","34:9":"its dust into sulfur","34:10":"it will lie waste. No one will pass through it forever and ever.","34:11":"and the plumb line of emptiness.","34:12":"but none shall be there; and all its princes shall be nothing.","34:13":"nettles and thistles in its fortresses; and it will be a habitation of jackals","34:14":"and the wild goat will cry to his fellow.  Yes","34:15":"and lay","34:16":"and read:  not one of these will be missing.  none will lack her mate.  For my mouth has commanded","34:17":"and his hand has divided it to them with a measuring line.  They shall possess it forever. From generation to generation they will dwell in it.","35:1":"The wilderness and the solitary place shall be glad for them; and the desert shall rejoice","35:2":"and rejoice even with joy and singing. Lebanon's glory Lebanon will be given to it","35:3":"and make firm the feeble knees.","35:4":"Be strong.  Don't be afraid. Behold, your God will come with vengeance, God's retribution. He will come and save you.,Say to them that are of a fearful heart, Be strong, fear not: behold, your God will come with vengeance, even God with a recompence; he will come and save you., אִמְרוּ לְנִמְהֲרֵי־לֵב חִזְקוּ אַל־תִּירָאוּ הִנֵּה אֱלֹהֵיכֶם נָקָם יָבוֹא גְּמוּל אֱלֹהִים הוּא יָבוֹא וְיֹשַׁעֲכֶם׃ ‬,Say to them that are of a fearful heart: Be strong","35:5":"and the ears of the deaf will be unstopped.","35:6":"and the tongue of the mute will sing; for waters will break out in the wilderness","35:7":"and the thirsty ground springs of water.  Grass with reeds and rushes will be in the habitation of jackals","35:8":"a road","35:9":"nor will any ravenous animal go up on it. They will not be found there; but the redeemed will walk there.","35:10":"and come with singing to Zion; and everlasting joy will be on their heads. They will obtain gladness and joy","36:1":"that Sennacherib king of Assyria attacked all of the fortified cities of Judah","36:2":"And the king of Assyria sent Rabshakeh from Lachish to Jerusalem unto king Hezekiah with a great army. And he stood by the conduit of the upper pool in the highway of the fuller's field.","36:3":"who was over the household","36:4":"Now tell Hezekiah, 'Thus says the great king, the king of Assyria, What confidence is this in which you trust?","36:5":"that you have rebelled against me?","36:6":"you trust in the staff of this bruised reed","36:7":"'We trust in Yahweh our God","36:8":"please make a pledge to my master the king of Assyria","36:9":"and put your trust on Egypt for chariots and for horsemen?","36:10":"Go up against this land, and destroy it.',And am I now come up without the LORD against this land to destroy it? the LORD said unto me, Go up against this land, and destroy it., וְעַתָּה הֲמִבַּלְעֲדֵי יְהוָה עָלִיתִי עַל־הָאָרֶץ הַזֹּאת לְהַשְׁחִיתָהּ יְהוָה אָמַר אֵלַי עֲלֵה אֶל־הָאָרֶץ הַזֹּאת וְהַשְׁחִיתָהּ׃ ‬,And am I now come up without the LORD against this land to destroy it? The LORD said unto me: Go up against this land, and destroy it.","36:11":"Shebna and Joah said to Rabshakeh","36:12":"Has my master sent me only to your master and to you, to speak these words, and not to the men who sit on the wall, who will eat their own dung and drink their own urine with you?","36:13":"and called out with a loud voice in the Jews' language","36:14":"'Don't let Hezekiah deceive you; for he will not be able to deliver you.","36:15":"saying","36:16":"for thus says the king of Assyria","36:17":"a land of grain and new wine","36:18":"saying","36:19":"Where are the gods of Hamath and Arphad? where are the gods of Sepharvaim? and have they delivered Samaria out of my hand?","36:20":"that Yahweh should deliver Jerusalem out of my hand?',Who are they among all the gods of these lands, that have delivered their land out of my hand, that the LORD should deliver Jerusalem out of my hand?, מִי בְּכָל־אֱלֹהֵי הָאֲרָצוֹת הָאֵלֶּה אֲשֶׁר־הִצִּילוּ אֶת־אַרְצָם מִיָּדִי כִּי־יַצִּיל יְהוָה אֶת־יְרוּשָׁלִַם מִיָּדִי׃ ‬,Who are they among all the gods of these countries, that have delivered their country out of my hand, that the LORD should deliver Jerusalem out of my hand?","36:21":"and said nothing in reply","36:22":"who was over the household","37:1":"when king Hezekiah heard it","37:2":"who was over the household","37:3":"Thus says Hezekiah, 'This day is a day of trouble, and of rebuke, and of rejection; for the children have come to the birth, and there is no strength to bring forth.,And they said unto him, Thus saith Hezekiah, This day is a day of trouble, and of rebuke, and of blasphemy: for the children are come to the birth, and there is not strength to bring forth., וַיֹּאמְרוּ אֵלָיו כֹּה אָמַר חִזְקִיָּהוּ יוֹם־צָרָה וְתוֹכֵחָה וּנְאָצָה הַיּוֹם הַזֶּה כִּי בָאוּ בָנִים עַד־מַשְׁבֵּר וְכֹחַ אַיִן לְלֵדָה׃ ‬,And they said unto him: Thus saith Hezekiah: This day is a day of trouble","37:4":"whom the king of Assyria his master has sent to defy the living God","37:5":"So the servants of king Hezekiah came to Isaiah.","37:6":"Tell your master, 'Thus says Yahweh, Don't be afraid of the words that you have heard","37:7":"I will put a spirit in him and he will hear news","37:8":"and found the king of Assyria warring against Libnah","37:9":"He has come out to fight against you.  When he heard it","37:10":"saying: Let not thy God in whom thou trustest beguile thee","37:11":"you have heard what the kings of Assyria have done to all lands","37:12":"which my fathers have destroyed","37:13":"and the king of Arpad","37:14":"and spread it before Yahweh.","37:15":"saying","37:16":"the God of Israel","37:17":"Yahweh","37:18":"Yahweh","37:19":"but the work of men's hands","37:20":"Yahweh our God","37:21":"saying","37:22":"This is the word which the LORD hath spoken concerning him; The virgin","37:23":"Whom hast thou reproached and blasphemed? and against whom hast thou exalted thy voice","37:24":"have you defied the Lord","37:25":"and with the sole of my feet I will dry up all the rivers of Egypt.,I have digged, and drunk water; and with the sole of my feet have I dried up all the rivers of the besieged places., אֲנִי קַרְתִּי וְשָׁתִיתִי מָיִם וְאַחְרִב בְּכַף־פְּעָמַי כֹּל יְאֹרֵי מָצוֹר׃ ‬,I have digged and drunk water, And with the sole of my feet have I dried up All the rivers of Egypt.,ὅτι δι' ἀγγέλων ὠνείδισας κύριον σὺ γὰρ εἶπας τῷ πλήθει τῶν ἁρμάτων ἐγὼ ἀνέβην εἰς ὕψος ὀρέων καὶ εἰς τὰ ἔσχατα τοῦ λιβάνου καὶ ἔκοψα τὸ ὕψος τῆς κέδρου αὐτοῦ καὶ τὸ κάλλος τῆς κυπαρίσσου καὶ εἰσῆλθον εἰς ὕψος μέρους τοῦ δρυμοῦ,and I have made a bridge, and dried up the waters, and every pool of water.,,,,","37:26":"and formed it in ancient times?  Now I have brought it to pass","37:27":"and like the green herb","37:28":"your going out","37:29":"and because your arrogance has come up into my ears","37:30":"and in the second year that which springs from the same; and in the third year sow and reap and plant vineyards","37:31":"and bear fruit upward.","37:32":"and survivors will escape from Mount Zion.  The zeal of Yahweh of Armies will perform this.'","37:33":"'He will not come to this city","37:34":"by the same he shall return","37:35":"for my own sake","37:36":"behold","37:37":"went away","37:38":"as he was worshipping in the house of Nisroch his god","38:1":"the son of Amoz","38:2":"","38:3":"Remember now, Yahweh, I beg you, how I have walked before you in truth and with a perfect heart, and have done that which is good in your sight.  Hezekiah wept bitterly.","38:4":"saying","38:5":"I will add fifteen years to your life.","38:6":"and I will defend this city.","38:7":"that Yahweh will do this thing that he has spoken.","38:8":"I will cause the shadow on the sundial","38:9":"when he had been sick","38:10":"In the middle of my life I go into the gates of Sheol. I am deprived of the residue of my years.","38:11":"I won't see Yah, Yah in the land of the living. I will see man no more with the inhabitants of the world.,I said, I shall not see the LORD, even the LORD, in the land of the living: I shall behold man no more with the inhabitants of the world., אָמַרְתִּי לֹא־אֶרְאֶה יָהּ יָהּ בְּאֶרֶץ הַחַיִּים לֹא־אַבִּיט אָדָם עוֹד עִם־יוֹשְׁבֵי חָדֶל׃ ‬,I said: I shall not see the LORD, Even the LORD in the land of the living; I shall behold man no more with the inhabitants of the world.,ἐγὼ εἶπα ἐν τῷ ὕψει τῶν ἡμερῶν μου ἐν πύλαις ᾅδου καταλείψω τὰ ἔτη τὰ ἐπίλοιπα,I said, I shall no more at all see the salvation of God in the land of the living: I shall no more at all see the salvation of Israel on the earth: I shall no more at all see man.,,,,","38:12":"and is carried away from me like a shepherd's tent.  I have rolled up","38:13":"I reckoned till morning","38:14":"I am oppressed. Be my security.,Like a crane or a swallow, so did I chatter: I did mourn as a dove: mine eyes fail with looking upward: O LORD, I am oppressed; undertake for me., כְּסוּס עָגוּר כֵּן אֲצַפְצֵף אֶהְגֶּה כַּיּוֹנָה דַּלּוּ עֵינַי לַמָּרוֹם אֲדֹנָי עָשְׁקָה־לִּי עָרְבֵנִי׃ ‬,Like a swallow or a crane, so do I chatter, I do moan as a dove; Mine eyes fail with looking upward. O LORD, I am oppressed, be Thou my surety.,ἕως πρωὶ ὡς λέοντι οὕτως τὰ ὀστᾶ μου συνέτριψεν ἀπὸ γὰρ τῆς ἡμέρας ἕως τῆς νυκτὸς παρεδόθην,As a swallow, so will I cry, and as a dove, so do I mourn: for mine eyes have failed with looking to the height of heaven to the Lord, who has delivered me,,,,,","38:15":"and himself has done it. I will walk carefully all my years because of the anguish of my soul.","38:16":"men live by these things; and my spirit finds life in all of them:  you restore me","38:17":"for peace I had great anguish","38:18":"For the grave cannot praise thee","38:19":"the living","38:20":"The LORD was ready to save me: therefore we will sing my songs to the stringed instruments all the days of our life in the house of the LORD.","38:21":"Let them take a cake of figs, and lay it for a poultice on the boil, and he shall recover.","38:22":"What is the sign that I will go up to the house of Yahweh?","39:1":"Merodach Baladan the son of Baladan","39:2":"and showed them the house of his precious things","39:3":"and asked him","39:4":"What have they seen in your house? Hezekiah answered","39:5":"Hear the word of Yahweh of Armies:,Then said Isaiah to Hezekiah, Hear the word of the LORD of hosts:, וַיֹּאמֶר יְשַׁעְיָהוּ אֶל־חִזְקִיָּהוּ שְׁמַע דְּבַר־יְהוָה צְבָאוֹת׃ ‬,Then said Isaiah to Hezekiah: Hear the word of the LORD of hosts:","39:6":"the days are coming when all that is in your house","39:7":"whom you shall father","39:8":"Yahweh's word which you have spoken is good.  He said moreover","40:1":"Comfort ye","40:2":"Speak ye comfortably to Jerusalem","40:3":"Prepare the way of Yahweh in the wilderness!  Make a level highway in the desert for our God.,The voice of him that crieth in the wilderness, Prepare ye the way of the LORD, make straight in the desert a highway for our God., קוֹל קוֹרֵא בַּמִּדְבָּר פַּנּוּ דֶּרֶךְ יְהוָה יַשְּׁרוּ בָּעֲרָבָה מְסִלָּה לֵאלֹהֵינוּ׃ ‬,Hark! one calleth: Clear ye in the wilderness the way of the LORD","40:4":"and every mountain and hill shall be made low.  The uneven shall be made level","40:5":"and all flesh shall see it together; for the mouth of Yahweh has spoken it.,And the glory of the LORD shall be revealed, and all flesh shall see it together: for the mouth of the LORD hath spoken it., וְנִגְלָה כְּבוֹד יְהוָה וְרָאוּ כָל־בָּשָׂר יַחְדָּו כִּי פִּי יְהוָה דִּבֵּר׃ ס ‬,And the glory of the LORD shall be revealed, And all flesh shall see it together; For the mouth of the LORD hath spoken it.","40:6":"Cry!  One said","40:7":"the flower fades","40:8":"the flower fades; but the word of our God stands forever.,The grass withereth, the flower fadeth: but the word of our God shall stand for ever., יָבֵשׁ חָצִיר נָבֵל צִיץ וּדְבַר־אֱלֹהֵינוּ יָקוּם לְעוֹלָם׃ ס ‬,The grass withereth, the flower fadeth; But the word of our God shall stand for ever.","40:9":"go up on a high mountain. You who tell good news to Jerusalem","40:10":"the Lord Yahweh will come as a mighty one","40:11":"and carry them in his bosom. He will gently lead those who have their young.","40:12":"and marked off the sky with his span","40:13":"or has taught him as his counselor?","40:14":"and who instructed him","40:15":"the nations are like a drop in a bucket","40:16":"nor its animals sufficient for a burnt offering.","40:17":"and vanity.","40:18":"To whom then will ye liken God? or what likeness will ye compare unto him?","40:19":"and the goldsmith overlays it with gold","40:20":"He that is so impoverished that he hath no oblation chooseth a tree that will not rot; he seeketh unto him a cunning workman to prepare a graven image","40:21":"yet?  Haven't you been told from the beginning?  Haven't you understood from the foundations of the earth?","40:22":"and its inhabitants are like grasshoppers; who stretches out the heavens like a curtain","40:23":"That bringeth the princes to nothing; he maketh the judges of the earth as vanity.","40:24":"and they wither","40:25":"To whom then will ye liken me","40:26":"and see who has created these","40:27":"Jacob","40:28":"Yahweh","40:29":"He giveth power to the faint; and to them that have no might he increaseth strength.","40:30":"and the young men utterly fall;","40:31":"and not be weary.  They will walk","41:1":"","41:2":"and makes him rule over kings.  He gives them like the dust to his sword","41:3":"and passes by safely","41:4":"calling the generations from the beginning?  I","41:5":"and fear.  The ends of the earth tremble. They approach","41:6":"Be strong!","41:7":"saying of the soldering","41:8":"","41:9":"and called from its corners","41:10":"for I am with you.  Don't be dismayed","41:11":"all those who are incensed against you will be disappointed and confounded.  Those who strive with you will be like nothing","41:12":"and won't find them","41:13":"Yahweh your God","41:14":"you worm Jacob","41:15":"I have made you into a new sharp threshing instrument with teeth.  You will thresh the mountains","41:16":"and the wind will carry them away","41:17":"and there is none. Their tongue fails for thirst.  I","41:18":"and springs in the midst of the valleys.  I will make the wilderness a pool of water","41:19":"acacia","41:20":"know","41:21":"says Yahweh.  Bring forth your strong reasons","41:22":"","41:23":"that we may know that you are gods.  Yes","41:24":"you are of nothing","41:25":"","41:26":"that we may know? And before","41:27":"'Behold","41:28":"there is no man; even among them there is no counselor who","41:29":"all of them","42:1":"","42:2":"nor raise his voice","42:3":"A bruised reed shall he not break","42:4":"until he has set justice in the earth","42:5":"he who created the heavens and stretched them out","42:6":"","42:7":"to bring the prisoners out of the dungeon","42:8":"","42:9":"the former things have happened","42:10":"and his praise from the end of the earth","42:11":"with the villages that Kedar inhabits.  Let the inhabitants of Sela sing. Let them shout from the top of the mountains!","42:12":"and declare his praise in the islands.","42:13":"he will shout aloud. He will triumph over his enemies.","42:14":"","42:15":"and dry up all their herbs. I will make the rivers islands","42:16":"and crooked places straight. I will do these things","42:17":"","42:18":"","42:19":"but my servant?  Or who is as deaf as my messenger whom I send?  Who is as blind as he who is at peace","42:20":"but don't observe.  His ears are open","42:21":"for his righteousness' sake","42:22":"and they are hidden in prisons. They have become a prey","42:23":"Who among you will give ear to this? who will hearken and hear for the time to come?","42:24":"and Israel to the robbers? Didn't Yahweh","42:25":"and the strength of battle; and it set him on fire all around","43:1":"Jacob","43:2":"I will be with you; and through the rivers","43:3":"the Holy One of Israel","43:4":"and I have loved you; therefore I will give people in your place","43:5":"and gather you from the west.","43:6":"'Give them up!' and tell the south","43:7":"and whom I have created for my glory","43:8":"and the deaf who have ears.","43:9":"and let the peoples be assembled.  Who among them can declare this","43:10":"With my servant whom I have chosen; that you may know and believe me, and understand that I am he.  Before me there was no God formed, neither will there be after me.,Ye are my witnesses, saith the LORD, and my servant whom I have chosen: that ye may know and believe me, and understand that I am he: before me there was no God formed, neither shall there be after me., אַתֶּם עֵדַי נְאֻם־יְהוָה וְעַבְדִּי אֲשֶׁר בָּחָרְתִּי לְמַעַן תֵּדְעוּ וְתַאֲמִינוּ לִי וְתָבִינוּ כִּי־אֲנִי הוּא לְפָנַי לֹא־נוֹצַר אֵל וְאַחֲרַי לֹא יִהְיֶה׃ ס ‬,Ye are My witnesses, saith the LORD, And My servant whom I have chosen; That ye may know and believe Me, and understand That I am He; Before Me there was no God formed, Neither shall any be after Me.,πάντα τὰ ἔθνη συνήχθησαν ἅμα καὶ συναχθήσονται ἄρχοντες ἐξ αὐτῶν τίς ἀναγγελεῖ ταῦτα ἢ τὰ ἐξ ἀρχῆς τίς ἀναγγελεῖ ὑμῖν ἀγαγέτωσαν τοὺς μάρτυρας αὐτῶν καὶ δικαιωθήτωσαν καὶ εἰπάτωσαν ἀληθῆ,Be ye my witnesses, and I too am a witness, saith the Lord God, and my servant whom I have chosen: that ye may know, and believe, and understand that I an he: before me there was no other God, and after me there shall be none.,,,,","43:11":"I","43:12":"I have saved","43:13":"since the day was I am he; and there is no one who can deliver out of my hand.  I will work","43:14":"your Redeemer","43:15":"your Holy One","43:16":"who makes a way in the sea","43:17":"the army and the mighty man (they lie down together","43:18":"","43:19":"I will do a new thing.  It springs forth now. Don't you know it?  I will even make a way in the wilderness","43:20":"the jackals and the ostriches; because I give water in the wilderness and rivers in the desert","43:21":"that they might set forth my praise.","43:22":"Jacob; but you have been weary of me","43:23":"nor wearied you with frankincense.","43:24":"nor have you filled me with the fat of your sacrifices; but you have burdened me with your sins.  You have wearied me with your iniquities.","43:25":"even I","43:26":"that you may be justified.","43:27":"and your teachers have transgressed against me.","43:28":"and Israel a reviling.,Therefore I have profaned the princes of the sanctuary, and have given Jacob to the curse, and Israel to reproaches., וַאֲחַלֵּל שָׂרֵי קֹדֶשׁ וְאֶתְּנָה לַחֵרֶם יַעֲקֹב וְיִשְׂרָאֵל לְגִדּוּפִים׃ ס ‬,Therefore I have profaned the princes of the sanctuary, And I have given Jacob to condemnation, And Israel to reviling.,οἱ πατέρες ὑμῶν πρῶτοι καὶ οἱ ἄρχοντες αὐτῶν ἠνόμησαν εἰς ἐμέ,And the princes have defiled my sanctuaries: so I gave Jacob to enemies to destroy, and Israel to reproach.,,,,","44:1":"Jacob my servant","44:2":"and formed you from the womb","44:3":"and streams on the dry ground.  I will pour my Spirit on your seed","44:4":"as willows by the watercourses.","44:5":"'I am Yahweh's;' and another will be called by the name of Jacob; and another will write with his hand 'to Yahweh","44:6":"the King of Israel","44:7":"and will declare it","44:8":"neither be afraid.  Haven't I declared it to you long ago","44:9":"nor know","44:10":"or molds an image that is profitable for nothing?","44:11":"all his fellows will be disappointed; and the workmen are mere men.  Let them all be gathered together.  Let them stand up. They will fear.  They will be put to shame together.","44:12":"works in the coals","44:13":"and shapes it like the figure of a man","44:14":"and takes the cypress and the oak","44:15":"and warms himself.  Yes","44:16":"he eats meat. He roasts a roast","44:17":"even his engraved image. He bows down to it and worships","44:18":"neither do they consider:  for he has shut their eyes","44:19":"neither is there knowledge nor understanding to say","44:20":"nor say","44:21":"Jacob and Israel; for you are my servant. I have formed you.  You are my servant.  Israel","44:22":"as a thick cloud","44:23":"you heavens","44:24":"your Redeemer","44:25":"and makes diviners mad; who turns wise men backward","44:26":"and performs the counsel of his messengers; who says of Jerusalem","44:27":"'Be dry","44:28":"'He is my shepherd","45:1":"to Cyrus","45:2":"","45:3":"and hidden riches of secret places","45:4":"and Israel my chosen","45:5":"and there is none else.  Besides me","45:6":"and from the west","45:7":"and create darkness.  I make peace","45:8":"you heavens","45:9":"'What are you making?' or your work","45:10":"'What have you become the father of?' or to a mother","45:11":"the Holy One of Israel","45:12":"and created man on it:  I","45:13":"and I will make straight all his ways:  he shall build my city","45:14":"","45:15":"God of Israel","45:16":"yes","45:17":"But Israel shall be saved in the LORD with an everlasting salvation: ye shall not be ashamed nor confounded world without end.","45:18":"the God who formed the earth and made it","45:19":"in a place of the land of darkness; I didn't say to the seed of Jacob","45:20":"you who have escaped from the nations:  they have no knowledge who carry the wood of their engraved image","45:21":"and bring [it] forth; yes","45:22":"and be you saved","45:23":"the word is gone forth from my mouth [in] righteousness","45:24":"it is said of me","45:25":"and shall glory.","46:1":"Nebo stoops; their idols are on the animals","46:2":"they bow down together; they could not deliver the burden","46:3":"house of Jacob","46:4":"and even to gray hairs will I carry you.  I have made","46:5":"and make me equal","46:6":"and weigh silver in the balance. They hire a goldsmith","46:7":"they carry it","46:8":"and show yourselves men; bring it again to mind","46:9":"and there is none else; [I am] God","46:10":"and from ancient times things that are not [yet] done; saying","46:11":"the man of my counsel from a far country; yes","46:12":"you stout-hearted","46:13":"it shall not be far off","47:1":"and sit in the dust","47:2":"and grind meal; remove your veil","47:3":"yes","47:4":"Yahweh of Armies is his name","47:5":"and get you into darkness","47:6":"I profaned my inheritance","47:7":"I shall be mistress forever; so that you did not lay these things to your heart","47:8":"you who are given to pleasures","47:9":"the loss of children","47:10":"None sees me; your wisdom and your knowledge","47:11":"which you don't know.","47:12":"and with the multitude of your sorceries","47:13":"the stargazers","47:14":"they shall be as stubble; the fire shall burn them; they shall not deliver themselves from the power of the flame: it shall not be a coal to warm at","47:15":"Thus shall they be unto thee with whom thou hast laboured","48:1":"house of Jacob","48:2":"and stay themselves on the God of Israel; Yahweh of Armies is his name):","48:3":"they went forth out of my mouth","48:4":"and your neck is an iron sinew","48:5":"My idol has done them","48:6":"will you not declare it? I have shown you new things from this time","48:7":"and not from of old; and before this day you didn't hear them; lest you should say","48:8":"you didn't hear; yes","48:9":"and for my praise will I refrain for you","48:10":"I have refined you","48:11":"for my own sake","48:12":"O Jacob","48:13":"my hand has laid the foundation of the earth","48:14":"all you","48:15":"even I","48:16":"hear you this; from the beginning I have not spoken in secret; from the time that it was","48:17":"your Redeemer","48:18":"and your righteousness as the waves of the sea:","48:19":"and the offspring of your body like the grains of it:  his name would not be cut off nor destroyed from before me.","48:20":"flee you from the Chaldeans; with a voice of singing declare you","48:21":"and the waters gushed out.","48:22":"says Yahweh","49:1":"islands","49:2":"And he hath made my mouth like a sharp sword; in the shadow of his hand hath he hid me","49:3":"You are my servant; Israel","49:4":"I have labored in vain","49:5":"to bring Jacob again to him","49:6":"he says","49:7":"the Redeemer of Israel","49:8":"In an acceptable time have I answered you","49:9":"Go forth; to those who are in darkness","49:10":"even by springs of water he will guide them.","49:11":"and my highways shall be exalted.","49:12":"these shall come from far; and behold","49:13":"heavens; and be joyful","49:14":"Yahweh has forsaken me","49:15":"that she should not have compassion on the son of her womb? yes","49:16":"I have engraved you on the palms of my hands; your walls are continually before me.","49:17":"Thy children shall make haste; thy destroyers and they that made thee waste shall go forth of thee.","49:18":"and see:  all these gather themselves together","49:19":"as for your waste and your desolate places","49:20":"The place is too small for me; give place to me that I may dwell.","49:21":"Who has conceived these for me","49:22":"Behold","49:23":"and their queens your nursing mothers:  they shall bow down to you with their faces to the earth","49:24":"or the lawful captives be delivered?","49:25":"Even the captives of the mighty shall be taken away","49:26":"as with sweet wine: and all flesh shall know that I","50:1":"Where is the bill of your mother's divorce","50:2":"when I came","50:3":"and I make sackcloth their covering.","50:4":"that I may know how to sustain with words him who is weary: he wakens morning by morning","50:5":"and I was not rebellious","50:6":"and my cheeks to those who plucked off the hair; I didn't hide my face from shame and spitting.","50:7":"and I know that I shall not be disappointed.","50:8":"He is near that justifieth me; who will contend with me? let us stand together: who is mine adversary? let him come near to me.","50:9":"the Lord Yahweh will help me; who is he who shall condemn me?  Behold","50:10":"who obeys the voice of his servant?  He who walks in darkness","50:11":"all you who kindle a fire","51:1":"you who follow after righteousness","51:2":"and to Sarah who bore you; for when he was but one I called him","51:3":"and has made her wilderness like Eden","51:4":"my people; and give ear to me","51:5":"my salvation is gone forth","51:6":"and look on the earth beneath; for the heavens shall vanish away like smoke","51:7":"you who know righteousness","51:8":"and the worm shall eat them like wool; but my righteousness shall be forever","51:9":"awake","51:10":"the waters of the great deep; who made the depths of the sea a way for the redeemed to pass over?","51:11":"and come with singing to Zion; and everlasting joy shall be on their heads: they shall obtain gladness and joy; [and] sorrow and sighing shall flee away.","51:12":"even I","51:13":"who stretched forth the heavens","51:14":"neither shall his bread fail.","51:15":"who stirs up the sea","51:16":"and have covered you in the shadow of my hand","51:17":"awake","51:18":"There is none to guide her among all the sons whom she hath brought forth; neither is there any that taketh her by the hand of all the sons that she hath brought up.","51:19":"and the famine and the sword; how shall I comfort you?","51:20":"they lie at the head of all the streets","51:21":"you afflicted","51:22":"and your God who pleads the cause of his people","51:23":"who have said to your soul","52:1":"awake","52:2":"sit [on your throne]","52:3":"You were sold for nothing; and you shall be redeemed without money.","52:4":"My people went down at the first into Egypt to sojourn there:  and the Assyrian has oppressed them without cause.","52:5":"what do I here","52:6":"it is I.","52:7":"who publishes peace","52:8":"together do they sing; for they shall see eye to eye","52:9":"sing together","52:10":"The LORD hath made bare his holy arm in the eyes of all the nations; and all the ends of the earth shall see the salvation of our God.","52:11":"depart you","52:12":"neither shall you go by flight: for Yahweh will go before you; and the God of Israel will be your rearward.","52:13":"my servant shall deal wisely","52:14":"and his form more than the sons of men)","52:15":"So shall he sprinkle many nations; the kings shall shut their mouths at him: for that which had not been told them shall they see; and that which they had not heard shall they consider.","53:1":"Who hath believed our report? and to whom is the arm of the LORD revealed?","53:2":"and as a root out of dry ground.  He has no form nor comeliness. When we see him","53:3":"and rejected by men; a man of suffering","53:4":"and carried our suffering; yet we considered him plagued","53:5":"But he was wounded for our transgressions","53:6":"All we like sheep have gone astray; we have turned every one to his own way; and the LORD hath laid on him the iniquity of us all.","53:7":"yet when he was afflicted he didn't open his mouth. As a lamb that is led to the slaughter","53:8":"who considered that he was cut off out of the land of the living and stricken for the disobedience of my people?","53:9":"and with a rich man in his death; although he had done no violence","53:10":"he shall see his seed. He shall prolong his days","53:11":"he will see the light{So read the Dead Sea Scrolls and Septuagint. Masoretic Text omits the light.} and be satisfied. My righteous servant will justify many by the knowledge of himself; and he will bear their iniquities.","53:12":"and he shall divide the spoil with the strong; because he poured out his soul to death","54:1":"barren","54:2":"and let them stretch forth the curtains of your habitations; don't spare: lengthen your cords","54:3":"and make the desolate cities to be inhabited.","54:4":"Fear not; for thou shalt not be ashamed: neither be thou confounded; for thou shalt not be put to shame: for thou shalt forget the shame of thy youth","54:5":"For thy Maker is thine husband; the LORD of hosts is his name; and thy Redeemer the Holy One of Israel; The God of the whole earth shall he be called.","54:6":"even a wife of youth","54:7":"For a small moment have I forsaken thee; but with great mercies will I gather thee.","54:8":"says Yahweh your Redeemer.","54:9":"so have I sworn that I will not be angry with you","54:10":"and the hills be removed; but my loving kindness shall not depart from you","54:11":"tossed with storms","54:12":"and your gates of sparkling jewels","54:13":"And all thy children shall be taught of the LORD; and great shall be the peace of thy children.","54:14":"for you shall not be afraid; and from terror","54:15":"they may gather together","54:16":"I have created the smith who blows the fire of coals","54:17":"and their righteousness which is of me","55:1":"everyone who thirsts","55:2":"and eat you that which is good","55:3":"and come to me; hear","55:4":"I have given him for a witness to the peoples","55:5":"you shall call a nation that you don't know; and a nation that didn't know you shall run to you","55:6":"Seek ye the LORD while he may be found","55:7":"and the unrighteous man his thoughts; and let him return to Yahweh","55:8":"neither are your ways my ways","55:9":"so are my ways higher than your ways","55:10":"and doesn't return there","55:11":"but it shall accomplish that which I please","55:12":"and be led forth with peace: the mountains and the hills shall break forth before you into singing; and all the trees of the fields shall clap their hands.","55:13":"for an everlasting sign that shall not be cut off.","56:1":"Keep you justice","56:2":"and the son of man who holds it fast; who keeps the Sabbath from profaning it","56:3":"who has joined himself to Yahweh","56:4":"and choose the things that please me","56:5":"that shall not be cut off.","56:6":"to minister to him","56:7":"and make them joyful in my house of prayer:  their burnt offerings and their sacrifices shall be accepted on my altar; for my house shall be called a house of prayer for all peoples.","56:8":"who gathers the outcasts of Israel","56:9":"come to devour","56:10":"they are all without knowledge; they are all mute dogs","56:11":"the dogs are greedy","56:12":"[say they]","57:1":"and no man lays it to heart; and merciful men are taken away","57:2":"each one who walks in his uprightness.","57:3":"you sons of the sorceress","57:4":"and put out the tongue?  Aren't you children of disobedience","57:5":"under every green tree; who kill the children in the valleys","57:6":"they are your lot; even to them have you poured a drink offering","57:7":"Upon a lofty and high mountain hast thou set thy bed: even thither wentest thou up to offer sacrifice.","57:8":"and are gone up; you have enlarged your bed","57:9":"and did increase your perfumes","57:10":"It is in vain:  you found a reviving of your strength; therefore you weren't faint.","57:11":"that you lie","57:12":"they shall not profit you.","57:13":"let those who you have gathered deliver you; but the wind shall take them","57:14":"Cast up","57:15":"whose name is Holy:  I dwell in the high and holy place","57:16":"neither will I be always angry; for the spirit would faint before me","57:17":"and struck him; I hid [my face] and was angry; and he went on backsliding in the way of his heart.","57:18":"and will heal him:  I will lead him also","57:19":"peace","57:20":"and its waters cast up mire and dirt.","57:21":"says my God","58:1":"don't spare","58:2":"and delight to know my ways: as a nation that did righteousness","58:3":"[say they]","58:4":"you fast for strife and contention","58:5":"and to spread sackcloth and ashes under him? will you call this a fast","58:6":"to undo the bands of the yoke","58:7":"and that you bring the poor who are cast out to your house? when you see the naked","58:8":"and your healing shall spring forth speedily; and your righteousness shall go before you; the glory of Yahweh shall be your rear guard.","58:9":"and Yahweh will answer; you shall cry","58:10":"and satisfy the afflicted soul:  then shall your light rise in darkness","58:11":"and satisfy your soul in dry places","58:12":"The restorer of paths to dwell in.","58:13":"from doing your pleasure on my holy day; and call the Sabbath a delight","58:14":"Then shalt thou delight thyself in the LORD; and I will cause thee to ride upon the high places of the earth","59:1":"Yahweh's hand is not shortened","59:2":"and your sins have hidden his face from you","59:3":"and your fingers with iniquity; your lips have spoken lies","59:4":"and none pleads in truth: they trust in vanity","59:5":"and weave the spider's web: he who eats of their eggs dies; and that which is crushed breaks out into a viper.","59:6":"neither shall they cover themselves with their works:  their works are works of iniquity","59:7":"and they make haste to shed innocent blood: their thoughts are thoughts of iniquity; desolation and destruction are in their paths.","59:8":"The way of peace they know not; and there is no judgment in their goings: they have made them crooked paths: whosoever goeth therein shall not know peace.","59:9":"neither does righteousness overtake us:  we look for light","59:10":"we grope as those who have no eyes:  we stumble at noonday as in the twilight; among those who are lusty we are as dead men.","59:11":"and moan sore like doves: we look for justice","59:12":"and our sins testify against us; for our transgressions are with us","59:13":"and turning away from following our God","59:14":"and righteousness stands afar off; for truth is fallen in the street","59:15":"truth is lacking; and he who departs from evil makes himself a prey.  Yahweh saw it","59:16":"and wondered that there was no intercessor:  therefore his own arm brought salvation to him; and his righteousness","59:17":"and a helmet of salvation on his head; and he put on garments of vengeance for clothing","59:18":"accordingly he will repay","59:19":"and his glory from the rising of the sun; for he will come as a rushing stream","59:20":"and to those who turn from disobedience in Jacob","59:21":"this is my covenant with them","60:1":"shine; for your light is come","60:2":"behold","60:3":"and kings to the brightness of your rising.","60:4":"and see:  they all gather themselves together","60:5":"and your heart shall thrill and be enlarged; because the abundance of the sea shall be turned to you","60:6":"the dromedaries of Midian and Ephah; all they from Sheba shall come; they shall bring gold and frankincense","60:7":"the rams of Nebaioth shall minister to you; they shall come up with acceptance on my altar; and I will glorify the house of my glory.","60:8":"and as the doves to their windows?","60:9":"and the ships of Tarshish first","60:10":"and their kings shall minister to you:  for in my wrath I struck you","60:11":"and their kings led captive.","60:12":"those nations shall be utterly wasted.","60:13":"the fir tree","60:14":"The Zion of the Holy One of Israel.","60:15":"so that no man passed through you","60:16":"and shall suck the breast of kings; and you shall know that I","60:17":"and for iron I will bring silver","60:18":"desolation nor destruction within your borders; but you shall call your walls Salvation","60:19":"and your God your glory.","60:20":"neither shall your moon withdraw itself; for Yahweh will be your everlasting light","60:21":"the branch of my planting","60:22":"and the small one a strong nation; I","61:1":"to proclaim liberty to the captives","61:2":"and the day of vengeance of our God; to comfort all who mourn;","61:3":"to give to them a garland for ashes","61:4":"they shall raise up the former desolations","61:5":"and foreigners shall be your plowmen and your vinedressers.","61:6":"and in their glory shall you boast yourselves.","61:7":"For your shame ye shall have double; and for confusion they shall rejoice in their portion: therefore in their land they shall possess the double: everlasting joy shall be unto them.","61:8":"Yahweh","61:9":"and their offspring among the peoples; all who see them shall acknowledge them","61:10":"my soul shall be joyful in my God; for he has clothed me with the garments of salvation","61:11":"and as the garden causes the things that are sown in it to spring forth; so the Lord Yahweh will cause righteousness and praise to spring forth before all the nations.","62:1":"and for Jerusalem's sake I will not rest","62:2":"and all kings your glory","62:3":"and a royal diadem in the hand of your God.","62:4":"and your land Beulah; for Yahweh delights in you","62:5":"so shall your sons marry you; and as the bridegroom rejoices over the bride","62:6":"Jerusalem; they shall never hold their peace day nor night:  you who call on Yahweh","62:7":"until he establishes","62:8":"and by the arm of his strength","62:9":"and praise Yahweh; and those who have gathered it shall drink it in the courts of my sanctuary.","62:10":"go through the gates; prepare you the way of the people; cast up","62:11":"Yahweh has proclaimed to the end of the earth","62:12":"The redeemed of Yahweh: and you shall be called Sought out","63:1":"with dyed garments from Bozrah? this who is glorious in his clothing","63:2":"and your garments like him who treads in the wine vat?","63:3":"I trod them in my anger","63:4":"and the year of my redeemed is come.","63:5":"and there was none to help; and I wondered that there was none to uphold:  therefore my own arm brought salvation to me; and my wrath","63:6":"and made them drunk in my wrath","63:7":"[and] the praises of Yahweh","63:8":"Surely","63:9":"and the angel of his presence saved them:  in his love and in his pity he redeemed them; and he bore them","63:10":"and grieved his holy Spirit: therefore he was turned to be their enemy","63:11":"Moses [and] his people","63:12":"to make himself an everlasting name?","63:13":"as a horse in the wilderness","63:14":"the Spirit of Yahweh caused them to rest; so did you lead your people","63:15":"and see from the habitation of your holiness and of your glory:  where are your zeal and your mighty acts? the yearning of your heart and your compassion is restrained toward me.","63:16":"though Abraham doesn't know us","63:17":"why do you make us to err from your ways","63:18":"The people of thy holiness have possessed it but a little while: our adversaries have trodden down thy sanctuary.","63:19":"as those who were not called by your name.","64:1":"that you would come down","64:2":"[and] the fire causes the waters to boil; to make your name known to your adversaries","64:3":"you came down","64:4":"nor perceived by the ear","64:5":"those who remember you in your ways:  behold","64:6":"and all our righteousness is as a polluted garment:  and we all fade as a leaf; and our iniquities","64:7":"who stirs up himself to take hold of you; for you have hid your face from us","64:8":"Yahweh","64:9":"Yahweh","64:10":"Zion is become a wilderness","64:11":"where our fathers praised you","64:12":"Yahweh? will you hold your peace","65:1":"See me","65:2":"who walk in a way that is not good","65:3":"sacrificing in gardens","65:4":"and lodge in the secret places; who eat pig's flesh","65:5":"Stand by yourself","65:6":"it is written before me:  I will not keep silence","65:7":"and the iniquities of your fathers together","65:8":"As the new wine is found in the cluster","65:9":"and out of Judah an inheritor of my mountains; and my chosen shall inherit it","65:10":"and the valley of Achor a place for herds to lie down in","65:11":"who forget my holy mountain","65:12":"and you shall all bow down to the slaughter; because when I called","65:13":"Behold","65:14":"my servants shall sing for joy of heart","65:15":"And ye shall leave your name for a curse unto my chosen: for the Lord GOD shall slay thee","65:16":"and because they are hid from my eyes.","65:17":"behold","65:18":"behold","65:19":"and joy in my people; and there shall be heard in her no more the voice of weeping and the voice of crying.","65:20":"nor an old man who has not filled his days; for the child shall die one hundred years old","65:21":"and inhabit them; and they shall plant vineyards","65:22":"and another inhabit; they shall not plant","65:23":"nor bring forth for calamity; for they are the seed of the blessed of Yahweh","65:24":"before they call","65:25":"and the lion shall eat straw like the ox; and dust shall be the serpent's food. They shall not hurt nor destroy in all my holy mountain","66:1":"heaven is my throne","66:2":"and [so] all these things came to be","66:3":"as he who breaks a dog's neck; he who offers an offering","66:4":"and will bring their fears on them; because when I called","66:5":"you who tremble at his word: Your brothers who hate you","66:6":"a voice from the temple","66:7":"she brought forth; before her pain came","66:8":"she brought forth her children.","66:9":"and not cause to bring forth? says Yahweh:  shall I who cause to bring forth shut [the womb]? says your God.","66:10":"and be glad for her","66:11":"and be delighted with the abundance of her glory.","66:12":"Behold","66:13":"so will I comfort you; and you shall be comforted in Jerusalem.","66:14":"and your heart shall rejoice","66:15":"behold","66:16":"and by his sword","66:17":"behind one in the midst","66:18":"that I will gather all nations and languages; and they shall come","66:19":"and I will send such as escape of them to the nations","66:20":"on horses","66:21":"says Yahweh.","66:22":"which I will make","66:23":"that from one new moon to another","66:24":"and look on the dead bodies of the men who have transgressed against me:  for their worm shall not die"}