{"1:1":"a servant of God and of the Lord Jesus Christ","1:2":"my brothers{The word for brothers here and where context allows may also be correctly translated brothers and sisters or siblings.}","1:3":"Knowing this","1:4":"that you may be perfect and complete","1:5":"let him ask of God","1:6":"without any doubting","1:7":"For let not that man think that he shall receive any thing of the Lord.","1:8":"unstable in all his ways.","1:9":"Let the brother of low degree rejoice in that he is exalted:","1:10":"in that he is made humble","1:11":"and withers the grass","1:12":"for when he has been approved","1:13":"I am tempted by God, for God can't be tempted by evil","1:14":"when he is drawn away by his own lust","1:15":"when it has conceived","1:16":"my beloved brothers.","1:17":"coming down from the Father of lights","1:18":"that we should be a kind of first fruits of his creatures.","1:19":"then","1:20":"For the wrath of man worketh not the righteousness of God.","1:21":"putting away all filthiness and overflowing of wickedness","1:22":"and not only hearers","1:23":"he is like a man looking at his natural face in a mirror;","1:24":"and goes away","1:25":"and continues","1:26":"but deceives his heart","1:27":"and to keep oneself unstained by the world.","2:1":"don't hold the faith of our Lord Jesus Christ of glory with partiality.","2:2":"in fine clothing","2:3":"and say","2:4":"and become judges with evil thoughts?","2:5":"my beloved brothers.  Didn't God choose those who are poor in this world to be rich in faith","2:6":"and personally drag you before the courts?","2:7":"Do not they blaspheme that worthy name by the which ye are called?","2:8":"if you fulfill the royal law","2:9":"you commit sin","2:10":"and yet stumbles in one point","2:11":"Do not commit adultery,{Exodus 20:14; Deuteronomy 5:18} also said","2:12":"and so do","2:13":"For he shall have judgment without mercy","2:14":"my brothers","2:15":"","2:16":"Go in peace, be warmed and filled; and yet you didn't give them the things the body needs","2:17":"if it has no works","2:18":"a man will say","2:19":"and shudder.","2:20":"vain man","2:21":"in that he offered up Isaac his son on the altar?","2:22":"and by works faith was perfected;","2:23":"Abraham believed God, and it was accounted to him as righteousness;{Genesis 15:16} and he was called the friend of God.","2:24":"a man is justified","2:25":"in that she received the messengers","2:26":"even so faith apart from works is dead.","3:1":"my brothers","3:2":"the same is a perfect man","3:3":"we put bits into the horses' mouths so that they may obey us","3:4":"the ships also","3:5":"and boasts great things. See how a small fire can spread to a large forest!","3:6":"which defiles the whole body","3:7":"bird","3:8":"full of deadly poison.","3:9":"and with it we curse men","3:10":"these things ought not to be so.","3:11":"Doth a fountain send forth at the same place sweet water and bitter?","3:12":"my brothers","3:13":"Who is a wise man and endued with knowledge among you? let him shew out of a good conversation his works with meekness of wisdom.","3:14":"don't boast and don't lie against the truth.","3:15":"but is earthly","3:16":"there is confusion and every evil deed.","3:17":"then peaceful","3:18":"And the fruit of righteousness is sown in peace of them that make peace.","4:1":"From whence come wars and fightings among you? come they not hence","4:2":"and don't have.  You kill","4:3":"and don't receive","4:4":"don't you know that friendship with the world is enmity with God?  Whoever therefore wants to be a friend of the world makes himself an enemy of God.","4:5":"The Spirit who lives in us yearns jealously?","4:6":"God resists the proud, but gives grace to the humble.{Proverbs 3:34}","4:7":"and he will flee from you.","4:8":"and he will draw near to you.  Cleanse your hands","4:9":"mourn","4:10":"and he will exalt you.","4:11":"brothers.  He who speaks against a brother and judges his brother","4:12":"who is able to save and to destroy. But who are you to judge another?","4:13":"you who say","4:14":"that appears for a little time","4:15":"If the Lord wills, we will both live, and do this or that.","4:16":"But now ye rejoice in your boastings: all such rejoicing is evil.","4:17":"and doesn't do it","5:1":"you rich","5:2":"Your riches are corrupted","5:3":"and their corrosion will be for a testimony against you","5:4":"the wages of the laborers who mowed your fields","5:5":"and taken your pleasure. You have nourished your hearts as in a day of slaughter.","5:6":"you have murdered the righteous one. He doesn't resist you.","5:7":"brothers","5:8":"for the coming of the Lord is at hand.","5:9":"brothers","5:10":"brothers","5:11":"we call them blessed who endured.  You have heard of the patience of Job","5:12":"my brothers","5:13":"Is any among you afflicted? let him pray. Is any merry? let him sing psalms.","5:14":"and let them pray over him","5:15":"and the Lord will raise him up.  If he has committed sins","5:16":"and pray for one another","5:17":"and he prayed earnestly that it might not rain","5:18":"and the sky gave rain","5:19":"if any among you wanders from the truth","5:20":"and will cover a multitude of sins."}