{"1:1":"of the priests who were in Anathoth in the land of Benjamin:","1:2":"king of Judah","1:3":"king of Judah","1:4":"saying","1:5":"and before you came forth out of the womb I sanctified you; I have appointed you a prophet to the nations.","1:6":"Ah","1:7":"Don't say","1:8":"says Yahweh.","1:9":"and touched my mouth; and Yahweh said to me","1:10":"I have this day set you over the nations and over the kingdoms","1:11":"saying","1:12":"You have well seen:  for I watch over my word to perform it.","1:13":"saying","1:14":"Out of the north evil shall break forth on all the inhabitants of the land.","1:15":"behold","1:16":"in that they have forsaken me","1:17":"and arise","1:18":"behold","1:19":"says Yahweh","2:1":"saying","2:2":"and cry in the ears of Jerusalem","2:3":"the first fruits of his increase: all who devour him shall be held guilty; evil shall come on them","2:4":"O house of Jacob","2:5":"What unrighteousness have your fathers found in me","2:6":"Where is Yahweh who brought us up out of the land of Egypt","2:7":"to eat the fruit of it and the goodness of it; but when you entered","2:8":"Where is Yahweh? and those who handle the law didn't know me:  the rulers also transgressed against me","2:9":"says Yahweh","2:10":"and see; and send to Kedar","2:11":"which yet are no gods? but my people have changed their glory for that which does not profit.","2:12":"you heavens","2:13":"the spring of living waters","2:14":"Is Israel a servant? is he a homeborn slave? why is he spoiled?","2:15":"and yelled; and they have made his land waste:  his cities are burned up","2:16":"Also the children of Noph and Tahapanes have broken the crown of thy head.","2:17":"in that you have forsaken Yahweh your God","2:18":"to drink the waters of the Shihor? or what have you to do in the way to Assyria","2:19":"and your backsliding shall reprove you:  know therefore and see that it is an evil thing and a bitter","2:20":"and burst your bonds; and you said","2:21":"wholly a right seed: how then are you turned into the degenerate branches of a foreign vine to me?","2:22":"and use much soap","2:23":"I am not defiled","2:24":"that snuffs up the wind in her desire; in her occasion who can turn her away? all those who seek her will not weary themselves; in her month they shall find her.","2:25":"and your throat from thirst: but you said","2:26":"so is the house of Israel ashamed; they","2:27":"You are my father; and to a stone","2:28":"if they can save you in the time of your trouble: for according to the number of your cities are your gods","2:29":"says Yahweh.","2:30":"like a destroying lion.","2:31":"see the word of Yahweh.  Have I been a wilderness to Israel? or a land of thick darkness? why say my people","2:32":"or a bride her attire? yet my people have forgotten me days without number.","2:33":"Why trimmest thou thy way to seek love? therefore hast thou also taught the wicked ones thy ways.","2:34":"Also in thy skirts is found the blood of the souls of the poor innocents: I have not found it by secret search","2:35":"I am innocent; surely his anger is turned away from me.  Behold","2:36":"as you were ashamed of Assyria.","2:37":"with your hands on your head: for Yahweh has rejected those in whom you trust","3:1":"If a man put away his wife","3:2":"and see; where have you not been lain with?  By the ways have you sat for them","3:3":"and there has been no latter rain; yet you have a prostitute's forehead","3:4":"My Father","3:5":"you have spoken and have done evil things","3:6":"Have you seen that which backsliding Israel has done? she is gone up on every high mountain and under every green tree","3:7":"She will return to me; but she didn't return:  and her treacherous sister Judah saw it.","3:8":"when","3:9":"that the land was polluted","3:10":"but only in pretense","3:11":"Backsliding Israel has shown herself more righteous than treacherous Judah.","3:12":"and proclaim these words toward the north","3:13":"that you have transgressed against Yahweh your God","3:14":"backsliding children","3:15":"who shall feed you with knowledge and understanding.","3:16":"when you are multiplied and increased in the land","3:17":"to the name of Yahweh","3:18":"and they shall come together out of the land of the north to the land that I gave for an inheritance to your fathers.","3:19":"How I will put you among the children","3:20":"so have you dealt treacherously with me","3:21":"the weeping [and] the petitions of the children of Israel; because they have perverted their way","3:22":"you backsliding children","3:23":"the tumult on the mountains:  truly in Yahweh our God is the salvation of Israel.","3:24":"their flocks and their herds","3:25":"and let our confusion cover us; for we have sinned against Yahweh our God","4:1":"Israel","4:2":"As Yahweh lives","4:3":"Break up your fallow ground","4:4":"and take away the foreskins of your heart","4:5":"and publish in Jerusalem; and say","4:6":"don't stay; for I will bring evil from the north","4:7":"and a destroyer of nations; he is on his way","4:8":"lament and wail; for the fierce anger of Yahweh hasn't turned back from us.","4:9":"says Yahweh","4:10":"Ah","4:11":"A hot wind from the bare heights in the wilderness toward the daughter of my people","4:12":"Even a full wind from those places shall come unto me: now also will I give sentence against them.","4:13":"he shall come up as clouds","4:14":"wash your heart from wickedness","4:15":"and publishes evil from the hills of Ephraim:","4:16":"publish against Jerusalem","4:17":"because she has been rebellious against me","4:18":"for it reaches to your heart.","4:19":"my anguish!  I am pained at my very heart; my heart is disquieted in me; I can't hold my peace; because you have heard","4:20":"[and] my curtains in a moment.","4:21":"and hear the sound of the trumpet?","4:22":"they don't know me; they are foolish children","4:23":"and","4:24":"and behold","4:25":"and behold","4:26":"and behold","4:27":"The whole land shall be a desolation; yet will I not make a full end.","4:28":"and the heavens above be black; because I have spoken it","4:29":"and climb up on the rocks: every city is forsaken","4:30":"when you are made desolate","4:31":"the anguish as of her who brings forth her first child","5:1":"and see now","5:2":"As Yahweh lives; surely they swear falsely.","5:3":"don't your eyes look on truth? you have stricken them","5:4":"Surely these are poor; they are foolish; for they don't know the way of Yahweh","5:5":"and will speak to them; for they know the way of Yahweh","5:6":"a wolf of the evenings shall destroy them","5:7":"and sworn by them that are no gods:  when I had fed them to the full","5:8":"They were as fed horses in the morning: every one neighed after his neighbour's wife.","5:9":"Shall I not visit for these things? saith the LORD: and shall not my soul be avenged on such a nation as this?","5:10":"and destroy; but don't make a full end: take away her branches; for they are not Yahweh's.","5:11":"says Yahweh.","5:12":"and said","5:13":"and the word is not in them: thus shall it be done to them.","5:14":"the God of Armies","5:15":"I will bring a nation on you from far","5:16":"they are all mighty men.","5:17":"and your bread","5:18":"says Yahweh","5:19":"when you shall say","5:20":"and publish it in Judah","5:21":"foolish people","5:22":"who have placed the sand for the bound of the sea","5:23":"But this people hath a revolting and a rebellious heart; they are revolted and gone.","5:24":"Let us now fear Yahweh our God","5:25":"and your sins have withheld good from you.","5:26":"as fowlers lie in wait; they set a trap","5:27":"so are their houses full of deceit: therefore they are become great","5:28":"they shine:  yes","5:29":"Shall I not visit for these things? saith the LORD: shall not my soul be avenged on such a nation as this?","5:30":"A wonderful and horrible thing is committed in the land;","5:31":"and the priests bear rule by their means; and my people love to have it so: and what will you do in the end of it?","6:1":"you children of Benjamin","6:2":"the daughter of Zion","6:3":"The shepherds with their flocks shall come unto her; they shall pitch their tents against her round about; they shall feed every one in his place.","6:4":"and let us go up at noon. Woe to us! for the day declines","6:5":"and let us go up by night","6:6":"Hew you down trees","6:7":"so she casts forth her wickedness: violence and destruction is heard in her; before me continually is sickness and wounds.","6:8":"Jerusalem","6:9":"They shall thoroughly glean the remnant of Israel as a vine:  turn again your hand as a grape gatherer into the baskets.","6:10":"that they may hear? behold","6:11":"and on the assembly of young men together; for even the husband with the wife shall be taken","6:12":"their fields and their wives together; for I will stretch out my hand on the inhabitants of the land","6:13":"For from the least of them even unto the greatest of them every one is given to covetousness; and from the prophet even unto the priest every one dealeth falsely.","6:14":"saying","6:15":"they were not at all ashamed","6:16":"Stand you in the ways and see","6:17":"[saying]","6:18":"you nations","6:19":"earth:  behold","6:20":"and the sweet cane from a far country? your burnt offerings are not acceptable","6:21":"Behold","6:22":"Behold","6:23":"and have no mercy; their voice roars like the sea","6:24":"[and] pangs as of a woman in travail.","6:25":"nor walk by the way; for the sword of the enemy","6:26":"gird you with sackcloth","6:27":"I have set thee for a tower and a fortress among my people","6:28":"going about with slanders; they are brass and iron:  they all of them deal corruptly.","6:29":"The bellows are burned","6:30":"because Yahweh has rejected them.","7:1":"saying","7:2":"and proclaim there this word","7:3":"the God of Israel","7:4":"saying","7:5":"For if ye throughly amend your ways and your doings; if ye throughly execute judgment between a man and his neighbour;","7:6":"the fatherless","7:7":"in the land that I gave to your fathers","7:8":"you trust in lying words","7:9":"murder","7:10":"which is called by my name","7:11":"which is called by my name","7:12":"where I caused my name to dwell at the first","7:13":"because you have done all these works","7:14":"in which you trust","7:15":"as I have cast out all your brothers","7:16":"neither lift up a cry nor prayer for them","7:17":"Seest thou not what they do in the cities of Judah and in the streets of Jerusalem?","7:18":"and the fathers kindle the fire","7:19":"to the confusion of their own faces?","7:20":"my anger and my wrath shall be poured out on this place","7:21":"the God of Israel:  Add your burnt offerings to your sacrifices","7:22":"nor command them in the day that I brought them out of the land of Egypt","7:23":"saying","7:24":"but walked in [their own] counsels [and] in the stubbornness of their evil heart","7:25":"I have sent to you all my servants the prophets","7:26":"nor inclined their ear","7:27":"Therefore thou shalt speak all these words unto them; but they will not hearken to thee: thou shalt also call unto them; but they will not answer thee.","7:28":"This is the nation that has not listened to the voice of Yahweh their God","7:29":"[Jerusalem]","7:30":"says Yahweh:  they have set their abominations in the house which is called by my name","7:31":"which is in the valley of the son of Hinnom","7:32":"behold","7:33":"and for the animals of the earth; and none shall frighten them away.","7:34":"and from the streets of Jerusalem","8:1":"says Yahweh","8:2":"and the moon","8:3":"that remain in all the places where I have driven them","8:4":"Thus says Yahweh:  Shall men fall","8:5":"they refuse to return.","8:6":"but they didn't speak aright: no man repents him of his wickedness","8:7":"the stork in the sky knows her appointed times; and the turtledove and the swallow and the crane observe the time of their coming; but my people don't know Yahweh's law.","8:8":"We are wise","8:9":"they are dismayed and taken: behold","8:10":"and their fields to those who shall possess them:  for everyone from the least even to the greatest is given to covetousness; from the prophet even to the priest every one deals falsely.","8:11":"saying","8:12":"they were not at all ashamed","8:13":"says Yahweh:  there shall be no grapes on the vine","8:14":"and let us enter into the fortified cities","8:15":"but no good came; [and] for a time of healing","8:16":"and have devoured the land and all that is in it; the city and those who dwell therein.","8:17":"behold","8:18":"When I would comfort myself against sorrow","8:19":"the voice of the cry of the daughter of my people from a land that is very far off:  isn't Yahweh in Zion?  Isn't her King in her? Why have they provoked me to anger with their engraved images","8:20":"the summer is ended","8:21":"For the hurt of the daughter of my people am I hurt; I am black; astonishment hath taken hold on me.","8:22":"Is there no balm in Gilead; is there no physician there? why then is not the health of the daughter of my people recovered?","9:1":"and my eyes a spring of tears","9:2":"and go from them! for they are all adulterers","9:3":"[as it were] their bow","9:4":"and don't you trust in any brother; for every brother will utterly supplant","9:5":"and will not speak the truth:  they have taught their tongue to speak lies; they weary themselves to commit iniquity.","9:6":"says Yahweh.","9:7":"Behold","9:8":"but in his heart he lays wait for him.","9:9":"Shall I not visit them for these things? saith the LORD: shall not my soul be avenged on such a nation as this?","9:10":"and for the pastures of the wilderness a lamentation","9:11":"a dwelling place of jackals; and I will make the cities of Judah a desolation","9:12":"that may understand this? and [who is] he to whom the mouth of Yahweh has spoken","9:13":"Because they have forsaken my law which I set before them","9:14":"and after the Baals","9:15":"the God of Israel","9:16":"whom neither they nor their fathers have known; and I will send the sword after them","9:17":"Consider you","9:18":"and take up a wailing for us","9:19":"How are we ruined! we are greatly confounded","9:20":"you women","9:21":"it is entered into our palaces; to cut off the children from outside","9:22":"Thus says Yahweh","9:23":"Don't let the wise man glory in his wisdom","9:24":"that he has understanding","9:25":"the days come","9:26":"and Judah","10:1":"house of Israel!","10:2":"Don't learn the way of the nations, and don't be dismayed at the signs of the sky; for the nations are dismayed at them.,Thus saith the LORD, Learn not the way of the heathen, and be not dismayed at the signs of heaven; for the heathen are dismayed at them., כֹּה אָמַר יְהוָה אֶל־דֶּרֶךְ הַגּוֹיִם אַל־תִּלְמָדוּ וּמֵאֹתוֹת הַשָּׁמַיִם אַל־תֵּחָתּוּ כִּי־יֵחַתּוּ הַגּוֹיִם מֵהֵמָּה׃ ‬,thus saith the LORD: Learn not the way of the nations, And be not dismayed at the signs of heaven; For the nations are dismayed at them.,ἀκούσατε τὸν λόγον κυρίου ὃν ἐλάλησεν ἐφ' ὑμᾶς οἶκος ισραηλ,Thus saith the Lord, Learn ye not the ways of the heathen, and be not alarmed at the signs of the sky; for they are alarmed at them, falling on their faces.,,,,","10:3":"the work of the hands of the workman with the axe.","10:4":"that it not move.","10:5":"of turned work","10:6":"Yahweh; you are great","10:7":"King of the nations? for to you does it appertain; because among all the wise men of the nations","10:8":"But they are altogether brutish and foolish: the stock is a doctrine of vanities.","10:9":"which is brought from Tarshish","10:10":"and an everlasting King:  at his wrath the earth trembles","10:11":"The gods that have not made the heavens and the earth","10:12":"he has established the world by his wisdom","10:13":"there is a tumult of waters in the heavens","10:14":"and there is no breath in them.","10:15":"a work of delusion:  in the time of their visitation they shall perish.","10:16":"The portion of Jacob is not like them: for he is the former of all things; and Israel is the rod of his inheritance: The LORD of hosts is his name.","10:17":"you who abide in the siege.","10:18":"Behold","10:19":"Truly this is [my] grief","10:20":"and all my cords are broken: my children are gone forth from me","10:21":"and have not inquired of Yahweh:  therefore they have not prospered","10:22":"behold","10:23":"I know that the way of man is not in himself: it is not in man who walks to direct his steps.","10:24":"correct me","10:25":"and on the families that don't call on your name: for they have devoured Jacob","11:1":"saying","11:2":"and speak to the men of Judah","11:3":"Thus says Yahweh","11:4":"out of the iron furnace","11:5":"to give them a land flowing with milk and honey","11:6":"Proclaim all these words in the cities of Judah","11:7":"even to this day","11:8":"nor turn their ear","11:9":"A conspiracy is found among the men of Judah","11:10":"who refused to hear my words; and they are gone after other gods to serve them:  the house of Israel and the house of Judah have broken my covenant which I made with their fathers.","11:11":"Behold","11:12":"Then shall the cities of Judah and inhabitants of Jerusalem go","11:13":"Judah; and according to the number of the streets of Jerusalem have you set up altars to the shameful thing","11:14":"neither lift up cry nor prayer for them; for I will not hear them in the time that they cry to me because of their trouble.","11:15":"seeing she has worked lewdness [with] many","11:16":"A green olive tree","11:17":"who planted you","11:18":"and I knew it:  then you shown me their doings.","11:19":"[saying]","11:20":"Yahweh of Armies","11:21":"who seek your life","11:22":"Behold","11:23":"even the year of their visitation.","12:1":"Yahweh","12:2":"yes","12:3":"Yahweh","12:4":"and the herbs of the whole country wither? for the wickedness of those who dwell therein","12:5":"and they have wearied you","12:6":"and the house of your father","12:7":"I have cast off my heritage; I have given the dearly beloved of my soul into the hand of her enemies.","12:8":"Mine heritage is unto me as a lion in the forest; it crieth out against me: therefore have I hated it.","12:9":"assemble all the animals of the field","12:10":"they have trodden my portion under foot","12:11":"being desolate; the whole land is made desolate","12:12":"The spoilers are come upon all high places through the wilderness: for the sword of the LORD shall devour from the one end of the land even to the other end of the land: no flesh shall have peace.","12:13":"and have reaped thorns; they have put themselves to pain","12:14":"who touch the inheritance which I have caused my people Israel to inherit: behold","12:15":"after that I have plucked them up","12:16":"if they will diligently learn the ways of my people","12:17":"then will I pluck up that nation","13:1":"Go","13:2":"and put it on my waist.","13:3":"saying","13:4":"which is on your waist","13:5":"and hid it by the Euphrates","13:6":"that Yahweh said to me","13:7":"and dug","13:8":"saying","13:9":"After this manner will I mar the pride of Judah","13:10":"who refuse to hear my words","13:11":"so have I caused to cleave to me the whole house of Israel and the whole house of Judah","13:12":"the God of Israel","13:13":"Thus says Yahweh","13:14":"even the fathers and the sons together","13:15":"and give ear; don't be proud; for Yahweh has spoken.","13:16":"before he cause darkness","13:17":"my soul shall weep in secret for [your] pride; and my eye shall weep sore","13:18":"Humble yourselves","13:19":"and there is none to open them: Judah is carried away captive","13:20":"and see those who come from the north: where is the flock that was given you","13:21":"when he shall set over you as head those whom you have yourself taught to be friends to you? shall not sorrows take hold of you","13:22":"Why are these things come on me? for the greatness of your iniquity are your skirts uncovered","13:23":"or the leopard his spots? then may you also do good","13:24":"as the stubble that passes away","13:25":"the portion measured to you from me","13:26":"and your shame shall appear.","13:27":"even your adulteries","14:1":"The word of the LORD that came to Jeremiah concerning the dearth.","14:2":"and the gates of it languish","14:3":"and find no water; they return with their vessels empty; they are disappointed and confounded","14:4":"because no rain has been in the land","14:5":"the hind also in the field calves","14:6":"they pant for air like jackals; their eyes fail","14:7":"work you for your name's sake","14:8":"the Savior of it in the time of trouble","14:9":"as a mighty man who can't save? yet you","14:10":"Even so have they loved to wander; they have not refrained their feet:  therefore Yahweh does not accept them; now he will remember their iniquity","14:11":"Don't pray for this people for [their] good.","14:12":"I will not hear their cry; and when they offer burnt offering and meal offering","14:13":"Ah","14:14":"The prophets prophesy lies in my name; I didn't send them","14:15":"and I didn't send them","14:16":"their wives","14:17":"Let my eyes run down with tears night and day","14:18":"then","14:19":"and there is no healing for us? We looked for peace","14:20":"Yahweh","14:21":"for your name's sake; do not disgrace the throne of your glory:  remember","14:22":"Yahweh our God? therefore we will wait for you; for you have made all these things.","15:1":"Though Moses and Samuel stood before me","15:2":"when they tell you","15:3":"says Yahweh: the sword to kill","15:4":"because of Manasseh","15:5":"Jerusalem? or who will bemoan you? or who will turn aside to ask of your welfare?","15:6":"says Yahweh","15:7":"I have destroyed my people; they didn't return from their ways.","15:8":"Their widows are increased to me above the sand of the seas: I have brought upon them against the mother of the young men a spoiler at noonday: I have caused him to fall upon it suddenly","15:9":"says Yahweh.","15:10":"my mother","15:11":"Most certainly I will strengthen you for good; most certainly I will cause the enemy to make supplication to you in the time of evil and in the time of affliction.","15:12":"even iron from the north","15:13":"and that for all your sins","15:14":"which shall burn on you.","15:15":"you know; remember me","15:16":"and I ate them; and your words were to me a joy and the rejoicing of my heart:  for I am called by your name","15:17":"nor rejoiced; I sat alone because of your hand; for you have filled me with indignation.","15:18":"and my wound incurable","15:19":"If you return","15:20":"but they shall not prevail against you; for I am with you to save you and to deliver you","15:21":"and I will redeem you out of the hand of the terrible.","16:1":"saying","16:2":"neither shall you have sons or daughters","16:3":"and concerning their mothers who bore them","16:4":"neither shall they be buried; they shall be as dung on the surface of the ground; and they shall be consumed by the sword","16:5":"Don't enter into the house of mourning","16:6":"neither shall men lament for them","16:7":"to comfort them for the dead; neither shall men give them the cup of consolation to drink for their father or for their mother.","16:8":"to eat and to drink.","16:9":"the God of Israel:  Behold","16:10":"when you shall show this people all these words","16:11":"Because your fathers have forsaken me","16:12":"behold","16:13":"neither you nor your fathers; and there shall you serve other gods day and night; for I will show you no favor.","16:14":"behold","16:15":"As Yahweh lives","16:16":"I will send for many fishermen","16:17":"neither is their iniquity concealed from my eyes.","16:18":"because they have polluted my land with the carcasses of their detestable things","16:19":"my strength","16:20":"which yet are no gods?","16:21":"behold","17:1":"[and] with the point of a diamond:  it is engraved on the tablet of their heart","17:2":"Whilst their children remember their altars and their groves by the green trees upon the high hills.","17:3":"I will give your substance and all your treasures for a spoil","17:4":"even of yourself","17:5":"and makes flesh his arm","17:6":"and shall not see when good comes","17:7":"and whose trust Yahweh is.","17:8":"who spreads out its roots by the river","17:9":"and it is exceedingly corrupt:  who can know it?","17:10":"Yahweh","17:11":"so is he who gets riches","17:12":"[set] on high from the beginning","17:13":"the hope of Israel","17:14":"O Yahweh","17:15":"they tell me","17:16":"I have not hurried from being a shepherd after you; neither have I desired the woeful day; you know: that which came out of my lips was before your face.","17:17":"Be not a terror unto me: thou art my hope in the day of evil.","17:18":"but let not me be disappointed; let them be dismayed","17:19":"and stand in the gate of the children of the people","17:20":"Hear you the word of Yahweh","17:21":"Take heed to yourselves","17:22":"neither do any work:  but make the Sabbath day","17:23":"neither turn their ear","17:24":"if you diligently listen to me","17:25":"riding in chariots and on horses","17:26":"and from the places round about Jerusalem","17:27":"and not to bear a burden and enter in at the gates of Jerusalem on the Sabbath day; then will I kindle a fire in the gates of it","18:1":"saying","18:2":"and go down to the potter's house","18:3":"and behold","18:4":"he made it again another vessel","18:5":"saying","18:6":"can't I do with you as this potter? says Yahweh. Behold","18:7":"and concerning a kingdom","18:8":"concerning which I have spoken","18:9":"and concerning a kingdom","18:10":"that they not obey my voice","18:11":"speak to the men of Judah","18:12":"It is in vain; for we will walk after our own devices","18:13":"who has heard such things; the virgin of Israel has done a very horrible thing.","18:14":"Will a man leave the snow of Lebanon which cometh from the rock of the field? or shall the cold flowing waters that come from another place be forsaken?","18:15":"they have burned incense to false [gods]; and they have been made to stumble in their ways","18:16":"and a perpetual hissing; everyone who passes thereby shall be astonished","18:17":"and not the face","18:18":"Come","18:19":"Yahweh","18:20":"to turn away your wrath from them.","18:21":"and give them over to the power of the sword; and let their wives become childless","18:22":"when you shall bring a troop suddenly on them; for they have dug a pit to take me","18:23":"Yahweh","19:1":"Go","19:2":"which is by the entry of the gate Harsith","19:3":"Hear you the word of Yahweh","19:4":"and have estranged this place","19:5":"to burn their sons in the fire for burnt offerings to Baal; which I didn't command","19:6":"behold","19:7":"and by the hand of those who seek their life:  and their dead bodies will I give to be food for the birds of the sky","19:8":"and a hissing; everyone who passes thereby shall be astonished and hiss because of all the plagues of it.","19:9":"in the siege and in the distress","19:10":"","19:11":"Thus says Yahweh of Armies:  Even so will I break this people and this city","19:12":"says Yahweh","19:13":"and the houses of the kings of Judah","19:14":"where Yahweh had sent him to prophesy; and he stood in the court of Yahweh's house","19:15":"the God of Israel","20:1":"the son of Immer the priest","20:2":"and put him in the stocks that were in the upper gate of Benjamin","20:3":"that Pashhur brought forth Jeremiah out of the stocks.  Then said Jeremiah to him","20:4":"Behold","20:5":"and all the gains of it","20:6":"Pashhur","20:7":"you have persuaded me","20:8":"I cry out; I cry","20:9":"I will not make mention of him","20:10":"terror on every side. Denounce","20:11":"and they shall not prevail; they shall be utterly disappointed","20:12":"Yahweh of Armies","20:13":"praise you Yahweh; for he has delivered the soul of the needy from the hand of evil-doers.","20:14":"Cursed be the day wherein I was born: let not the day wherein my mother bare me be blessed.","20:15":"saying","20:16":"and didn't repent:  and let him hear a cry in the morning","20:17":"and her womb always great.","20:18":"that my days should be consumed with shame?","21:1":"when king Zedekiah sent to him Pashhur the son of Malchijah","21:2":"that he may go up from us.","21:3":"Thus shall you tell Zedekiah:","21:4":"the God of Israel","21:5":"even in anger","21:6":"both man and animal: they shall die of a great pestilence.","21:7":"says Yahweh","21:8":"Thus says Yahweh:  Behold","21:9":"and by the famine","21:10":"and not for good","21:11":"hear you the word of Yahweh:","21:12":"thus says Yahweh","21:13":"I am against you","21:14":"says Yahweh; and I will kindle a fire in her forest","22:1":"and speak there this word","22:2":"Hear the word of Yahweh","22:3":"and deliver him who is robbed out of the hand of the oppressor: and do no wrong","22:4":"then shall there enter in by the gates of this house kings sitting on the throne of David","22:5":"I swear by myself","22:6":"[and] the head of Lebanon; [yet] surely I will make you a wilderness","22:7":"everyone with his weapons; and they shall cut down your choice cedars","22:8":"and they shall say every man to his neighbor","22:9":"Because they forsook the covenant of Yahweh their God","22:10":"neither bemoan him; but weep sore for him who goes away; for he shall return no more","22:11":"king of Judah","22:12":"there shall he die","22:13":"and his chambers by injustice; who uses his neighbor's service without wages","22:14":"I will build me a wide house and spacious chambers","22:15":"because you strive to excel in cedar? Didn't your father eat and drink","22:16":"He judged the cause of the poor and needy; then it was well with him: was not this to know me? saith the LORD.","22:17":"and for shedding innocent blood","22:18":"king of Judah:  they shall not lament for him","22:19":"drawn and cast forth beyond the gates of Jerusalem.","22:20":"and cry; and lift up your voice in Bashan","22:21":"I will not hear. This has been your manner from your youth","22:22":"and your lovers shall go into captivity:  surely then shall you be ashamed and confounded for all your wickedness.","22:23":"who makes your nest in the cedars","22:24":"says Yahweh","22:25":"and into the hand of them of whom you are afraid","22:26":"and your mother who bore you","22:27":"there shall they not return.","22:28":"he and his seed","22:29":"earth","22:30":"Write you this man childless","23:1":"Woe be unto the pastors that destroy and scatter the sheep of my pasture! saith the LORD.","23:2":"the God of Israel","23:3":"and will bring them again to their folds; and they shall be fruitful and multiply.","23:4":"who shall feed them; and they shall fear no more","23:5":"the days come","23:6":"and Israel shall dwell safely; and this is his name by which he shall be called: Yahweh our righteousness.","23:7":"behold","23:8":"As Yahweh lives","23:9":"all my bones shake; I am like a drunken man","23:10":"and their might is not right;","23:11":"in my house have I found their wickedness","23:12":"and fall therein; for I will bring evil on them","23:13":"and caused my people Israel to err.","23:14":"and walk in lies; and they strengthen the hands of evil-doers","23:15":"I will feed them with wormwood","23:16":"Don't listen to the words of the prophets who prophesy to you:  they teach you vanity; they speak a vision of their own heart","23:17":"Yahweh has said","23:18":"that he should perceive and hear his word? who has marked my word","23:19":"the storm of Yahweh","23:20":"until he has executed","23:21":"yet they ran:  I didn't speak to them","23:22":"then had they caused my people to hear my words","23:23":"says Yahweh","23:24":"Can any hide himself in secret places that I shall not see him? saith the LORD. Do not I fill heaven and earth? saith the LORD.","23:25":"who prophesy lies in my name","23:26":"even the prophets of the deceit of their own heart?","23:27":"as their fathers forgot my name for Baal.","23:28":"let him tell a dream; and he who has my word","23:29":"Is not my word like as a fire? saith the LORD; and like a hammer that breaketh the rock in pieces?","23:30":"behold","23:31":"I am against the prophets","23:32":"I am against those who prophesy lying dreams","23:33":"or the prophet","23:34":"and the priest","23:35":"and everyone to his brother","23:36":"of Yahweh of Armies our God.","23:37":"What has Yahweh answered you? and","23:38":"The burden of Yahweh; therefore thus says Yahweh:  Because you say this word","23:39":"behold","23:40":"and a perpetual shame","24:1":"and behold","24:2":"like the figs that are first-ripe; and the other basket had very bad figs","24:3":"What see you","24:4":"saying","24:5":"the God of Israel:  Like these good figs","24:6":"and I will bring them again to this land:  and I will build them","24:7":"that I am Yahweh: and they shall be my people","24:8":"which can't be eaten","24:9":"a taunt and a curse","24:10":"the famine","25:1":"in the fourth year of Jehoiakim the son of Josiah","25:2":"and to all the inhabitants of Jerusalem","25:3":"king of Judah","25:4":"rising up early and sending them","25:5":"Return you now everyone from his evil way","25:6":"and don't provoke me to anger with the work of your hands; and I will do you no harm.","25:7":"says Yahweh; that you may provoke me to anger with the work of your hands to your own hurt.","25:8":"","25:9":"I will send and take all the families of the north","25:10":"the voice of the bridegroom and the voice of the bride","25:11":"and an astonishment; and these nations shall serve the king of Babylon seventy years.","25:12":"when seventy years are accomplished","25:13":"even all that is written in this book","25:14":"even of them; and I will recompense them according to their deeds","25:15":"the God of Israel","25:16":"and reel back and forth","25:17":"and made all the nations to drink","25:18":"Jerusalem","25:19":"and his servants","25:20":"and all the kings of the land of the Uz","25:21":"and Moab","25:22":"and all the kings of Sidon","25:23":"and Tema","25:24":"and all the kings of the mixed people who dwell in the wilderness;","25:25":"and all the kings of Elam","25:26":"far and near","25:27":"Thus says Yahweh of Armies","25:28":"if they refuse to take the cup at your hand to drink","25:29":"behold","25:30":"and tell them","25:31":"he will give them to the sword","25:32":"Behold","25:33":"neither gathered","25:34":"you shepherds","25:35":"nor the principal of the flock to escape.","25:36":"and the wailing of the principal of the flock! for Yahweh lays waste their pasture.","25:37":"And the peaceable habitations are cut down because of the fierce anger of the LORD.","25:38":"as the lion; for their land is become an astonishment because of the fierceness of the oppressing [sword]","26:1":"king of Judah","26:2":"and speak to all the cities of Judah","26:3":"and turn every man from his evil way; that I may repent me of the evil which I purpose to do to them because of the evil of their doings.","26:4":"Thus says Yahweh:  If you will not listen to me","26:5":"whom I send to you","26:6":"and will make this city a curse to all the nations of the earth.","26:7":"So the priests and the prophets and all the people heard Jeremiah speaking these words in the house of the LORD.","26:8":"when Jeremiah had made an end of speaking all that Yahweh had commanded him to speak to all the people","26:9":"saying","26:10":"they came up from the king's house to the house of Yahweh; and they sat in the entry of the new gate of Yahweh's [house].","26:11":"saying","26:12":"saying","26:13":"and obey the voice of Yahweh your God; and Yahweh will repent him of the evil that he has pronounced against you.","26:14":"behold","26:15":"if you put me to death","26:16":"Then said the princes and all the people unto the priests and to the prophets; This man is not worthy to die: for he hath spoken to us in the name of the LORD our God.","26:17":"and spoke to all the assembly of the people","26:18":"saying","26:19":"and entreat the favor of Yahweh","26:20":"Uriah the son of Shemaiah of Kiriath Jearim; and he prophesied against this city and against this land according to all the words of Jeremiah:","26:21":"with all his mighty men","26:22":"[namely]","26:23":"and brought him to Jehoiakim the king","26:24":"that they should not give him into the hand of the people to put him to death.","27:1":"king of Judah","27:2":"and put them on your neck;","27:3":"and to the king of Moab","27:4":"saying","27:5":"the men and the animals that are on the surface of the earth","27:6":"my servant; and the animals of the field also have I given him to serve him.","27:7":"and his son","27:8":"that the nation and the kingdom which will not serve the same Nebuchadnezzar king of Babylon","27:9":"don't you listen to your prophets","27:10":"to remove you far from your land","27:11":"and serve him","27:12":"saying","27:13":"you and your people","27:14":"saying","27:15":"says Yahweh","27:16":"saying","27:17":"and live: why should this city become a desolation?","27:18":"and if the word of Yahweh be with them","27:19":"and concerning the sea","27:20":"when he carried away captive Jeconiah the son of Jehoiakim","27:21":"thus says Yahweh of Armies","27:22":"and there shall they be","28:1":"in the beginning of the reign of Zedekiah king of Judah","28:2":"the God of Israel","28:3":"that Nebuchadnezzar king of Babylon took away from this place","28:4":"king of Judah","28:5":"and in the presence of all the people who stood in the house of Yahweh","28:6":"Amen:  Yahweh do so; Yahweh perform your words which you have prophesied","28:7":"and in the ears of all the people:","28:8":"and against great kingdoms","28:9":"when the word of the prophet shall happen","28:10":"and broke it.","28:11":"saying","28:12":"after that Hananiah the prophet had broken the bar from off the neck of the prophet Jeremiah","28:13":"and tell Hananiah","28:14":"the God of Israel:  I have put a yoke of iron on the neck of all these nations","28:15":"Hear now","28:16":"Behold","28:17":"So Hananiah the prophet died the same year in the seventh month.","29:1":"and to the priests","29:2":"and the queen mother","29:3":"and Gemariah the son of Hilkiah","29:4":"the God of Israel","29:5":"and dwell in them; and plant gardens","29:6":"and father sons and daughters; and take wives for your sons","29:7":"and pray to Yahweh for it; for in the peace of it shall you have peace.","29:8":"the God of Israel:  Don't let your prophets who are in the midst of you","29:9":"says Yahweh.","29:10":"After seventy years are accomplished for Babylon","29:11":"says Yahweh","29:12":"and you shall go and pray to me","29:13":"and find me","29:14":"says Yahweh","29:15":"Yahweh has raised us up prophets in Babylon;","29:16":"and concerning all the people who dwell in this city","29:17":"I will send on them the sword","29:18":"with the famine","29:19":"says Yahweh","29:20":"all you of the captivity","29:21":"the God of Israel","29:22":"saying","29:23":"and have committed adultery with their neighbors' wives","29:24":"saying","29:25":"the God of Israel","29:26":"that there may be officers in the house of Yahweh","29:27":"why have you not rebuked Jeremiah of Anathoth","29:28":"saying","29:29":"And Zephaniah the priest read this letter in the ears of Jeremiah the prophet.","29:30":"saying","29:31":"saying","29:32":"Behold","30:1":"saying","30:2":"the God of Israel","30:3":"behold","30:4":"And these are the words that the LORD spake concerning Israel and concerning Judah.","30:5":"of fear","30:6":"and see whether a man does travail with child: why do I see every man with his hands on his waist","30:7":"so that none is like it: it is even the time of Jacob's trouble; but he shall be saved out of it.","30:8":"says Yahweh of Armies","30:9":"and David their king","30:10":"O Jacob my servant","30:11":"says Yahweh","30:12":"Your hurt is incurable","30:13":"that you may be bound up: you have no healing medicines.","30:14":"with the chastisement of a cruel one","30:15":"because your sins were increased","30:16":"everyone of them","30:17":"and I will heal you of your wounds","30:18":"I will turn again the captivity of Jacob's tents","30:19":"and they shall not be few; I will also glorify them","30:20":"and their congregation shall be established before me; and I will punish all who oppress them.","30:21":"and their ruler shall proceed from the midst of them; and I will cause him to draw near","30:22":"and I will be your God.","30:23":"the storm of Yahweh","30:24":"until he has executed","31:1":"says Yahweh","31:2":"The people who were left of the sword found favor in the wilderness; even Israel","31:3":"[saying]","31:4":"and you shall be built","31:5":"and shall enjoy [the fruit of it].","31:6":"that the watchmen on the hills of Ephraim shall cry","31:7":"Sing with gladness for Jacob","31:8":"I will bring them from the north country","31:9":"in a straight way in which they shall not stumble; for I am a father to Israel","31:10":"you nations","31:11":"and redeemed him from the hand of him who was stronger than he.","31:12":"and shall flow to the goodness of Yahweh","31:13":"and the young men and the old together; for I will turn their mourning into joy","31:14":"and my people shall be satisfied with my goodness","31:15":"lamentation","31:16":"and your eyes from tears; for your work shall be rewarded","31:17":"says Yahweh; and [your] children shall come again to their own border.","31:18":"You have chastised me","31:19":"I repented; and after that I was instructed","31:20":"I do earnestly remember him still: therefore my heart yearns for him; I will surely have mercy on him","31:21":"make guideposts; set your heart toward the highway","31:22":"you backsliding daughter? for Yahweh has created a new thing in the earth: a woman shall encompass a man.","31:23":"the God of Israel","31:24":"the farmers","31:25":"and every sorrowful soul have I replenished.","31:26":"and saw; and my sleep was sweet to me.","31:27":"the days come","31:28":"like as I have watched over them to pluck up and to break down and to overthrow and to destroy and to afflict","31:29":"The fathers have eaten sour grapes","31:30":"his teeth shall be set on edge.","31:31":"the days come","31:32":"although I was a husband to them","31:33":"says Yahweh:  I will put my law in their inward parts","31:34":"and every man his brother","31:35":"who gives the sun for a light by day","31:36":"says Yahweh","31:37":"and the foundations of the earth searched out beneath","31:38":"the days come","31:39":"and shall turn about to Goah.","31:40":"and all the fields to the brook Kidron","32:1":"which was the eighteenth year of Nebuchadnezzar.","32:2":"which was in the king of Judah's house.","32:3":"saying","32:4":"but shall surely be delivered into the hand of the king of Babylon","32:5":"and there shall he be until I visit him","32:6":"The word of Yahweh came to me","32:7":"Hanamel the son of Shallum your uncle shall come to you","32:8":"and said to me","32:9":"and weighed him the money","32:10":"and sealed it","32:11":"both that which was sealed","32:12":"the son of Mahseiah","32:13":"saying","32:14":"the God of Israel:  Take these deeds","32:15":"the God of Israel:  Houses and fields and vineyards shall yet again be bought in this land.","32:16":"I prayed to Yahweh","32:17":"you have made the heavens and the earth by your great power and by your outstretched arm; there is nothing too hard for you","32:18":"and recompense the iniquity of the fathers into the bosom of their children after them; the great","32:19":"and mighty in work; whose eyes are open on all the ways of the sons of men","32:20":"even to this day","32:21":"and with wonders","32:22":"which you did swear to their fathers to give them","32:23":"and possessed it","32:24":"the mounds","32:25":"Lord Yahweh","32:26":"saying","32:27":"I am Yahweh","32:28":"I will give this city into the hand of the Chaldeans","32:29":"who fight against this city","32:30":"says Yahweh.","32:31":"","32:32":"which they have done to provoke me to anger","32:33":"and not the face: and though I taught them","32:34":"to defile it.","32:35":"which are in the valley of the son of Hinnom","32:36":"the God of Israel","32:37":"I will gather them out of all the countries","32:38":"and I will be their God:","32:39":"that they may fear me forever","32:40":"that I will not turn away from following them","32:41":"I will rejoice over them to do them good","32:42":"so will I bring on them all the good that I have promised them.","32:43":"about which you say","32:44":"and subscribe the deeds","33:1":"while he was yet shut up in the court of the guard","33:2":"Yahweh who forms it to establish it; Yahweh is his name:","33:3":"and I will answer you","33:4":"the God of Israel","33:5":"and to fill them with the dead bodies of men","33:6":"I will bring it health and cure","33:7":"and will build them","33:8":"by which they have sinned against me; and I will pardon all their iniquities","33:9":"for a praise and for a glory","33:10":"about which you say","33:11":"the voice of the bridegroom and the voice of the bride","33:12":"which is waste","33:13":"in the cities of the lowland","33:14":"the days come","33:15":"and at that time","33:16":"and Jerusalem shall dwell safely; and this is [the name] by which she shall be called: Yahweh our righteousness.","33:17":"For thus saith the LORD; David shall never want a man to sit upon the throne of the house of Israel;","33:18":"and to burn meal offerings","33:19":"saying","33:20":"and my covenant of the night","33:21":"that he shall not have a son to reign on his throne; and with the Levites the priests","33:22":"neither the sand of the sea measured; so will I multiply the seed of David my servant","33:23":"saying","33:24":"saying","33:25":"if I have not appointed the ordinances of heaven and earth;","33:26":"and of David my servant","34:1":"when Nebuchadnezzar king of Babylon","34:2":"the God of Israel","34:3":"but shall surely be taken","34:4":"O Zedekiah king of Judah: thus says Yahweh concerning you","34:5":"the former kings who were before you","34:6":"","34:7":"and against all the cities of Judah that were left","34:8":"after that the king Zedekiah had made a covenant with all the people who were at Jerusalem","34:9":"and every man his female servant","34:10":"who had entered into the covenant","34:11":"and caused the servants and the handmaids","34:12":"saying","34:13":"the God of Israel:  I made a covenant with your fathers in the day that I brought them forth out of the land of Egypt","34:14":"who has been sold to you","34:15":"and had done that which is right in my eyes","34:16":"and caused every man his servant","34:17":"to proclaim liberty","34:18":"who have not performed the words of the covenant which they made before me","34:19":"and the princes of Jerusalem","34:20":"and into the hand of those who seek their life; and their dead bodies shall be for food to the birds of the sky","34:21":"and into the hand of those who seek their life","34:22":"I will command","35:1":"king of Judah","35:2":"and speak to them","35:3":"the son of Habazziniah","35:4":"into the chamber of the sons of Hanan the son of Igdaliah","35:5":"and cups; and I said to them","35:6":"We will drink no wine; for Jonadab the son of Rechab","35:7":"nor sow seed","35:8":"our father","35:9":"nor field","35:10":"and have obeyed","35:11":"when Nebuchadnezzar king of Babylon came up into the land","35:12":"saying","35:13":"the God of Israel:  Go","35:14":"that he commanded his sons","35:15":"rising up early and sending them","35:16":"but this people has not listened to me;","35:17":"the God of Armies","35:18":"Thus says Yahweh of Armies","35:19":"the God of Israel:  Jonadab the son of Rechab shall not want a man to stand before me forever.","36:1":"king of Judah","36:2":"and write therein all the words that I have spoken to you against Israel","36:3":"It may be that the house of Judah will hear all the evil which I purpose to do unto them; that they may return every man from his evil way; that I may forgive their iniquity and their sin.","36:4":"which he had spoken to him","36:5":"saying","36:6":"and read in the scroll","36:7":"and will return everyone from his evil way; for great is the anger and the wrath that Yahweh has pronounced against this people.","36:8":"reading in the book the words of Yahweh in Yahweh's house.","36:9":"king of Judah","36:10":"in the chamber of Gemariah the son of Shaphan","36:11":"the son of Shaphan","36:12":"into the scribe's chamber: and behold","36:13":"when Baruch read the book in the ears of the people.","36:14":"the son of Shelemiah","36:15":"Sit down now","36:16":"when they had heard all the words","36:17":"saying","36:18":"He pronounced all these words to me with his mouth","36:19":"Go","36:20":"And they went in to the king into the court","36:21":"and in the ears of all the princes who stood beside the king.","36:22":"Now the king sat in the winterhouse in the ninth month: and there was a fire on the hearth burning before him.","36:23":"when Jehudi had read three or four leaves","36:24":"nor tore their garments","36:25":"Nevertheless Elnathan and Delaiah and Gemariah had made intercession to the king that he would not burn the roll: but he would not hear them.","36:26":"and Seraiah the son of Azriel","36:27":"after that the king had burned the scroll","36:28":"and write in it all the former words that were in the first scroll","36:29":"Thus says Yahweh:  You have burned this scroll","36:30":"and in the night to the frost.","36:31":"and on the inhabitants of Jerusalem","36:32":"and gave it to Baruch the scribe","37:1":"instead of Coniah the son of Jehoiakim","37:2":"nor his servants","37:3":"and Zephaniah the son of Maaseiah","37:4":"Now Jeremiah came in and went out among the people: for they had not put him into prison.","37:5":"they broke up from Jerusalem.","37:6":"saying","37:7":"the God of Israel","37:8":"and fight against this city; and they shall take it","37:9":"Don't deceive yourselves","37:10":"and there remained but wounded men among them","37:11":"when the army of the Chaldeans was broken up from Jerusalem for fear of Pharaoh's army","37:12":"to receive his portion there","37:13":"a captain of the guard was there","37:14":"It is false; I am not falling away to the Chaldeans.  But he didn't listen to him; so Irijah laid hold on Jeremiah","37:15":"and struck him","37:16":"and into the cells","37:17":"and fetched him: and the king asked him secretly in his house","37:18":"Wherein have I sinned against you","37:19":"saying","37:20":"my lord the king:  please let my supplication be presented before you","37:21":"and they committed Jeremiah into the court of the guard; and they gave him daily a loaf of bread out of the bakers' street","38:1":"and Gedaliah the son of Pashhur","38:2":"He who remains in this city shall die by the sword","38:3":"This city shall surely be given into the hand of the army of the king of Babylon","38:4":"Let this man","38:5":"Behold","38:6":"and cast him into the dungeon of Malchijah the king's son","38:7":"a eunuch","38:8":"and spoke to the king","38:9":"these men have done evil in all that they have done to Jeremiah the prophet","38:10":"saying","38:11":"and went into the house of the king under the treasury","38:12":"Put now these rags and worn-out garments under your armholes under the cords. Jeremiah did so.","38:13":"and took him up out of the dungeon:  and Jeremiah remained in the court of the guard.","38:14":"and took Jeremiah the prophet to him into the third entry that is in the house of Yahweh: and the king said to Jeremiah","38:15":"If I declare it to you","38:16":"saying","38:17":"Thus says Yahweh","38:18":"then shall this city be given into the hand of the Chaldeans","38:19":"I am afraid of the Jews who are fallen away to the Chaldeans","38:20":"They shall not deliver you.  Obey","38:21":"this is the word that Yahweh has shown me:","38:22":"all the women who are left in the king of Judah's house shall be brought forth to the king of Babylon's princes","38:23":"but shall be taken by the hand of the king of Babylon: and you shall cause this city to be burned with fire.","38:24":"Let no man know of these words","38:25":"and they come to you","38:26":"I presented my supplication before the king","38:27":"and asked him; and he told them according to all these words that the king had commanded.  So they left off speaking with him; for the matter was not perceived.","38:28":"So Jeremiah abode in the court of the prison until the day that Jerusalem was taken: and he was there when Jerusalem was taken.","39:1":"(in the ninth year of Zedekiah king of Judah","39:2":"in the fourth month","39:3":"and sat in the middle gate","39:4":"when Zedekiah the king of Judah and all the men of war saw them","39:5":"and overtook Zedekiah in the plains of Jericho:  and when they had taken him","39:6":"Then the king of Babylon slew the sons of Zedekiah in Riblah before his eyes: also the king of Babylon slew all the nobles of Judah.","39:7":"and bound him in fetters","39:8":"and the houses of the people","39:9":"the deserters also who fell away to him","39:10":"who had nothing","39:11":"saying","39:12":"and look well to him","39:13":"and Nebushazban","39:14":"and took Jeremiah out of the court of the guard","39:15":"while he was shut up in the court of the guard","39:16":"and speak to Ebedmelech the Ethiopian","39:17":"says Yahweh; and you shall not be given into the hand of the men of whom you are afraid.","39:18":"and you shall not fall by the sword","40:1":"after that Nebuzaradan the captain of the guard had let him go from Ramah","40:2":"and said to him","40:3":"and done according as he spoke: because you have sinned against Yahweh","40:4":"behold","40:5":"Go back then","40:6":"and lived with him among the people who were left in the land.","40:7":"even they and their men","40:8":"[to wit]","40:9":"saying","40:10":"behold","40:11":"and among the children of Ammon","40:12":"and came to the land of Judah","40:13":"and all the captains of the forces who were in the fields","40:14":"Do you know that Baalis the king of the children of Ammon has sent Ishmael the son of Nethaniah to take your life? But Gedaliah the son of Ahikam didn't believe them.","40:15":"saying","40:16":"You shall not do this thing; for you speak falsely of Ishmael.","41:1":"that Ishmael the son of Nethaniah","41:2":"and the ten men who were with him","41:3":"[to wit]","41:4":"and no man knew it","41:5":"from Shiloh","41:6":"weeping all along as he went:  and it happened","41:7":"when they came into the midst of the city","41:8":"Don't kill us; for we have stores hidden in the field","41:9":"by the side of Gedaliah (the same was who which Asa the king had made for fear of Baasha king of Israel)","41:10":"even the king's daughters","41:11":"and all the captains of the forces who were with him","41:12":"and went to fight with Ishmael the son of Nethaniah","41:13":"when all the people who were with Ishmael saw Johanan the son of Kareah","41:14":"and went to Johanan the son of Kareah.","41:15":"and went to the children of Ammon.","41:16":"and all the captains of the forces who were with him","41:17":"and lived in Geruth Chimham","41:18":"because Ishmael the son of Nethaniah had killed Gedaliah the son of Ahikam","42:1":"and Johanan the son of Kareah","42:2":"Let","42:3":"and the thing that we should do.","42:4":"I have heard you; behold","42:5":"Yahweh be a true and faithful witness among us","42:6":"or whether it be evil","42:7":"that the word of Yahweh came to Jeremiah.","42:8":"and all the captains of the forces who were with him","42:9":"Thus says Yahweh","42:10":"then will I build you","42:11":"of whom you are afraid; don't be afraid of him","42:12":"that he may have mercy on you","42:13":"We will not dwell in this land; so that you don't obey the voice of Yahweh your God","42:14":"No; but we will go into the land of Egypt","42:15":"O remnant of Judah:  Thus says Yahweh of Armies","42:16":"that the sword","42:17":"by the famine","42:18":"the God of Israel:  As my anger and my wrath has been poured forth on the inhabitants of Jerusalem","42:19":"remnant of Judah","42:20":"saying","42:21":"And now I have this day declared it to you; but ye have not obeyed the voice of the LORD your God","42:22":"by the famine","43:1":"when Jeremiah had made an end of speaking to all the people all the words of Yahweh their God","43:2":"and Johanan the son of Kareah","43:3":"to deliver us into the hand of the Chaldeans","43:4":"and all the captains of the forces","43:5":"and all the captains of the forces","43:6":"and the women","43:7":"So they came into the land of Egypt: for they obeyed not the voice of the LORD: thus came they even to Tahpanhes.","43:8":"saying","43:9":"and hide them in mortar in the brick work","43:10":"Thus says Yahweh of Armies","43:11":"and shall strike the land of Egypt; such as are for death [shall be given] to death","43:12":"and carry them away captive: and he shall array himself with the land of Egypt","43:13":"that is in the land of Egypt; and the houses of the gods of Egypt shall he burn with fire.","44:1":"who lived at Migdol","44:2":"the God of Israel:  You have seen all the evil that I have brought on Jerusalem","44:3":"in that they went to burn incense","44:4":"rising up early and sending them","44:5":"nor inclined their ear to turn from their wickedness","44:6":"and was kindled in the cities of Judah and in the streets of Jerusalem; and they are wasted and desolate","44:7":"the God of Armies","44:8":"burning incense to other gods in the land of Egypt","44:9":"and the wickedness of the kings of Judah","44:10":"neither have they feared","44:11":"the God of Israel:  Behold","44:12":"that have set their faces to go into the land of Egypt to sojourn there","44:13":"as I have punished Jerusalem","44:14":"who have gone into the land of Egypt to sojourn there","44:15":"and all the women who stood by","44:16":"we will not listen to you.","44:17":"to burn incense to the queen of the sky","44:18":"and pouring out drink offerings to her","44:19":"and poured out drink offerings to her","44:20":"to the men","44:21":"and in the streets of Jerusalem","44:22":"because of the evil of your doings","44:23":"and because you have sinned against Yahweh","44:24":"and to all the women","44:25":"the God of Israel","44:26":"all Judah who dwell in the land of Egypt:  Behold","44:27":"I watch over them for evil","44:28":"few in number; and all the remnant of Judah","44:29":"says Yahweh","44:30":"Behold","45:1":"when he wrote these words in a book at the mouth of Jeremiah","45:2":"the God of Israel","45:3":"Woe is me now! for Yahweh has added sorrow to my pain; I am weary with my groaning","45:4":"Thus says Yahweh:  Behold","45:5":"behold","46:1":"The word of the LORD which came to Jeremiah the prophet against the Gentiles;","46:2":"which was by the river Euphrates in Carchemish","46:3":"and draw near to battle.","46:4":"and get up","46:5":"and have fled apace","46:6":"nor the mighty man escape; in the north by the river Euphrates have they stumbled and fallen.","46:7":"whose waters toss themselves like the rivers?","46:8":"and his waters toss themselves like the rivers:  and he says","46:9":"you horses; and rage","46:10":"Yahweh of Armies","46:11":"and take balm","46:12":"and the earth is full of your cry; for the mighty man has stumbled against the mighty","46:13":"how that Nebuchadnezzar king of Babylon should come and strike the land of Egypt.","46:14":"and publish in Migdol","46:15":"because Yahweh did drive them.","46:16":"yes","46:17":"Pharaoh king of Egypt is but a noise; he has let the appointed time pass by.","46:18":"says the King","46:19":"furnish yourself to go into captivity; for Memphis shall become a desolation","46:20":"it is come.","46:21":"they are fled away together","46:22":"and come against her with axes","46:23":"says Yahweh","46:24":"The daughter of Egypt shall be confounded; she shall be delivered into the hand of the people of the north.","46:25":"the God of Israel","46:26":"and into the hand of Nebuchadnezzar king of Babylon","46:27":"Jacob my servant","46:28":"O Jacob my servant","47:1":"before that Pharaoh struck Gaza.","47:2":"waters rise up out of the north","47:3":"at the rushing of his chariots","47:4":"to cut off from Tyre and Sidon every helper who remains: for Yahweh will destroy the Philistines","47:5":"the remnant of their valley:  how long will you cut yourself?","47:6":"how long will it be before you be quiet? put up yourself into your scabbard; rest","47:7":"seeing Yahweh has given you a charge? Against Ashkelon","48:1":"the God of Israel:  Woe to Nebo! for it is laid waste; Kiriathaim is disappointed","48:2":"and let us cut her off from being a nation.  You also","48:3":"desolation and great destruction!","48:4":"Moab is destroyed; her little ones have caused a cry to be heard.","48:5":"For in the going up of Luhith continual weeping shall go up; for in the going down of Horonaim the enemies have heard a cry of destruction.","48:6":"save your lives","48:7":"because you have trusted in your works and in your treasures","48:8":"and no city shall escape; the valley also shall perish","48:9":"that she may fly and get her away: and her cities shall become a desolation","48:10":"Cursed be he that doeth the work of the LORD deceitfully","48:11":"and he has settled on his lees","48:12":"behold","48:13":"as the house of Israel was ashamed of Bethel their confidence.","48:14":"We are mighty men","48:15":"and they are gone up into his cities","48:16":"and his affliction hurries fast.","48:17":"bemoan him","48:18":"come down from your glory","48:19":"stand by the way","48:20":"that Moab is laid waste.","48:21":"on Holon","48:22":"and on Nebo","48:23":"and on Beth Gamul","48:24":"and on Bozrah","48:25":"and his arm is broken","48:26":"and he also shall be in derision.","48:27":"you wag the head.","48:28":"leave the cities","48:29":"[that] he is very proud; his loftiness","48:30":"says Yahweh","48:31":"I will cry out for all Moab: for the men of Kir Heres shall they mourn.","48:32":"vine of Sibmah:  your branches passed over the sea","48:33":"And joy and gladness is taken from the plentiful field","48:34":"even to Jahaz have they uttered their voice","48:35":"says Yahweh","48:36":"and my heart sounds like pipes for the men of Kir Heres: therefore the abundance that he has gotten is perished.","48:37":"and every beard clipped: on all the hands are cuttings","48:38":"says Yahweh.","48:39":"They shall howl","48:40":"he shall fly as an eagle","48:41":"and the strongholds are seized","48:42":"because he has magnified himself against Yahweh.","48:43":"and the pit","48:44":"even on Moab","48:45":"and a flame from the midst of Sihon","48:46":"O Moab! the people of Chemosh is undone; for your sons are taken away captive","48:47":"says Yahweh.  Thus far is the judgment of Moab.","49:1":"and his people well in the cities of it?","49:2":"behold","49:3":"Heshbon","49:4":"your flowing valley","49:5":"I will bring a fear on you","49:6":"says Yahweh.","49:7":"Concerning Edom","49:8":"turn back","49:9":"would they not leave some gleaning grapes? if thieves by night","49:10":"I have uncovered his secret places","49:11":"I will preserve them alive; and let your widows trust in me.","49:12":"they to whom it didn't pertain to drink of the cup shall certainly drink; and are you he who shall altogether go unpunished? you shall not go unpunished","49:13":"says Yahweh","49:14":"and an ambassador is sent among the nations","49:15":"behold","49:16":"the pride of your heart has deceived you","49:17":"and shall hiss at all the plagues of it.","49:18":"says Yahweh","49:19":"he shall come up like a lion from the pride of the Jordan against the strong habitation:  for I will suddenly make them run away from it; and whoever is chosen","49:20":"that he has taken against Edom; and his purposes","49:21":"the noise which is heard in the Red Sea{or","49:22":"he shall come up and fly as the eagle","49:23":"and Arpad; for they have heard evil news","49:24":"she turns herself to flee","49:25":"the city of my joy?","49:26":"and all the men of war shall be brought to silence in that day","49:27":"and it shall devour the palaces of Ben Hadad.","49:28":"and of the kingdoms of Hazor","49:29":"and all their vessels","49:30":"wander far off","49:31":"go up to a nation that is at ease","49:32":"and the multitude of their livestock a spoil:  and I will scatter to all winds those who have the corners [of their hair] cut off; and I will bring their calamity from every side of them","49:33":"a desolation forever: no man shall dwell there","49:34":"in the beginning of the reign of Zedekiah king of Judah","49:35":"I will break the bow of Elam","49:36":"and will scatter them toward all those winds; and there shall be no nation where the outcasts of Elam shall not come.","49:37":"and before those who seek their life; and I will bring evil on them","49:38":"and will destroy from there king and princes","49:39":"that I will bring back the captivity of Elam","50:1":"concerning the land of the Chaldeans","50:2":"and set up a standard; publish","50:3":"which shall make her land desolate","50:4":"and in that time","50:5":"[saying]","50:6":"My people hath been lost sheep: their shepherds have caused them to go astray","50:7":"We are not guilty","50:8":"and go forth out of the land of the Chaldeans","50:9":"behold","50:10":"says Yahweh.","50:11":"because you rejoice","50:12":"she shall be the least of the nations","50:13":"but she shall be wholly desolate:  everyone who goes by Babylon shall be astonished","50:14":"all you who bend the bow; shoot at her","50:15":"her walls are thrown down; for it is the vengeance of Yahweh:  take vengeance on her; as she has done","50:16":"and him who handles the sickle in the time of harvest:  for fear of the oppressing sword they shall turn everyone to his people","50:17":"the king of Assyria devoured him; and now at last Nebuchadnezzar king of Babylon has broken his bones.","50:18":"the God of Israel:  Behold","50:19":"and he shall feed on Carmel and Bashan","50:20":"and in that time","50:21":"even against it","50:22":"and of great destruction.","50:23":"How is the hammer of the whole earth cut asunder and broken! how is Babylon become a desolation among the nations!","50:24":"and you are also taken","50:25":"and has brought forth the weapons of his indignation; for the Lord","50:26":"and destroy her utterly; let nothing of her be left.","50:27":"the time of their visitation.","50:28":"to declare in Zion the vengeance of Yahweh our God","50:29":"all those who bend the bow; encamp against her round about; let none of it escape: recompense her according to her work; according to all that she has done","50:30":"and all her men of war shall be brought to silence in that day","50:31":"I am against you","50:32":"and none shall raise him up; and I will kindle a fire in his cities","50:33":"Thus saith the LORD of hosts; The children of Israel and the children of Judah were oppressed together: and all that took them captives held them fast; they refused to let them go.","50:34":"that he may give rest to the earth","50:35":"says Yahweh","50:36":"and they shall become fools; a sword is on her mighty men","50:37":"and on their chariots","50:38":"and they shall be dried up; for it is a land of engraved images","50:39":"and the ostriches shall dwell therein: and it shall be no more inhabited forever; neither shall it be lived in from generation to generation.","50:40":"says Yahweh","50:41":"a people comes from the north; and a great nation and many kings shall be stirred up from the uttermost parts of the earth.","50:42":"and have no mercy; their voice roars like the sea; and they ride on horses","50:43":"and his hands wax feeble:  anguish has taken hold of him","50:44":"[the enemy] shall come up like a lion from the pride of the Jordan against the strong habitation: for I will suddenly make them run away from it; and whoever is chosen","50:45":"that he has taken against Babylon; and his purposes","50:46":"and the cry is heard among the nations.","51:1":"I will raise up against Babylon","51:2":"who shall winnow her; and they shall empty her land:  for in the day of trouble they shall be against her round about.","51:3":"and against [him who] lifts himself up in his coat of mail: and don't you spare her young men; destroy you utterly all her army.","51:4":"and thrust through in her streets.","51:5":"nor Judah","51:6":"and save every man his life; don't be cut off in her iniquity:  for it is the time of Yahweh's vengeance; he will render to her a recompense.","51:7":"who made all the earth drunken:  the nations have drunk of her wine; therefore the nations are mad.","51:8":"if so be she may be healed.","51:9":"but she is not healed: forsake her","51:10":"and let us declare in Zion the work of Yahweh our God.","51:11":"to destroy it: for it is the vengeance of Yahweh","51:12":"make the watch strong","51:13":"abundant in treasures","51:14":"[saying]","51:15":"he has established the world by his wisdom","51:16":"there is a tumult of waters in the heavens","51:17":"and there is no breath in them.","51:18":"a work of delusion:  in the time of their visitation they shall perish.","51:19":"The portion of Jacob is not like them; for he is the former of all things: and Israel is the rod of his inheritance: the LORD of hosts is his name.","51:20":"Thou art my battle axe and weapons of war: for with thee will I break in pieces the nations","51:21":"And with thee will I break in pieces the horse and his rider; and with thee will I break in pieces the chariot and his rider;","51:22":"With thee also will I break in pieces man and woman; and with thee will I break in pieces old and young; and with thee will I break in pieces the young man and the maid;","51:23":"I will also break in pieces with thee the shepherd and his flock; and with thee will I break in pieces the husbandman and his yoke of oxen; and with thee will I break in pieces captains and rulers.","51:24":"says Yahweh.","51:25":"I am against you","51:26":"nor a stone for foundations; but you shall be desolate for ever","51:27":"blow the trumpet among the nations","51:28":"the kings of the Medes","51:29":"to make the land of Babylon a desolation","51:30":"they remain in their strongholds; their might has failed; they are become as women:  her dwelling places are set on fire; her bars are broken.","51:31":"and one messenger to meet another","51:32":"and the reeds they have burned with fire","51:33":"the God of Israel:  The daughter of Babylon is like a threshing floor at the time when it is trodden; yet a little while","51:34":"he has crushed me","51:35":"shall the inhabitant of Zion say; and","51:36":"I will plead your cause","51:37":"a dwelling place for jackals","51:38":"They shall roar together like lions: they shall yell as lions' whelps.","51:39":"I will make their feast","51:40":"like rams with male goats.","51:41":"How is Sheshach taken! and how is the praise of the whole earth surprised! how is Babylon become an astonishment among the nations!","51:42":"The sea is come up upon Babylon: she is covered with the multitude of the waves thereof.","51:43":"a dry land","51:44":"and I will bring forth out of his mouth that which he has swallowed up; and the nations shall not flow any more to him:  yes","51:45":"go you out of the midst of her","51:46":"neither fear for the news that shall be heard in the land; for news shall come one year","51:47":"behold","51:48":"and all that is therein","51:49":"so at Babylon shall fall the slain of all the land.","51:50":"go you","51:51":"because we have heard reproach; confusion has covered our faces:  for strangers are come into the sanctuaries of Yahweh's house.","51:52":"behold","51:53":"and though she should fortify the height of her strength","51:54":"and of great destruction from the land of the Chaldeans!","51:55":"and destroys out of her the great voice; and their waves roar like many waters; the noise of their voice is uttered:","51:56":"even on Babylon","51:57":"her governors and her deputies","51:58":"and her high gates shall be burned with fire; and the peoples shall labor for vanity","51:59":"the son of Mahseiah","51:60":"even all these words that are written concerning Babylon.","51:61":"When you come to Babylon","51:62":"Yahweh","51:63":"when you have made an end of reading this book","51:64":"Thus shall Babylon sink","52:1":"Zedekiah was one and twenty years old when he began to reign","52:2":"according to all that Jehoiakim had done.","52:3":"until he had cast them out from his presence. Zedekiah rebelled against the king of Babylon.","52:4":"in the tenth month","52:5":"So the city was besieged unto the eleventh year of king Zedekiah.","52:6":"in the ninth day of the month","52:7":"and all the men of war fled","52:8":"and overtook Zedekiah in the plains of Jericho; and all his army was scattered from him.","52:9":"and carried him up to the king of Babylon to Riblah in the land of Hamath; and he gave judgment on him.","52:10":"And the king of Babylon slew the sons of Zedekiah before his eyes: he slew also all the princes of Judah in Riblah.","52:11":"and carried him to Babylon","52:12":"in the tenth day of the month","52:13":"and the king's house; and all the houses of Jerusalem","52:14":"who were with the captain of the guard","52:15":"and the residue of the people who were left in the city","52:16":"But Nebuzaradan the captain of the guard left certain of the poor of the land for vinedressers and for husbandmen.","52:17":"and the bases and the bronze sea that were in the house of Yahweh","52:18":"and the shovels","52:19":"and the fire pans","52:20":"the one sea","52:21":"the height of the one pillar was eighteen cubits; and a line of twelve cubits did compass it; and the thickness of it was four fingers:  it was hollow.","52:22":"with network and pomegranates on the capital round about","52:23":"And there were ninety and six pomegranates on a side; and all the pomegranates upon the network were an hundred round about.","52:24":"and Zephaniah the second priest","52:25":"who were found in the city; and the scribe of the captain of the army","52:26":"and brought them to the king of Babylon to Riblah.","52:27":"and put them to death at Riblah in the land of Hamath.  So Judah was carried away captive out of his land.","52:28":"This is the people whom Nebuchadrezzar carried away captive: in the seventh year three thousand Jews and three and twenty:","52:29":"In the eighteenth year of Nebuchadrezzar he carried away captive from Jerusalem eight hundred thirty and two persons:","52:30":"In the three and twentieth year of Nebuchadrezzar Nebuzaradan the captain of the guard carried away captive of the Jews seven hundred forty and five persons: all the persons were four thousand and six hundred.","52:31":"in the twelfth month","52:32":"and set his throne above the throne of the kings who were with him in Babylon","52:33":"And changed his prison garments: and he did continually eat bread before him all the days of his life.","52:34":"there was a continual allowance given him by the king of Babylon"}