{"1:1":"the son of Pethuel.","1:2":"you elders","1:3":"and have your children tell their children","1:4":"the great locust has eaten. What the great locust has left","1:5":"you drunkards","1:6":"strong","1:7":"and stripped my fig tree. He has stripped its bark","1:8":"Lament like a virgin girded with sackcloth for the husband of her youth.","1:9":"Yahweh's ministers","1:10":"for the grain is destroyed","1:11":"you farmers!  Wail","1:12":"and the fig tree withered; the pomegranate tree","1:13":"you priests!  Wail","1:14":"and all the inhabitants of the land","1:15":"and it will come as destruction from the Almighty.","1:16":"Is not the meat cut off before our eyes","1:17":"for the grain has withered.","1:18":"because they have no pasture.  Yes","1:19":"I cry to you","1:20":"the animals of the field pant to you","2:1":"and sound an alarm in my holy mountain! Let all the inhabitants of the land tremble","2:2":"a day of clouds and thick darkness. As the dawn spreading on the mountains","2:3":"and behind them","2:4":"and as horsemen","2:5":"like the noise of a flame of fire that devours the stubble","2:6":"Before their face the people shall be much pained: all faces shall gather blackness.","2:7":"and they don't swerve off course.","2:8":"and they burst through the defenses","2:9":"They shall run to and fro in the city; they shall run upon the wall","2:10":"and the stars withdraw their shining.","2:11":"and who can endure it?","2:12":"turn to me with all your heart, and with fasting, and with weeping, and with mourning.","2:13":"and not your garments","2:14":"and leave a blessing behind him","2:15":"Blow the trumpet in Zion","2:16":"and those who suck the breasts. Let the bridegroom go forth from his room","2:17":"the ministers of Yahweh","2:18":"And had pity on his people.","2:19":"Behold, I will send you grain, new wine, and oil, and you will be satisfied with them; and I will no more make you a reproach among the nations.,Yea, the LORD will answer and say unto his people, Behold, I will send you corn, and wine, and oil, and ye shall be satisfied therewith: and I will no more make you a reproach among the heathen:, וַיַּעַן יְהוָה וַיֹּאמֶר לְעַמּוֹ הִנְנִי שֹׁלֵחַ לָכֶם אֶת־הַדָּגָן וְהַתִּירוֹשׁ וְהַיִּצְהָר וּשְׂבַעְתֶּם אֹתוֹ וְלֹא־אֶתֵּן אֶתְכֶם עוֹד חֶרְפָּה בַּגּוֹיִם׃ ‬,And the LORD answered and said unto His people: Behold","2:20":"and will drive it into a barren and desolate land","2:21":"don't be afraid.  Be glad and rejoice","2:22":"you animals of the field; for the pastures of the wilderness spring up","2:23":"","2:24":"and the vats will overflow with new wine and oil.","2:25":"the great locust","2:26":"and be satisfied","2:27":"and that I am Yahweh","2:28":"","2:29":"I will pour out my Spirit.","2:30":"fire","2:31":"and the moon into blood","2:32":"as Yahweh has said","3:1":"","3:2":"and will bring them down into the valley of Jehoshaphat; and I will execute judgment on them there for my people","3:3":"and have given a boy for a prostitute","3:4":"","3:5":"and have carried my finest treasures into your temples","3:6":"that you may remove them far from their border.","3:7":"I will stir them up out of the place where you have sold them","3:8":"and they will sell them to the men of Sheba","3:9":"","3:10":"and your pruning hooks into spears. Let the weak say","3:11":"all you surrounding nations","3:12":"","3:13":"tread","3:14":"multitudes in the valley of decision! For the day of Yahweh is near","3:15":"and the stars withdraw their shining.","3:16":"and thunder from Jerusalem; and the heavens and the earth will shake; but Yahweh will be a refuge to his people","3:17":"","3:18":"that the mountains will drop down sweet wine","3:19":"and Edom will be a desolate wilderness","3:20":"and Jerusalem from generation to generation.","3:21":"that I have not cleansed: for Yahweh dwells in Zion.,For I will cleanse their blood that I have not cleansed: for the LORD dwelleth in Zion., וְנִקֵּיתִי דָּמָם לֹא־נִקֵּיתִי וַיהוָה שֹׁכֵן בְּצִיּוֹן׃ ‬,And I will hold as innocent their blood that I have not held as innocent; And the LORD dwelleth in Zion.,4:21 καὶ ἐκδικήσω τὸ αἷμα αὐτῶν καὶ οὐ μὴ ἀθῳώσω καὶ κύριος κατασκηνώσει ἐν σιων,And I will make inquisition for their blood, and will by no means leave it unavenged: and the Lord shall dwell in Sion.,,,,"}