{"1:1":"saying","1:2":"Arise","1:3":"and found a ship going to Tarshish; so he paid its fare","1:4":"and there was a mighty storm on the sea","1:5":"and cried every man to his god. They threw the cargo that was in the ship into the sea","1:6":"and said to him","1:7":"Come, let us cast lots, that we may know for whose cause this evil is on us. So they cast lots","1:8":"Tell us, please, for whose cause this evil is on us.  What is your occupation?  Where do you come from? What is your country?  Of what people are you?","1:9":"I am a Hebrew, and I fear Yahweh, the God of heaven, who has made the sea and the dry land.","1:10":"and said to him","1:11":"What shall we do to you, that the sea may be calm to us?  For the sea grew more and more stormy.","1:12":"Take me up, and throw me into the sea. Then the sea will be calm for you; for I know that because of me this great storm is on you.","1:13":"for the sea grew more and more stormy against them.","1:14":"and said","1:15":"and threw him into the sea; and the sea ceased its raging.","1:16":"and made vows.","1:17":"and Jonah was in the belly of the fish three days and three nights.","2:1":"his God","2:2":"I called because of my affliction to Yahweh. He answered me.  Out of the belly of Sheol I cried. You heard my voice.,And said, I cried by reason of mine affliction unto the LORD, and he heard me; out of the belly of hell cried I, and thou heardest my voice., וַיֹּאמֶר קָרָאתִי מִצָּרָה לִי אֶל־יְהוָה וַיַּעֲנֵנִי מִבֶּטֶן שְׁאוֹל שִׁוַּעְתִּי שָׁמַעְתָּ קוֹלִי׃ ‬,And he said: I called out of mine affliction Unto the LORD, and He answered me; Out of the belly of the nether-world cried I, And Thou heardest my voice.,2:3 καὶ εἶπεν ἐβόησα ἐν θλίψει μου πρὸς κύριον τὸν θεόν μου καὶ εἰσήκουσέν μου ἐκ κοιλίας ᾅδου κραυγῆς μου ἤκουσας φωνῆς μου,2:3 and said, I cried in my affliction to the Lord my God, and he hearkened to me, even to my cry out of the belly of hell: thou heardest my voice.,,,,","2:3":"in the heart of the seas. The flood was all around me.  All your waves and your billows passed over me.","2:4":"'I have been banished from your sight; yet I will look again toward your holy temple.'","2:5":"even to the soul.  The deep was around me. The weeds were wrapped around my head.","2:6":"Yahweh my God.","2:7":"","2:8":"They that observe lying vanities forsake their own mercy.","2:9":"","2:10":"and it vomited out Jonah on the dry land.","3:1":"saying","3:2":"Arise","3:3":"and went to Nineveh","3:4":"and he cried out","3:5":"and put on sackcloth","3:6":"and he arose from his throne","3:7":"saying","3:8":"both man and animal","3:9":"and turn away from his fierce anger","3:10":"that they turned from their evil way. God relented of the disaster which he said he would do to them","4:1":"and he was angry.","4:2":"and said","4:3":"Yahweh","4:4":"Is it right for you to be angry?","4:5":"and sat on the east side of the city","4:6":"and made it to come up over Jonah","4:7":"and it chewed on the vine","4:8":"when the sun arose","4:9":"Is it right for you to be angry about the vine? He said","4:10":"You have been concerned for the vine, for which you have not labored, neither made it grow; which came up in a night, and perished in a night.,Then said the LORD, Thou hast had pity on the gourd, for the which thou hast not laboured, neither madest it grow; which came up in a night, and perished in a night:, וַיֹּאמֶר יְהוָה אַתָּה חַסְתָּ עַל־הַקִּיקָיוֹן אֲשֶׁר לֹא־עָמַלְתָּ בּוֹ וְלֹא גִדַּלְתּוֹ שֶׁבִּן־לַיְלָה הָיָה וּבִן־לַיְלָה אָבָד׃ ‬,And the LORD said: Thou hast had pity on the gourd","4:11":"that great city"}