{"1:1":"that Yahweh spoke to Joshua the son of Nun","1:2":"go over this Jordan","1:3":"as I told Moses.","1:4":"and this Lebanon","1:5":"so I will be with you.  I will not fail you nor forsake you.","1:6":"Be strong and of a good courage: for unto this people shalt thou divide for an inheritance the land","1:7":"to observe to do according to all the law","1:8":"but you shall meditate on it day and night","1:9":"neither be dismayed:  for Yahweh your God is with you wherever you go.","1:10":"saying","1:11":"Pass through the host","1:12":"and to the Gadites","1:13":"you","1:14":"your little ones","1:15":"as he has given you","1:16":"saying","1:17":"so will we listen to you. Only may Yahweh your God be with you","1:18":"and doesn't listen to your words in all that you command him","2:1":"saying","2:2":"Behold, men of the children of Israel came in here tonight to spy out the land.","2:3":"saying","2:4":"Yes, the men came to me, but I didn't know where they came from.,And the woman took the two men, and hid them, and said thus, There came men unto me, but I wist not whence they were:,  וַתִּקַּח הָאִשָּׁה אֶת־שְׁנֵי הָאֲנָשִׁים וַתִּצְפְּנוֹ וַתֹּאמֶר כֵּן בָּאוּ אֵלַי הָאֲנָשִׁים וְלֹא יָדַעְתִּי מֵאַיִן הֵמָּה׃ ‬,And the woman took the two men, and hid them; and she said: Yea","2:5":"when it was dark","2:6":"and hid them with the stalks of flax","2:7":"they shut the gate.","2:8":"she came up to them on the roof;","2:9":"I know that Yahweh has given you the land, and that the fear of you has fallen on us, and that all the inhabitants of the land melt away before you.,And she said unto the men, I know that the LORD hath given you the land, and that your terror is fallen upon us, and that all the inhabitants of the land faint because of you.,  וַתֹּאמֶר אֶל־הָאֲנָשִׁים יָדַעְתִּי כִּי־נָתַן יְהוָה לָכֶם אֶת־הָאָרֶץ וְכִי־נָפְלָה אֵימַתְכֶם עָלֵינוּ וְכִי נָמֹגוּ כָּל־יֹשְׁבֵי הָאָרֶץ מִפְּנֵיכֶם׃ ‬,and she said unto the men: I know that the LORD hath given you the land","2:10":"Sea of Reeds} before you","2:11":"our hearts melted","2:12":"please swear to me by Yahweh","2:13":"my mother","2:14":"Our life for yours, if you don't talk about this business of ours; and it shall be, when Yahweh gives us the land, that we will deal kindly and truly with you.","2:15":"and she lived on the wall.","2:16":"Go to the mountain, lest the pursuers find you; and hide yourselves there three days, until the pursuers have returned.  Afterward, you may go your way.","2:17":"We will be guiltless of this your oath which you have made us to swear.,And the men said unto her, We will be blameless of this thine oath which thou hast made us swear.,  וַיֹּאמְרוּ אֵלֶיהָ הָאֲנָשִׁים נְקִיִּם אֲנַחְנוּ מִשְּׁבֻעָתֵךְ הַזֶּה אֲשֶׁר הִשְׁבַּעְתָּנוּ׃ ‬,And the men said unto her: We will be guiltless of this thine oath which thou hast made us to swear.","2:18":"when we come into the land","2:19":"his blood will be on his head","2:20":"then we shall be guiltless of your oath which you have made us to swear.,And if thou utter this our business, then we will be quit of thine oath which thou hast made us to swear.,  וְאִם־תַּגִּידִי אֶת־דְּבָרֵנוּ זֶה וְהָיִינוּ נְקִיִּם מִשְּׁבֻעָתֵךְ אֲשֶׁר הִשְׁבַּעְתָּנוּ׃ ‬,But if thou utter this our business, then we will be guiltless of thine oath which thou hast made us to swear.","2:21":"According to your words, so be it.  She sent them away","2:22":"and came to the mountain","2:23":"descended from the mountain","2:24":"Truly Yahweh has delivered into our hands all the land.  Moreover, all the inhabitants of the land melt away before us.","3:1":"and came to the Jordan","3:2":"that the officers went through the midst of the camp;","3:3":"saying","3:4":"about two thousand cubits by measure.  Don't come near to it","3:5":"Sanctify yourselves; for tomorrow Yahweh will do wonders among you.","3:6":"saying","3:7":"Today I will begin to magnify you in the sight of all Israel, that they may know that as I was with Moses, so I will be with you.,And the LORD said unto Joshua, This day will I begin to magnify thee in the sight of all Israel, that they may know that, as I was with Moses, so I will be with thee.,  וַיֹּאמֶר יְהוָה אֶל־יְהוֹשֻׁעַ הַיּוֹם הַזֶּה אָחֵל גַּדֶּלְךָ בְּעֵינֵי כָּל־יִשְׂרָאֵל אֲשֶׁר יֵדְעוּן כִּי כַּאֲשֶׁר הָיִיתִי עִם־מֹשֶׁה אֶהְיֶה עִמָּךְ׃ ‬,And the LORD said unto Joshua: This day will I begin to magnify thee in the sight of all Israel","3:8":"saying","3:9":"Come here, and hear the words of Yahweh your God.","3:10":"Hereby you shall know that the living God is among you, and that he will without fail drive the Canaanite, and the Hittite, and the Hivite, and the Perizzite, and the Girgashite, and the Amorite, and the Jebusite out from before you.,And Joshua said, Hereby ye shall know that the living God is among you, and that he will without fail drive out from before you the Canaanites, and the Hittites, and the Hivites, and the Perizzites, and the Girgashites, and the Amorites, and the Jebusites.,  וַיֹּאמֶר יְהוֹשֻׁעַ בְּזֹאת תֵּדְעוּן כִּי אֵל חַי בְּקִרְבְּכֶם וְהוֹרֵשׁ יוֹרִישׁ מִפְּנֵיכֶם אֶת־הַכְּנַעֲנִי וְאֶת־הַחִתִּי וְאֶת־הַחִוִּי וְאֶת־הַפְּרִזִּי וְאֶת־הַגִּרְגָּשִׁי וְהָאֱמֹרִי וְהַיְבוּסִי׃ ‬,And Joshua said: Hereby ye shall know that the living God is among you","3:11":"the ark of the covenant of the Lord of all the earth passes over before you into the Jordan.","3:12":"for every tribe a man.","3:13":"when the soles of the feet of the priests who bear the ark of Yahweh","3:14":"when the people moved from their tents to pass over the Jordan","3:15":"and the feet of the priests who bore the ark had dipped in the edge of the water (for the Jordan overflows all its banks all the time of harvest)","3:16":"and rose up in one heap","3:17":"until all the nation had passed completely over the Jordan.","4:1":"when all the nation had completely passed over the Jordan","4:2":"out of every tribe a man","4:3":"saying","4:4":"whom he had prepared of the children of Israel","4:5":"Pass over before the ark of Yahweh your God into the middle of the Jordan, and each of you pick up a stone and put it on your shoulder, according to the number of the tribes of the children of Israel;,And Joshua said unto them, Pass over before the ark of the LORD your God into the midst of Jordan, and take you up every man of you a stone upon his shoulder, according unto the number of the tribes of the children of Israel:,  וַיֹּאמֶר לָהֶם יְהוֹשֻׁעַ עִבְרוּ לִפְנֵי אֲרוֹן יְהוָה אֱלֹהֵיכֶם אֶל־תּוֹךְ הַיַּרְדֵּן וְהָרִימוּ לָכֶם אִישׁ אֶבֶן אַחַת עַל־שִׁכְמוֹ לְמִסְפַּר שִׁבְטֵי בְנֵי־יִשְׂרָאֵל׃ ‬,and Joshua said unto them: Pass on before the ark of the LORD your God into the midst of the Jordan","4:6":"that when your children ask in time to come","4:7":"'Because the waters of the Jordan were cut off before the ark of the covenant of Yahweh. When it passed over the Jordan","4:8":"and took up twelve stones out of the middle of the Jordan","4:9":"in the place where the feet of the priests who bore the ark of the covenant stood; and they are there to this day.","4:10":"until everything was finished that Yahweh commanded Joshua to speak to the people","4:11":"when all the people had completely passed over","4:12":"and the children of Gad","4:13":"ready and armed for war passed over before Yahweh to battle","4:14":"Yahweh magnified Joshua in the sight of all Israel; and they feared him","4:15":"saying","4:16":"Command the priests that bear the ark of the testimony","4:17":"saying","4:18":"when the priests who bore the ark of the covenant of Yahweh had come up out of the middle of the Jordan","4:19":"and encamped in Gilgal","4:20":"which they took out of the Jordan","4:21":"saying","4:22":"saying","4:23":"until you had passed over","4:24":"that it is mighty; that you may fear Yahweh your God forever.',That all the people of the earth might know the hand of the LORD, that it is mighty: that ye might fear the LORD your God for ever.,  לְמַעַן דַּעַת כָּל־עַמֵּי הָאָרֶץ אֶת־יַד יְהוָה כִּי חֲזָקָה הִיא לְמַעַן יְרָאתֶם אֶת־יְהוָה אֱלֹהֵיכֶם כָּל־הַיָּמִים׃ ס ‬,that all the peoples of the earth may know the hand of the LORD, that it is mighty; that ye may fear the LORD your God for ever.","5:1":"when all the kings of the Amorites","5:2":"Yahweh said to Joshua","5:3":"and circumcised the children of Israel at the hill of the foreskins.","5:4":"who were males","5:5":"Now all the people that came out were circumcised: but all the people that were born in the wilderness by the way as they came forth out of Egypt","5:6":"until all the nation","5:7":"whom he raised up in their place","5:8":"when they were done circumcising all the nation","5:9":"Today I have rolled away the reproach of Egypt from off you.  Therefore the name of that place was called Gilgal","5:10":"And the children of Israel encamped in Gilgal","5:11":"in the same day.","5:12":"after they had eaten of the produce of the land.  The children of Israel didn't have manna any more; but they ate of the fruit of the land of Canaan that year.","5:13":"when Joshua was by Jericho","5:14":"No; but I have come now as commander of Yahweh's army. Joshua fell on his face to the earth","5:15":"Take your shoes off of your feet; for the place on which you stand is holy. Joshua did so.","6:1":"and no one came in.","6:2":"Behold, I have given Jericho into your hand, with its king and the mighty men of valor.,And the LORD said unto Joshua, See, I have given into thine hand Jericho, and the king thereof, and the mighty men of valor.,  וַיֹּאמֶר יְהוָה אֶל־יְהוֹשֻׁעַ רְאֵה נָתַתִּי בְיָדְךָ אֶת־יְרִיחוֹ וְאֶת־מַלְכָּהּ גִּבּוֹרֵי הֶחָיִל׃ ‬,And the LORD said unto Joshua: 'see, I have given into thy hand Jericho, and the king thereof, even the mighty men of valour.,καὶ εἶπεν κύριος πρὸς ἰησοῦν ἰδοὺ ἐγὼ παραδίδωμι ὑποχείριόν σου τὴν ιεριχω καὶ τὸν βασιλέα αὐτῆς τὸν ἐν αὐτῇ δυνατοὺς ὄντας ἐν ἰσχύι,And the Lord said to Joshua, Behold, I deliver Jericho into thy power, and its king in it, and its mighty men.,,,,","6:3":"going around the city once.  You shall do this six days.","6:4":"you shall march around the city seven times","6:5":"and when you hear the sound of the trumpet","6:6":"and said to them","6:7":"Advance!  March around the city, and let the armed men pass on before Yahweh's ark.","6:8":"that when Joshua had spoken to the people","6:9":"and the ark went after them.  The trumpets sounded as they went.","6:10":"saying","6:11":"going about it once.  Then they came into the camp","6:12":"and the priests took up the ark of Yahweh.","6:13":"and blew the trumpets:  and the armed men went before them. The rear guard came after the ark of Yahweh.  The trumpets sounded as they went.","6:14":"and returned into the camp.  They did this six days.","6:15":"that they rose early at the dawning of the day","6:16":"when the priests blew the trumpets","6:17":"even it and all that is in it","6:18":"only keep yourselves from the devoted thing","6:19":"and gold","6:20":"and the priests blew the trumpets. It happened","6:21":"both man and woman","6:22":"Go into the prostitute's house, and bring out from there the woman and all that she has, as you swore to her.","6:23":"and brought out Rahab with her father","6:24":"and all that was in it. Only they put the silver","6:25":"her father's household","6:26":"saying","6:27":"So the LORD was with Joshua; and his fame was noised throughout all the country.","7:1":"the son of Carmi","7:2":"which is beside Beth Aven","7:3":"and said to him","7:4":"So there went up thither of the people about three thousand men: and they fled before the men of Ai.","7:5":"and struck them at the descent; and the hearts of the people melted","7:6":"and fell to the earth on his face before the ark of Yahweh until the evening","7:7":"Alas","7:8":"Lord","7:9":"and will compass us round","7:10":"Get you up; why are you thus fallen on your face?","7:11":"they have even transgressed my covenant which I commanded them:  yes","7:12":"because they are become accursed:  I will not be with you any more","7:13":"sanctify the people","7:14":"that the tribe which Yahweh takes shall come near by families; and the family which Yahweh shall take shall come near by households; and the household which Yahweh shall take shall come near man by man.","7:15":"that he who is taken with the devoted thing shall be burnt with fire","7:16":"and brought Israel near by their tribes; and the tribe of Judah was taken:","7:17":"And he brought the family of Judah; and he took the family of the Zarhites: and he brought the family of the Zarhites man by man; and Zabdi was taken:","7:18":"the son of Carmi","7:19":"My son","7:20":"and said","7:21":"and two hundred shekels of silver","7:22":"and they ran to the tent; and","7:23":"and brought them to Joshua","7:24":"and all Israel with him","7:25":"Why have you troubled us?  Yahweh shall trouble you this day.  All Israel stoned him with stones; and they burned them with fire","7:26":"to this day; and Yahweh turned from the fierceness of his anger. Therefore the name of that place was called The valley of Achor to this day.","8:1":"Don't be afraid","8:2":"and the livestock of it","8:3":"and all the people of war","8:4":"saying","8:5":"and all the people who are with me","8:6":"until we have drawn them away from the city; for they will say","8:7":"and take possession of the city:  for Yahweh your God will deliver it into your hand.","8:8":"when you have seized on the city","8:9":"and stayed between Bethel and Ai","8:10":"and mustered the people","8:11":"[even] the [men of] war who were with him","8:12":"and set them in ambush between Bethel and Ai","8:13":"even all the army who was on the north of the city","8:14":"when the king of Ai saw it","8:15":"and fled by the way of the wilderness.","8:16":"and were drawn away from the city.","8:17":"who didn't go out after Israel:  and they left the city open","8:18":"Stretch out the javelin that is in your hand toward Ai; for I will give it into your hand. Joshua stretched out the javelin that was in his hand toward the city.","8:19":"and they ran as soon as he had stretched out his hand","8:20":"they saw","8:21":"and that the smoke of the city ascended","8:22":"some on this side","8:23":"and brought him to Joshua.","8:24":"when Israel had made an end of killing all the inhabitants of Ai in the field","8:25":"both of men and women","8:26":"with which he stretched out the javelin","8:27":"according to the word of Yahweh which he commanded Joshua.","8:28":"and made it a heap forever","8:29":"and they took his body down from the tree","8:30":"the God of Israel","8:31":"as it is written in the book of the law of Moses","8:32":"which he wrote","8:33":"and their elders and officers","8:34":"the blessing and the curse","8:35":"which Joshua didn't read before all the assembly of Israel","9:1":"when all the kings who were beyond the Jordan","9:2":"to fight with Joshua and with Israel","9:3":"","9:4":"and went and made as if they had been ambassadors","9:5":"and old garments on them; and all the bread of their provision was dry and was become moldy.","9:6":"and said to him","9:7":"What if you dwell among us; and how shall we make a covenant with you?","9:8":"We are your servants.  Joshua said to them","9:9":"From a very far country your servants are come because of the name of Yahweh your God: for we have heard the fame of him","9:10":"who were beyond the Jordan","9:11":"saying","9:12":"behold","9:13":"which we filled","9:14":"and didn't ask counsel at the mouth of Yahweh.","9:15":"and made a covenant with them","9:16":"that they heard that they were their neighbors","9:17":"and came to their cities on the third day.  Now their cities were Gibeon","9:18":"because the princes of the congregation had sworn to them by Yahweh","9:19":"We have sworn to them by Yahweh","9:20":"and let them live; lest wrath be on us","9:21":"Let them live:  so they became wood cutters and drawers of water to all the congregation","9:22":"and he spoke to them","9:23":"and there shall never fail to be of you bondservants","9:24":"and said","9:25":"behold","9:26":"and delivered them out of the hand of the children of Israel","9:27":"and for the altar of Yahweh","10:1":"when Adoni-Zedek king of Jerusalem heard how Joshua had taken Ai","10:2":"because Gibeon was a great city","10:3":"and to Piram king of Jarmuth","10:4":"and help me","10:5":"the king of Jerusalem","10:6":"saying","10:7":"he","10:8":"Don't fear them:  for I have delivered them into your hands; there shall not a man of them stand before you.","10:9":"Joshua therefore came unto them suddenly","10:10":"and he killed them with a great slaughter at Gibeon","10:11":"as they fled from before Israel","10:12":"Sun","10:13":"and the moon stayed","10:14":"that Yahweh listened to the voice of a man:  for Yahweh fought for Israel.","10:15":"and all Israel with him","10:16":"and hid themselves in the cave at Makkedah.","10:17":"saying","10:18":"Roll great stones to the mouth of the cave","10:19":"and strike the hindmost of them; don't allow them to enter into their cities: for Yahweh your God has delivered them into your hand.","10:20":"when Joshua and the children of Israel had made an end of killing them with a very great slaughter","10:21":"And all the people returned to the camp to Joshua at Makkedah in peace: none moved his tongue against any of the children of Israel.","10:22":"Open the mouth of the cave","10:23":"and brought forth those five kings to him out of the cave","10:24":"when they brought forth those kings to Joshua","10:25":"Don't be afraid","10:26":"and put them to death","10:27":"that Joshua commanded","10:28":"and struck it with the edge of the sword","10:29":"and all Israel with him","10:30":"and the king of it","10:31":"and all Israel with him","10:32":"and struck it with the edge of the sword","10:33":"until he had left him none remaining.","10:34":"and all Israel with him","10:35":"and struck it with the edge of the sword; and all the souls who were therein he utterly destroyed that day","10:36":"and all Israel with him","10:37":"and struck it with the edge of the sword","10:38":"and all Israel with him","10:39":"and the king of it","10:40":"the hill country","10:41":"and all the country of Goshen","10:42":"because Yahweh","10:43":"and all Israel with him","11:1":"when Jabin king of Hazor heard of it","11:2":"in the hill country","11:3":"and the Amorite","11:4":"they and all their armies with them","11:5":"to fight with Israel.","11:6":"Don't be afraid because of them; for tomorrow at this time will I deliver them up all slain before Israel:  you shall hamstring their horses","11:7":"and all the people of war with him","11:8":"and they struck them","11:9":"and burnt their chariots with fire.","11:10":"and took Hazor","11:11":"utterly destroying them; there was none left who breathed: and he burnt Hazor with fire.","11:12":"and all the kings of them","11:13":"Israel burned none of them","11:14":"and the livestock","11:15":"so did Moses command Joshua: and so did Joshua; he left nothing undone of all that Yahweh commanded Moses.","11:16":"the hill country","11:17":"that goes up to Seir","11:18":"Joshua made war a long time with all those kings.","11:19":"save the Hivites the inhabitants of Gibeon: they took all in battle.","11:20":"to come against Israel in battle","11:21":"and cut off the Anakim from the hill country","11:22":"in Gath","11:23":"according to all that Yahweh spoke to Moses; and Joshua gave it for an inheritance to Israel according to their divisions by their tribes. The land had rest from war.","12:1":"whom the children of Israel struck","12:2":"who lived in Heshbon","12:3":"eastward","12:4":"of the remnant of the Rephaim","12:5":"and in Salecah","12:6":"and the Gadites","12:7":"from Baal Gad in the valley of Lebanon even to Mount Halak","12:8":"and in the lowland","12:9":"one; the king of Ai","12:10":"one; the king of Hebron","12:11":"one; the king of Lachish","12:12":"one; the king of Gezer","12:13":"one; the king of Geder","12:14":"one; the king of Arad","12:15":"one; the king of Adullam","12:16":"one; the king of Bethel","12:17":"one; the king of Hepher","12:18":"one; the king of Lassharon","12:19":"one; the king of Hazor","12:20":"one; the king of Achshaph","12:21":"one; the king of Megiddo","12:22":"one; the king of Jokneam in Carmel","12:23":"one; the king of Goiim in Gilgal","12:24":"one:  all the kings thirty-one.","13:1":"You are old and well stricken in years","13:2":"and all the Geshurites;","13:3":"which is before Egypt","13:4":"and Mearah that belongs to the Sidonians","13:5":"and all Lebanon","13:6":"even all the Sidonians; them will I drive out from before the children of Israel:  only allot you it to Israel for an inheritance","13:7":"and the half-tribe of Manasseh.","13:8":"which Moses gave them","13:9":"that is on the edge of the valley of the Arnon","13:10":"who reigned in Heshbon","13:11":"and the border of the Geshurites and Maacathites","13:12":"who reigned in Ashtaroth and in Edrei (the same was left of the remnant of the Rephaim); for these did Moses strike","13:13":"nor the Maacathites:  but Geshur and Maacath dwell in the midst of Israel to this day.","13:14":"the God of Israel","13:15":"And Moses gave unto the tribe of the children of Reuben inheritance according to their families.","13:16":"that is on the edge of the valley of the Arnon","13:17":"and all its cities that are in the plain; Dibon","13:18":"and Kedemoth","13:19":"and Sibmah","13:20":"and the slopes of Pisgah","13:21":"and all the kingdom of Sihon king of the Amorites","13:22":"the soothsayer","13:23":"and the border [of it]. This was the inheritance of the children of Reuben according to their families","13:24":"to the children of Gad","13:25":"and all the cities of Gilead","13:26":"and Betonim; and from Mahanaim to the border of Debir;","13:27":"Beth Haram","13:28":"the cities and the villages of it.","13:29":"And Moses gave inheritance unto the half tribe of Manasseh: and this was the possession of the half tribe of the children of Manasseh by their families.","13:30":"all Bashan","13:31":"and Ashtaroth","13:32":"beyond the Jordan at Jericho","13:33":"the God of Israel","14:1":"which Eleazar the priest","14:2":"as Yahweh commanded by Moses","14:3":"For Moses had given the inheritance of two tribes and an half tribe on the other side Jordan: but unto the Levites he gave none inheritance among them.","14:4":"Manasseh and Ephraim: and they gave no portion to the Levites in the land","14:5":"so the children of Israel did; and they divided the land.","14:6":"You know the thing that Yahweh spoke to Moses the man of God concerning me and concerning you in Kadesh Barnea.","14:7":"Forty years old was I when Moses the servant of the LORD sent me from Kadeshbarnea to espy out the land; and I brought him word again as it was in mine heart.","14:8":"Nevertheless my brethren that went up with me made the heart of the people melt: but I wholly followed the LORD my God.","14:9":"saying","14:10":"behold","14:11":"even so is my strength now","14:12":"of which Yahweh spoke in that day; for you heard in that day how the Anakim were there","14:13":"And Joshua blessed him","14:14":"the God of Israel.","14:15":"And the name of Hebron before was Kirjatharba; which Arba was a great man among the Anakims. And the land had rest from war.","15:1":"even to the wilderness of Zin southward","15:2":"from the bay that looks southward;","15:3":"and passed along to Zin","15:4":"and went out at the brook of Egypt; and the goings out of the border were at the sea: this shall be your south border.","15:5":"even to the end of the Jordan. The border of the north quarter was from the bay of the sea at the end of the Jordan;","15:6":"and passed along by the north of Beth Arabah; and the border went up to the stone of Bohan the son of Reuben;","15:7":"and so northward","15:8":"which is at the uttermost part of the valley of Rephaim northward;","15:9":"and went out to the cities of Mount Ephron; and the border extended to Baalah (the same is Kiriath Jearim);","15:10":"and passed along to the side of Mount Jearim on the north (the same is Chesalon)","15:11":"and passed along to Mount Baalah","15:12":"and the border [of it]. This is the border of the children of Judah round about according to their families.","15:13":"according to the commandment of Yahweh to Joshua","15:14":"and Ahiman","15:15":"And he went up thence to the inhabitants of Debir: and the name of Debir before was Kirjathsepher.","15:16":"He who strikes Kiriath Sepher","15:17":"the brother of Caleb","15:18":"when she came [to him]","15:19":"Give me a blessing; for that you have set me in the land of the South","15:20":"This is the inheritance of the tribe of the children of Judah according to their families.","15:21":"and Eder","15:22":"and Dimonah","15:23":"and Hazor","15:24":"and Telem","15:25":"Kerioth","15:26":"and Shema","15:27":"and Heshmon","15:28":"and Beersheba","15:29":"and Iim","15:30":"and Chesil","15:31":"and Madmannah","15:32":"and Shilhim","15:33":"Eshtaol","15:34":"and En Gannim","15:35":"and Adullam","15:36":"and Adithaim","15:37":"and Hadashah","15:38":"and Mizpeh","15:39":"and Bozkath","15:40":"and Lahmam","15:41":"Beth Dagon","15:42":"and Ether","15:43":"and Ashnah","15:44":"and Achzib","15:45":"with its towns and its villages;","15:46":"all that were by the side of Ashdod","15:47":"its towns and its villages; Gaza","15:48":"Shamir","15:49":"and Kiriath Sannah (the same is Debir)","15:50":"and Eshtemoh","15:51":"and Holon","15:52":"and Dumah","15:53":"and Beth Tappuah","15:54":"and Kiriath Arba (the same is Hebron)","15:55":"Carmel","15:56":"and Jokdeam","15:57":"Gibeah","15:58":"Beth Zur","15:59":"and Beth Anoth","15:60":"and Rabbah; two cities with their villages.","15:61":"Beth Arabah","15:62":"and the City of Salt","15:63":"the inhabitants of Jerusalem","16:1":"at the waters of Jericho on the east","16:2":"and passed along to the border of the Archites to Ataroth;","16:3":"to the border of Beth Horon the lower","16:4":"Manasseh and Ephraim","16:5":"to Beth Horon the upper;","16:6":"and passed along it on the east of Janoah;","16:7":"and to Naarah","16:8":"The border went out from Tappuah westward unto the river Kanah; and the goings out thereof were at the sea. This is the inheritance of the tribe of the children of Ephraim by their families.","16:9":"all the cities with their villages.","16:10":"and are become servants to do forced labor.","17:1":"the father of Gilead","17:2":"and for the children of Helek","17:3":"the son of Hepher","17:4":"and before Joshua the son of Nun","17:5":"besides the land of Gilead and Bashan","17:6":"Because the daughters of Manasseh had an inheritance among his sons: and the rest of Manasseh's sons had the land of Gilead.","17:7":"which is before Shechem; and the border went along to the right hand","17:8":"Now Manasseh had the land of Tappuah: but Tappuah on the border of Manasseh belonged to the children of Ephraim;","17:9":"southward of the brook: these cities belonged to Ephraim among the cities of Manasseh: and the border of Manasseh was on the north side of the brook","17:10":"and northward it was Manasseh's","17:11":"and Ibleam and its towns","17:12":"Yet the children of Manasseh could not drive out the inhabitants of those cities; but the Canaanites would dwell in that land.","17:13":"when the children of Israel had grown strong","17:14":"saying","17:15":"If you are a great people","17:16":"The hill country is not enough for us: and all the Canaanites who dwell in the land of the valley have chariots of iron","17:17":"even to Ephraim and to Manasseh","17:18":"you shall cut it down","18:1":"and set up the tent of meeting there: and the land was subdued before them.","18:2":"which had not yet divided their inheritance.","18:3":"How long are you slack to go in to possess the land","18:4":"and they shall arise","18:5":"and the house of Joseph shall abide in their border on the north.","18:6":"and bring [the description] here to me; and I will cast lots for you here before Yahweh our God.","18:7":"which Moses the servant of Yahweh gave them.","18:8":"and went:  and Joshua charged those who went to describe the land","18:9":"and described it by cities into seven portions in a book; and they came to Joshua to the camp at Shiloh.","18:10":"And Joshua cast lots for them in Shiloh before the LORD: and there Joshua divided the land unto the children of Israel according to their divisions.","18:11":"And the lot of the tribe of the children of Benjamin came up according to their families: and the coast of their lot came forth between the children of Judah and the children of Joseph.","18:12":"and went up through the hill country westward; and the goings out of it were at the wilderness of Beth Aven.","18:13":"to the side of Luz (the same is Bethel)","18:14":"and turned about on the west quarter southward","18:15":"and went out to the spring of the waters of Nephtoah;","18:16":"which is in the valley of Rephaim northward; and it went down to the valley of Hinnom","18:17":"and went out at En Shemesh","18:18":"and went down to the Arabah;","18:19":"at the south end of the Jordan: this was the south border.","18:20":"by the borders of it round about","18:21":"and Beth Hoglah","18:22":"and Zemaraim","18:23":"and Parah","18:24":"and Ophni","18:25":"and Ramah","18:26":"and Chephirah","18:27":"and Irpeel","18:28":"Eleph","19:1":"even for the tribe of the children of Simeon according to their families: and their inheritance was in the midst of the inheritance of the children of Judah.","19:2":"or Sheba","19:3":"and Balah","19:4":"and Bethul","19:5":"and Beth Marcaboth","19:6":"and Sharuhen; thirteen cities with their villages:","19:7":"Rimmon","19:8":"Ramah of the South.  This is the inheritance of the tribe of the children of Simeon according to their families.","19:9":"Out of the portion of the children of Judah was the inheritance of the children of Simeon: for the part of the children of Judah was too much for them: therefore the children of Simeon had their inheritance within the inheritance of them.","19:10":"And the third lot came up for the children of Zebulun according to their families: and the border of their inheritance was unto Sarid:","19:11":"even to Maralah","19:12":"and went up to Japhia;","19:13":"to Ethkazin; and it went out at Rimmon which stretches to Neah;","19:14":"And the border compasseth it on the north side to Hannathon: and the outgoings thereof are in the valley of Jiphthahel:","19:15":"and Nahalal","19:16":"these cities with their villages.","19:17":"even for the children of Issachar according to their families.","19:18":"and Chesulloth","19:19":"and Shion","19:20":"and Kishion","19:21":"and Engannim","19:22":"and Shahazumah","19:23":"the cities with their villages.","19:24":"And the fifth lot came out for the tribe of the children of Asher according to their families.","19:25":"and Hali","19:26":"and Amad","19:27":"and reached to Zebulun","19:28":"and Rehob","19:29":"and to the fortified city of Tyre; and the border turned to Hosah; and the goings out of it were at the sea by the region of Achzib;","19:30":"and Aphek","19:31":"these cities with their villages.","19:32":"even for the children of Naphtali according to their families.","19:33":"from the oak in Zaanannim","19:34":"and went out from there to Hukkok; and it reached to Zebulun on the south","19:35":"Zer","19:36":"and Ramah","19:37":"and Edrei","19:38":"and Migdal El","19:39":"the cities with their villages.","19:40":"And the seventh lot came out for the tribe of the children of Dan according to their families.","19:41":"and Eshtaol","19:42":"and Aijalon","19:43":"and Timnah","19:44":"and Gibbethon","19:45":"and Bene Berak","19:46":"and Rakkon","19:47":"and took it","19:48":"these cities with their villages.","19:49":"When they had made an end of dividing the land for inheritance by their coasts","19:50":"even Timnathserah in the hill country of Ephraim; and he built the city","19:51":"which Eleazar the priest","20:1":"saying","20:2":"saying","20:3":"That the slayer that killeth any person unawares and unwittingly may flee thither: and they shall be your refuge from the avenger of blood.","20:4":"and shall stand at the entrance of the gate of the city","20:5":"then they shall not deliver up the manslayer into his hand; because he struck his neighbor unawares","20:6":"until he stand before the congregation for judgment","20:7":"and Shechem in the hill country of Ephraim","20:8":"they assigned Bezer in the wilderness in the plain out of the tribe of Reuben","20:9":"and for the stranger who sojourns among them","21:1":"and to Joshua the son of Nun","21:2":"saying","21:3":"according to the commandment of Yahweh","21:4":"who were of the Levites","21:5":"and out of the tribe of Dan","21:6":"and out of the tribe of Asher","21:7":"and out of the tribe of Gad","21:8":"as Yahweh commanded by Moses.","21:9":"and out of the tribe of the children of Simeon","21:10":"of the families of the Kohathites","21:11":"[which Arba was] the father of Anak (the same is Hebron)","21:12":"and the villages of it","21:13":"the city of refuge for the manslayer","21:14":"and Eshtemoa with its suburbs","21:15":"and Debir with its suburbs","21:16":"and Juttah with its suburbs","21:17":"Gibeon with its suburbs","21:18":"and Almon with its suburbs; four cities.","21:19":"the priests","21:20":"the Levites","21:21":"the city of refuge for the manslayer","21:22":"and Beth Horon with its suburbs; four cities.","21:23":"Elteke with its suburbs","21:24":"Gath Rimmon with its suburbs; four cities.","21:25":"Taanach with its suburbs","21:26":"All the cities were ten with their suburbs for the families of the children of Kohath that remained.","21:27":"of the families of the Levites","21:28":"Kishion with its suburbs","21:29":"En Gannim with its suburbs; four cities.","21:30":"Mishal with its suburbs","21:31":"and Rehob with its suburbs; four cities.","21:32":"Kedesh in Galilee with its suburbs","21:33":"All the cities of the Gershonites according to their families were thirteen cities with their suburbs.","21:34":"the rest of the Levites","21:35":"Nahalal with its suburbs; four cities.","21:36":"Bezer with its suburbs","21:37":"and Mephaath with its suburbs; four cities.","21:38":"Ramoth in Gilead with its suburbs","21:39":"Jazer with its suburbs; four cities in all.","21:40":"even the rest of the families of the Levites; and their lot was twelve cities.","21:41":"All the cities of the Levites within the possession of the children of Israel were forty and eight cities with their suburbs.","21:42":"These cities were every one with their suburbs round about them: thus were all these cities.","21:43":"and lived therein.","21:44":"according to all that he swore to their fathers:  and there stood not a man of all their enemies before them; Yahweh delivered all their enemies into their hand.","21:45":"There failed not ought of any good thing which the LORD had spoken unto the house of Israel; all came to pass.","22:1":"and the Gadites","22:2":"You have kept all that Moses the servant of Yahweh commanded you","22:3":"but have kept the charge of the commandment of Yahweh your God.","22:4":"as he spoke to them:  therefore now turn you","22:5":"to love Yahweh your God","22:6":"and sent them away; and they went to their tents.","22:7":"he blessed them","22:8":"saying","22:9":"and departed from the children of Israel out of Shiloh","22:10":"that is in the land of Canaan","22:11":"Behold","22:12":"the whole congregation of the children of Israel gathered themselves together at Shiloh","22:13":"and to the children of Gad","22:14":"one prince of a fathers' house for each of the tribes of Israel; and they were everyone of them head of their fathers' houses among the thousands of Israel.","22:15":"and to the children of Gad","22:16":"What trespass is this that you have committed against the God of Israel","22:17":"from which we have not cleansed ourselves to this day","22:18":"seeing you rebel today against Yahweh","22:19":"if the land of your possession be unclean","22:20":"and wrath fell on all the congregation of Israel? and that man didn't perish alone in his iniquity.","22:21":"and spoke to the heads of the thousands of Israel","22:22":"God","22:23":"or if to offer sacrifices of peace offerings thereon","22:24":"[and] of purpose","22:25":"you children of Reuben and children of Gad; you have no portion in Yahweh:  so might your children make our children cease from fearing Yahweh.","22:26":"Let us now prepare to build us an altar","22:27":"and between our generations after us","22:28":"It shall be","22:29":"and turn away this day from following Yahweh","22:30":"and the princes of the congregation","22:31":"and to the children of Gad","22:32":"and the princes","22:33":"and spoke no more of going up against them to war","22:34":"[said they]","23:1":"when Yahweh had given rest to Israel from all their enemies round about","23:2":"for their elders and for their heads","23:3":"he it is that has fought for you.","23:4":"I have allotted to you these nations that remain","23:5":"he will thrust them out from before you","23:6":"that you not turn aside from it to the right hand or to the left;","23:7":"these that remain among you; neither make mention of the name of their gods","23:8":"as you have done to this day.","23:9":"no man has stood before you to this day.","23:10":"he it is who fights for you","23:11":"that you love Yahweh your God.","23:12":"and cleave to the remnant of these nations","23:13":"and a scourge in your sides","23:14":"this day I am going the way of all the earth: and you know in all your hearts and in all your souls","23:15":"that as all the good things are come on you of which Yahweh your God spoke to you","23:16":"which he commanded you","24:1":"and called for the elders of Israel","24:2":"Thus says Yahweh","24:3":"and led him throughout all the land of Canaan","24:4":"to possess it:  and Jacob and his children went down into Egypt.","24:5":"and I plagued Egypt","24:6":"Sea of Reeds}.","24:7":"he put darkness between you and the Egyptians","24:8":"that lived beyond the Jordan:  and they fought with you; and I gave them into your hand","24:9":"king of Moab","24:10":"But I would not hearken unto Balaam; therefore he blessed you still: so I delivered you out of his hand.","24:11":"and came to Jericho:  and the men of Jericho fought against you","24:12":"which drove them out from before you","24:13":"and cities which you didn't build","24:14":"and serve him in sincerity and in truth; and put away the gods which your fathers served beyond the River","24:15":"choose you this day whom you will serve; whether the gods which your fathers served that were beyond the River","24:16":"Far be it from us that we should forsake Yahweh","24:17":"he it is who brought us and our fathers up out of the land of Egypt","24:18":"even the Amorites who lived in the land:  therefore we also will serve Yahweh; for he is our God.","24:19":"You can't serve Yahweh; for he is a holy God; he is a jealous God; he will not forgive your disobedience nor your sins.","24:20":"and serve foreign gods","24:21":"No; but we will serve Yahweh.","24:22":"You are witnesses against yourselves that you have chosen you Yahweh","24:23":"[said he]","24:24":"Yahweh our God will we serve","24:25":"and set them a statute and an ordinance in Shechem.","24:26":"and set it up there under the oak that was by the sanctuary of Yahweh.","24:27":"Behold","24:28":"every man to his inheritance.","24:29":"that Joshua the son of Nun","24:30":"which is in the hill country of Ephraim","24:31":"and all the days of the elders who outlived Joshua","24:32":"which the children of Israel brought up out of Egypt","24:33":"which was given him in the hill country of Ephraim."}