{"1:1":"that was full of people! She has become as a widow","1:2":"and her tears are on her cheeks; among all her lovers she has none to comfort her: All her friends have dealt treacherously with her; they are become her enemies.","1:3":"and because of great servitude; she dwells among the nations","1:4":"because none come to the solemn assembly; all her gates are desolate","1:5":"her enemies prosper; for Yahweh has afflicted her for the multitude of her transgressions: her young children are gone into captivity before the adversary.","1:6":"they are gone without strength before the pursuer.","1:7":"and none did help her","1:8":"because they have seen her nakedness:  yes","1:9":"Yahweh","1:10":"concerning whom you did command that they should not enter into your assembly.","1:11":"they seek bread; they have given their pleasant things for food to refresh the soul:  look","1:12":"all you who pass by?  Look","1:13":"and it prevails against them; He has spread a net for my feet","1:14":"they are come up on my neck; he has made my strength to fail:  The Lord has delivered me into their hands","1:15":"The LORD hath trodden under foot all my mighty men in the midst of me: he hath called an assembly against me to crush my young men: the LORD hath trodden the virgin","1:16":"my eye runs down with water; Because the comforter who should refresh my soul is far from me: My children are desolate","1:17":"that those who are round about him should be his adversaries:  Jerusalem is among them as an unclean thing.","1:18":"and see my sorrow: My virgins and my young men are gone into captivity.","1:19":"[but] they deceived me: My priests and my elders gave up the spirit in the city","1:20":"Yahweh; for I am in distress; my heart is troubled; My heart is turned within me; for I have grievously rebelled: Abroad the sword bereaves","1:21":"and they shall be like me.","1:22":"as you have done to me for all my transgressions: For my sighs are many","2:1":"And hasn't remembered his footstool in the day of his anger.","2:2":"and has not pitied:  He has thrown down in his wrath the strongholds of the daughter of Judah; He has brought them down to the ground; he has profaned the kingdom and the princes of it.","2:3":"which devours round about.","2:4":"he has stood with his right hand as an adversary","2:5":"he has swallowed up Israel; He has swallowed up all her palaces","2:6":"as if it were of a garden; he has destroyed his place of assembly:  Yahweh has caused solemn assembly and Sabbath to be forgotten in Zion","2:7":"he has abhorred his sanctuary; He has given up into the hand of the enemy the walls of her palaces: They have made a noise in the house of Yahweh","2:8":"he has not withdrawn his hand from destroying; He has made the rampart and wall to lament; they languish together.","2:9":"her prophets find no vision from Yahweh.","2:10":"they keep silence; They have cast up dust on their heads; they have girded themselves with sackcloth:  The virgins of Jerusalem hang down their heads to the ground.","2:11":"my heart is troubled; My liver is poured on the earth","2:12":"Where is grain and wine? When they swoon as the wounded in the streets of the city","2:13":"daughter of Jerusalem?  What shall I compare to you","2:14":"to bring back your captivity","2:15":"[saying]","2:16":"We have swallowed her up; Certainly this is the day that we looked for; we have found","2:17":"and has not pitied:  He has caused the enemy to rejoice over you; he has exalted the horn of your adversaries.","2:18":"let tears run down like a river day and night; Give yourself no respite; don't let the apple of your eye cease.","2:19":"cry out in the night","2:20":"Yahweh","2:21":"[and] not pitied.","2:22":"as in the day of a solemn assembly","3:1":"I AM the man that hath seen affliction by the rod of his wrath.","3:2":"and not in light.","3:3":"Surely against me is he turned; he turneth his hand against me all the day.","3:4":"My flesh and my skin hath he made old; he hath broken my bones.","3:5":"and compassed me with gall and travail.","3:6":"as those that have been long dead.","3:7":"that I can't go forth; he has made my chain heavy.","3:8":"when I cry","3:9":"He hath inclosed my ways with hewn stone","3:10":"as a lion in secret places.","3:11":"and pulled me in pieces; he has made me desolate.","3:12":"and set me as a mark for the arrow.","3:13":"He hath caused the arrows of his quiver to enter into my reins.","3:14":"and their song all the day.","3:15":"he has sated me with wormwood.","3:16":"He hath also broken my teeth with gravel stones","3:17":"And thou hast removed my soul far off from peace: I forgat prosperity.","3:18":"My strength is perished","3:19":"the wormwood and the gall.","3:20":"and is bowed down within me.","3:21":"This I recall to my mind","3:22":"because his compassion doesn't fail.","3:23":"They are new every morning: great is thy faithfulness.","3:24":"says my soul; therefore will I hope in him.","3:25":"to the soul that seeks him.","3:26":"It is good that a man should both hope and quietly wait for the salvation of the LORD.","3:27":"It is good for a man that he bear the yoke of his youth.","3:28":"because he has laid it on him.","3:29":"if so be there may be hope.","3:30":"He giveth his cheek to him that smiteth him: he is filled full with reproach.","3:31":"For the LORD will not cast off for ever:","3:32":"yet he will have compassion according to the multitude of his loving kindnesses.","3:33":"nor grieve the children of men.","3:34":"","3:35":"","3:36":"the Lord doesn't approve.","3:37":"and it comes to pass","3:38":"Out of the mouth of the most High proceedeth not evil and good?","3:39":"a man for the punishment of his sins?","3:40":"and turn again to Yahweh.","3:41":"Let us lift up our heart with our hands unto God in the heavens.","3:42":"We have transgressed and have rebelled: thou hast not pardoned.","3:43":"you have not pitied.","3:44":"so that no prayer can pass through.","3:45":"Thou hast made us as the offscouring and refuse in the midst of the people.","3:46":"All our enemies have opened their mouths against us.","3:47":"devastation and destruction.","3:48":"for the destruction of the daughter of my people.","3:49":"and doesn't cease","3:50":"and see from heaven.","3:51":"because of all the daughters of my city.","3:52":"those who are my enemies without cause.","3:53":"and have cast a stone on me.","3:54":"I am cut off.","3:55":"Yahweh","3:56":"at my cry.","3:57":"Don't be afraid.","3:58":"you have pleaded the causes of my soul; you have redeemed my life.","3:59":"you have seen my wrong; judge you my cause.","3:60":"Thou hast seen all their vengeance and all their imaginations against me.","3:61":"Yahweh","3:62":"and their device against me all the day.","3:63":"and their rising up; I am their song.","3:64":"Yahweh","3:65":"your curse to them.","3:66":"and destroy them from under the heavens of Yahweh.","4:1":"How is the gold become dim! how is the most fine gold changed! the stones of the sanctuary are poured out in the top of every street.","4:2":"comparable to fine gold","4:3":"they give suck to their young ones:  The daughter of my people is become cruel","4:4":"and no man breaks it to them.","4:5":"They that did feed delicately are desolate in the streets: they that were brought up in scarlet embrace dunghills.","4:6":"That was overthrown as in a moment","4:7":"they were whiter than milk; They were more ruddy in body than rubies","4:8":"it is become like a stick.","4:9":"stricken through","4:10":"The hands of the pitiful women have sodden their own children: they were their meat in the destruction of the daughter of my people.","4:11":"he has poured out his fierce anger; He has kindled a fire in Zion","4:12":"neither all the inhabitants of the world","4:13":"[and] the iniquities of her priests","4:14":"they are polluted with blood","4:15":"they cried to them","4:16":"they didn't favor the elders.","4:17":"As for us","4:18":"so that we can't go in our streets: Our end is near","4:19":"they laid wait for us in the wilderness.","4:20":"the anointed of Yahweh","4:21":"daughter of Edom","4:22":"daughter of Zion; he will no more carry you away into captivity:  He will visit your iniquity","5:1":"Yahweh","5:2":"Our houses to aliens.","5:3":"We are orphans and fatherless","5:4":"We have drunken our water for money; our wood is sold unto us.","5:5":"and have no rest.","5:6":"To the Assyrians","5:7":"and are no more; We have borne their iniquities.","5:8":"Servants have ruled over us: there is none that doth deliver us out of their hand.","5:9":"Because of the sword of the wilderness.","5:10":"Because of the burning heat of famine.","5:11":"The virgins in the cities of Judah.","5:12":"Princes are hanged up by their hand: the faces of elders were not honoured.","5:13":"They took the young men to grind","5:14":"The young men from their music.","5:15":"The joy of our heart is ceased; our dance is turned into mourning.","5:16":"The crown is fallen from our head: woe unto us","5:17":"For this our heart is faint; for these things our eyes are dim.","5:18":"which is desolate:  The foxes walk on it.","5:19":"Yahweh","5:20":"[And] forsake us so long time?","5:21":"Yahweh","5:22":"But thou hast utterly rejected us; thou art very wroth against us."}