{"1:1":"and spoke to him out of the Tent of Meeting","1:2":"","1:3":"","1:4":"and it shall be accepted for him to make atonement for him.","1:5":"the priests","1:6":"and cut it into pieces.","1:7":"and lay wood in order on the fire;","1:8":"the priests","1:9":"for a burnt offering","1:10":"","1:11":"the priests","1:12":"with its head and its fat. The priest shall lay them in order on the wood that is on the fire which is on the altar","1:13":"and burn it on the altar. It is a burnt offering","1:14":"","1:15":"and wring off its head","1:16":"and cast it beside the altar on the east part","1:17":"but shall not divide it apart. The priest shall burn it on the altar","2:1":"","2:2":"and of its oil","2:3":"And the remnant of the meat offering shall be Aaron's and his sons': it is a thing most holy of the offerings of the LORD made by fire.","2:4":"","2:5":"it shall be of unleavened fine flour","2:6":"and pour oil on it. It is a meal offering.","2:7":"it shall be made of fine flour with oil.","2:8":"and he shall bring it to the altar.","2:9":"and shall burn it on the altar","2:10":"And that which is left of the meat offering shall be Aaron's and his sons': it is a thing most holy of the offerings of the LORD made by fire.","2:11":"","2:12":"As for the oblation of the firstfruits","2:13":"And every oblation of thy meat offering shalt thou season with salt; neither shalt thou suffer the salt of the covenant of thy God to be lacking from thy meat offering: with all thine offerings thou shalt offer salt.","2:14":"","2:15":"and lay frankincense on it: it is a meal offering.","2:16":"part of its bruised grain","3:1":"","3:2":"and kill it at the door of the tent of meeting:  and Aaron's sons the priests shall sprinkle the blood on the altar round about.","3:3":"and all the fat that is on the innards","3:4":"and the fat that is on them","3:5":"which is on the wood that is on the fire:  it is an offering made by fire","3:6":"","3:7":"then he shall offer it before Yahweh;","3:8":"and kill it before the tent of meeting:  and Aaron's sons shall sprinkle its blood on the altar round about.","3:9":"the entire tail fat","3:10":"and the fat that is on them","3:11":"And the priest shall burn it upon the altar: it is the food of the offering made by fire unto the LORD.","3:12":"","3:13":"and kill it before the tent of meeting; and the sons of Aaron shall sprinkle its blood on the altar round about.","3:14":"an offering made by fire to Yahweh; the fat that covers the innards","3:15":"and the fat that is on them","3:16":"for a sweet savor; all the fat is Yahweh's.","3:17":"It shall be a perpetual statute for your generations throughout all your dwellings","4:1":"saying","4:2":"","4:3":"then let him offer for his sin","4:4":"and kill the bull before Yahweh.","4:5":"and bring it to the Tent of Meeting.","4:6":"and sprinkle some of the blood seven times before Yahweh","4:7":"which is in the tent of meeting; and he shall pour out all of rest of the blood of the bull at the base of the altar of burnt offering","4:8":"and all the fat that is on the innards","4:9":"and the fat that is on them","4:10":"As it was taken off from the bullock of the sacrifice of peace offerings: and the priest shall burn them upon the altar of the burnt offering.","4:11":"all its flesh","4:12":"where the ashes are poured out","4:13":"","4:14":"then the assembly shall offer a young bull for a sin offering","4:15":"And the elders of the congregation shall lay their hands upon the head of the bullock before the LORD: and the bullock shall be killed before the LORD.","4:16":"And the priest that is anointed shall bring of the bullock's blood to the tabernacle of the congregation:","4:17":"and sprinkle it seven times before Yahweh","4:18":"that is in the Tent of Meeting; and the rest of the blood he shall pour out at the base of the altar of burnt offering","4:19":"and burn it on the altar.","4:20":"so shall he do with this; and the priest shall make atonement for them","4:21":"and burn it as he burned the first bull.  It is the sin offering for the assembly.","4:22":"","4:23":"in which he has sinned","4:24":"and kill it in the place where they kill the burnt offering before Yahweh. It is a sin offering.","4:25":"and put it on the horns of the altar of burnt offering. He shall pour out the rest of its blood at the base of the altar of burnt offering.","4:26":"like the fat of the sacrifice of peace offerings; and the priest shall make atonement for him concerning his sin","4:27":"","4:28":"which he has sinned","4:29":"and kill the sin offering in the place of burnt offering.","4:30":"and put it on the horns of the altar of burnt offering; and the rest of its blood he shall pour out at the base of the altar.","4:31":"like the fat is taken away from off of the sacrifice of peace offerings; and the priest shall burn it on the altar for a sweet savor to Yahweh; and the priest shall make atonement for him","4:32":"","4:33":"and kill it for a sin offering in the place where they kill the burnt offering.","4:34":"and put it on the horns of the altar of burnt offering; and all the rest of its blood he shall pour out at the base of the altar.","4:35":"like the fat of the lamb is taken away from the sacrifice of peace offerings; and the priest shall burn them on the altar","5:1":"","5:2":"","5:3":"","5:4":"","5:5":"when he is guilty of one of these","5:6":"a female from the flock","5:7":"","5:8":"who shall first offer the one which is for the sin offering","5:9":"And he shall sprinkle of the blood of the sin offering upon the side of the altar; and the rest of the blood shall be wrung out at the bottom of the altar: it is a sin offering.","5:10":"according to the ordinance; and the priest shall make atonement for him concerning his sin which he has sinned","5:11":"","5:12":"and the priest shall take his handful of it as the memorial portion","5:13":"and he will be forgiven; and the rest shall be the priest's","5:14":"saying","5:15":"","5:16":"and shall add a fifth part to it","5:17":"","5:18":"according to your estimation","5:19":"","6:1":"saying","6:2":"","6:3":"and dealt falsely therein","6:4":"if he has sinned","6:5":"and shall add a fifth part more to it. To him to whom it belongs he shall give it","6:6":"a ram without blemish from the flock","6:7":"and he will be forgiven concerning whatever he does to become guilty.,And the priest shall make an atonement for him before the LORD: and it shall be forgiven him for any thing of all that he hath done in trespassing therein.,  וְכִפֶּר עָלָיו הַכֹּהֵן לִפְנֵי יְהוָה וְנִסְלַח לוֹ עַל־אַחַת מִכֹּל אֲשֶׁר־יַעֲשֶׂה לְאַשְׁמָה בָהּ׃ פ ‬,And the priest shall make atonement for him before the LORD, and he shall be forgiven, concerning whatsoever he doeth so as to be guilty thereby.,5:26 καὶ ἐξιλάσεται περὶ αὐτοῦ ὁ ἱερεὺς ἔναντι κυρίου καὶ ἀφεθήσεται αὐτῷ περὶ ἑνὸς ἀπὸ πάντων ὧν ἐποίησεν καὶ ἐπλημμέλησεν αὐτῷ,And the Lord spoke to Moses, saying,,וזאת תורת המנחה הקריבו אתה בני אהרן לפני יהוה אל פני המזבח,And this [is] the law of the meat offering: the sons of Aaron shall offer it before the LORD, before the altar.,וְדָא אוֹרַיְתָא דְמִנְחָתָא דִיקָרְבוּן יָתַהּ בְּנֵי אַהֲרֹן קֳדָם יְיָ לָקֳדָם מַדְבְּחָא ,And the priest shall make atonement for him before the Lord, and it shall be forgiven him for any one of all (these) in which he may have acted to be guilty thereby.(8)","6:8":"saying","6:9":"","6:10":"and he shall put on his linen breeches upon his body; and he shall remove the ashes from where the fire has consumed the burnt offering on the altar","6:11":"and put on other garments","6:12":"it shall not go out; and the priest shall burn wood on it every morning: and he shall lay the burnt offering in order upon it","6:13":"The fire shall ever be burning upon the altar; it shall never go out.","6:14":"","6:15":"and of its oil","6:16":"And the remainder thereof shall Aaron and his sons eat: with unleavened bread shall it be eaten in the holy place; in the court of the tabernacle of the congregation they shall eat it.","6:17":"as the sin offering","6:18":"as their portion forever throughout your generations","6:19":"saying","6:20":"","6:21":"you shall bring it in.  You shall offer the meal offering in baked pieces for a sweet savor to Yahweh.","6:22":"it shall be wholly burnt to Yahweh.","6:23":"","6:24":"saying","6:25":"","6:26":"in the court of the Tent of Meeting.","6:27":"you shall wash that on which it was sprinkled in a holy place.","6:28":"it shall be scoured","6:29":"All the males among the priests shall eat thereof: it is most holy.","6:30":"of which any of the blood is brought into the Tent of Meeting to make atonement in the Holy Place","7:1":"","7:2":"he shall kill the trespass offering; and its blood he shall sprinkle on the altar round about.","7:3":"and the fat that covers the innards","7:4":"and the fat that is on them","7:5":"And the priest shall burn them upon the altar for an offering made by fire unto the LORD: it is a trespass offering.","7:6":"Every male among the priests shall eat thereof: it shall be eaten in the holy place: it is most holy.","7:7":"","7:8":"even the priest shall have for himself the skin of the burnt offering which he has offered.","7:9":"and all that is dressed in the frying pan","7:10":"mixed with oil or dry","7:11":"","7:12":"then he shall offer with the sacrifice of thanksgiving unleavened cakes mixed with oil","7:13":"Besides the cakes","7:14":"And of it he shall offer one out of the whole oblation for an heave offering unto the LORD","7:15":"And the flesh of the sacrifice of his peace offerings for thanksgiving shall be eaten the same day that it is offered; he shall not leave any of it until the morning.","7:16":"","7:17":"But the remainder of the flesh of the sacrifice on the third day shall be burnt with fire.","7:18":"it will not be accepted","7:19":"","7:20":"that belongs to Yahweh","7:21":"the uncleanness of man","7:22":"saying","7:23":"","7:24":"and the fat of that which is torn of animals","7:25":"of which men offer an offering made by fire to Yahweh","7:26":"whether it is of bird or of animal","7:27":"that soul shall be cut off from his people.',Whatsoever soul it be that eateth any manner of blood, even that soul shall be cut off from his people.,  כָּל־נֶפֶשׁ אֲשֶׁר־תֹּאכַל כָּל־דָּם וְנִכְרְתָה הַנֶּפֶשׁ הַהִוא מֵעַמֶּיהָ׃ פ ‬,Whosoever it be that eateth any blood, that soul shall be cut off from his people.,πᾶσα ψυχή ἣ ἄν φάγῃ αἷμα ἀπολεῖται ἡ ψυχὴ ἐκείνη ἀπὸ τοῦ λαοῦ αὐτῆς,7:17 Every soul that shall eat blood, that soul shall perish from his people.,כל הנפש אשר תאכל כל דם ונכרתה הנפש ההיא מעמיה,Whatsoever soul [it be] that eateth any manner of blood, even that soul shall be cut off from his people.,כָּל אֱנָשָׁא דִי תֵיכוּל כָּל דְמָא וְיִשְׁתֵּיצֵי אֱנָשָׁא הַהוּא מֵעַמַהּ ,every man who eateth any kind of blood, that man shall be destroyed from his people.","7:28":"saying","7:29":"","7:30":"that the breast may be waved for a wave offering before Yahweh.","7:31":"but the breast shall be Aaron's and his sons'.","7:32":"And the right shoulder shall ye give unto the priest for an heave offering of the sacrifices of your peace offerings.","7:33":"and the fat","7:34":"and have given them to Aaron the priest and to his sons as their portion forever from the children of Israel.',For the wave breast and the heave shoulder have I taken of the children of Israel from off the sacrifices of their peace offerings, and have given them unto Aaron the priest and unto his sons by a statute for ever from among the children of Israel.,  כִּי אֶת־חֲזֵה הַתְּנוּפָה וְאֵת שׁוֹק הַתְּרוּמָה לָקַחְתִּי מֵאֵת בְּנֵי־יִשְׂרָאֵל מִזִּבְחֵי שַׁלְמֵיהֶם וָאֶתֵּן אֹתָם לְאַהֲרֹן הַכֹּהֵן וּלְבָנָיו לְחָק־עוֹלָם מֵאֵת בְּנֵי יִשְׂרָאֵל׃ ‬,For the breast of waving and the thigh of heaving have I taken of the children of Israel out of their sacrifices of peace-offerings, and have given them unto Aaron the priest and unto his sons as a due for ever from the children of Israel.,τὸ γὰρ στηθύνιον τοῦ ἐπιθέματος καὶ τὸν βραχίονα τοῦ ἀφαιρέματος εἴληφα παρὰ τῶν υἱῶν ισραηλ ἀπὸ τῶν θυσιῶν τοῦ σωτηρίου ὑμῶν καὶ ἔδωκα αὐτὰ ααρων τῷ ἱερεῖ καὶ τοῖς υἱοῖς αὐτοῦ νόμιμον αἰώνιον παρὰ τῶν υἱῶν ισραηλ,7:24 For I have taken the wave-breast and shoulder of separation from the children of Israel from the sacrifices of your peace-offerings, and I have given them to Aaron the priest and his sons, a perpetual ordinance due from the children of Israel.,כי את חזה התנופה ואת שוק התרומה לקחתי מאת בני ישראל מזבחי שלמיהם ואתן אתם לאהרן הכהן ולבניו לחק עולם מאת בני ישראל,For the wave breast and the heave shoulder have I taken of the children of Israel from off the sacrifices of their peace offerings, and have given them unto Aaron the priest and unto his sons by a statute for ever from among the children of Israel.,אֲרֵי יָת חֶדְיָא דַאֲרָמוּתָא וְיָת שׁוֹקָא דְאַפְרָשׁוּתָא נְסֵבִית מִן בְּנֵי יִשְׂרָאֵל מִנִכְסַת קוּדְשֵׁיהוֹן וִיהָבִית יָתְהוֹן לְאַהֲרֹן כַּהֲנָא וְלִבְנוֹהִי לִקְיָם עָלָם מִן בְּנֵי יִשְׂרָאֵל ,For the uplifted breast and the shoulder of separation of the sacrifices of the Beni Israel I have given to Aharon the priest and to his sons by an everlasting statute from the sons of Israel.","7:35":"and the anointing portion of his sons","7:36":"in the day that he anointed them.  It is their portion forever throughout their generations.","7:37":"of the meal offering","7:38":"in the day that he commanded the children of Israel to offer their offerings to Yahweh","8:1":"saying","8:2":"and the garments","8:3":"καὶ πᾶσαν τὴν συναγωγὴν ἐκκλησίασον ἐπὶ τὴν θύραν τῆς σκηνῆς τοῦ μαρτυρίου","8:4":"And Moses did as the LORD commanded him; and the assembly was gathered together unto the door of the tabernacle of the congregation.","8:5":"This is the thing which Yahweh has commanded to be done.","8:6":"and washed them with water.","8:7":"tied the sash on him","8:8":"And he put the breastplate upon him: also he put in the breastplate the Urim and the Thummim.","8:9":"in front","8:10":"and anointed the tabernacle and all that was in it","8:11":"and anointed the altar and all its vessels","8:12":"and anointed him","8:13":"and clothed them with coats","8:14":"and Aaron and his sons laid their hands on the head of the bull of the sin offering.","8:15":"and put it on the horns of the altar round about with his finger","8:16":"and the cover of the liver","8:17":"and its skin","8:18":"And he brought the ram for the burnt offering: and Aaron and his sons laid their hands upon the head of the ram.","8:19":"And he killed it; and Moses sprinkled the blood upon the altar round about.","8:20":"and the pieces","8:21":"And he washed the inwards and the legs in water; and Moses burnt the whole ram upon the altar: it was a burnt sacrifice for a sweet savor","8:22":"the ram of consecration: and Aaron and his sons laid their hands on the head of the ram.","8:23":"and put it on the tip of Aaron's right ear","8:24":"and on the thumb of their right hand","8:25":"and the fat tail","8:26":"that was before Yahweh","8:27":"and waved them for a wave offering before Yahweh.","8:28":"and burned them on the altar on the burnt offering.  They were a consecration for a sweet savor. It was an offering made by fire to Yahweh.","8:29":"and waved it for a wave offering before Yahweh.  It was Moses' portion of the ram of consecration","8:30":"and some of the blood which was on the altar","8:31":"Boil the flesh at the door of the Tent of Meeting, and there eat it and the bread that is in the basket of consecration, as I commanded, saying, 'Aaron and his sons shall eat it.',And Moses said unto Aaron and to his sons, Boil the flesh at the door of the tabernacle of the congregation: and there eat it with the bread that is in the basket of consecrations, as I commanded, saying, Aaron and his sons shall eat it.,  וַיֹּאמֶר מֹשֶׁה אֶל־אַהֲרֹן וְאֶל־בָּנָיו בַּשְּׁלוּ אֶת־הַבָּשָׂר פֶּתַח אֹהֶל מוֹעֵד וְשָׁם תֹּאכְלוּ אֹתוֹ וְאֶת־הַלֶּחֶם אֲשֶׁר בְּסַל הַמִּלֻּאִים כַּאֲשֶׁר צִוֵּיתִי לֵאמֹר אַהֲרֹן וּבָנָיו יֹאכְלֻהוּ׃ ‬,And Moses said unto Aaron and to his sons: Boil the flesh at the door of the tent of meeting; and there eat it and the bread that is in the basket of consecration","8:32":"And that which remaineth of the flesh and of the bread shall ye burn with fire.","8:33":"until the days of your consecration are fulfilled: for he shall consecrate you seven days.","8:34":"so Yahweh has commanded to do","8:35":"and keep the charge of Yahweh","8:36":"So Aaron and his sons did all things which the LORD commanded by the hand of Moses.","9:1":"that Moses called Aaron and his sons","9:2":"Take a calf from the herd for a sin offering, and a ram for a burnt offering, without blemish, and offer them before Yahweh.,And he said unto Aaron, Take thee a young calf for a sin offering, and a ram for a burnt offering, without blemish, and offer them before the LORD.,  וַיֹּאמֶר אֶל־אַהֲרֹן קַח־לְךָ עֵגֶל בֶּן־בָּקָר לְחַטָּאת וְאַיִל לְעֹלָה תְּמִימִם וְהַקְרֵב לִפְנֵי יְהוָה׃ ‬,and he said unto Aaron: Take thee a bull-calf for a sin-offering","9:3":"saying","9:4":"to sacrifice before Yahweh; and a meal offering mixed with oil: for today Yahweh appears to you.',Also a bullock and a ram for peace offerings, to sacrifice before the LORD; and a meat offering mingled with oil: for to day the LORD will appear unto you.,  וְשׁוֹר וָאַיִל לִשְׁלָמִים לִזְבֹּחַ לִפְנֵי יְהוָה וּמִנְחָה בְּלוּלָה בַשָּׁמֶן כִּי הַיּוֹם יְהוָה נִרְאָה אֲלֵיכֶם׃ ‬,and an ox and a ram for peace-offerings, to sacrifice before the LORD; and a meal-offering mingled with oil; for to-day the LORD appeareth unto you.","9:5":"And they brought that which Moses commanded before the tabernacle of the congregation: and all the congregation drew near and stood before the LORD.","9:6":"This is the thing which Yahweh commanded that you should do:  and the glory of Yahweh shall appear to you.","9:7":"Draw near to the altar, and offer your sin offering, and your burnt offering, and make atonement for yourself, and for the people; and offer the offering of the people, and make atonement for them; as Yahweh commanded.","9:8":"and killed the calf of the sin offering","9:9":"and put it on the horns of the altar","9:10":"and the kidneys","9:11":"And the flesh and the hide he burnt with fire without the camp.","9:12":"and he sprinkled it on the altar round about.","9:13":"piece by piece","9:14":"and burned them on the burnt offering on the altar.","9:15":"and took the goat of the sin offering which was for the people","9:16":"and offered it according to the ordinance.","9:17":"and filled his hand from there","9:18":"the sacrifice of peace offerings","9:19":"the fat tail","9:20":"and he burned the fat on the altar:","9:21":"as Moses commanded.","9:22":"and blessed them; and he came down from offering the sin offering","9:23":"and came out","9:24":"and consumed the burnt offering and the fat upon the altar:  and when all the people saw it","10:1":"the sons of Aaron","10:2":"and devoured them","10:3":"This is what Yahweh spoke of, saying, 'I will show myself holy to those who come near me, and before all the people I will be glorified.' Aaron held his peace.","10:4":"the sons of Uzziel the uncle of Aaron","10:5":"and carried them in their coats out of the camp","10:6":"and to Eleazar and to Ithamar","10:7":"lest you die; for the anointing oil of Yahweh is on you. They did according to the word of Moses.,And ye shall not go out from the door of the tabernacle of the congregation, lest ye die: for the anointing oil of the LORD is upon you. And they did according to the word of Moses.,  וּמִפֶּתַח אֹהֶל מוֹעֵד לֹא תֵצְאוּ פֶּן־תָּמֻתוּ כִּי־שֶׁמֶן מִשְׁחַת יְהוָה עֲלֵיכֶם וַיַּעֲשׂוּ כִּדְבַר מֹשֶׁה׃ פ ‬,And ye shall not go out from the door of the tent of meeting, lest ye die; for the anointing oil of the LORD is upon you. And they did according to the word of Moses.","10:8":"saying","10:9":"thou","10:10":"and between the unclean and the clean;","10:11":"καὶ συμβιβάσεις τοὺς υἱοὺς ισραηλ πάντα τὰ νόμιμα ἃ ἐλάλησεν κύριος πρὸς αὐτοὺς διὰ χειρὸς μωυσῆ","10:12":"and to Eleazar and to Ithamar","10:13":"because it is your portion","10:14":"you","10:15":"to wave it for a wave offering before Yahweh:  and it shall be yours","10:16":"and","10:17":"seeing it is most holy","10:18":"its blood was not brought into the inner part of the sanctuary:  you certainly should have eaten it in the sanctuary","10:19":"Behold, this day they have offered their sin offering and their burnt offering before Yahweh; and such things as these have happened to me:  and if I had eaten the sin offering today, would it have been pleasing in the sight of Yahweh?","10:20":"it was pleasing in his sight.","11:1":"saying to them","11:2":"","11:3":"and is cloven-footed","11:4":"","11:5":"because he chews the cud but doesn't have a parted hoof","11:6":"because she chews the cud but doesn't part the hoof","11:7":"because he has a split hoof","11:8":"and their carcasses you shall not touch; they are unclean to you.","11:9":"","11:10":"and in the rivers","11:11":"and you shall detest their carcasses.","11:12":"that is an abomination to you.","11:13":"","11:14":"any kind of black kite","11:15":"","11:16":"the screech owl","11:17":"the cormorant","11:18":"the desert owl","11:19":"any kind of heron","11:20":"","11:21":"which have legs above their feet","11:22":"any kind of katydid","11:23":"are an abomination to you.","11:24":"","11:25":"and be unclean until the evening.","11:26":"","11:27":"among all animals that go on all fours","11:28":"and be unclean until the evening.  They are unclean to you.","11:29":"","11:30":"and the monitor lizard","11:31":"shall be unclean until the evening.","11:32":"it shall be unclean; whether it is any vessel of wood","11:33":"into which any of them falls","11:34":"that on which water comes","11:35":"or range for pots","11:36":"Nevertheless a fountain or pit","11:37":"it is clean.","11:38":"and part of their carcass falls on it","11:39":"","11:40":"and be unclean until the evening.  He also who carries its carcass shall wash his clothes","11:41":"","11:42":"and whatever goes on all fours","11:43":"neither shall you make yourselves unclean with them","11:44":"and be holy; for I am holy:  neither shall you defile yourselves with any kind of creeping thing that moves on the earth.","11:45":"to be your God.  You shall therefore be holy","11:46":"","11:47":"and between the living thing that may be eaten and the living thing that may not be eaten.',To make a difference between the unclean and the clean, and between the beast that may be eaten and the beast that may not be eaten.,  לְהַבְדִּיל בֵּין הַטָּמֵא וּבֵין הַטָּהֹר וּבֵין הַחַיָּה הַנֶּאֱכֶלֶת וּבֵין הַחַיָּה אֲשֶׁר לֹא תֵאָכֵל׃ פ ‬,to make a difference between the unclean and the clean, and between the living thing that may be eaten and the living thing that may not be eaten.,διαστεῖλαι ἀνὰ μέσον τῶν ἀκαθάρτων καὶ ἀνὰ μέσον τῶν καθαρῶν καὶ ἀνὰ μέσον τῶν ζωογονούντων τὰ ἐσθιόμενα καὶ ἀνὰ μέσον τῶν ζωογονούντων τὰ μὴ ἐσθιόμενα,to distinguish between the unclean and the clean; and between those that bring forth alive, such as should be eaten, and those that bring forth alive, such as should not be eaten.,להבדיל בין הטמא ובין הטהור ובין החיה הנאכלת ובין החיה אשר לא תאכל,To make a difference between the unclean and the clean, and between the beast that may be eaten and the beast that may not be eaten.,לְאַפְרָשָׁא בֵּין מְסָאָבָא וּבֵין דַכְיָא וּבֵין חַיְתָא דְמִתְאַכְלָא וּבֵין חַיְתָא דִי לָא מִתְאַכְלָא ,for making a distinction between the unclean and the clean, between the animal that may be eaten, and the animal that may not be eaten.","12:1":"saying","12:2":"","12:3":"And in the eighth day the flesh of his foreskin shall be circumcised.","12:4":"nor come into the sanctuary","12:5":"then she shall be unclean two weeks","12:6":"","12:7":"and make atonement for her; and she shall be cleansed from the fountain of her blood. 'This is the law for her who bears, whether a male or a female.,Who shall offer it before the LORD, and make an atonement for her; and she shall be cleansed from the issue of her blood. This is the law for her that hath born a male or a female.,  וְהִקְרִיבוֹ לִפְנֵי יְהוָה וְכִפֶּר עָלֶיהָ וְטָהֲרָה מִמְּקֹר דָּמֶיהָ זֹאת תּוֹרַת הַיֹּלֶדֶת לַזָּכָר אוֹ לַנְּקֵבָה׃ ‬,And he shall offer it before the LORD, and make atonement for her; and she shall be cleansed from the fountain of her blood. This is the law for her that beareth, whether a male or a female.,καὶ προσοίσει ἔναντι κυρίου καὶ ἐξιλάσεται περὶ αὐτῆς ὁ ἱερεὺς καὶ καθαριεῖ αὐτὴν ἀπὸ τῆς πηγῆς τοῦ αἵματος αὐτῆς οὗτος ὁ νόμος τῆς τικτούσης ἄρσεν ἢ θῆλυ,And he shall present it before the Lord, and the priest shall make atonement for her, and shall purge her from the fountain of her blood; this is the law of her who bears a male or a female.,והקריבו לפני יהוה וכפר עליה הכהן וטהרה ממקור דמיה זאת תורת הילדת לזכר או לנקבה,The Priest who shall offer it before the LORD, and make an atonement for her; and she shall be cleansed from the issue of her blood. This [is] the law for her that hath born a male or a female.,וִיקָרְבִנֵהּ קֳדָם יְיָ וִיכַפֵּר עֲלַהּ וְתִדְכֵּי מִסוֹאֲבַת דְמָהָא דָא אוֹרַיְתָא דְיַלֶדְתָּא לְדוּכְרָא אוֹ לִנְקֻבְתָא ,who shall offer it before the Lord, and make atonement for her, and she shall be cleansed from the uncleanness of her blood. This is the law for her who beareth male or female.","12:8":"then she shall take two turtledoves","13:1":"saying","13:2":"","13:3":"and the appearance of the plague is deeper than the body's skin","13:4":"and the appearance of it isn't deeper than the skin","13:5":"and","13:6":"if the plague has faded","13:7":"after he has shown himself to the priest for his cleansing","13:8":"if the scab has spread on the skin","13:9":"","13:10":"if there is a white rising in the skin","13:11":"and the priest shall pronounce him unclean.  He shall not isolate him","13:12":"","13:13":"behold","13:14":"he shall be unclean.","13:15":"and pronounce him unclean: the raw flesh is unclean.  It is leprosy.","13:16":"and is changed to white","13:17":"behold","13:18":"","13:19":"or a bright spot","13:20":"if the appearance of it is lower than the skin","13:21":"and behold","13:22":"then the priest shall pronounce him unclean.  It is a plague.","13:23":"and hasn't spread","13:24":"","13:25":"if the hair in the bright spot has turned white","13:26":"and behold","13:27":"then the priest shall pronounce him unclean. It is the plague of leprosy.","13:28":"and hasn't spread in the skin","13:29":"","13:30":"if the appearance of it is deeper than the skin","13:31":"and behold","13:32":"if the itch hasn't spread","13:33":"but he shall not shave the itch; and the priest shall shut him up who has the itch seven more days.","13:34":"the priest shall examine the itch; and behold","13:35":"","13:36":"if the itch has spread in the skin","13:37":"and black hair has grown in it; the itch is healed","13:38":"","13:39":"if the bright spots on the skin of their body are a dull white","13:40":"","13:41":"he is forehead bald.  He is clean.","13:42":"or the bald forehead","13:43":"behold","13:44":"He is a leprous man","13:45":"unclean.,καὶ ὁ λεπρός ἐν ᾧ ἐστιν ἡ ἁφή τὰ ἱμάτια αὐτοῦ ἔστω παραλελυμένα καὶ ἡ κεφαλὴ αὐτοῦ ἀκατακάλυπτος καὶ περὶ τὸ στόμα αὐτοῦ περιβαλέσθω καὶ ἀκάθαρτος κεκλήσεται,And the leper in whom the plague is, let his garments be ungirt, and his head uncovered; and let him have a covering put upon his mouth, and he shall be called unclean.,והצרוע אשר בו הנגע בגדיו יהיו פרומים וראשו יהיה פרוע ועל שפם יעטא וטמא טמא יקרא,And the leper in whom the plague [is], his clothes shall be rent, and his head bare, and he shall put a covering upon his upper lip, and shall cry, Unclean, unclean.,וּסְגִירָא דִי בֵהּ מַכְתָּשָׁא לְבוּשׁוֹהִי יְהוֹן מְבַזְעִין וְרֵישֵׁהּ יְהֵי פְרִיעַ וְעַל שָׂפָם כַּאֲבֵלָא יִתְעַטָף וְלָא תִסְתַּאֲבוּן וְלָא תִסְתַּאֲבוּן יִקְרֵי ,And the leper in whom is the plague,his clothes shall be rent, and his head bared; and, like the mourner, he shall be covered unto his lip, and shall cry: Be not made unclean!","13:46":"All the days wherein the plague shall be in him he shall be defiled; he is unclean: he shall dwell alone; without the camp shall his habitation be.","13:47":"","13:48":"or woof; of linen","13:49":"or in the skin","13:50":"and isolate the plague seven days.","13:51":"either in the warp","13:52":"whether the warp or the woof","13:53":"","13:54":"and he shall isolate it seven more days.","13:55":"after the plague is washed; and behold","13:56":"and behold","13:57":"either in the warp","13:58":"either the warp","13:59":"either in the warp","14:1":"saying","14:2":"","14:3":"and behold","14:4":"and cedar wood","14:5":"And the priest shall command that one of the birds be killed in an earthen vessel over running water:","14:6":"he shall take it","14:7":"and shall pronounce him clean","14:8":"","14:9":"that he shall shave all his hair off his head and his beard and his eyebrows","14:10":"","14:11":"and those things","14:12":"","14:13":"in the place of the sanctuary; for as the sin offering is the priest's","14:14":"and the priest shall put it on the tip of the right ear of him who is to be cleansed","14:15":"and pour it into the palm of his own left hand.","14:16":"and shall sprinkle some of the oil with his finger seven times before Yahweh.","14:17":"and on the thumb of his right hand","14:18":"and the priest shall make atonement for him before Yahweh.","14:19":"","14:20":"and he shall be clean.","14:21":"","14:22":"or two young pigeons","14:23":"","14:24":"and the log of oil","14:25":"and on the thumb of his right hand","14:26":"And the priest shall pour of the oil into the palm of his own left hand:","14:27":"And the priest shall sprinkle with his right finger some of the oil that is in his left hand seven times before the LORD:","14:28":"and on the thumb of his right hand","14:29":"to make atonement for him before Yahweh.","14:30":"or of the young pigeons","14:31":"the one for a sin offering","14:32":"who is not able to afford the sacrifice for his cleansing.","14:33":"saying","14:34":"","14:35":"saying","14:36":"before the priest goes in to examine the plague","14:37":"if the plague is in the walls of the house with hollow streaks","14:38":"and shut up the house seven days.","14:39":"and look. If the plague has spread in the walls of the house","14:40":"and cast them into an unclean place outside of the city:","14:41":"and they shall pour out the mortar","14:42":"and put them in the place of those stones; and he shall take other mortar","14:43":"","14:44":"if the plague has spread in the house","14:45":"its stones","14:46":"","14:47":"And he that lieth in the house shall wash his clothes; and he that eateth in the house shall wash his clothes.","14:48":"","14:49":"and cedar wood","14:50":"And he shall kill the one of the birds in an earthen vessel over running water:","14:51":"and the hyssop","14:52":"and with the running water","14:53":"","14:54":"and for an itch","14:55":"and for a house","14:56":"and for a scab","14:57":"and when it is clean. This is the law of leprosy.","15:1":"saying","15:2":"","15:3":"or his body has stopped from his discharge","15:4":"","15:5":"and bathe himself in water","15:6":"and bathe himself in water","15:7":"","15:8":"","15:9":"","15:10":"and bathe himself in water","15:11":"","15:12":"","15:13":"","15:14":"","15:15":"the one for a sin offering","15:16":"","15:17":"and every skin","15:18":"they shall both bathe themselves in water","15:19":"","15:20":"","15:21":"and bathe himself in water","15:22":"and bathe himself in water","15:23":"or on anything whereon she sits","15:24":"","15:25":"","15:26":"as the uncleanness of her period.","15:27":"and shall wash his clothes","15:28":"","15:29":"or two young pigeons","15:30":"and the other for a burnt offering; and the priest shall make atonement for her before Yahweh for the uncleanness of her discharge.","15:31":"Thus shall ye separate the children of Israel from their uncleanness; that they die not in their uncleanness","15:32":"and of him who has an emission of semen","15:33":"and of a man or woman who has a discharge","16:1":"after the death of the two sons of Aaron","16:2":"Tell Aaron your brother, not to come at all times into the Most Holy Place within the veil, before the mercy seat which is on the ark; lest he die: for I will appear in the cloud on the mercy seat.,And the LORD said unto Moses, Speak unto Aaron thy brother, that he come not at all times into the holy place within the vail before the mercy seat, which is upon the ark; that he die not: for I will appear in the cloud upon the mercy seat.,  וַיֹּאמֶר יְהוָה אֶל־מֹשֶׁה דַּבֵּר אֶל־אַהֲרֹן אָחִיךָ וְאַל־יָבֹא בְכָל־עֵת אֶל־הַקֹּדֶשׁ מִבֵּית לַפָּרֹכֶת אֶל־פְּנֵי הַכַּפֹּרֶת אֲשֶׁר עַל־הָאָרֹן וְלֹא יָמוּת כִּי בֶּעָנָן אֵרָאֶה עַל־הַכַּפֹּרֶת׃ ‬,and the LORD said unto Moses: 'speak unto Aaron thy brother, that he come not at all times into the holy place within the veil, before the ark-cover which is upon the ark; that he die not; for I appear in the cloud upon the ark-cover.,καὶ εἶπεν κύριος πρὸς μωυσῆν λάλησον πρὸς ααρων τὸν ἀδελφόν σου καὶ μὴ εἰσπορευέσθω πᾶσαν ὥραν εἰς τὸ ἅγιον ἐσώτερον τοῦ καταπετάσματος εἰς πρόσωπον τοῦ ἱλαστηρίου ὅ ἐστιν ἐπὶ τῆς κιβωτοῦ τοῦ μαρτυρίου καὶ οὐκ ἀποθανεῖται ἐν γὰρ νεφέλῃ ὀφθήσομαι ἐπὶ τοῦ ἱλαστηρίου,And the Lord said to Moses, Speak to Aaron thy brother, and let him not come in at all times into the holy place within the veil before the propitiatory, which is upon the ark of the testimony, and he shall not die; for I will appear in a cloud on the propitiatory.,ויאמר יהוה אל משה דבר אל אהרן אחיך ואל יבוא בכל עת אל הקדש מבית לפרכת אל פני הכפרת אשר על הארון ולא ימות כי בענן אראה על הכפרת,And the LORD said unto Moses, Speak unto Aaron thy brother, that he come not at all times into the holy [place] within the veil before the mercy seat, which [is] upon the ark; that he die not: for I will appear in the cloud upon the mercy seat.,וַאֲמַר יְיָ לְמֹשֶׁה מַלֵל עִם אַהֲרֹן אָחוּךְ וְלָא יְהֵי עָלֵל בְּכָל עִדָן לְקוּדְשָׁא מִגָיו לְפָרֻכְתָּא לָקֳדָם כַּפֻּרְתָּא דִי עַל אֲרוֹנָא וְלָא יְמוּת אֲרֵי בַּעֲנָנָא אֲנָא מִתְגְלִי עַל בֵּית כַּפֻּרְתָּא ,and the Lord said unto Mosheh, Speak with Aharon thy brother, that he may not enter at any time into the Holy Place within the veil before the mercy-seat which is upon the ark, that he die not; for in the cloud will I reveal Myself over the mercy-seat.","16:3":"","16:4":"and he shall have the linen breeches on his body","16:5":"and one ram for a burnt offering.","16:6":"","16:7":"and set them before Yahweh at the door of the Tent of Meeting.","16:8":"and the other lot for the scapegoat.","16:9":"and offer him for a sin offering.","16:10":"on which the lot fell for the scapegoat","16:11":"","16:12":"and two handfuls of sweet incense beaten small","16:13":"that the cloud of the incense may cover the mercy seat that is on the testimony","16:14":"and sprinkle it with his finger on the mercy seat on the east; and before the mercy seat he shall sprinkle some of the blood with his finger seven times.","16:15":"","16:16":"because of the uncleanness of the children of Israel","16:17":"until he comes out","16:18":"","16:19":"and cleanse it","16:20":"","16:21":"and confess over him all the iniquities of the children of Israel","16:22":"and he shall let the goat go in the wilderness.","16:23":"","16:24":"and put on his garments","16:25":"And the fat of the sin offering shall he burn upon the altar.","16:26":"","16:27":"and the goat for the sin offering","16:28":"and bathe his flesh in water","16:29":"","16:30":"to cleanse you; from all your sins you shall be clean before Yahweh.","16:31":"and you shall afflict your souls; it is a statute forever.","16:32":"who is anointed and who is consecrated to be priest in his father's place","16:33":"And he shall make an atonement for the holy sanctuary","16:34":"And this shall be an everlasting statute unto you","17:1":"saying","17:2":"","17:3":"who kills an ox","17:4":"to offer it as an offering to Yahweh before the tabernacle of Yahweh: blood shall be imputed to that man.  He has shed blood; and that man shall be cut off from among his people.","17:5":"which they sacrifice in the open field","17:6":"and burn the fat for a sweet savor to Yahweh.","17:7":"after which they play the prostitute.  This shall be a statute forever to them throughout their generations.'","17:8":"","17:9":"to sacrifice it to Yahweh; that man shall be cut off from his people.","17:10":"","17:11":"For the life of the flesh is in the blood: and I have given it to you upon the altar to make an atonement for your souls: for it is the blood that maketh an atonement for the soul.","17:12":"No person among you shall eat blood, neither shall any stranger who lives as a foreigner among you eat blood.","17:13":"","17:14":"its blood is with its life: therefore I said to the children of Israel","17:15":"","17:16":"or bathe his flesh","18:1":"","18:2":"","18:3":"where you lived: and you shall not do as they do in the land of Canaan","18:4":"and you shall keep my statutes","18:5":"he shall live in them:  I am Yahweh.","18:6":"","18:7":"","18:8":"","18:9":"","18:10":"","18:11":"","18:12":"","18:13":"","18:14":"","18:15":"ἀσχημοσύνην νύμφης σου οὐκ ἀποκαλύψεις γυνὴ γὰρ υἱοῦ σού ἐστιν οὐκ ἀποκαλύψεις τὴν ἀσχημοσύνην αὐτῆς","18:16":"","18:17":"","18:18":"","18:19":"","18:20":"","18:21":"","18:22":"","18:23":"","18:24":"","18:25":"and the land vomited out her inhabitants.","18:26":"and shall not do any of these abominations; neither the native-born","18:27":"that were before you","18:28":"when you defile it","18:29":"","18:30":"that you do not practice any of these abominable customs","19:1":"saying","19:2":"","19:3":"","19:4":"","19:5":"","19:6":"and on the next day: and if anything remains until the third day","19:7":"it is an abomination. It will not be accepted;","19:8":"because he has profaned the holy thing of Yahweh","19:9":"","19:10":"neither shall you gather the fallen grapes of your vineyard; you shall leave them for the poor and for the foreigner.  I am Yahweh your God.","19:11":"","19:12":"","19:13":"","19:14":"","19:15":"","19:16":"","19:17":"","19:18":"","19:19":"Ye shall keep my statutes. Thou shalt not let thy cattle gender with a diverse kind: thou shalt not sow thy field with mingled seed: neither shall a garment mingled of linen and woolen come upon thee.","19:20":"","19:21":"to the door of the Tent of Meeting","19:22":"And the priest shall make an atonement for him with the ram of the trespass offering before the LORD for his sin which he hath done: and the sin which he hath done shall be forgiven him.","19:23":"","19:24":"for giving praise to Yahweh.","19:25":"that it may yield its increase to you.  I am Yahweh your God.","19:26":"","19:27":"","19:28":"","19:29":"","19:30":"","19:31":"","19:32":"","19:33":"","19:34":"and you shall love him as yourself; for you lived as foreigners in the land of Egypt. I am Yahweh your God.","19:35":"","19:36":"just weights","19:37":"and all my ordinances","20:1":"saying","20:2":"","20:3":"and will cut him off from among his people because he has given of his seed to Molech","20:4":"when he gives of his seed to Molech","20:5":"and against his family","20:6":"","20:7":"","20:8":"and do them.  I am Yahweh who sanctifies you.","20:9":"","20:10":"","20:11":"And the man that lieth with his father's wife hath uncovered his father's nakedness: both of them shall surely be put to death; their blood shall be upon them.","20:12":"","20:13":"","20:14":"","20:15":"","20:16":"","20:17":"","20:18":"","20:19":"","20:20":"he has uncovered his uncle's nakedness:  they shall bear their sin; they shall die childless.","20:21":"","20:22":"","20:23":"which I am casting out before you:  for they did all these things","20:24":"You shall inherit their land, and I will give it to you to possess it, a land flowing with milk and honey. I am Yahweh your God","20:25":"","20:26":"Yahweh","20:27":"A man also or woman that hath a familiar spirit","21:1":"Speak to the priests, the sons of Aaron, and say to them, 'A priest shall not defile himself for the dead among his people;,And the LORD said unto Moses, Speak unto the priests the sons of Aaron, and say unto them, There shall none be defiled for the dead among his people:,  וַיֹּאמֶר יְהוָה אֶל־מֹשֶׁה אֱמֹר אֶל־הַכֹּהֲנִים בְּנֵי אַהֲרֹן וְאָמַרְתָּ אֲלֵהֶם לְנֶפֶשׁ לֹא־יִטַּמָּא בְּעַמָּיו׃ ‬,And the LORD said unto Moses: Speak unto the priests the sons of Aaron, and say unto them: There shall none defile himself for the dead among his people;,καὶ εἶπεν κύριος πρὸς μωυσῆν λέγων εἰπὸν τοῖς ἱερεῦσιν τοῖς υἱοῖς ααρων καὶ ἐρεῖς πρὸς αὐτούς ἐν ταῖς ψυχαῖς οὐ μιανθήσονται ἐν τῷ ἔθνει αὐτῶν,And the Lord spoke to Moses, saying, Speak to the priests the sons of Aaron, and thou shalt tell them that they shall not defile themselves in their nation for the dead,,ויאמר יהוה אל משה אמר אל הכהנים בני אהרן ואמרת אליהם לנפש לא יטמא בעמו,And the LORD said unto Moses, Speak unto the priests the sons of Aaron, and say unto them, There shall none be defiled for the dead among his people:,וַאֲמַר יְיָ לְמֹשֶׁה אֱמַר לְכַהֲנַיָא בְּנֵי אַהֲרֹן וְתֵימַר לְהוֹן עַל מִית לָא יִסְתָּאַב בְּעַמֵהּ ,And the Lord spake with Mosheh, saying: Speak unto the priests, the sons of Aharon, and say to them: Let no one be defiled among his people on account of the dead:","21:2":"for his father","21:3":"who has had no husband; for her he may defile himself.","21:4":"being a chief man among his people","21:5":"","21:6":"and not profane the name of their God; for they offer the offerings of Yahweh made by fire","21:7":"","21:8":"who sanctify you","21:9":"","21:10":"","21:11":"nor defile himself for his father","21:12":"nor profane the sanctuary of his God; for the crown of the anointing oil of his God is upon him.  I am Yahweh.","21:13":"","21:14":"or one divorced","21:15":"","21:16":"saying","21:17":"","21:18":"he shall not draw near: a blind man","21:19":"or an injured hand","21:20":"or a dwarf","21:21":"who has a blemish","21:22":"both of the most holy","21:23":"nor come near to the altar","21:24":"and to his sons","22:1":"saying","22:2":"","22:3":"","22:4":"","22:5":"whereby he may be made unclean","22:6":"and shall not eat of the holy things","22:7":"he shall be clean; and afterward he shall eat of the holy things","22:8":"or is torn by animals","22:9":"","22:10":"","22:11":"purchased by his money","22:12":"she shall not eat of the heave offering of the holy things.","22:13":"or divorced","22:14":"","22:15":"which they offer to Yahweh","22:16":"when they eat their holy things:  for I am Yahweh who sanctifies them.',Or suffer them to bear the iniquity of trespass, when they eat their holy things: for I the LORD do sanctify them.,  וְהִשִּׂיאוּ אוֹתָם עֲוֺן אַשְׁמָה בְּאָכְלָם אֶת־קָדְשֵׁיהֶם כִּי אֲנִי יְהוָה מְקַדְּשָׁם׃ פ ‬,and so cause them to bear the iniquity that bringeth guilt, when they eat their holy things; for I am the LORD who sanctify them.,καὶ ἐπάξουσιν ἐφ' ἑαυτοὺς ἀνομίαν πλημμελείας ἐν τῷ ἐσθίειν αὐτοὺς τὰ ἅγια αὐτῶν ὅτι ἐγὼ κύριος ὁ ἁγιάζων αὐτούς,So should they bring upon themselves the iniquity of trespass in their eating their holy things: for I am the Lord that sanctifies them.,והשיאו אתם עון אשמה באכלם את קדשיהם כי אני יהוה מקדשם,Or suffer them to bear the iniquity of trespass, when they eat their holy things: for I the LORD do sanctify them.,וִיקַבְּלוּן עֲלֵיהוֹן עֲוָיָן וְחוֹבִין בְּמֵיכָלְהוֹן בְּסוֹאֲבָא יָת קוּדְשֵׁיהוֹן אֲרֵי אֲנָא יְיָ מְקַדִשְׁהוֹן ,nor bring upon themselves iniquities and sins, when they eat in uncleanness the things that are holy. I am the Lord, who sanctify them.","22:17":"saying","22:18":"","22:19":"you shall offer a male without blemish","22:20":"that you shall not offer: for it shall not be acceptable for you.","22:21":"or for a freewill offering","22:22":"injured","22:23":"that you may offer for a freewill offering; but for a vow it shall not be accepted.","22:24":"crushed","22:25":"","22:26":"saying","22:27":"","22:28":"you shall not kill it and its young both in one day.","22:29":"","22:30":"On the same day it shall be eaten up; ye shall leave none of it until the morrow: I am the LORD.","22:31":"","22:32":"but I will be made holy among the children of Israel.  I am Yahweh who makes you holy","22:33":"to be your God. I am Yahweh.,That brought you out of the land of Egypt, to be your God: I am the LORD.,  הַמּוֹצִיא אֶתְכֶם מֵאֶרֶץ מִצְרַיִם לִהְיוֹת לָכֶם לֵאלֹהִים אֲנִי יְהוָה׃ פ ‬,that brought you out of the land of Egypt, to be your God: I am the LORD.,ὁ ἐξαγαγὼν ὑμᾶς ἐκ γῆς αἰγύπτου ὥστε εἶναι ὑμῶν θεός ἐγὼ κύριος,who brought you out of the land of Egypt, to be your God: I am the Lord.,המוצא אתכם מארץ מצרים להיות לכם לאלהים אני יהוה,That brought you out of the land of Egypt, to be your God: I [am] the LORD.,דְאַפִּיק יָתְכוֹן מֵאַרְעָא דְמִצְרַיִם לְמֶהֱוֵי לְכוֹן לֵאלָהָא אֲנָא יְיָ ,who have led you forth from the land of Mizraim to be unto you Eloha: I am the Lord.","23:1":"saying","23:2":"","23:3":"","23:4":"","23:5":"on the fourteenth day of the month in the evening","23:6":"And on the fifteenth day of the same month is the feast of unleavened bread unto the LORD: seven days ye must eat unleavened bread.","23:7":"In the first day ye shall have an holy convocation: ye shall do no servile work therein.","23:8":"","23:9":"saying","23:10":"","23:11":"to be accepted for you. On the next day after the Sabbath the priest shall wave it.","23:12":"you shall offer a male lamb without blemish a year old for a burnt offering to Yahweh.","23:13":"an offering made by fire to Yahweh for a sweet savor; and the drink offering with it shall be of wine","23:14":"nor roasted grain","23:15":"","23:16":"Even unto the morrow after the seventh sabbath shall ye number fifty days; and ye shall offer a new meat offering unto the LORD.","23:17":"for first fruits to Yahweh.","23:18":"one young bull","23:19":"and two male lambs a year old for a sacrifice of peace offerings.","23:20":"with the two lambs. They shall be holy to Yahweh for the priest.","23:21":"And ye shall proclaim on the selfsame day","23:22":"And when ye reap the harvest of your land","23:23":"saying","23:24":"","23:25":"","23:26":"saying","23:27":"","23:28":"to make atonement for you before Yahweh your God.","23:29":"For whatsoever soul it be that shall not be afflicted in that same day","23:30":"that person I will destroy from among his people.","23:31":"Ye shall do no manner of work: it shall be a statute for ever throughout your generations in all your dwellings.","23:32":"and you shall deny yourselves.  In the ninth day of the month at evening","23:33":"saying","23:34":"","23:35":"On the first day shall be an holy convocation: ye shall do no servile work therein.","23:36":"Seven days ye shall offer an offering made by fire unto the LORD: on the eighth day shall be an holy convocation unto you; and ye shall offer an offering made by fire unto the LORD: it is a solemn assembly; and ye shall do no servile work therein.","23:37":"","23:38":"and besides your gifts","23:39":"","23:40":"branches of palm trees","23:41":"And ye shall keep it a feast unto the LORD seven days in the year. It shall be a statute for ever in your generations: ye shall celebrate it in the seventh month.","23:42":"","23:43":"when I brought them out of the land of Egypt. I am Yahweh your God.',That your generations may know that I made the children of Israel to dwell in booths, when I brought them out of the land of Egypt: I am the LORD your God.,  לְמַעַן יֵדְעוּ דֹרֹתֵיכֶם כִּי בַסֻּכּוֹת הוֹשַׁבְתִּי אֶת־בְּנֵי יִשְׂרָאֵל בְּהוֹצִיאִי אוֹתָם מֵאֶרֶץ מִצְרָיִם אֲנִי יְהוָה אֱלֹהֵיכֶם׃ ‬,that your generations may know that I made the children of Israel to dwell in booths, when I brought them out of the land of Egypt: I am the LORD your God.,ὅπως ἴδωσιν αἱ γενεαὶ ὑμῶν ὅτι ἐν σκηναῖς κατῴκισα τοὺς υἱοὺς ισραηλ ἐν τῷ ἐξαγαγεῖν με αὐτοὺς ἐκ γῆς αἰγύπτου ἐγὼ κύριος ὁ θεὸς ὑμῶν,that your posterity may see, that I made the children of Israel to dwell in tents, when I brought them out of the land of Egypt: I am the Lord your God.,למען ידעו דרתיכם כי בסכות הושבתי את בני ישראל בהוצאי אתם מארץ מצרים אני יהוה אלהיכם,That your generations may know that I made the children of Israel to dwell in booths, when I brought them out of the land of Egypt: I [am] the LORD your God.,בְּדִיל דְיִדְעוּן דָרֵיכוֹן אֲרֵי בִמְטַלָיוּת עֲנָנֵי אוֹתֵבִית יָת בְּנֵי יִשְׂרָאֵל בְּאַפָּקוּתִי יָתְהוֹן מֵאַרְעָא דְמִצְרַיִם אֲנָא יְיָ אֱלָהֲכוֹן ,that your generations may know that I made the children of Israel to dwell under the shadow of clouds when I brought them forth from the land of Mizraim. I am the Lord your God.","23:44":"And Moses declared unto the children of Israel the feasts of the LORD.","24:1":"saying","24:2":"that they bring unto thee pure olive oil beaten for the light","24:3":"in the Tent of Meeting","24:4":"He shall order the lamps upon the pure candlestick before the LORD continually.","24:5":"","24:6":"six on a row","24:7":"that it may be to the bread for a memorial","24:8":"Every sabbath he shall set it in order before the LORD continually","24:9":"καὶ ἔσται ααρων καὶ τοῖς υἱοῖς αὐτοῦ καὶ φάγονται αὐτὰ ἐν τόπῳ ἁγίῳ ἔστιν γὰρ ἅγια τῶν ἁγίων τοῦτο αὐτῷ ἀπὸ τῶν θυσιαζομένων τῷ κυρίῳ νόμιμον αἰώνιον","24:10":"whose father was an Egyptian","24:11":"and cursed; and they brought him to Moses.  His mother's name was Shelomith","24:12":"until the will of Yahweh should be declared to them.","24:13":"saying","24:14":"and let all the congregation stone him.","24:15":"saying","24:16":"he shall surely be put to death; all the congregation shall certainly stone him: the foreigner as well as the native-born","24:17":"","24:18":"life for life.","24:19":"so shall it be done to him:","24:20":"eye for eye","24:21":"And he that killeth a beast","24:22":"for the foreigner as well as the native-born: for I am Yahweh your God.',Ye shall have one manner of law, as well for the stranger, as for one of your own country: for I am the LORD your God.,  מִשְׁפַּט אֶחָד יִהְיֶה לָכֶם כַּגֵּר כָּאֶזְרָח יִהְיֶה כִּי אֲנִי יְהוָה אֱלֹהֵיכֶם׃ ‬,Ye shall have one manner of law, as well for the stranger, as for the home-born; for I am the LORD your God.","24:23":"and stoned him with stones. The children of Israel did as Yahweh commanded Moses.","25:1":"","25:2":"","25:3":"and six years you shall prune your vineyard","25:4":"a Sabbath to Yahweh.  You shall not sow your field or prune your vineyard.","25:5":"and the grapes of your undressed vine you shall not gather. It shall be a year of solemn rest for the land.","25:6":"for your servant","25:7":"and for the animals that are in your land","25:8":"","25:9":"Then shalt thou cause the trumpet of the jubilee to sound on the tenth day of the seventh month","25:10":"and proclaim liberty throughout the land to all its inhabitants.  It shall be a jubilee to you; and each of you shall return to his own property","25:11":"neither reap that which grows of itself","25:12":"For it is the jubilee; it shall be holy unto you: ye shall eat the increase thereof out of the field.","25:13":"","25:14":"","25:15":"According to the number of years after the jubilee thou shalt buy of thy neighbor","25:16":"and according to the shortness of the years you shall diminish the price of it; for he is selling the number of the crops to you.","25:17":"Ye shall not therefore oppress one another; but thou shalt fear thy God: for I am the LORD your God.","25:18":"","25:19":"and you shall eat your fill","25:20":"What shall we eat the seventh year? Behold, we shall not sow, nor gather in our increase;","25:21":"and it shall bring forth fruit for the three years.","25:22":"and eat of the fruits","25:23":"","25:24":"And in all the land of your possession ye shall grant a redemption for the land.","25:25":"","25:26":"and he becomes prosperous and finds sufficient means to redeem it;","25:27":"and restore the surplus to the man to whom he sold it; and he shall return to his property.","25:28":"then what he has sold shall remain in the hand of him who has bought it until the Year of Jubilee:  and in the Jubilee it shall be released","25:29":"","25:30":"then the house that is in the walled city shall be made sure in perpetuity to him who bought it","25:31":"and they shall be released in the Jubilee.","25:32":"","25:33":"and the city of his possession","25:34":"But the field of the suburbs of their cities may not be sold; for it is their perpetual possession.","25:35":"","25:36":"but fear your God; that your brother may live among you.","25:37":"nor give him your food for profit.","25:38":"who brought you forth out of the land of Egypt","25:39":"","25:40":"and as a sojourner","25:41":"he and his children with him","25:42":"whom I brought forth out of the land of Egypt.  They shall not be sold as slaves.","25:43":"but shall fear your God.","25:44":"","25:45":"of them you may buy","25:46":"to hold for a possession; of them may you take your slaves forever: but over your brothers the children of Israel you shall not rule","25:47":"","25:48":"After that he is sold he may be redeemed again; one of his brethren may redeem him:","25:49":"or his uncle's son","25:50":"And he shall reckon with him that bought him from the year that he was sold to him unto the year of jubilee: and the price of his sale shall be according unto the number of years","25:51":"according to them he shall give back the price of his redemption out of the money that he was bought for.","25:52":"then he shall reckon with him; according to his years of service he shall give back the price of his redemption.","25:53":"And as a yearly hired servant shall he be with him: and the other shall not rule with rigor over him in thy sight.","25:54":"then he shall be released in the Year of Jubilee","25:55":"For unto me the children of Israel are servants; they are my servants whom I brought forth out of the land of Egypt: I am the LORD your God.","26:1":"","26:2":"","26:3":"","26:4":"and the land shall yield its increase","26:5":"and the vintage shall reach to the sowing time; and you shall eat your bread to the full","26:6":"","26:7":"and they shall fall before you by the sword.","26:8":"and a hundred of you shall chase ten thousand; and your enemies shall fall before you by the sword.","26:9":"","26:10":"and you shall move out the old because of the new.","26:11":"And I set my tabernacle among you: and my soul shall not abhor you.","26:12":"and will be your God","26:13":"who brought you forth out of the land of Egypt","26:14":"","26:15":"and if your soul abhors my ordinances","26:16":"even consumption and fever","26:17":"and you will be struck before your enemies.  Those who hate you will rule over you; and you will flee when no one pursues you.","26:18":"","26:19":"and I will make your sky like iron","26:20":"neither will the trees of the land yield their fruit.","26:21":"","26:22":"which will rob you of your children","26:23":"","26:24":"even I","26:25":"that will execute the vengeance of the covenant; and you will be gathered together within your cities:  and I will send the pestilence among you; and you will be delivered into the hand of the enemy.","26:26":"ten women shall bake your bread in one oven","26:27":"","26:28":"Then I will walk contrary unto you also in fury; and I","26:29":"and you will eat the flesh of your daughters.","26:30":"and cut down your incense altars","26:31":"and will bring your sanctuaries to desolation","26:32":"And I will bring the land into desolation: and your enemies which dwell therein shall be astonished at it.","26:33":"and I will draw out the sword after you:  and your land will be a desolation","26:34":"Then shall the land enjoy her sabbaths","26:35":"even the rest which it didn't have in your sabbaths","26:36":"","26:37":"as it were before the sword","26:38":"and the land of your enemies will eat you up.","26:39":"And they that are left of you shall pine away in their iniquity in your enemies' lands; and also in the iniquities of their fathers shall they pine away with them.","26:40":"","26:41":"and brought them into the land of their enemies:  if then their uncircumcised heart is humbled","26:42":"and also my covenant with Abraham; and I will remember the land.","26:43":"and will enjoy its sabbaths while it lies desolate without them:  and they will accept the punishment of their iniquity; because","26:44":"when they are in the land of their enemies","26:45":"whom I brought forth out of the land of Egypt in the sight of the nations","26:46":"ordinances and laws","27:1":"saying","27:2":"","27:3":"even your valuation shall be fifty shekels of silver","27:4":"then your valuation shall be thirty shekels.","27:5":"then your valuation shall be for a male twenty shekels","27:6":"then your valuation shall be for a male five shekels of silver","27:7":"then your valuation shall be fifteen shekels","27:8":"then he shall be set before the priest","27:9":"","27:10":"nor change it","27:11":"of which they do not offer as an offering to Yahweh","27:12":"whether it is good or bad. As you the priest values it","27:13":"then he shall add the fifth part of it to its valuation.","27:14":"","27:15":"then he shall add the fifth part of the money of your valuation to it","27:16":"","27:17":"according to your valuation it shall stand.","27:18":"then the priest shall reckon to him the money according to the years that remain to the Year of Jubilee; and an abatement shall be made from your valuation.","27:19":"then he shall add the fifth part of the money of your valuation to it","27:20":"or if he has sold the field to another man","27:21":"when it goes out in the Jubilee","27:22":"","27:23":"as a holy thing to Yahweh.","27:24":"even to him to whom the possession of the land belongs.","27:25":"And all thy estimations shall be according to the shekel of the sanctuary: twenty gerahs shall be the shekel.","27:26":"","27:27":"then he shall buy it back according to your valuation","27:28":"","27:29":"","27:30":"","27:31":"he shall add a fifth part to it.","27:32":"whatever passes under the rod","27:33":"neither shall he change it:  and if he changes it at all","27:34":"These are the commandments"}