{"1:1":"","1:2":"","1:3":"having traced the course of all things accurately from the first","1:4":"That thou mightest know the certainty of those things","1:5":"the king of Judea","1:6":"walking blamelessly in all the commandments and ordinances of the Lord.","1:7":"because Elizabeth was barren","1:8":"while he executed the priest's office before God in the order of his division","1:9":"his lot was to enter into the temple of the Lord and burn incense.","1:10":"And the whole multitude of the people were praying without at the time of incense.","1:11":"standing on the right side of the altar of incense.","1:12":"and fear fell upon him.","1:13":"Don't be afraid, Zacharias, because your request has been heard, and your wife, Elizabeth, will bear you a son, and you shall call his name John.,But the angel said unto him, Fear not, Zacharias: for thy prayer is heard; and thy wife Elisabeth shall bear thee a son, and thou shalt call his name John.,,,,,,,,","1:14":"And thou shalt have joy and gladness; and many shall rejoice at his birth.","1:15":"and he will drink no wine nor strong drink.  He will be filled with the Holy Spirit","1:16":"their God.","1:17":"'to turn the hearts of the fathers to the children","1:18":"How can I be sure of this? For I am an old man, and my wife is well advanced in years.","1:19":"I am Gabriel, who stands in the presence of God.  I was sent to speak to you, and to bring you this good news.,And the angel answering said unto him, I am Gabriel, that stand in the presence of God; and am sent to speak unto thee, and to shew thee these glad tidings.,,,,,,,,","1:20":"you will be silent and not able to speak","1:21":"and they marveled that he delayed in the temple.","1:22":"he could not speak to them","1:23":"when the days of his service were fulfilled","1:24":"his wife","1:25":"Thus hath the Lord dealt with me in the days wherein he looked on me","1:26":"the angel Gabriel was sent from God to a city of Galilee","1:27":"of the house of David.  The virgin's name was Mary.","1:28":"the angel said to her","1:29":"she was greatly troubled at the saying","1:30":"Don't be afraid, Mary, for you have found favor with God.,And the angel said unto her, Fear not, Mary: for thou hast found favour with God.,,,,,,,,","1:31":"you will conceive in your womb","1:32":"and will be called the Son of the Most High. The Lord God will give him the throne of his father","1:33":"","1:34":"How can this be, seeing I am a virgin?","1:35":"The Holy Spirit will come on you, and the power of the Most High will overshadow you. Therefore also the holy one who is born from you will be called the Son of God.,And the angel answered and said unto her, The Holy Ghost shall come upon thee, and the power of the Highest shall overshadow thee: therefore also that holy thing which shall be born of thee shall be called the Son of God.,,,,,,,,","1:36":"Elizabeth","1:37":"","1:38":"Behold, the handmaid of the Lord; be it to me according to your word.  The angel departed from her.","1:39":"into a city of Judah","1:40":"And entered into the house of Zacharias","1:41":"when Elizabeth heard Mary's greeting","1:42":"and said","1:43":"that the mother of my Lord should come to me?","1:44":"when the voice of your greeting came into my ears","1:45":"for there will be a fulfillment of the things which have been spoken to her from the Lord!,And blessed is she that believed: for there shall be a performance of those things which were told her from the Lord.,,,,,,,,","1:46":"My soul magnifies the Lord.,And Mary said, My soul doth magnify the Lord,,,,,,,,,","1:47":"","1:48":"from now on","1:49":"For he that is mighty hath done to me great things; and holy is his name.","1:50":"And his mercy is on them that fear him from generation to generation.","1:51":"He hath shewed strength with his arm; he hath scattered the proud in the imagination of their hearts.","1:52":"He hath put down the mighty from their seats","1:53":"He hath filled the hungry with good things; and the rich he hath sent empty away.","1:54":"his servant","1:55":"to Abraham and his seed forever.,As he spake to our fathers, to Abraham, and to his seed for ever.,,,,,,,,","1:56":"and then returned to her house.","1:57":"and she brought forth a son.","1:58":"and they rejoiced with her.","1:59":"that they came to circumcise the child; and they would have called him Zacharias","1:60":"Not so; but he will be called John.","1:61":"There is no one among your relatives who is called by this name.","1:62":"what he would have him called.","1:63":"and wrote","1:64":"and his tongue freed","1:65":"and all these sayings were talked about throughout all the hill country of Judea.","1:66":"saying","1:67":"Zacharias","1:68":"","1:69":"And hath raised up an horn of salvation for us in the house of his servant David;","1:70":"","1:71":"and from the hand of all who hate us;","1:72":"to remember his holy covenant","1:73":"our father","1:74":"being delivered out of the hand of our enemies","1:75":"In holiness and righteousness before him","1:76":"child","1:77":"","1:78":"whereby the dawn from on high will visit us","1:79":"","1:80":"and becoming strong in spirit","2:1":"that a decree went out from Caesar Augustus that all the world should be enrolled.","2:2":"(And this taxing was first made when Cyrenius was governor of Syria.)","2:3":"everyone to his own city.","2:4":"out of the city of Nazareth","2:5":"who was pledged to be married to him as wife","2:6":"while they were there","2:7":"and she wrapped him in bands of cloth","2:8":"and keeping watch by night over their flock.","2:9":"an angel of the Lord stood by them","2:10":"Don't be afraid, for behold, I bring you good news of great joy which will be to all the people.,And the angel said unto them, Fear not: for, behold, I bring you good tidings of great joy, which shall be to all people.,,,,,,,,","2:11":"this day","2:12":"lying in a feeding trough.,And this shall be a sign unto you; Ye shall find the babe wrapped in swaddling clothes, lying in a manger.,,,,,,,,","2:13":"there was with the angel a multitude of the heavenly army praising God","2:14":"Glory to God in the highest","2:15":"when the angels went away from them into the sky","2:16":"and found both Mary and Joseph","2:17":"they publicized widely the saying which was spoken to them about this child.","2:18":"And all they that heard it wondered at those things which were told them by the shepherds.","2:19":"pondering them in her heart.","2:20":"glorifying and praising God for all the things that they had heard and seen","2:21":"his name was called Jesus","2:22":"they brought him up to Jerusalem","2:23":"Every male who opens the womb shall be called holy to the Lord)","2:24":"A pair of turtledoves, or two young pigeons.{Leviticus 12:8}","2:25":"there was a man in Jerusalem whose name was Simeon. This man was righteous and devout","2:26":"And it was revealed unto him by the Holy Ghost","2:27":"Jesus","2:28":"and blessed God","2:29":"","2:30":"","2:31":"Which thou hast prepared before the face of all people;","2:32":"and the glory of your people Israel.,A light to lighten the Gentiles, and the glory of thy people Israel.,,,,,,,,","2:33":"","2:34":"and said to Mary","2:35":"a sword will pierce through your own soul","2:36":"a prophetess","2:37":"who didn't depart from the temple","2:38":"she gave thanks to the Lord","2:39":"they returned into Galilee","2:40":"and was becoming strong in spirit","2:41":"Now his parents went to Jerusalem every year at the feast of the passover.","2:42":"they went up to Jerusalem according to the custom of the feast","2:43":"as they were returning","2:44":"they went a day's journey","2:45":"they returned to Jerusalem","2:46":"sitting in the midst of the teachers","2:47":"And all that heard him were astonished at his understanding and answers.","2:48":"they were astonished","2:49":"Why were you looking for me?  Didn't you know that I must be in my Father's house?","2:50":"And they understood not the saying which he spake unto them.","2:51":"and came to Nazareth. He was subject to them","2:52":"and in favor with God and men.","3:1":"Pontius Pilate being governor of Judea","3:2":"the word of God came to John","3:3":"preaching the baptism of repentance for remission of sins.","3:4":"The voice of one crying in the wilderness, 'Make ready the way of the Lord.  Make his paths straight.,As it is written in the book of the words of Esaias the prophet, saying, The voice of one crying in the wilderness, Prepare ye the way of the Lord, make his paths straight.,,,,,,,,","3:5":"and the rough ways smooth.","3:6":"","3:7":"You offspring of vipers, who warned you to flee from the wrath to come?,Then said he to the multitude that came forth to be baptized of him, O generation of vipers, who hath warned you to flee from the wrath to come?,,,,,,,,","3:8":"and don't begin to say among yourselves","3:9":"and thrown into the fire.,And now also the axe is laid unto the root of the trees: every tree therefore which bringeth not forth good fruit is hewn down, and cast into the fire.,,,,,,,,","3:10":"What then must we do?","3:11":"He who has two coats, let him give to him who has none.  He who has food, let him do likewise.","3:12":"and they said to him","3:13":"Collect no more than that which is appointed to you.","3:14":"saying","3:15":"and all men reasoned in their hearts concerning John","3:16":"I indeed baptize you with water, but he comes who is mightier than I, the latchet of whose sandals I am not worthy to loosen.  He will baptize you in the Holy Spirit and fire,,John answered, saying unto them all, I indeed baptize you with water; but one mightier than I cometh, the latchet of whose shoes I am not worthy to unloose: he shall baptize you with the Holy Ghost and with fire:,,,,,,,,","3:17":"and he will thoroughly cleanse his threshing floor","3:18":"","3:19":"being reproved by him for Herodias","3:20":"that he shut up John in prison.","3:21":"when all the people were baptized","3:22":"saying You are my beloved Son. In you I am well pleased.","3:23":"when he began to teach","3:24":"the son of Levi","3:25":"the son of Amos","3:26":"the son of Mattathias","3:27":"the son of Rhesa","3:28":"the son of Addi","3:29":"the son of Eliezer","3:30":"the son of Judah","3:31":"the son of Menan","3:32":"the son of Obed","3:33":"the son of Aram","3:34":"the son of Isaac","3:35":"the son of Reu","3:36":"the son of Arphaxad","3:37":"the son of Enoch","3:38":"the son of Seth","4:1":"full of the Holy Spirit","4:2":"being tempted by the devil.  He ate nothing in those days.  Afterward","4:3":"If you are the Son of God, command this stone to become bread.","4:4":"saying","4:5":"leading him up on a high mountain","4:6":"I will give you all this authority, and their glory, for it has been delivered to me; and I give it to whomever I want.,And the devil said unto him, All this power will I give thee, and the glory of them: for that is delivered unto me; and to whomsoever I will I give it.,,,,,,,,","4:7":"it will all be yours.,If thou therefore wilt worship me, all shall be thine.,,,,,,,,","4:8":"Get behind me Satan!  For it is written, 'You shall worship the Lord your God, and him only shall you serve.'{Deuteronomy 6:13}","4:9":"and set him on the pinnacle of the temple","4:10":"'He will give his angels charge concerning you","4:11":"'On their hands they will bear you up","4:12":"said to him","4:13":"he departed from him until another time.","4:14":"and news about him spread through all the surrounding area.","4:15":"being glorified by all.","4:16":"where he had been brought up.  He entered","4:17":"and found the place where it was written","4:18":"","4:19":"","4:20":"gave it back to the attendant","4:21":"Today, this Scripture has been fulfilled in your hearing.","4:22":"and wondered at the gracious words which proceeded out of his mouth","4:23":"Doubtless you will tell me this parable, 'Physician, heal yourself!  Whatever we have heard done at Capernaum, do also here in your hometown.'","4:24":"Most certainly I tell you, no prophet is acceptable in his hometown.,And he said, Verily I say unto you, No prophet is accepted in his own country.,,,,,,,,","4:25":"there were many widows in Israel in the days of Elijah","4:26":"except to Zarephath","4:27":"yet not one of them was cleansed","4:28":"as they heard these things.","4:29":"threw him out of the city","4:30":"passing through the midst of them","4:31":"a city of Galilee.  He was teaching them on the Sabbath day","4:32":"for his word was with authority.","4:33":"and he cried out with a loud voice","4:34":"Ah! what have we to do with you, Jesus of Nazareth? Have you come to destroy us?  I know you who you are: the Holy One of God!","4:35":"saying","4:36":"and they spoke together","4:37":"And the fame of him went out into every place of the country round about.","4:38":"and entered into Simon's house. Simon's mother-in-law was afflicted with a great fever","4:39":"and rebuked the fever; and it left her. Immediately she rose up and served them.","4:40":"all those who had any sick with various diseases brought them to him; and he laid his hands on every one of them","4:41":"crying out","4:42":"he departed and went into an uninhabited place","4:43":"I must preach the good news of the Kingdom of God to the other cities also.  For this reason I have been sent.","4:44":"And he preached in the synagogues of Galilee.","5:1":"while the multitude pressed on him and heard the word of God","5:2":"but the fishermen had gone out of them","5:3":"which was Simon's","5:4":"he said to Simon","5:5":"Master, we worked all night, and took nothing; but at your word I will let down the net.","5:6":"they caught a great multitude of fish","5:7":"that they should come and help them.  They came","5:8":"when he saw it","5:9":"and all who were with him","5:10":"sons of Zebedee","5:11":"they left everything","5:12":"while he was in one of the cities","5:13":"and touched him","5:14":"But go your way, and show yourself to the priest, and offer for your cleansing according to what Moses commanded, for a testimony to them.","5:15":"and great multitudes came together to hear","5:16":"and prayed.","5:17":"that he was teaching; and there were Pharisees and teachers of the law sitting by","5:18":"men brought a paralyzed man on a cot","5:19":"they went up to the housetop","5:20":"he said to him","5:21":"saying","5:22":"perceiving their thoughts","5:23":"'Your sins are forgiven you;' or to say","5:24":"arise","5:25":"and took up that which he was laying on","5:26":"and they glorified God. They were filled with fear","5:27":"and saw a tax collector named Levi sitting at the tax office","5:28":"and rose up and followed him.","5:29":"And Levi made him a great feast in his own house: and there was a great company of publicans and of others that sat down with them.","5:30":"saying","5:31":"Those who are healthy have no need for a physician, but those who are sick do.,And Jesus answering said unto them, They that are whole need not a physician; but they that are sick.,,,,,,,,","5:32":"but sinners to repentance.,I came not to call the righteous, but sinners to repentance.,,,,,,,,","5:33":"Why do John's disciples often fast and pray, likewise also the disciples of the Pharisees, but yours eat and drink?","5:34":"Can you make the friends of the bridegroom fast, while the bridegroom is with them?,And he said unto them, Can ye make the children of the bridechamber fast, while the bridegroom is with them?,,,,,,,,","5:35":"","5:36":"","5:37":"or else the new wine will burst the skins","5:38":"and both are preserved.","5:39":"for he says","6:1":"that he was going through the grain fields.  His disciples plucked the heads of grain","6:2":"Why do you do that which is not lawful to do on the Sabbath day?","6:3":"answering them","6:4":"and took and ate the show bread","6:5":"The Son of Man is lord of the Sabbath.","6:6":"and his right hand was withered.","6:7":"to see whether he would heal on the Sabbath","6:8":"Rise up, and stand in the middle. He arose and stood.","6:9":"I will ask you something: Is it lawful on the Sabbath to do good, or to do harm? To save a life, or to kill?","6:10":"and said to the man","6:11":"and talked with one another about what they might do to Jesus.","6:12":"that he went out to the mountain to pray","6:13":"he called his disciples","6:14":"whom he also named Peter; Andrew","6:15":"the son of Alphaeus; Simon","6:16":"who also became a traitor.","6:17":"and stood on a level place","6:18":"and they were being healed.","6:19":"for power came out from him and healed them all.","6:20":"and said","6:21":"for you will be filled. Blessed are you who weep now","6:22":"and when they shall exclude and mock you","6:23":"and leap for joy","6:24":"","6:25":"you who are full now","6:26":"{TR adds to you} when{TR adds all} men speak well of you","6:27":"","6:28":"and pray for those who mistreat you.","6:29":"offer also the other; and from him who takes away your cloak","6:30":"and don't ask him who takes away your goods to give them back again.","6:31":"","6:32":"what credit is that to you? For even sinners love those who love them.","6:33":"what credit is that to you?  For even sinners do the same.","6:34":"what credit is that to you?  Even sinners lend to sinners","6:35":"and do good","6:36":"even as your Father is also merciful.","6:37":"and you won't be judged.  Don't condemn","6:38":"Give","6:39":"","6:40":"but everyone when he is fully trained will be like his teacher.","6:41":"but don't consider the beam that is in your own eye?","6:42":"'Brother","6:43":"For a good tree bringeth not forth corrupt fruit; neither doth a corrupt tree bring forth good fruit.","6:44":"nor do they gather grapes from a bramble bush.","6:45":"and the evil man out of the evil treasure of his heart brings out that which is evil","6:46":"","6:47":"and hears my words","6:48":"who dug and went deep","6:49":"and doesn't do","7:1":"he entered into Capernaum.","7:2":"who was dear to him","7:3":"he sent to him elders of the Jews","7:4":"they begged him earnestly","7:5":"and he built our synagogue for us.,For he loveth our nation, and he hath built us a synagogue.,,,,,,,,","7:6":"the centurion sent friends to him","7:7":"and my servant will be healed.","7:8":"having under myself soldiers.  I tell this one","7:9":"he marveled at him","7:10":"returning to the house","7:11":"that he went to a city called Nain. Many of his disciples","7:12":"behold","7:13":"he had compassion on her","7:14":"and the bearers stood still. He said","7:15":"and began to speak.  And he gave him to his mother.","7:16":"and they glorified God","7:17":"and in all the surrounding region.","7:18":"And the disciples of John shewed him of all these things.","7:19":"calling to himself two of his disciples","7:20":"they said","7:21":"And in that same hour he cured many of their infirmities and plagues","7:22":"Go and tell John the things which you have seen and heard:  that the blind receive their sight, the lame walk, the lepers are cleansed, the deaf hear, the dead are raised up, and the poor have good news preached to them.,Then Jesus answering said unto them, Go your way, and tell John what things ye have seen and heard; how that the blind see, the lame walk, the lepers are cleansed, the deaf hear, the dead are raised, to the poor the gospel is preached.,,,,,,,,","7:23":"","7:24":"he began to tell the multitudes about John","7:25":"those who are gorgeously dressed","7:26":"I tell you","7:27":"'Behold","7:28":"For I say unto you","7:29":"they declared God to be just","7:30":"not being baptized by him themselves.","7:31":"{So reads TR.  MT omits But the Lord said,} To what then will I liken the people of this generation? What are they like?,And the Lord said, Whereunto then shall I liken the men of this generation? and to what are they like?,,,,,,,,","7:32":"and call one to another","7:33":"and you say","7:34":"and you say","7:35":"","7:36":"and sat at the table.","7:37":"a woman in the city who was a sinner","7:38":"she began to wet his feet with her tears","7:39":"he said to himself","7:40":"Simon, I have something to tell you. He said","7:41":"","7:42":"he forgave them both.  Which of them therefore will love him most?,And when they had nothing to pay, he frankly forgave them both. Tell me therefore, which of them will love him most?,,,,,,,,","7:43":"He, I suppose, to whom he forgave the most. He said to him","7:44":"he said to Simon","7:45":"but she","7:46":"but she has anointed my feet with ointment.","7:47":"her sins","7:48":"Your sins are forgiven.","7:49":"Who is this who even forgives sins?","7:50":"Your faith has saved you. Go in peace.","8:1":"that he went about through cities and villages","8:2":"from whom seven demons had gone out;","8:3":"the wife of Chuzas","8:4":"and people from every city were coming to him","8:5":"","8:6":"and as soon as it grew","8:7":"and the thorns grew with it","8:8":"and grew","8:9":"What does this parable mean?","8:10":"To you it is given to know the mysteries of the Kingdom of God, but to the rest in parables; that 'seeing they may not see, and hearing they may not understand.'{Isaiah 6:9},And he said, Unto you it is given to know the mysteries of the kingdom of God: but to others in parables; that seeing they might not see, and hearing they might not understand.,,,,,,,,","8:11":"Now the parable is this: The seed is the word of God.","8:12":"then the devil comes","8:13":"when they hear","8:14":"these are those who have heard","8:15":"these are such as in an honest and good heart","8:16":"","8:17":"that will not be revealed; nor anything secret","8:18":"to him will be given; and whoever doesn't have","8:19":"and they could not come near him for the crowd.","8:20":"Your mother and your brothers stand outside, desiring to see you.","8:21":"My mother and my brothers are these who hear the word of God, and do it.","8:22":"that he entered into a boat","8:23":"he fell asleep.  A wind storm came down on the lake","8:24":"and awoke him","8:25":"Where is your faith?  Being afraid they marveled","8:26":"which is opposite Galilee.","8:27":"a certain man out of the city who had demons for a long time met him.  He wore no clothes","8:28":"he cried out","8:29":"and bound with chains and fetters. Breaking the bands apart","8:30":"What is your name?  He said","8:31":"And they besought him that he would not command them to go out into the deep.","8:32":"and they begged him that he would allow them to enter into those. He allowed them.","8:33":"and entered into the pigs","8:34":"they fled","8:35":"and found the man from whom the demons had gone out","8:36":"They also which saw it told them by what means he that was possessed of the devils was healed.","8:37":"for they were very much afraid. He entered into the boat","8:38":"but Jesus sent him away","8:39":"proclaiming throughout the whole city what great things Jesus had done for him.","8:40":"when Jesus returned","8:41":"there came a man named Jairus","8:42":"about twelve years of age","8:43":"who had spent all her living on physicians","8:44":"and touched the fringe{or","8:45":"Who touched me?  When all denied it","8:46":"Someone did touch me, for I perceived that power has gone out of me.","8:47":"she came trembling","8:48":"Daughter, cheer up.  Your faith has made you well. Go in peace.","8:49":"one from the ruler of the synagogue's house came","8:50":"answered him","8:51":"he didn't allow anyone to enter in","8:52":"but he said","8:53":"knowing that she was dead.","8:54":"and taking her by the hand","8:55":"and she rose up immediately. He commanded that something be given to her to eat.","8:56":"but he charged them to tell no one what had been done.","9:1":"and gave them power and authority over all demons","9:2":"and to heal the sick.","9:3":"Take nothing for your journey--neither staffs, nor wallet, nor bread, nor money; neither have two coats apiece.,And he said unto them, Take nothing for your journey, neither staves, nor scrip, neither bread, neither money; neither have two coats apiece.,,,,,,,,","9:4":"stay there","9:5":"when you depart from that city","9:6":"and went throughout the villages","9:7":"because it was said by some that John had risen from the dead","9:8":"and by others that one of the old prophets had risen again.","9:9":"John I beheaded, but who is this, about whom I hear such things?  He sought to see him.","9:10":"when they had returned","9:11":"perceiving it","9:12":"and said to him","9:13":"You give them something to eat. They said","9:14":"Make them sit down in groups of about fifty each.","9:15":"and made them all sit down.","9:16":"and looking up to the sky","9:17":"and were all filled.  They gathered up twelve baskets of broken pieces that were left over.","9:18":"as he was praying alone","9:19":"'John the Baptizer,' but others say, 'Elijah,' and others, that one of the old prophets is risen again.","9:20":"But who do you say that I am? Peter answered","9:21":"and commanded them to tell this to no one","9:22":"The Son of Man must suffer many things, and be rejected by the elders, chief priests, and scribes, and be killed, and the third day be raised up.","9:23":"If anyone desires to come after me, let him deny himself, take up his cross,{TR, NU add daily} and follow me.,And he said to them all, If any man will come after me, let him deny himself, and take up his cross daily, and follow me.,,,,,,,,","9:24":"but whoever will lose his life for my sake","9:25":"and loses or forfeits his own self?","9:26":"of him will the Son of Man be ashamed","9:27":"who will in no way taste of death","9:28":"that he took with him Peter","9:29":"the appearance of his face was altered","9:30":"two men were talking with him","9:31":"and spoke of his departure","9:32":"but when they were fully awake","9:33":"as they were parting from him","9:34":"a cloud came and overshadowed them","9:35":"saying","9:36":"Jesus was found alone.  They were silent","9:37":"when they had come down from the mountain","9:38":"a man from the crowd called out","9:39":"a spirit takes him","9:40":"and they couldn't.,And I besought thy disciples to cast him out; and they could not.,,,,,,,,","9:41":"Faithless and perverse generation, how long shall I be with you and bear with you? Bring your son here.","9:42":"the demon threw him down and convulsed him violently.  But Jesus rebuked the unclean spirit","9:43":"he said to his disciples","9:44":"Let these sayings sink down into your ears: for the Son of man shall be delivered into the hands of men.","9:45":"that they should not perceive it","9:46":"Then there arose a reasoning among them","9:47":"perceiving the reasoning of their hearts","9:48":"Whoever receives this little child in my name receives me.  Whoever receives me receives him who sent me. For whoever is least among you all, this one will be great.","9:49":"Master, we saw someone casting out demons in your name, and we forbade him, because he doesn't follow with us.","9:50":"Don't forbid him, for he who is not against us is for us.","9:51":"when the days were near that he should be taken up","9:52":"and entered into a village of the Samaritans","9:53":"because he was traveling with his face set towards Jerusalem.","9:54":"James and John","9:55":"You don't know of what kind of spirit you are.,But he turned, and rebuked them, and said, Ye know not what manner of spirit ye are of.,,,,,,,,","9:56":"but to save them.  They went to another village.,For the Son of man is not come to destroy men's lives, but to save them. And they went to another village.,,,,,,,,","9:57":"a certain man said to him","9:58":"The foxes have holes, and the birds of the sky have nests, but the Son of Man has no place to lay his head.","9:59":"Follow me!  But he said","9:60":"Leave the dead to bury their own dead, but you go and announce the Kingdom of God.","9:61":"I want to follow you, Lord, but first allow me to bid farewell to those who are at my house.","9:62":"No one, having put his hand to the plow, and looking back, is fit for the Kingdom of God.","10:1":"the Lord also appointed seventy others","10:2":"The harvest is indeed plentiful, but the laborers are few.  Pray therefore to the Lord of the harvest, that he may send out laborers into his harvest.,Therefore said he unto them, The harvest truly is great, but the labourers are few: pray ye therefore the Lord of the harvest, that he would send forth labourers into his harvest.,,,,,,,,","10:3":"I send you out as lambs among wolves.","10:4":"nor wallet","10:5":"first say","10:6":"your peace will rest on him; but if not","10:7":"eating and drinking the things they give","10:8":"and they receive you","10:9":"and tell them","10:10":"and they don't receive you","10:11":"we wipe off against you.  Nevertheless know this","10:12":"it will be more tolerable in that day for Sodom than for that city.","10:13":"","10:14":"But it shall be more tolerable for Tyre and Sidon at the judgment","10:15":"Capernaum","10:16":"and whoever rejects you rejects me.  Whoever rejects me rejects him who sent me.,He that heareth you heareth me; and he that despiseth you despiseth me; and he that despiseth me despiseth him that sent me.,,,,,,,,","10:17":"saying","10:18":"I saw Satan having fallen like lightning from heaven.,And he said unto them, I beheld Satan as lightning fall from heaven.,,,,,,,,","10:19":"I give you authority to tread on serpents and scorpions","10:20":"don't rejoice in this","10:21":"and said","10:22":"he said","10:23":"he said privately","10:24":"and didn't see them","10:25":"a certain lawyer stood up and tested him","10:26":"What is written in the law?  How do you read it?","10:27":"You shall love the Lord your God with all your heart, with all your soul, with all your strength, and with all your mind;{Deuteronomy 6:5} and your neighbor as yourself.{Leviticus 19:18}","10:28":"You have answered correctly.  Do this, and you will live.","10:29":"desiring to justify himself","10:30":"A certain man was going down from Jerusalem to Jericho, and he fell among robbers, who both stripped him and beat him, and departed, leaving him half dead.,And Jesus answering said, A certain man went down from Jerusalem to Jericho, and fell among thieves, which stripped him of his raiment, and wounded him, and departed, leaving him half dead.,,,,,,,,","10:31":"he passed by on the other side.","10:32":"when he came to the place","10:33":"as he traveled","10:34":"and bound up his wounds","10:35":"when he departed","10:36":"","10:37":"He who showed mercy on him.  Then Jesus said to him","10:38":"he entered into a certain village","10:39":"who also sat at Jesus' feet","10:40":"and she came up to him","10:41":"Martha, Martha, you are anxious and troubled about many things,,And Jesus answered and said unto her, Martha, Martha, thou art careful and troubled about many things:,,,,,,,,","10:42":"which will not be taken away from her.,But one thing is needful: and Mary hath chosen that good part, which shall not be taken away from her.,,,,,,,,","11:1":"that when he finished praying in a certain place","11:2":"When you pray, say, 'Our Father in heaven, may your name be kept holy.  May your Kingdom come. May your will be done on Earth, as it is in heaven.,And he said unto them, When ye pray, say, Our Father which art in heaven, Hallowed be thy name. Thy kingdom come. Thy will be done, as in heaven, so in earth.,,,,,,,,","11:3":"Give us day by day our daily bread.","11:4":"for we ourselves also forgive everyone who is indebted to us.  Bring us not into temptation","11:5":"Which of you, if you go to a friend at midnight, and tell him, 'Friend, lend me three loaves of bread,,And he said unto them, Which of you shall have a friend, and shall go unto him at midnight, and say unto him, Friend, lend me three loaves;,,,,,,,,","11:6":"and I have nothing to set before him","11:7":"'Don't bother me. The door is now shut","11:8":"although he will not rise and give it to him because he is his friend","11:9":"","11:10":"For every one that asketh receiveth; and he that seeketh findeth; and to him that knocketh it shall be opened.","11:11":"","11:12":"he won't give him a scorpion","11:13":"being evil","11:14":"and it was mute. It happened","11:15":"He casts out demons by Beelzebul, the prince of the demons.","11:16":"testing him","11:17":"knowing their thoughts","11:18":"how will his kingdom stand? For you say that I cast out demons by Beelzebul.","11:19":"by whom do your children cast them out?  Therefore will they be your judges.","11:20":"then the Kingdom of God has come to you.","11:21":"","11:22":"he takes from him his whole armor in which he trusted","11:23":"","11:24":"when he has gone out of the man","11:25":"he finds it swept and put in order.","11:26":"and takes seven other spirits more evil than himself","11:27":"as he said these things","11:28":"On the contrary, blessed are those who hear the word of God, and keep it.","11:29":"he began to say","11:30":"so will also the Son of Man be to this generation.","11:31":"and will condemn them: for she came from the ends of the earth to hear the wisdom of Solomon; and behold","11:32":"and will condemn it:  for they repented at the preaching of Jonah","11:33":"","11:34":"your whole body is also full of light; but when it is evil","11:35":"Take heed therefore that the light which is in thee be not darkness.","11:36":"having no part dark","11:37":"a certain Pharisee asked him to dine with him. He went in","11:38":"he marveled that he had not first washed himself before dinner.","11:39":"Now you Pharisees cleanse the outside of the cup and of the platter, but your inward part is full of extortion and wickedness.,And the Lord said unto him, Now do ye Pharisees make clean the outside of the cup and the platter; but your inward part is full of ravening and wickedness.,,,,,,,,","11:40":"didn't he who made the outside make the inside also?","11:41":"and behold","11:42":"but you bypass justice and the love of God. You ought to have done these","11:43":"and the greetings in the marketplaces.","11:44":"scribes and Pharisees","11:45":"Teacher, in saying this you insult us also.","11:46":"Woe to you lawyers also!  For you load men with burdens that are difficult to carry, and you yourselves won't even lift one finger to help carry those burdens.,And he said, Woe unto you also, ye lawyers! for ye lade men with burdens grievous to be borne, and ye yourselves touch not the burdens with one of your fingers.,,,,,,,,","11:47":"and your fathers killed them.","11:48":"and you build their tombs.","11:49":"'I will send to them prophets and apostles; and some of them they will kill and persecute","11:50":"which was shed from the foundation of the world","11:51":"who perished between the altar and the sanctuary.'  Yes","11:52":"and those who were entering in","11:53":"the scribes and the Pharisees began to be terribly angry","11:54":"and seeking to catch him in something he might say","12:1":"when a multitude of many thousands had gathered together","12:2":"that will not be revealed","12:3":"Therefore whatsoever ye have spoken in darkness shall be heard in the light; and that which ye have spoken in the ear in closets shall be proclaimed upon the housetops.","12:4":"","12:5":"who after he has killed","12:6":"","12:7":"But even the very hairs of your head are all numbered. Fear not therefore: ye are of more value than many sparrows.","12:8":"","12:9":"But he that denieth me before men shall be denied before the angels of God.","12:10":"but those who blaspheme against the Holy Spirit will not be forgiven.","12:11":"the rulers","12:12":"","12:13":"Teacher, tell my brother to divide the inheritance with me.","12:14":"Man, who made me a judge or an arbitrator over you?","12:15":"Beware!  Keep yourselves from covetousness, for a man's life doesn't consist of the abundance of the things which he possesses.","12:16":"saying","12:17":"saying","12:18":"'This is what I will do.  I will pull down my barns","12:19":"Soul, you have many goods laid up for many years.  Take your ease, eat, drink, be merry.'","12:20":"","12:21":"and is not rich toward God.,So is he that layeth up treasure for himself, and is not rich toward God.,,,,,,,,","12:22":"Therefore I tell you, don't be anxious for your life, what you will eat, nor yet for your body, what you will wear.,And he said unto his disciples, Therefore I say unto you, Take no thought for your life, what ye shall eat; neither for the body, what ye shall put on.,,,,,,,,","12:23":"and the body is more than clothing.","12:24":"they don't reap","12:25":"And which of you with taking thought can add to his stature one cubit?","12:26":"why are you anxious about the rest?","12:27":"how they grow.  They don't toil","12:28":"which today exists","12:29":"And seek not ye what ye shall eat","12:30":"but your Father knows that you need these things.","12:31":"and all these things will be added to you.","12:32":"little flock","12:33":"and give gifts to the needy. Make for yourselves purses which don't grow old","12:34":"there will your heart be also.","12:35":"","12:36":"when he returns from the marriage feast; that","12:37":"whom the lord will find watching when he comes.  Most certainly I tell you","12:38":"and finds them so.","12:39":"that if the master of the house had known in what hour the thief was coming","12:40":"for the Son of Man is coming in an hour that you don't expect him.,Be ye therefore ready also: for the Son of man cometh at an hour when ye think not.,,,,,,,,","12:41":"Lord, are you telling this parable to us, or to everybody?","12:42":"Who then is the faithful and wise steward, whom his lord will set over his household, to give them their portion of food at the right times?,And the Lord said, Who then is that faithful and wise steward, whom his lord shall make ruler over his household, to give them their portion of meat in due season?,,,,,,,,","12:43":"Blessed is that servant","12:44":"that he will set him over all that he has.","12:45":"'My lord delays his coming","12:46":"and in an hour that he doesn't know","12:47":"who knew his lord's will","12:48":"and did things worthy of stripes","12:49":"","12:50":"and how distressed I am until it is accomplished!","12:51":"no","12:52":"there will be five in one house divided","12:53":"father against son","12:54":"When you see a cloud rising from the west, immediately you say, 'A shower is coming,' and so it happens.,And he said also to the people, When ye see a cloud rise out of the west, straightway ye say, There cometh a shower; and so it is.,,,,,,,,","12:55":"you say","12:56":"but how is it that you don't interpret this time?","12:57":"Yea","12:58":"try diligently on the way to be released from him","12:59":"you will by no means get out of there","13:1":"whose blood Pilate had mixed with their sacrifices.","13:2":"Do you think that these Galileans were worse sinners than all the other Galileans, because they suffered such things?,And Jesus answering said unto them, Suppose ye that these Galilaeans were sinners above all the Galilaeans, because they suffered such things?,,,,,,,,","13:3":"no","13:4":"on whom the tower in Siloam fell","13:5":"no","13:6":"","13:7":"'Behold","13:8":"'Lord","13:9":"fine; but if not","13:10":"And he was teaching in one of the synagogues on the sabbath.","13:11":"there was a woman who had a spirit of infirmity eighteen years","13:12":"he called her","13:13":"and immediately she stood up straight","13:14":"being indignant because Jesus had healed on the Sabbath","13:15":"You hypocrites! Doesn't each one of you free his ox or his donkey from the stall on the Sabbath, and lead him away to water?,The Lord then answered him, and said, Thou hypocrite, doth not each one of you on the sabbath loose his ox or his ass from the stall, and lead him away to watering?,,,,,,,,","13:16":"being a daughter of Abraham","13:17":"all his adversaries were disappointed","13:18":"What is the Kingdom of God like?  To what shall I compare it?,Then said he, Unto what is the kingdom of God like? and whereunto shall I resemble it?,,,,,,,,","13:19":"which a man took","13:20":"To what shall I compare the Kingdom of God?,And again he said, Whereunto shall I liken the kingdom of God?,,,,,,,,","13:21":"which a woman took and hid in three measures{literally","13:22":"teaching","13:23":"Lord, are they few who are saved? He said to them","13:24":"","13:25":"and has shut the door","13:26":"'We ate and drank in your presence","13:27":"'I tell you","13:28":"when you see Abraham","13:29":"west","13:30":"there are some who are last who will be first","13:31":"some Pharisees came","13:32":"Go and tell that fox, 'Behold, I cast out demons and perform cures today and tomorrow, and the third day I complete my mission.,And he said unto them, Go ye, and tell that fox, Behold, I cast out devils, and I do cures to day and to morrow, and the third day I shall be perfected.,,,,,,,,","13:33":"for it can't be that a prophet perish outside of Jerusalem.'","13:34":"","13:35":"your house is left to you desolate.  I tell you","14:1":"when he went into the house of one of the rulers of the Pharisees on a Sabbath to eat bread","14:2":"a certain man who had dropsy was in front of him.","14:3":"answering","14:4":"and healed him","14:5":"Which of you, if your son{TR reads donkey instead of son} or an ox fell into a well, wouldn't immediately pull him out on a Sabbath day?","14:6":"And they could not answer him again to these things.","14:7":"when he noticed how they chose the best seats","14:8":"","14:9":"'Make room for this person.'  Then you would begin","14:10":"go and sit in the lowest place","14:11":"and whoever humbles himself will be exalted.,For whosoever exalteth himself shall be abased; and he that humbleth himself shall be exalted.,,,,,,,,","14:12":"When you make a dinner or a supper, don't call your friends, nor your brothers, nor your kinsmen, nor rich neighbors, or perhaps they might also return the favor, and pay you back.,Then said he also to him that bade him, When thou makest a dinner or a supper, call not thy friends, nor thy brethren, neither thy kinsmen, nor thy rich neighbours; lest they also bid thee again, and a recompence be made thee.,,,,,,,,","14:13":"ask the poor","14:14":"because they don't have the resources to repay you.  For you will be repaid in the resurrection of the righteous.,And thou shalt be blessed; for they cannot recompense thee: for thou shalt be recompensed at the resurrection of the just.,,,,,,,,","14:15":"he said to him","14:16":"A certain man made a great supper, and he invited many people.,Then said he unto him, A certain man made a great supper, and bade many:,,,,,,,,","14:17":"'Come","14:18":"","14:19":"","14:20":"","14:21":"","14:22":"","14:23":"","14:24":"","14:25":"","14:26":"","14:27":"and come after me","14:28":"desiring to build a tower","14:29":"when he has laid a foundation","14:30":"'This man began to build","14:31":"as he goes to encounter another king in war","14:32":"while the other is yet a great way off","14:33":"he can't be my disciple.","14:34":"but if the salt becomes flat and tasteless","14:35":"let him hear.,It is neither fit for the land, nor yet for the dunghill; but men cast it out. He that hath ears to hear, let him hear.,,,,,,,,","15:1":"Then drew near unto him all the publicans and sinners for to hear him.","15:2":"saying","15:3":"And he spake this parable unto them","15:4":"","15:5":"he carries it on his shoulders","15:6":"he calls together his friends and his neighbors","15:7":"than over ninety-nine righteous people who need no repentance.","15:8":"if she had ten drachma{A drachma coin was worth about 2 days wages for an agricultural laborer.} coins","15:9":"she calls together her friends and neighbors","15:10":"I tell you","15:11":"A certain man had two sons.,And he said, A certain man had two sons:,,,,,,,,","15:12":"'Father","15:13":"the younger son gathered all of this together and traveled into a far country.  There he wasted his property with riotous living.","15:14":"there arose a severe famine in that country","15:15":"and he sent him into his fields to feed pigs.","15:16":"but no one gave him any.","15:17":"'How many hired servants of my father's have bread enough to spare","15:18":"and will tell him","15:19":"","15:20":"","15:21":"'Father","15:22":"","15:23":"kill it","15:24":"my son","15:25":"","15:26":"and asked what was going on.","15:27":"'Your brother has come","15:28":"and would not go in.  Therefore his father came out","15:29":"'Behold","15:30":"your son","15:31":"","15:32":"for this","16:1":"There was a certain rich man who had a manager.  An accusation was made to him that this man was wasting his possessions.,And he said also unto his disciples, There was a certain rich man, which had a steward; and the same was accused unto him that he had wasted his goods.,,,,,,,,","16:2":"and said to him","16:3":"","16:4":"so that when I am removed from management","16:5":"he said to the first","16:6":"'A hundred batos{100 batos is about 395 litres","16:7":"'How much do you owe?'  He said","16:8":"","16:9":"make for yourselves friends by means of unrighteous mammon","16:10":"He that is faithful in that which is least is faithful also in much: and he that is unjust in the least is unjust also in much.","16:11":"who will commit to your trust the true riches?","16:12":"who will give you that which is your own?","16:13":"for either he will hate the one","16:14":"who were lovers of money","16:15":"You are those who justify yourselves in the sight of men, but God knows your hearts. For that which is exalted among men is an abomination in the sight of God.,And he said unto them, Ye are they which justify yourselves before men; but God knoweth your hearts: for that which is highly esteemed among men is abomination in the sight of God.,,,,,,,,","16:16":"and everyone is forcing his way into it.","16:17":"than for one tiny stroke of a pen in the law to fall.","16:18":"and marries another","16:19":"","16:20":"named Lazarus","16:21":"even the dogs came and licked his sores.","16:22":"and that he was carried away by the angels to Abraham's bosom.  The rich man also died","16:23":"Hell}","16:24":"'Father Abraham","16:25":"","16:26":"between us and you there is a great gulf fixed","16:27":"","16:28":"that he may testify to them","16:29":"","16:30":"","16:31":"And he said unto him","17:1":"It is impossible that no occasions of stumbling should come, but woe to him through whom they come!,Then said he unto the disciples, It is impossible but that offences will come: but woe unto him, through whom they come!,,,,,,,,","17:2":"and he were thrown into the sea","17:3":"rebuke him. If he repents","17:4":"and seven times returns","17:5":"Increase our faith.","17:6":"If you had faith like a grain of mustard seed, you would tell this sycamore tree, 'Be uprooted, and be planted in the sea,' and it would obey you.,And the Lord said, If ye had faith as a grain of mustard seed, ye might say unto this sycamine tree, Be thou plucked up by the root, and be thou planted in the sea; and it should obey you.,,,,,,,,","17:7":"having a servant plowing or keeping sheep","17:8":"'Prepare my supper","17:9":"Doth he thank that servant because he did the things that were commanded him? I trow not.","17:10":"when you have done all the things that are commanded you","17:11":"that he was passing along the borders of Samaria and Galilee.","17:12":"ten men who were lepers met him","17:13":"saying","17:14":"he said to them","17:15":"when he saw that he was healed","17:16":"giving him thanks; and he was a Samaritan.","17:17":"Weren't the ten cleansed?  But where are the nine?,And Jesus answering said, Were there not ten cleansed? but where are the nine?,,,,,,,,","17:18":"except this stranger?,There are not found that returned to give glory to God, save this stranger.,,,,,,,,","17:19":"Get up, and go your way.  Your faith has healed you.","17:20":"he answered them","17:21":"'Look","17:22":"The days will come, when you will desire to see one of the days of the Son of Man, and you will not see it.,And he said unto the disciples, The days will come, when ye shall desire to see one of the days of the Son of man, and ye shall not see it.,,,,,,,,","17:23":"'Look","17:24":"when it flashes out of the one part under the sky","17:25":"he must suffer many things and be rejected by this generation.","17:26":"even so will it be also in the days of the Son of Man.","17:27":"they drank","17:28":"even as it happened in the days of Lot:  they ate","17:29":"it rained fire and sulfur from the sky","17:30":"Even thus shall it be in the day when the Son of man is revealed.","17:31":"he who will be on the housetop","17:32":"Remember Lot's wife.","17:33":"but whoever loses his life preserves it.","17:34":"in that night there will be two people in one bed. The one will be taken","17:35":"and the other will be left.,Two women shall be grinding together; the one shall be taken, and the other left.,,,,,,,,","17:36":"Two men shall be in the field; the one shall be taken","17:37":"asked him","18:1":"and not give up","18:2":"There was a judge in a certain city who didn't fear God, and didn't respect man.,Saying, There was in a city a judge, which feared not God, neither regarded man:,,,,,,,,","18:3":"and she often came to him","18:4":"but afterward he said to himself","18:5":"I will defend her","18:6":"Listen to what the unrighteous judge says.,And the Lord said, Hear what the unjust judge saith.,,,,,,,,","18:7":"who are crying out to him day and night","18:8":"when the Son of Man comes","18:9":"and who despised all others.","18:10":"","18:11":"I thank you","18:12":"I fast twice in the week","18:13":"standing far away","18:14":"this man went down to his house justified rather than the other; for everyone who exalts himself will be humbled","18:15":"that he might touch them.  But when the disciples saw it","18:16":"saying","18:17":"I tell you","18:18":"saying","18:19":"Why do you call me good?  No one is good, except one--God.,And Jesus said unto him, Why callest thou me good? none is good, save one, that is, God.,,,,,,,,","18:20":"' 'Don't murder","18:21":"I have observed all these things from my youth up.","18:22":"he said to him","18:23":"he became very sad","18:24":"seeing that he became very sad","18:25":"than for a rich man to enter into the Kingdom of God.,For it is easier for a camel to go through a needle's eye, than for a rich man to enter into the kingdom of God.,,,,,,,,","18:26":"Then who can be saved?","18:27":"The things which are impossible with men are possible with God.","18:28":"Look, we have left everything, and followed you.","18:29":"Most certainly I tell you, there is no one who has left house, or wife, or brothers, or parents, or children, for the Kingdom of God's sake,,And he said unto them, Verily I say unto you, There is no man that hath left house, or parents, or brethren, or wife, or children, for the kingdom of God's sake,,,,,,,,,","18:30":"and in the world to come","18:31":"and said to them","18:32":"will be mocked","18:33":"he will rise again.,And they shall scourge him, and put him to death: and the third day he shall rise again.,,,,,,,,","18:34":"and they didn't understand the things that were said.","18:35":"as he came near Jericho","18:36":"he asked what this meant.","18:37":"And they told him","18:38":"Jesus, you son of David, have mercy on me!","18:39":"that he should be quiet; but he cried out all the more","18:40":"Jesus commanded him to be brought to him. When he had come near","18:41":"Lord, that I may see again.","18:42":"Receive your sight.  Your faith has healed you.","18:43":"and followed him","19:1":"And Jesus entered and passed through Jericho.","19:2":"and he was rich.","19:3":"and couldn't because of the crowd","19:4":"and climbed up into a sycamore tree to see him","19:5":"he looked up and saw him","19:6":"came down","19:7":"they all murmured","19:8":"Behold, Lord, half of my goods I give to the poor.  If I have wrongfully exacted anything of anyone, I restore four times as much.","19:9":"Today, salvation has come to this house, because he also is a son of Abraham.,And Jesus said unto him, This day is salvation come to this house, forsomuch as he also is a son of Abraham.,,,,,,,,","19:10":"","19:11":"he went on and told a parable","19:12":"A certain nobleman went into a far country to receive for himself a kingdom, and to return.,He said therefore, A certain nobleman went into a far country to receive for himself a kingdom, and to return.,,,,,,,,","19:13":"and gave them ten mina coins","19:14":"and sent an envoy after him","19:15":"","19:16":"saying","19:17":"","19:18":"","19:19":"","19:20":"saying","19:21":"because you are an exacting man. You take up that which you didn't lay down","19:22":"","19:23":"and at my coming","19:24":"'Take the mina away from him","19:25":"","19:26":"will more be given; but from him who doesn't have","19:27":"and kill them before me.',But those mine enemies, which would not that I should reign over them, bring hither, and slay them before me.,,,,,,,,","19:28":"he went on ahead","19:29":"when he drew near to Bethsphage{TR","19:30":"Go your way into the village on the other side, in which, as you enter, you will find a colt tied, whereon no man ever yet sat.  Untie it, and bring it.,Saying, Go ye into the village over against you; in the which at your entering ye shall find a colt tied, whereon yet never man sat: loose him, and bring him hither.,,,,,,,,","19:31":"'Why are you untying it?' say to him: 'The Lord needs it.',And if any man ask you, Why do ye loose him? thus shall ye say unto him, Because the Lord hath need of him.,,,,,,,,","19:32":"and found things just as he had told them.","19:33":"the owners of it said to them","19:34":"The Lord needs it.","19:35":"and set Jesus on them.","19:36":"they spread their cloaks in the way.","19:37":"at the descent of the Mount of Olives","19:38":"Blessed is the King who comes in the name of the Lord!{Psalm 118:26} Peace in heaven, and glory in the highest!","19:39":"Teacher, rebuke your disciples!","19:40":"I tell you that if these were silent, the stones would cry out.","19:41":"he saw the city and wept over it","19:42":"If you, even you, had known today the things which belong to your peace!  But now, they are hidden from your eyes.,Saying, If thou hadst known, even thou, at least in this thy day, the things which belong unto thy peace! but now they are hid from thine eyes.,,,,,,,,","19:43":"when your enemies will throw up a barricade against you","19:44":"because you didn't know the time of your visitation.,And shall lay thee even with the ground, and thy children within thee; and they shall not leave in thee one stone upon another; because thou knewest not the time of thy visitation.,,,,,,,,","19:45":"and began to drive out those who bought and sold in it","19:46":"It is written, 'My house is a house of prayer,'{Isaiah 56:7} but you have made it a 'den of robbers'!{Jeremiah 7:11}","19:47":"but the chief priests and the scribes and the leading men among the people sought to destroy him.","19:48":"for all the people hung on to every word that he said.","20:1":"as he was teaching the people in the temple and preaching the Good News","20:2":"Tell us:  by what authority do you do these things? Or who is giving you this authority?","20:3":"I also will ask you one question.  Tell me:,And he answered and said unto them, I will also ask you one thing; and answer me:,,,,,,,,","20:4":"was it from heaven","20:5":"saying","20:6":"'From men","20:7":"And they answered","20:8":"Neither will I tell you by what authority I do these things.","20:9":"","20:10":"he sent a servant to the farmers to collect his share of the fruit of the vineyard. But the farmers beat him","20:11":"and they also beat him","20:12":"and they also wounded him","20:13":"'What shall I do? I will send my beloved son.  It may be that seeing him","20:14":"","20:15":"and killed him. What therefore will the lord of the vineyard do to them?","20:16":"and will give the vineyard to others.  When they heard it, they said, May it never be!,He shall come and destroy these husbandmen, and shall give the vineyard to others. And when they heard it, they said, God forbid.,,,,,,,,","20:17":"and said","20:18":"but it will crush whomever it falls on to dust.,Whosoever shall fall upon that stone shall be broken; but on whomsoever it shall fall, it will grind him to powder.,,,,,,,,","20:19":"but they feared the people--for they knew he had spoken this parable against them.","20:20":"and sent out spies","20:21":"Teacher, we know that you say and teach what is right, and aren't partial to anyone, but truly teach the way of God.,And they asked him, saying, Master, we know that thou sayest and teachest rightly, neither acceptest thou the person of any, but teachest the way of God truly:,,,,,,,,","20:22":"or not?,Is it lawful for us to give tribute unto Caesar, or no?,,,,,,,,","20:23":"and said to them","20:24":"","20:25":"Then give to Caesar the things that are Caesar's, and to God the things that are God's.","20:26":"and were silent.","20:27":"those who deny that there is a resurrection.","20:28":"Teacher, Moses wrote to us that if a man's brother dies having a wife, and he is childless, his brother should take the wife, and raise up children for his brother.,Saying, Master, Moses wrote unto us, If any man's brother die, having a wife, and he die without children, that his brother should take his wife, and raise up seed unto his brother.,,,,,,,,","20:29":"and died childless.","20:30":"and he died childless.","20:31":"and likewise the seven all left no children","20:32":"Last of all the woman died also.","20:33":"","20:34":"The children of this age marry, and are given in marriage.,And Jesus answering said unto them, The children of this world marry, and are given in marriage:,,,,,,,,","20:35":"neither marry","20:36":"for they are like the angels","20:37":"even Moses showed at the bush","20:38":"but of the living","20:39":"Teacher, you speak well.","20:40":"And after that they durst not ask him any question at all.","20:41":"Why do they say that the Christ is David's son?,And he said unto them, How say they that Christ is David's son?,,,,,,,,","20:42":"'The Lord said to my Lord","20:43":"","20:44":"David therefore calleth him Lord","20:45":"he said to his disciples","20:46":"","20:47":"and for a pretense make long prayers: these will receive greater condemnation.,Which devour widows' houses, and for a shew make long prayers: the same shall receive greater damnation.,,,,,,,,","21:1":"and saw the rich people who were putting their gifts into the treasury.","21:2":"two lepta.  2 lepta was about 1% of a day's wages for an agricultural laborer.}","21:3":"Truly I tell you, this poor widow put in more than all of them,,And he said, Of a truth I say unto you, that this poor widow hath cast in more than they all:,,,,,,,,","21:4":"but she","21:5":"he said","21:6":"As for these things which ye behold","21:7":"Teacher, so when will these things be? What is the sign that these things are about to happen?","21:8":"Watch out that you don't get led astray, for many will come in my name, saying, 'I am he{or, I AM},' and, 'The time is at hand.' Therefore don't follow them.,And he said, Take heed that ye be not deceived: for many shall come in my name, saying, I am Christ; and the time draweth near: go ye not therefore after them.,,,,,,,,","21:9":"don't be terrified","21:10":"Nation will rise against nation, and kingdom against kingdom.,Then said he unto them, Nation shall rise against nation, and kingdom against kingdom:,,,,,,,,","21:11":"famines","21:12":"they will lay their hands on you and will persecute you","21:13":"And it shall turn to you for a testimony.","21:14":"","21:15":"For I will give you a mouth and wisdom","21:16":"brothers","21:17":"And ye shall be hated of all men for my name's sake.","21:18":"But there shall not an hair of your head perish.","21:19":"","21:20":"","21:21":"Then let them which are in Judaea flee to the mountains; and let them which are in the midst of it depart out; and let not them that are in the countries enter thereinto.","21:22":"that all things which are written may be fulfilled.","21:23":"and wrath to this people.","21:24":"and will be led captive into all the nations.  Jerusalem will be trampled down by the Gentiles","21:25":"moon","21:26":"and for expectation of the things which are coming on the world:  for the powers of the heavens will be shaken.","21:27":"And then shall they see the Son of man coming in a cloud with power and great glory.","21:28":"look up","21:29":"","21:30":"you see it and know by your own selves that the summer is already near.","21:31":"when you see these things happening","21:32":"this generation will not pass away until all things are accomplished.","21:33":"but my words will by no means pass away.","21:34":"","21:35":"For as a snare shall it come on all them that dwell on the face of the whole earth.","21:36":"praying that you may be counted worthy to escape all these things that will happen","21:37":"and every night he would go out and spend the night on the mountain that is called Olivet.","21:38":"And all the people came early in the morning to him in the temple","22:1":"which is called the Passover","22:2":"for they feared the people.","22:3":"who was surnamed Iscariot","22:4":"and talked with the chief priests and captains about how he might deliver him to them.","22:5":"and agreed to give him money.","22:6":"and sought an opportunity to deliver him to them in the absence of the multitude.","22:7":"on which the Passover must be sacrificed.","22:8":"saying","22:9":"Where do you want us to prepare?","22:10":"Behold, when you have entered into the city, a man carrying a pitcher of water will meet you. Follow him into the house which he enters.,And he said unto them, Behold, when ye are entered into the city, there shall a man meet you, bearing a pitcher of water; follow him into the house where he entereth in.,,,,,,,,","22:11":"'The Teacher says to you","22:12":"furnished upper room. Make preparations there.,And he shall shew you a large upper room furnished: there make ready.,,,,,,,,","22:13":"found things as he had told them","22:14":"he sat down with the twelve apostles.","22:15":"I have earnestly desired to eat this Passover with you before I suffer,,And he said unto them, With desire I have desired to eat this passover with you before I suffer:,,,,,,,,","22:16":"I will no longer by any means eat of it until it is fulfilled in the Kingdom of God.,For I say unto you, I will not any more eat thereof, until it be fulfilled in the kingdom of God.,,,,,,,,","22:17":"and when he had given thanks","22:18":"I will not drink at all again from the fruit of the vine","22:19":"and when he had given thanks","22:20":"he took the cup after supper","22:21":"the hand of him who betrays me is with me on the table.","22:22":"as it has been determined","22:23":"which of them it was who would do this thing.","22:24":"which of them was considered to be greatest.","22:25":"The kings of the nations lord it over them, and those who have authority over them are called 'benefactors.',And he said unto them, The kings of the Gentiles exercise lordship over them; and they that exercise authority upon them are called benefactors.,,,,,,,,","22:26":"let him become as the younger","22:27":"one who sits at the table","22:28":"Ye are they which have continued with me in my temptations.","22:29":"even as my Father conferred on me","22:30":"judging the twelve tribes of Israel.,That ye may eat and drink at my table in my kingdom, and sit on thrones judging the twelve tribes of Israel.,,,,,,,,","22:31":"Simon, Simon, behold, Satan asked to have you, that he might sift you as wheat,,And the Lord said, Simon, Simon, behold, Satan hath desired to have you, that he may sift you as wheat:,,,,,,,,","22:32":"that your faith wouldn't fail. You","22:33":"Lord, I am ready to go with you both to prison and to death!","22:34":"I tell you, Peter, the rooster will by no means crow today until you deny that you know me three times.","22:35":"When I sent you out without purse, and wallet, and shoes, did you lack anything?  They said","22:36":"But now, whoever has a purse, let him take it, and likewise a wallet.  Whoever has none, let him sell his cloak, and buy a sword.,Then said he unto them, But now, he that hath a purse, let him take it, and likewise his scrip: and he that hath no sword, let him sell his garment, and buy one.,,,,,,,,","22:37":"","22:38":"Lord, behold, here are two swords.  He said to them","22:39":"and went","22:40":"he said to them","22:41":"and he knelt down and prayed","22:42":"Father, if you are willing, remove this cup from me. Nevertheless, not my will, but yours, be done.","22:43":"strengthening him.","22:44":"And being in an agony he prayed more earnestly: and his sweat was as it were great drops of blood falling down to the ground.","22:45":"he came to the disciples","22:46":"Why do you sleep?  Rise and pray that you may not enter into temptation.","22:47":"behold","22:48":"Judas, do you betray the Son of Man with a kiss?","22:49":"they said to him","22:50":"and cut off his right ear.","22:51":"Let me at least do this--and he touched his ear","22:52":"captains of the temple","22:53":"you didn't stretch out your hands against me.  But this is your hour","22:54":"and led him away","22:55":"and had sat down together","22:56":"and looking intently at him","22:57":"saying","22:58":"and said","22:59":"another confidently affirmed","22:60":"Man, I don't know what you are talking about! Immediately","22:61":"and looked at Peter.  Then Peter remembered the Lord's word","22:62":"and wept bitterly.","22:63":"And the men that held Jesus mocked him","22:64":"they struck him on the face and asked him","22:65":"insulting him.","22:66":"the assembly of the elders of the people was gathered together","22:67":"If I tell you, you won't believe,,Art thou the Christ? tell us. And he said unto them, If I tell you, ye will not believe:,,,,,,,,","22:68":"you will in no way answer me or let me go.","22:69":"the Son of Man will be seated at the right hand of the power of God.,Hereafter shall the Son of man sit on the right hand of the power of God.,,,,,,,,","22:70":"Are you then the Son of God?  He said to them","22:71":"Why do we need any more witness?  For we ourselves have heard from his own mouth!","23:1":"And the whole multitude of them arose","23:2":"saying","23:3":"Are you the King of the Jews?  He answered him","23:4":"I find no basis for a charge against this man.","23:5":"saying","23:6":"he asked if the man was a Galilean.","23:7":"he sent him to Herod","23:8":"he was exceedingly glad","23:9":"but he gave no answers.","23:10":"vehemently accusing him.","23:11":"they sent him back to Pilate.","23:12":"for before that they were enemies with each other.","23:13":"","23:14":"You brought this man to me as one that perverts the people, and see, I have examined him before you, and found no basis for a charge against this man concerning those things of which you accuse him.,Said unto them, Ye have brought this man unto me, as one that perverteth the people: and, behold, I, having examined him before you, have found no fault in this man touching those things whereof ye accuse him:,,,,,,,,","23:15":"for I sent you to him","23:16":"","23:17":"(For of necessity he must release one unto them at the feast.)","23:18":"saying","23:19":"and for murder.","23:20":"wanting to release Jesus","23:21":"saying","23:22":"Why?  What evil has this man done? I have found no capital crime in him.  I will therefore chastise him and release him.","23:23":"asking that he might be crucified.  Their voices and the voices of the chief priests prevailed.","23:24":"And Pilate gave sentence that it should be as they required.","23:25":"for whom they asked","23:26":"they grabbed one Simon of Cyrene","23:27":"including women who also mourned and lamented him.","23:28":"turning to them","23:29":"the days are coming in which they will say","23:30":"'Fall on us!' and tell the hills","23:31":"what will be done in the dry?,For if they do these things in a green tree, what shall be done in the dry?,,,,,,,,","23:32":"two criminals","23:33":"they crucified him there with the criminals","23:34":"Father, forgive them, for they don't know what they are doing.  Dividing his garments among them","23:35":"saying","23:36":"coming to him and offering him vinegar","23:37":"If you are the King of the Jews, save yourself!","23:38":"Latin","23:39":"saying","23:40":"and rebuking him said","23:41":"for we receive the due reward for our deeds","23:42":"Lord, remember me when you come into your Kingdom.","23:43":"Assuredly I tell you, today you will be with me in Paradise.","23:44":"so the sixth hour was about noon.}","23:45":"and the veil of the temple was torn in two.","23:46":"crying with a loud voice","23:47":"he glorified God","23:48":"when they saw the things that were done","23:49":"and the women who followed with him from Galilee","23:50":"a man named Joseph","23:51":"from Arimathaea","23:52":"and asked for Jesus' body.","23:53":"and wrapped it in a linen cloth","23:54":"and the Sabbath was drawing near.","23:55":"who had come with him out of Galilee","23:56":"and prepared spices and ointments. On the Sabbath they rested according to the commandment.","24:1":"at early dawn","24:2":"And they found the stone rolled away from the sepulchre.","24:3":"and didn't find the Lord Jesus' body.","24:4":"while they were greatly perplexed about this","24:5":"they bowed their faces down to the earth. They said to them","24:6":"but is risen.  Remember what he told you when he was still in Galilee","24:7":"and be crucified","24:8":"","24:9":"and told all these things to the eleven","24:10":"Joanna","24:11":"and they didn't believe them.","24:12":"he saw the strips of linen lying by themselves","24:13":"two of them were going that very day to a village named Emmaus","24:14":"And they talked together of all these things which had happened.","24:15":"while they talked and questioned together","24:16":"But their eyes were holden that they should not know him.","24:17":"What are you talking about as you walk, and are sad?","24:18":"named Cleopas","24:19":"What things?  They said to him","24:20":"and crucified him.","24:21":"and besides all this","24:22":"certain women of our company amazed us","24:23":"they came saying that they had also seen a vision of angels","24:24":"and found it just like the women had said","24:25":"Foolish men, and slow of heart to believe in all that the prophets have spoken!,Then he said unto them, O fools, and slow of heart to believe all that the prophets have spoken:,,,,,,,,","24:26":"","24:27":"he explained to them in all the Scriptures the things concerning himself.","24:28":"where they were going","24:29":"saying","24:30":"that when he had sat down at the table with them","24:31":"and they recognized him","24:32":"Weren't our hearts burning within us, while he spoke to us along the way, and while he opened the Scriptures to us?","24:33":"returned to Jerusalem","24:34":"The Lord is risen indeed, and has appeared to Simon!","24:35":"and how he was recognized by them in the breaking of the bread.","24:36":"Jesus himself stood among them","24:37":"and supposed that they had seen a spirit.","24:38":"Why are you troubled?  Why do doubts arise in your hearts?,And he said unto them, Why are ye troubled? and why do thoughts arise in your hearts?,,,,,,,,","24:39":"that it is truly me. Touch me and see","24:40":"he showed them his hands and his feet.","24:41":"and wondered","24:42":"And they gave him a piece of a broiled fish","24:43":"and ate in front of them.","24:44":"This is what I told you, while I was still with you, that all things which are written in the law of Moses, the prophets, and the psalms, concerning me must be fulfilled.","24:45":"that they might understand the Scriptures.","24:46":"Thus it is written, and thus it was necessary for the Christ to suffer and to rise from the dead the third day,,And said unto them, Thus it is written, and thus it behoved Christ to suffer, and to rise from the dead the third day:,,,,,,,,","24:47":"beginning at Jerusalem.","24:48":"And ye are witnesses of these things.","24:49":"I send forth the promise of my Father on you. But wait in the city of Jerusalem until you are clothed with power from on high.,And, behold, I send the promise of my Father upon you: but tarry ye in the city of Jerusalem, until ye be endued with power from on high.,,,,,,,,","24:50":"and he lifted up his hands","24:51":"while he blessed them","24:52":"and returned to Jerusalem with great joy","24:53":"praising and blessing God.  Amen."}