{"1:1":"The burden of the word of the LORD to Israel by Malachi.","1:2":"How have you loved us?  Wasn't Esau Jacob's brother? says Yahweh","1:3":"and made his mountains a desolation","1:4":"We are beaten down, but we will return and build the waste places; thus says Yahweh of Armies","1:5":"and you will say","1:6":"","1:7":"'How have we polluted you?'  In that you say","1:8":"isn't that evil? And when you offer the lame and sick","1:9":"And now","1:10":"neither will I accept an offering at your hand.,Who is there even among you that would shut the doors for nought? neither do ye kindle fire on mine altar for nought. I have no pleasure in you, saith the LORD of hosts, neither will I accept an offering at your hand., מִי גַם־בָּכֶם וְיִסְגֹּר דְּלָתַיִם וְלֹא־תָאִירוּ מִזְבְּחִי חִנָּם אֵין־לִי חֵפֶץ בָּכֶם אָמַר יְהוָה צְבָאוֹת וּמִנְחָה לֹא־אֶרְצֶה מִיֶּדְכֶם׃ ‬,Oh that there were even one among you that would shut the doors, That ye might not kindle fire on Mine altar in vain! I have no pleasure in you, Saith the LORD of hosts, Neither will I accept an offering at your hand.,διότι καὶ ἐν ὑμῖν συγκλεισθήσονται θύραι καὶ οὐκ ἀνάψετε τὸ θυσιαστήριόν μου δωρεάν οὐκ ἔστιν μου θέλημα ἐν ὑμῖν λέγει κύριος παντοκράτωρ καὶ θυσίαν οὐ προσδέξομαι ἐκ τῶν χειρῶν ὑμῶν,Because even among you the doors shall be shut, and one will not kindle the fire of mine altar for nothing, I have no pleasure in you, saith the Lord Almighty, and I will not accept a sacrifice at your hands.,,,,","1:11":"my name is great among the nations","1:12":"And the fruit thereof","1:13":"'Behold","1:14":"and my name is awesome among the nations.","2:1":"","2:2":"and if you will not lay it to heart","2:3":"I will rebuke your seed","2:4":"that my covenant may be with Levi","2:5":"","2:6":"and unrighteousness was not found in his lips.  He walked with me in peace and uprightness","2:7":"and they should seek the law at his mouth; for he is the messenger of Yahweh of Armies.","2:8":"says Yahweh of Armies.,But ye are departed out of the way; ye have caused many to stumble at the law; ye have corrupted the covenant of Levi, saith the LORD of hosts., וְאַתֶּם סַרְתֶּם מִן־הַדֶּרֶךְ הִכְשַׁלְתֶּם רַבִּים בַּתּוֹרָה שִׁחַתֶּם בְּרִית הַלֵּוִי אָמַר יְהוָה צְבָאוֹת׃ ‬,But ye are turned aside out of the way; Ye have caused many to stumble in the law; Ye have corrupted the covenant of Levi, Saith the LORD of hosts.,ὑμεῖς δὲ ἐξεκλίνατε ἐκ τῆς ὁδοῦ καὶ πολλοὺς ἠσθενήσατε ἐν νόμῳ διεφθείρατε τὴν διαθήκην τοῦ λευι λέγει κύριος παντοκράτωρ,But ye have turned aside from the way, and caused many to fail in following the law: ye have corrupted the covenant of Levi, saith the Lord Almighty.,,,,","2:9":"","2:10":"profaning the covenant of our fathers?","2:11":"and an abomination is committed in Israel and in Jerusalem; for Judah has profaned the holiness of Yahweh which he loves","2:12":"to the man who does this","2:13":"with weeping","2:14":"'Why?'  Because Yahweh has been witness between you and the wife of your youth","2:15":"although he had the residue of the Spirit?  Why one?  He sought a godly seed. Therefore take heed to your spirit","2:16":"says Yahweh, the God of Israel, and him who covers his garment with violence! says Yahweh of Armies.  Therefore take heed to your spirit","2:17":"'How have we wearied him?'  In that you say","3:1":"Behold","3:2":"","3:3":"and he will purify the sons of Levi","3:4":"as in the days of old","3:5":"and against the adulterers","3:6":"","3:7":"and have not kept them.  Return to me","3:8":"'How have we robbed you?'  In tithes and offerings.","3:9":"even this whole nation.","3:10":"that there may be food in my house","3:11":"and he shall not destroy the fruits of your ground; neither shall your vine cast its fruit before its time in the field","3:12":"And all nations shall call you blessed: for ye shall be a delightsome land","3:13":"","3:14":"'It is vain to serve God;' and 'What profit is it that we have kept his charge","3:15":"those who work wickedness are built up; yes","3:16":"and heard","3:17":"says Yahweh of Armies, my own possession in the day that I make","3:18":"between him who serves God and him who doesn't serve him.","4:1":"that it shall leave them neither root nor branch.,For, behold, the day cometh, that shall burn as an oven; and all the proud, yea, and all that do wickedly, shall be stubble: and the day that cometh shall burn them up, saith the LORD of hosts, that it shall leave them neither root nor branch., כִּי־הִנֵּה הַיּוֹם בָּא בֹּעֵר כַּתַּנּוּר וְהָיוּ כָל־זֵדִים וְכָל־עֹשֵׂה רִשְׁעָה קַשׁ וְלִהַט אֹתָם הַיּוֹם הַבָּא אָמַר יְהוָה צְבָאוֹת אֲשֶׁר לֹא־יַעֲזֹב לָהֶם שֹׁרֶשׁ וְעָנָף׃ ‬,For, behold, the day cometh, It burneth as a furnace; And all the proud, and all that work wickedness, shall be stubble; And the day that cometh shall set them ablaze, Saith the LORD of hosts, That it shall leave them neither root nor branch.,3:19 διότι ἰδοὺ ἡμέρα κυρίου ἔρχεται καιομένη ὡς κλίβανος καὶ φλέξει αὐτούς καὶ ἔσονται πάντες οἱ ἀλλογενεῖς καὶ πάντες οἱ ποιοῦντες ἄνομα καλάμη καὶ ἀνάψει αὐτοὺς ἡ ἡμέρα ἡ ἐρχομένη λέγει κύριος παντοκράτωρ καὶ οὐ μὴ ὑπολειφθῇ ἐξ αὐτῶν ῥίζα οὐδὲ κλῆμα,For, behold, a day comes burning as an oven, and it shall consume them; and all the aliens, and all that do wickedly, shall be stubble: and the day that is coming shall set them on fire, saith the Lord Almighty, and there shall not be left of them root or branch.,,,,","4:2":"and leap like calves of the stall.","4:3":"says Yahweh of Armies.,And ye shall tread down the wicked; for they shall be ashes under the soles of your feet in the day that I shall do this, saith the LORD of hosts., וְעַסּוֹתֶם רְשָׁעִים כִּי־יִהְיוּ אֵפֶר תַּחַת כַּפּוֹת רַגְלֵיכֶם בַּיּוֹם אֲשֶׁר אֲנִי עֹשֶׂה אָמַר יְהוָה צְבָאוֹת׃ פ ‬,And ye shall tread down the wicked; For they shall be ashes under the soles of your feet In the day that I do make, Saith the LORD of hosts.,3:21 καὶ καταπατήσετε ἀνόμους διότι ἔσονται σποδὸς ὑποκάτω τῶν ποδῶν ὑμῶν ἐν τῇ ἡμέρᾳ ᾗ ἐγὼ ποιῶ λέγει κύριος παντοκράτωρ,And ye shall trample the wicked; for they shall be ashes underneath your feet in the day which I appoint, saith the Lord Almighty.,,,,","4:4":"","4:5":"I will send you Elijah the prophet before the great and terrible day of Yahweh comes.","4:6":"and the hearts of the children to their fathers"}