{"1:1":"the Son of God.","1:2":"Behold, I send my messenger before your face, who will prepare your way before you.{Malachi 3:1},As it is written in the prophets, Behold, I send my messenger before thy face, which shall prepare thy way before thee.,,,,,,,,","1:3":"'Make ready the way of the Lord!  Make his paths straight!'{Isaiah 40:3},The voice of one crying in the wilderness, Prepare ye the way of the Lord, make his paths straight.,,,,,,,,","1:4":"immersing} in the wilderness and preaching the baptism of repentance for forgiveness of sins.","1:5":"confessing their sins.","1:6":"And John was clothed with camel's hair","1:7":"saying","1:8":"but he will baptize you in the Holy Spirit.,I indeed have baptized you with water: but he shall baptize you with the Holy Ghost.,,,,,,,,","1:9":"that Jesus came from Nazareth of Galilee","1:10":"he saw the heavens parting","1:11":"You are my beloved Son, in whom I am well pleased.","1:12":"And immediately the spirit driveth him into the wilderness.","1:13":"And he was there in the wilderness forty days","1:14":"Jesus came into Galilee","1:15":"The time is fulfilled, and the Kingdom of God is at hand!  Repent, and believe in the Good News.","1:16":"he saw Simon and Andrew the brother of Simon casting a net into the sea","1:17":"Come after me, and I will make you into fishers for men.","1:18":"and followed him.","1:19":"he saw James the son of Zebedee","1:20":"and they left their father","1:21":"and immediately on the Sabbath day he entered into the synagogue and taught.","1:22":"for he taught them as having authority","1:23":"and he cried out","1:24":"Ha!  What do we have to do with you, Jesus, you Nazarene?  Have you come to destroy us?  I know you who you are: the Holy One of God!","1:25":"saying","1:26":"convulsing him and crying with a loud voice","1:27":"so that they questioned among themselves","1:28":"And immediately his fame spread abroad throughout all the region round about Galilee.","1:29":"when they had come out of the synagogue","1:30":"and immediately they told him about her.","1:31":"and raised her up. The fever left her","1:32":"when the sun had set","1:33":"And all the city was gathered together at the door.","1:34":"and cast out many demons.  He didn't allow the demons to speak","1:35":"while it was still dark","1:36":"And Simon and they that were with him followed after him.","1:37":"and told him","1:38":"Let's go elsewhere into the next towns, that I may preach there also, because I came out for this reason.","1:39":"preaching and casting out demons.","1:40":"begging him","1:41":"he stretched out his hand","1:42":"immediately the leprosy departed from him","1:43":"and immediately sent him out","1:44":"See you say nothing to anybody, but go show yourself to the priest, and offer for your cleansing the things which Moses commanded, for a testimony to them.","1:45":"and began to proclaim it much","2:1":"it was heard that he was in the house.","2:2":"so that there was no more room","2:3":"carrying a paralytic to him.","2:4":"they removed the roof where he was.  When they had broken it up","2:5":"seeing their faith","2:6":"and reasoning in their hearts","2:7":"Why doth this man thus speak blasphemies? who can forgive sins but God only?","2:8":"perceiving in his spirit that they so reasoned within themselves","2:9":"to tell the paralytic","2:10":"","2:11":"I say unto thee","2:12":"and immediately took up the mat","2:13":"and he taught them.","2:14":"he saw Levi","2:15":"that he was reclining at the table in his house","2:16":"when they saw that he was eating with the sinners and tax collectors","2:17":"he said to them","2:18":"and they came and asked him","2:19":"Can the groomsmen fast while the bridegroom is with them?  As long as they have the bridegroom with them, they can't fast.,And Jesus said unto them, Can the children of the bridechamber fast, while the bridegroom is with them? as long as they have the bridegroom with them, they cannot fast.,,,,,,,,","2:20":"and then will they fast in that day.","2:21":"or else the patch shrinks and the new tears away from the old","2:22":"or else the new wine will burst the skins","2:23":"and his disciples began","2:24":"Behold, why do they do that which is not lawful on the Sabbath day?","2:25":"Did you never read what David did, when he had need, and was hungry--he, and those who were with him?,And he said unto them, Have ye never read what David did, when he had need, and was an hungred, he, and they that were with him?,,,,,,,,","2:26":"and ate the show bread","2:27":"The Sabbath was made for man, not man for the Sabbath.,And he said unto them, The sabbath was made for man, and not man for the sabbath:,,,,,,,,","2:28":"","3:1":"and there was a man there who had his hand withered.","3:2":"whether he would heal him on the Sabbath day","3:3":"Stand up.","3:4":"Is it lawful on the Sabbath day to do good, or to do harm?  To save a life, or to kill? But they were silent.","3:5":"being grieved at the hardening of their hearts","3:6":"and immediately conspired with the Herodians against him","3:7":"and a great multitude followed him from Galilee","3:8":"from Idumaea","3:9":"so that they wouldn't press on him.","3:10":"so that as many as had diseases pressed on him that they might touch him.","3:11":"whenever they saw him","3:12":"And he straitly charged them that they should not make him known.","3:13":"and called to himself those whom he wanted","3:14":"that they might be with him","3:15":"And to have power to heal sicknesses","3:16":"to whom he gave the name Peter;","3:17":"the brother of James","3:18":"the son of Alphaeus; Thaddaeus; Simon the Zealot;","3:19":"who also betrayed him.  He came into a house.","3:20":"so that they could not so much as eat bread.","3:21":"they went out to seize him: for they said","3:22":"He has Beelzebul, and","3:23":"and said to them in parables","3:24":"that kingdom cannot stand.","3:25":"that house cannot stand.","3:26":"and is divided","3:27":"unless he first binds the strong man; and then he will plunder his house.","3:28":"all sins of the descendants of man will be forgiven","3:29":"but is guilty of an eternal sin,But he that shall blaspheme against the Holy Ghost hath never forgiveness, but is in danger of eternal damnation.,,,,,,,,","3:30":"He has an unclean spirit.","3:31":"and standing outside","3:32":"and they told him","3:33":"Who are my mother and my brothers?","3:34":"he said","3:35":"the same is my brother","4:1":"so that he entered into a boat in the sea","4:2":"and told them in his teaching","4:3":"","4:4":"as he sowed","4:5":"where it had little soil","4:6":"it was scorched; and because it had no root","4:7":"and the thorns grew up","4:8":"and yielded fruit","4:9":"Whoever has ears to hear, let him hear.","4:10":"those who were around him with the twelve asked him about the parables.","4:11":"To you is given the mystery of the Kingdom of God, but to those who are outside, all things are done in parables,,And he said unto them, Unto you it is given to know the mystery of the kingdom of God: but unto them that are without, all these things are done in parables:,,,,,,,,","4:12":"and not perceive; and hearing they may hear","4:13":"Don't you understand this parable? How will you understand all of the parables?,And he said unto them, Know ye not this parable? and how then will ye know all parables?,,,,,,,,","4:14":"The sower soweth the word.","4:15":"immediately Satan comes","4:16":"who","4:17":"but are short-lived. When oppression or persecution arises because of the word","4:18":"","4:19":"and the deceitfulness of riches","4:20":"and accept it","4:21":"Is the lamp brought to be put under a basket{literally, a modion, a dry measuring basket containing about a peck (about 9 litres)} or under a bed? Isn't it put on a stand?,And he said unto them, Is a candle brought to be put under a bushel, or under a bed? and not to be set on a candlestick?,,,,,,,,","4:22":"except that it should be made known; neither was anything made secret","4:23":"let him hear.,If any man have ears to hear, let him hear.,,,,,,,,","4:24":"Take heed what you hear.  With whatever measure you measure, it will be measured to you, and more will be given to you who hear.,And he said unto them, Take heed what ye hear: with what measure ye mete, it shall be measured to you: and unto you that hear shall more be given.,,,,,,,,","4:25":"to him will more be given","4:26":"The Kingdom of God is as if a man should cast seed on the earth,,And he said, So is the kingdom of God, as if a man should cast seed into the ground;,,,,,,,,","4:27":"and the seed should spring up and grow","4:28":"then the ear","4:29":"immediately he puts forth the sickle","4:30":"How will we liken the Kingdom of God?  Or with what parable will we illustrate it?,And he said, Whereunto shall we liken the kingdom of God? or with what comparison shall we compare it?,,,,,,,,","4:31":"which","4:32":"grows up","4:33":"as they were able to hear it.","4:34":"But without a parable spake he not unto them: and when they were alone","4:35":"when evening had come","4:36":"they took him with them","4:37":"and the waves beat into the boat","4:38":"asleep on the cushion","4:39":"and rebuked the wind","4:40":"Why are you so afraid?  How is it that you have no faith?","4:41":"and said to one another","5:1":"into the country of the Gadarenes.","5:2":"immediately there met him out of the tombs a man with an unclean spirit","5:3":"not even with chains","5:4":"and the chains had been torn apart by him","5:5":"night and day","5:6":"he ran and bowed down to him","5:7":"he said","5:8":"Come out of the man, you unclean spirit!","5:9":"What is your name?  He said to him","5:10":"And he besought him much that he would not send them away out of the country.","5:11":"Now there was there nigh unto the mountains a great herd of swine feeding.","5:12":"saying","5:13":"and they were drowned in the sea.","5:14":"and told it in the city and in the country. The people came to see what it was that had happened.","5:15":"and saw him who had been possessed by demons sitting","5:16":"and about the pigs.","5:17":"And they began to pray him to depart out of their coasts.","5:18":"he who had been possessed by demons begged him that he might be with him.","5:19":"but said to him","5:20":"and began to proclaim in Decapolis how Jesus had done great things for him","5:21":"a great multitude was gathered to him; and he was by the sea.","5:22":"one of the rulers of the synagogue","5:23":"saying","5:24":"and a great multitude followed him","5:25":"who had an issue of blood for twelve years","5:26":"and had spent all that she had","5:27":"came up behind him in the crowd","5:28":"If I just touch his clothes, I will be made well.","5:29":"and she felt in her body that she was healed of her affliction.","5:30":"perceiving in himself that the power had gone out from him","5:31":"You see the multitude pressing against you, and you say, 'Who touched me?'","5:32":"And he looked round about to see her that had done this thing.","5:33":"fearing and trembling","5:34":"Daughter, your faith has made you well. Go in peace, and be cured of your disease.","5:35":"they came from the synagogue ruler's house saying","5:36":"when he heard the message spoken","5:37":"except Peter","5:38":"and he saw an uproar","5:39":"he said to them","5:40":"having put them all out","5:41":"he said to her","5:42":"and walked","5:43":"and commanded that something should be given to her to eat.","6:1":"and his disciples followed him.","6:2":"he began to teach in the synagogue","6:3":"the son of Mary","6:4":"A prophet is not without honor, except in his own country, and among his own relatives, and in his own house.","6:5":"except that he laid his hands on a few sick people","6:6":"And he marvelled because of their unbelief. And he went round about the villages","6:7":"and began to send them out two by two; and he gave them authority over the unclean spirits.","6:8":"except a staff only:  no bread","6:9":"and not put on two tunics.","6:10":"Wherever you enter into a house, stay there until you depart from there.,And he said unto them, In what place soever ye enter into an house, there abide till ye depart from that place.,,,,,,,,","6:11":"as you depart from there","6:12":"And they went out","6:13":"and anointed many with oil who were sick","6:14":"for his name had become known","6:15":"It is Elijah.  Others said","6:16":"when he heard this","6:17":"and bound him in prison for the sake of Herodias","6:18":"It is not lawful for you to have your brother's wife.","6:19":"and desired to kill him","6:20":"knowing that he was a righteous and holy man","6:21":"that Herod on his birthday made a supper for his nobles","6:22":"she pleased Herod and those sitting with him. The king said to the young lady","6:23":"Whatever you shall ask of me, I will give you, up to half of my kingdom.","6:24":"and said to her mother","6:25":"and asked","6:26":"but for the sake of his oaths","6:27":"and commanded to bring John's head","6:28":"and gave it to the young lady; and the young lady gave it to her mother.","6:29":"they came and took up his corpse","6:30":"and they told him all things","6:31":"You come apart into a deserted place, and rest awhile.  For there were many coming and going","6:32":"And they departed into a desert place by ship privately.","6:33":"and many recognized him and ran there on foot from all the cities. They arrived before them and came together to him.","6:34":"saw a great multitude","6:35":"his disciples came to him","6:36":"that they may go into the surrounding country and villages","6:37":"You give them something to eat. They asked him","6:38":"How many loaves do you have?  Go see. When they knew","6:39":"And he commanded them to make all sit down by companies upon the green grass.","6:40":"by hundreds and by fifties.","6:41":"and looking up to heaven","6:42":"and were filled.","6:43":"And they took up twelve baskets full of the fragments","6:44":"And they that did eat of the loaves were about five thousand men.","6:45":"and to go ahead to the other side","6:46":"he went up the mountain to pray.","6:47":"the boat was in the midst of the sea","6:48":"for the wind was contrary to them","6:49":"when they saw him walking on the sea","6:50":"and were troubled.  But he immediately spoke with them","6:51":"and they were very amazed among themselves","6:52":"but their hearts were hardened.","6:53":"they came to land at Gennesaret","6:54":"immediately the people recognized him","6:55":"and began to bring those who were sick","6:56":"into villages","7:1":"and some of the scribes gathered together to him","7:2":"that is","7:3":"and all the Jews","7:4":"unless they bathe themselves","7:5":"Why don't your disciples walk according to the tradition of the elders, but eat their bread with unwashed hands?","7:6":"Well did Isaiah prophesy of you hypocrites, as it is written, 'This people honors me with their lips, but their heart is far from me.,He answered and said unto them, Well hath Esaias prophesied of you hypocrites, as it is written, This people honoureth me with their lips, but their heart is far from me.,,,,,,,,","7:7":"teaching as doctrines the commandments of men.'{Isaiah 29:13}","7:8":"For laying aside the commandment of God","7:9":"Full well do you reject the commandment of God, that you may keep your tradition.,And he said unto them, Full well ye reject the commandment of God, that ye may keep your own tradition.,,,,,,,,","7:10":"'Honor your father and your mother;'{Exodus 20:12; Deuteronomy 5:16} and","7:11":"'If a man tells his father or his mother","7:12":"","7:13":"which you have handed down.  You do many things like this.,Making the word of God of none effect through your tradition, which ye have delivered: and many such like things do ye.,,,,,,,,","7:14":"and said to them","7:15":"that going into him can defile him; but the things which proceed out of the man are those that defile the man.","7:16":"let him hear!,If any man have ears to hear, let him hear.,,,,,,,,","7:17":"his disciples asked him about the parable.","7:18":"Are you thus without understanding also? Don't you perceive that whatever goes into the man from outside can't defile him,,And he saith unto them, Are ye so without understanding also? Do ye not perceive, that whatsoever thing from without entereth into the man, it cannot defile him;,,,,,,,,","7:19":"but into his stomach","7:20":"That which proceeds out of the man, that defiles the man.,And he said, That which cometh out of the man, that defileth the man.,,,,,,,,","7:21":"out of the hearts of men","7:22":"wickedness","7:23":"and defile the man.,All these evil things come from within, and defile the man.,,,,,,,,","7:24":"and went away into the borders of Tyre and Sidon.  He entered into a house","7:25":"whose little daughter had an unclean spirit","7:26":"a Syrophoenician by race. She begged him that he would cast the demon out of her daughter.","7:27":"Let the children be filled first, for it is not appropriate to take the children's bread and throw it to the dogs.","7:28":"Yes, Lord.  Yet even the dogs under the table eat the children's crumbs.","7:29":"For this saying, go your way.  The demon has gone out of your daughter.","7:30":"and found the child having been laid on the bed","7:31":"and came to the sea of Galilee","7:32":"And they bring unto him one that was deaf","7:33":"privately","7:34":"he sighed","7:35":"and the impediment of his tongue was released","7:36":"but the more he commanded them","7:37":"saying","8:1":"when there was a very great multitude","8:2":"","8:3":"they will faint on the way","8:4":"From where could one satisfy these people with bread here in a deserted place?","8:5":"How many loaves do you have?  They said","8:6":"and he took the seven loaves.  Having given thanks","8:7":"he said to serve these also.","8:8":"and were filled.  They took up seven baskets of broken pieces that were left over.","8:9":"And they that had eaten were about four thousand: and he sent them away.","8:10":"and came into the region of Dalmanutha.","8:11":"seeking from him a sign from heaven","8:12":"and said","8:13":"and again entering into the boat","8:14":"Now the disciples had forgotten to take bread","8:15":"saying","8:16":"saying","8:17":"perceiving it","8:18":"don't you see?  Having ears","8:19":"how many baskets full of broken pieces did you take up? They told him, Twelve.,When I brake the five loaves among five thousand, how many baskets full of fragments took ye up? They say unto him, Twelve.,,,,,,,,","8:20":"Seven.","8:21":"Don't you understand, yet?","8:22":"and begged him to touch him.","8:23":"and brought him out of the village.  When he had spit on his eyes","8:24":"and said","8:25":"and was restored","8:26":"saying","8:27":"with his disciples","8:28":"John the Baptizer, and others say Elijah, but others: one of the prophets.","8:29":"But who do you say that I am? Peter answered","8:30":"And he charged them that they should tell no man of him.","8:31":"and be rejected by the elders","8:32":"and began to rebuke him.","8:33":"turning around","8:34":"and said to them","8:35":"For whosoever will save his life shall lose it; but whosoever shall lose his life for my sake and the gospel's","8:36":"to gain the whole world","8:37":"Or what shall a man give in exchange for his soul?","8:38":"the Son of Man also will be ashamed of him","9:1":"Most certainly I tell you, there are some standing here who will in no way taste death until they see the Kingdom of God come with power.","9:2":"James","9:3":"exceedingly white","9:4":"and they were talking with Jesus.","9:5":"Rabbi, it is good for us to be here. Let's make three tents:  one for you, one for Moses, and one for Elijah.","9:6":"for they were very afraid.","9:7":"overshadowing them","9:8":"they saw no one with them any more","9:9":"he charged them that they should tell no one what things they had seen","9:10":"questioning what the rising from the dead meant.","9:11":"saying","9:12":"Elijah indeed comes first, and restores all things. How is it written about the Son of Man, that he should suffer many things and be despised?,And he answered and told them, Elias verily cometh first, and restoreth all things; and how it is written of the Son of man, that he must suffer many things, and be set at nought.,,,,,,,,","9:13":"and they have also done to him whatever they wanted to","9:14":"he saw a great multitude around them","9:15":"when they saw him","9:16":"What are you asking them?","9:17":"Teacher, I brought to you my son, who has a mute spirit;,And one of the multitude answered and said, Master, I have brought unto thee my son, which hath a dumb spirit;,,,,,,,,","9:18":"it throws him down","9:19":"Unbelieving generation, how long shall I be with you?  How long shall I bear with you? Bring him to me.","9:20":"and when he saw him","9:21":"How long has it been since this has come to him?  He said","9:22":"to destroy him.  But if you can do anything","9:23":"If you can believe, all things are possible to him who believes.","9:24":"I believe. Help my unbelief!","9:25":"he rebuked the unclean spirit","9:26":"and convulsed greatly","9:27":"and raised him up; and he arose.","9:28":"his disciples asked him privately","9:29":"This kind can come out by nothing, except by prayer and fasting.","9:30":"and passed through Galilee. He didn't want anyone to know it.","9:31":"and said to them","9:32":"and were afraid to ask him.","9:33":"and when he was in the house he asked them","9:34":"for they had disputed one with another on the way about who was the greatest.","9:35":"and called the twelve; and he said to them","9:36":"and set him in the midst of them. Taking him in his arms","9:37":"Whosoever shall receive one of such children in my name","9:38":"Teacher, we saw someone who doesn't follow us casting out demons in your name; and we forbade him, because he doesn't follow us.","9:39":"Don't forbid him, for there is no one who will do a mighty work in my name, and be able quickly to speak evil of me.,But Jesus said, Forbid him not: for there is no man which shall do a miracle in my name, that can lightly speak evil of me.,,,,,,,,","9:40":"For he that is not against us is on our part.","9:41":"because you are Christ's","9:42":"it would be better for him if he was thrown into the sea with a millstone hung around his neck.","9:43":"cut it off. It is better for you to enter into life maimed","9:44":"and the fire is not quenched.'","9:45":"cut it off. It is better for you to enter into life lame","9:46":"and the fire is not quenched.'","9:47":"cast it out. It is better for you to enter into the Kingdom of God with one eye","9:48":"and the fire is not quenched.'{Isaiah 66:24}","9:49":"and every sacrifice will be seasoned with salt.","9:50":"but if the salt has lost its saltiness","10:1":"he was again teaching them.","10:2":"and asked him","10:3":"What did Moses command you?","10:4":"Moses allowed a certificate of divorce to be written, and to divorce her.","10:5":"For your hardness of heart, he wrote you this commandment.,And Jesus answered and said unto them, For the hardness of your heart he wrote you this precept.,,,,,,,,","10:6":"God made them male and female.{Genesis 1:27}","10:7":"and will join to his wife","10:8":"{Genesis 2:24} so that they are no longer two","10:9":"let no man separate.,What therefore God hath joined together, let not man put asunder.,,,,,,,,","10:10":"his disciples asked him again about the same matter.","10:11":"Whoever divorces his wife, and marries another, commits adultery against her.,And he saith unto them, Whosoever shall put away his wife, and marry another, committeth adultery against her.,,,,,,,,","10:12":"and marries another","10:13":"that he should touch them","10:14":"he was moved with indignation","10:15":"whoever will not receive the Kingdom of God like a little child","10:16":"and blessed them","10:17":"one ran to him","10:18":"Why do you call me good?  No one is good except one--God.,And Jesus said unto him, Why callest thou me good? there is none good but one, that is, God.,,,,,,,,","10:19":"' 'Do not commit adultery","10:20":"Teacher, I have observed all these things from my youth.","10:21":"and said to him","10:22":"and he went away sorrowful","10:23":"and said to his disciples","10:24":"Children, how hard is it for those who trust in riches to enter into the Kingdom of God!,And the disciples were astonished at his words. But Jesus answereth again, and saith unto them, Children, how hard is it for them that trust in riches to enter into the kingdom of God!,,,,,,,,","10:25":"","10:26":"saying to him","10:27":"looking at them","10:28":"Behold, we have left all, and have followed you.","10:29":"Most certainly I tell you, there is no one who has left house, or brothers, or sisters, or father, or mother, or wife, or children, or land, for my sake, and for the sake of the Good News,,And Jesus answered and said, Verily I say unto you, There is no man that hath left house, or brethren, or sisters, or father, or mother, or wife, or children, or lands, for my sake, and the gospel's,,,,,,,,,","10:30":"houses","10:31":"","10:32":"going up to Jerusalem; and Jesus was going in front of them","10:33":"","10:34":"spit on him","10:35":"the sons of Zebedee","10:36":"What do you want me to do for you?","10:37":"Grant to us that we may sit, one at your right hand, and one at your left hand, in your glory.","10:38":"You don't know what you are asking. Are you able to drink the cup that I drink, and to be baptized with the baptism that I am baptized with?","10:39":"We are able.  Jesus said to them","10:40":"but for whom it has been prepared.,But to sit on my right hand and on my left hand is not mine to give; but it shall be given to them for whom it is prepared.,,,,,,,,","10:41":"they began to be indignant towards James and John.","10:42":"and said to them","10:43":"but whoever wants to become great among you shall be your servant.","10:44":"shall be bondservant of all.","10:45":"but to serve","10:46":"with his disciples and a great multitude","10:47":"he began to cry out","10:48":"that he should be quiet","10:49":"and said","10:50":"casting away his cloak","10:51":"What do you want me to do for you? The blind man said to him","10:52":"Go your way.  Your faith has made you well. Immediately he received his sight","11:1":"to Bethsphage{TR & NU read Bethphage instead of Bethsphage} and Bethany","11:2":"Go your way into the village that is opposite you.  Immediately as you enter into it, you will find a young donkey tied, on which no one has sat. Untie him, and bring him.,And saith unto them, Go your way into the village over against you: and as soon as ye be entered into it, ye shall find a colt tied, whereon never man sat; loose him, and bring him.,,,,,,,,","11:3":"'Why are you doing this?' say","11:4":"and found a young donkey tied at the door outside in the open street","11:5":"What are you doing, untying the young donkey?","11:6":"and they let them go.","11:7":"and threw their garments on it","11:8":"and others were cutting down branches from the trees","11:9":"and those who followed","11:10":"","11:11":"it being now evening","11:12":"when they had come out from Bethany","11:13":"he came to see if perhaps he might find anything on it.  When he came to it","11:14":"May no one ever eat fruit from you again! and his disciples heard it.","11:15":"and Jesus entered into the temple","11:16":"And would not suffer that any man should carry any vessel through the temple.","11:17":"saying to them","11:18":"and sought how they might destroy him.  For they feared him","11:19":"he went out of the city.","11:20":"they saw the fig tree withered away from the roots.","11:21":"remembering","11:22":"Have faith in God.,And Jesus answering saith unto them, Have faith in God.,,,,,,,,","11:23":"whoever may tell this mountain","11:24":"all things whatever you pray and ask for","11:25":"forgive","11:26":"neither will your Father in heaven forgive your transgressions.,But if ye do not forgive, neither will your Father which is in heaven forgive your trespasses.,,,,,,,,","11:27":"and as he was walking in the temple","11:28":"By what authority do you do these things?  Or who gave you this authority to do these things?","11:29":"I will ask you one question.  Answer me, and I will tell you by what authority I do these things.,And Jesus answered and said unto them, I will also ask of you one question, and answer me, and I will tell you by what authority I do these things.,,,,,,,,","11:30":"or from men? Answer me.,The baptism of John, was it from heaven, or of men? answer me.,,,,,,,,","11:31":"saying","11:32":"'From men'--they feared the people, for all held John to really be a prophet.,But if we shall say, Of men; they feared the people: for all men counted John, that he was a prophet indeed.,,,,,,,,","11:33":"We don't know.  Jesus said to them","12:1":"","12:2":"he sent a servant to the farmer to get from the farmer his share of the fruit of the vineyard.","12:3":"beat him","12:4":"he sent another servant to them; and they threw stones at him","12:5":"beating some","12:6":"his beloved son","12:7":"'This is the heir. Come","12:8":"killed him","12:9":"and will give the vineyard to others.","12:10":"the same was made the head of the corner.","12:11":"it is marvelous in our eyes'?{Psalm 118:22-23},This was the Lord's doing, and it is marvellous in our eyes?,,,,,,,,","12:12":"but they feared the multitude; for they perceived that he spoke the parable against them. They left him","12:13":"that they might trap him with words.","12:14":"they asked him","12:15":"or shall we not give?  But he, knowing their hypocrisy, said to them, Why do you test me? Bring me a denarius","12:16":"Whose is this image and inscription?  They said to him","12:17":"Render to Caesar the things that are Caesar's, and to God the things that are God's. They marveled greatly at him.","12:18":"who say that there is no resurrection. They asked him","12:19":"","12:20":"and dying left no offspring.","12:21":"and died","12:22":"And the seven had her","12:23":"when they rise","12:24":"Isn't this because you are mistaken, not knowing the Scriptures, nor the power of God?,And Jesus answering said unto them, Do ye not therefore err, because ye know not the scriptures, neither the power of God?,,,,,,,,","12:25":"they neither marry","12:26":"that they are raised; haven't you read in the book of Moses","12:27":"but of the living. You are therefore badly mistaken.,He is not the God of the dead, but the God of the living: ye therefore do greatly err.,,,,,,,,","12:28":"and heard them questioning together. Knowing that he had answered them well","12:29":"The greatest is, 'Hear, Israel, the Lord our God, the Lord is one:,And Jesus answered him, The first of all the commandments is, Hear, O Israel; The Lord our God is one Lord:,,,,,,,,","12:30":"and with all your soul","12:31":"'You shall love your neighbor as yourself.'{Leviticus 19:18} There is no other commandment greater than these.,And the second is like, namely this, Thou shalt love thy neighbour as thyself. There is none other commandment greater than these.,,,,,,,,","12:32":"Truly, teacher, you have said well that he is one, and there is none other but he,,And the scribe said unto him, Well, Master, thou hast said the truth: for there is one God; and there is none other but he:,,,,,,,,","12:33":"and with all the understanding","12:34":"he said to him","12:35":"as he taught in the temple","12:36":"'The Lord said to my Lord","12:37":"so how can he be his son? The common people heard him gladly.,David therefore himself calleth him Lord; and whence is he then his son? And the common people heard him gladly.,,,,,,,,","12:38":"Beware of the scribes, who like to walk in long robes, and to get greetings in the marketplaces,,And he said unto them in his doctrine, Beware of the scribes, which love to go in long clothing, and love salutations in the marketplaces,,,,,,,,,","12:39":"and the best places at feasts:","12:40":"and for a pretense make long prayers.  These will receive greater condemnation.,Which devour widows' houses, and for a pretence make long prayers: these shall receive greater damnation.,,,,,,,,","12:41":"and saw how the multitude cast money into the treasury.  Many who were rich cast in much.","12:42":"and she cast in two small brass coins","12:43":"and said to them","12:44":"but she","13:1":"one of his disciples said to him","13:2":"Do you see these great buildings? There will not be left here one stone on another, which will not be thrown down.","13:3":"Peter","13:4":"Tell us","13:5":"answering","13:6":"saying","13:7":"","13:8":"and kingdom against kingdom. There will be earthquakes in various places.  There will be famines and troubles.  These things are the beginning of birth pains.","13:9":"for they will deliver you up to councils. You will be beaten in synagogues.  You will stand before rulers and kings for my sake","13:10":"And the gospel must first be published among all nations.","13:11":"don't be anxious beforehand","13:12":"","13:13":"but he who endures to the end","13:14":"{Daniel 9:17; 11:31; 12:11} spoken of by Daniel the prophet","13:15":"nor enter in","13:16":"And let him that is in the field not turn back again for to take up his garment.","13:17":"But woe to them that are with child","13:18":"And pray ye that your flight be not in the winter.","13:19":"such as there has not been the like from the beginning of the creation which God created until now","13:20":"no flesh would have been saved; but for the sake of the chosen ones","13:21":"'Look","13:22":"and will show signs and wonders","13:23":"","13:24":"after that oppression","13:25":"and the powers that are in the heavens will be shaken.{Isaiah 13:10; 34:4}","13:26":"And then shall they see the Son of man coming in the clouds with great power and glory.","13:27":"and will gather together his chosen ones from the four winds","13:28":"","13:29":"when you see these things coming to pass","13:30":"this generation{The word translated generation (genea) could also be translated race, family, or people.} will not pass away until all these things happen.","13:31":"but my words will not pass away.","13:32":"not even the angels in heaven","13:33":"keep alert","13:34":"","13:35":"for you don't know when the lord of the house is coming","13:36":"Lest coming suddenly he find you sleeping.","13:37":"I tell all:  Watch.,And what I say unto you I say unto all, Watch.,,,,,,,,","14:1":"and the chief priests and the scribes sought how they might seize him by deception","14:2":"Not during the feast, because there might be a riot of the people.","14:3":"in the house of Simon the leper","14:4":"saying","14:5":"{300 denarii was about a years wages for an agricultural laborer.} and given to the poor.  They grumbled against her.,For it might have been sold for more than three hundred pence, and have been given to the poor. And they murmured against her.,,,,,,,,","14:6":"Leave her alone.  Why do you trouble her? She has done a good work for me.,And Jesus said, Let her alone; why trouble ye her? she hath wrought a good work on me.,,,,,,,,","14:7":"and whenever you want to","14:8":"She hath done what she could: she is come aforehand to anoint my body to the burying.","14:9":"wherever this Good News may be preached throughout the whole world","14:10":"who was one of the twelve","14:11":"when they heard it","14:12":"when they sacrificed the Passover","14:13":"and said to them","14:14":"tell the master of the house","14:15":"","14:16":"and came into the city","14:17":"And in the evening he cometh with the twelve.","14:18":"Jesus said","14:19":"and to ask him one by one","14:20":"It is one of the twelve, he who dips with me in the dish.,And he answered and said unto them, It is one of the twelve, that dippeth with me in the dish.,,,,,,,,","14:21":"even as it is written about him","14:22":"Jesus took bread","14:23":"and when he had given thanks","14:24":"This is my blood of the new covenant, which is poured out for many.,And he said unto them, This is my blood of the new testament, which is shed for many.,,,,,,,,","14:25":"I will no more drink of the fruit of the vine","14:26":"they went out to the Mount of Olives.","14:27":"All of you will be made to stumble because of me tonight, for it is written, 'I will strike the shepherd, and the sheep will be scattered.'{Zechariah 13:7},And Jesus saith unto them, All ye shall be offended because of me this night: for it is written, I will smite the shepherd, and the sheep shall be scattered.,,,,,,,,","14:28":"after I am raised up","14:29":"Although all will be offended, yet I will not.","14:30":"Most certainly I tell you, that you today, even this night, before the rooster crows twice, you will deny me three times.","14:31":"If I must die with you, I will not deny you.  They all said the same thing.","14:32":"Sit here, while I pray.","14:33":"James","14:34":"My soul is exceedingly sorrowful, even to death. Stay here, and watch.","14:35":"and fell on the ground","14:36":"Abba, Father, all things are possible to you. Please remove this cup from me.  However, not what I desire, but what you desire.","14:37":"and said to Peter","14:38":"that you may not enter into temptation. The spirit indeed is willing","14:39":"and prayed","14:40":"and found them sleeping","14:41":"and said to them","14:42":"let us be going.  Behold","14:43":"while he was still speaking","14:44":"saying","14:45":"immediately he came to him","14:46":"and seized him.","14:47":"and struck the servant of the high priest","14:48":"Have you come out, as against a robber, with swords and clubs to seize me?,And Jesus answered and said unto them, Are ye come out, as against a thief, with swords and with staves to take me?,,,,,,,,","14:49":"and you didn't arrest me.  But this is so that the Scriptures might be fulfilled.,I was daily with you in the temple teaching, and ye took me not: but the scriptures must be fulfilled.,,,,,,,,","14:50":"and fled.","14:51":"having a linen cloth thrown around himself","14:52":"and fled from them naked.","14:53":"the elders","14:54":"until he came into the court of the high priest.  He was sitting with the officers","14:55":"and found none.","14:56":"and their testimony didn't agree with each other.","14:57":"and gave false testimony against him","14:58":"We heard him say","14:59":"their testimony did not agree.","14:60":"and asked Jesus","14:61":"and answered nothing.  Again the high priest asked him","14:62":"I am.  You will see the Son of Man sitting at the right hand of Power, and coming with the clouds of the sky.","14:63":"and said","14:64":"","14:65":"and to cover his face","14:66":"one of the maids of the high priest came","14:67":"she looked at him","14:68":"saying","14:69":"and began again to tell those who stood by","14:70":"You truly are one of them, for you are a Galilean, and your speech shows it.","14:71":"and to swear","14:72":"how that Jesus said to him","15:1":"with the elders and scribes","15:2":"Are you the King of the Jews?  He answered","15:3":"And the chief priests accused him of many things: but he answered nothing.","15:4":"Have you no answer?  See how many things they testify against you!","15:5":"so that Pilate marveled.","15:6":"whom they asked of him.","15:7":"bound with those who had made insurrection","15:8":"crying aloud","15:9":"saying","15:10":"For he knew that the chief priests had delivered him for envy.","15:11":"that he should release Barabbas to them instead.","15:12":"What then should I do to him whom you call the King of the Jews?","15:13":"Crucify him!","15:14":"Why, what evil has he done? But they cried out exceedingly","15:15":"wishing to please the multitude","15:16":"which is the Praetorium; and they called together the whole cohort.","15:17":"and weaving a crown of thorns","15:18":"Hail, King of the Jews!","15:19":"and spat on him","15:20":"they took the purple off of him","15:21":"coming from the country","15:22":"which is","15:23":"but he didn't take it.","15:24":"they parted his garments among them","15:25":"{9:00 A. M.} and they crucified him.","15:26":"THE KING OF THE JEWS.","15:27":"and one on his left.","15:28":"which says","15:29":"wagging their heads","15:30":"and come down from the cross!,Save thyself, and come down from the cross.,,,,,,,,","15:31":"also the chief priests mocking among themselves with the scribes said","15:32":"the King of Israel","15:33":"noon} had come","15:34":"saying","15:35":"when they heard it","15:36":"and filling a sponge full of vinegar","15:37":"and gave up the spirit.","15:38":"And the veil of the temple was rent in twain from the top to the bottom.","15:39":"who stood by opposite him","15:40":"among whom were both Mary Magdalene","15:41":"when he was in Galilee","15:42":"because it was the Preparation Day","15:43":"a prominent council member who also himself was looking for the Kingdom of God","15:44":"he asked him whether he had been dead long.","15:45":"he granted the body to Joseph.","15:46":"and taking him down","15:47":"the mother of Joses","16:1":"Mary Magdalene","16:2":"they came to the tomb when the sun had risen.","16:3":"Who will roll away the stone from the door of the tomb for us?","16:4":"they saw that the stone was rolled back.","16:5":"they saw a young man sitting on the right side","16:6":"Don't be amazed.  You seek Jesus, the Nazarene, who has been crucified.  He has risen. He is not here.  Behold, the place where they laid him!,And he saith unto them, Be not affrighted: Ye seek Jesus of Nazareth, which was crucified: he is risen; he is not here: behold the place where they laid him.,,,,,,,,","16:7":"tell his disciples and Peter","16:8":"{TR adds quickly} and fled from the tomb","16:9":"he appeared first to Mary Magdalene","16:10":"as they mourned and wept.","16:11":"and had been seen by her","16:12":"as they walked","16:13":"either.","16:14":"and he rebuked them for their unbelief and hardness of heart","16:15":"Go into all the world, and preach the Good News to the whole creation.,And he said unto them, Go ye into all the world, and preach the gospel to every creature.,,,,,,,,","16:16":"He that believeth and is baptized shall be saved; but he that believeth not shall be damned.","16:17":"And these signs shall follow them that believe; In my name shall they cast out devils; they shall speak with new tongues;","16:18":"it will in no way hurt them; they will lay hands on the sick","16:19":"after he had spoken to them","16:20":"and preached everywhere"}