{"1:1":"the son of David","1:2":"Abraham begat Isaac; and Isaac begat Jacob; and Jacob begat Judas and his brethren;","1:3":"And Judas begat Phares and Zara of Thamar; and Phares begat Esrom; and Esrom begat Aram;","1:4":"And Aram begat Aminadab; and Aminadab begat Naasson; and Naasson begat Salmon;","1:5":"And Salmon begat Booz of Rachab; and Booz begat Obed of Ruth; and Obed begat Jesse;","1:6":"And Jesse begat David the king; and David the king begat Solomon of her that had been the wife of Urias;","1:7":"And Solomon begat Roboam; and Roboam begat Abia; and Abia begat Asa;","1:8":"And Asa begat Josaphat; and Josaphat begat Joram; and Joram begat Ozias;","1:9":"And Ozias begat Joatham; and Joatham begat Achaz; and Achaz begat Ezekias;","1:10":"And Ezekias begat Manasses; and Manasses begat Amon; and Amon begat Josias;","1:11":"at the time of the exile to Babylon.","1:12":"Jechoniah became the father of Shealtiel. Shealtiel became the father of Zerubbabel.","1:13":"And Zorobabel begat Abiud; and Abiud begat Eliakim; and Eliakim begat Azor;","1:14":"And Azor begat Sadoc; and Sadoc begat Achim; and Achim begat Eliud;","1:15":"And Eliud begat Eleazar; and Eleazar begat Matthan; and Matthan begat Jacob;","1:16":"the husband of Mary","1:17":"fourteen generations.","1:18":"Mary","1:19":"her husband","1:20":"behold","1:21":"for it is he who shall save his people from their sins.,And she shall bring forth a son, and thou shalt call his name JESUS: for he shall save his people from their sins.,,,,,,,,","1:22":"that it might be fulfilled which was spoken by the Lord through the prophet","1:23":"being interpreted","1:24":"and did as the angel of the Lord commanded him","1:25":"And knew her not till she had brought forth her firstborn son: and he called his name JESUS.","2:1":"behold","2:2":"Saying","2:3":"he was troubled","2:4":"he asked them where the Christ would be born.","2:5":"In Bethlehem of Judea, for thus it is written through the prophet,,And they said unto him, In Bethlehem of Judaea: for thus it is written by the prophet,,,,,,,,,","2:6":"land of Judah","2:7":"and learned from them exactly what time the star appeared.","2:8":"and said","2:9":"having heard the king","2:10":"they rejoiced with exceedingly great joy.","2:11":"his mother","2:12":"they went back to their own country another way.","2:13":"behold","2:14":"and departed into Egypt","2:15":"saying","2:16":"when he saw that he was mocked by the wise men","2:17":"saying","2:18":"In Rama was there a voice heard","2:19":"behold","2:20":"Saying","2:21":"and came into the land of Israel.","2:22":"Herod","2:23":"And he came and dwelt in a city called Nazareth: that it might be fulfilled which was spoken by the prophets","3:1":"John the Baptizer came","3:2":"And saying","3:3":"saying","3:4":"with a leather belt around his waist.  His food was locusts and wild honey.","3:5":"all of Judea","3:6":"immersed} by him in the Jordan","3:7":"{or","3:8":"Bring forth therefore fruits meet for repentance:","3:9":"'We have Abraham for our father","3:10":"","3:11":"immerse} you in water for repentance","3:12":"and he will thoroughly cleanse his threshing floor.  He will gather his wheat into the barn","3:13":"to be baptized by him.","3:14":"saying","3:15":"answering","3:16":"when he was baptized","3:17":"a voice out of the heavens said","4:1":"Then was Jesus led up of the spirit into the wilderness to be tempted of the devil.","4:2":"he was hungry afterward.","4:3":"If you are the Son of God, command that these stones become bread.","4:4":"It is written, 'Man shall not live by bread alone, but by every word that proceeds out of the mouth of God.'{Deuteronomy 8:3}","4:5":"","4:6":"If you are the Son of God, throw yourself down, for it is written, 'He will give his angels charge concerning you.' and, 'On their hands they will bear you up, so that you don't dash your foot against a stone.'{Psalm 91:11-12}","4:7":"Again, it is written, 'You shall not test the Lord, your God.'{Deuteronomy 6:16}","4:8":"the devil took him to an exceedingly high mountain","4:9":"I will give you all of these things, if you will fall down and worship me.","4:10":"Get behind me,{TR and NU read Go away instead of Get behind me} Satan!  For it is written, 'You shall worship the Lord your God, and him only shall you serve.'{Deuteronomy 6:13}","4:11":"and behold","4:12":"he withdrew into Galilee.","4:13":"he came and lived in Capernaum","4:14":"saying","4:15":"","4:16":"to those who sat in the region and shadow of death","4:17":"Jesus began to preach","4:18":"he{TR reads Jesus instead of he} saw two brothers:  Simon","4:19":"Come after me, and I will make you fishers for men.","4:20":"And they straightway left their nets","4:21":"he saw two other brothers","4:22":"and followed him.","4:23":"teaching in their synagogues","4:24":"afflicted with various diseases and torments","4:25":"Decapolis","5:1":"he went up onto the mountain. When he had sat down","5:2":"saying","5:3":"","5:4":"for they shall be comforted.{Isaiah 61:2; 66:10","5:5":"for they shall inherit the earth.{or","5:6":"for they shall be filled.","5:7":"for they shall obtain mercy.","5:8":"for they shall see God.","5:9":"for they shall be called children of God.","5:10":"for theirs is the Kingdom of Heaven.","5:11":"","5:12":"and be exceedingly glad","5:13":"","5:14":"Ye are the light of the world. A city that is set on an hill cannot be hid.","5:15":"and put it under a measuring basket","5:16":"let your light shine before men; that they may see your good works","5:17":"","5:18":"I tell you","5:19":"therefore","5:20":"there is no way you will enter into the Kingdom of Heaven.","5:21":"","5:22":"that everyone who is angry with his brother without a cause{NU omits without a cause.} shall be in danger of the judgment; and whoever shall say to his brother","5:23":"","5:24":"and go your way. First be reconciled to your brother","5:25":"while you are with him in the way; lest perhaps the prosecutor deliver you to the judge","5:26":"you shall by no means get out of there","5:27":"} 'You shall not commit adultery;'{Exodus 20:14},Ye have heard that it was said by them of old time, Thou shalt not commit adultery:,,,,,,,,","5:28":"But I say unto you","5:29":"pluck it out and throw it away from you.  For it is more profitable for you that one of your members should perish","5:30":"cut it off","5:31":"","5:32":"except for the cause of sexual immorality","5:33":"","5:34":"don't swear at all:  neither by heaven","5:35":"for it is the footstool of his feet; nor by Jerusalem","5:36":"for you can't make one hair white or black.","5:37":"But let your communication be","5:38":"","5:39":"don't resist him who is evil; but whoever strikes you on your right cheek","5:40":"let him have your cloak also.","5:41":"go with him two.","5:42":"and don't turn away him who desires to borrow from you.","5:43":"","5:44":"love your enemies","5:45":"and sends rain on the just and the unjust.","5:46":"what reward do you have? Don't even the tax collectors do the same?","5:47":"what more do you do than others? Don't even the tax collectors do the same?","5:48":"just as your Father in heaven is perfect.","6:1":"","6:2":"don't sound a trumpet before yourself","6:3":"don't let your left hand know what your right hand does","6:4":"then your Father who sees in secret will reward you openly.","6:5":"","6:6":"when you pray","6:7":"don't use vain repetitions","6:8":"for your Father knows what things you need","6:9":"may your name be kept holy.","6:10":"as in heaven","6:11":"Give us this day our daily bread.","6:12":"as we also forgive our debtors.","6:13":"but deliver us from the evil one. For yours is the Kingdom","6:14":"","6:15":"neither will your Father forgive your trespasses.","6:16":"","6:17":"when you fast","6:18":"but by your Father who is in secret","6:19":"","6:20":"where neither moth nor rust consume","6:21":"there your heart will be also.","6:22":"","6:23":"your whole body will be full of darkness. If therefore the light that is in you is darkness","6:24":"","6:25":"I tell you","6:26":"that they don't sow","6:27":"","6:28":"how they grow.  They don't toil","6:29":"And yet I say unto you","6:30":"which today exists","6:31":"","6:32":"for your heavenly Father knows that you need all these things.","6:33":"and his righteousness; and all these things will be given to you as well.","6:34":"for tomorrow will be anxious for itself.  Each day's own evil is sufficient.","7:1":"","7:2":"you will be judged; and with whatever measure you measure","7:3":"but don't consider the beam that is in your own eye?","7:4":"'Let me remove the speck from your eye;' and behold","7:5":"and then you can see clearly to remove the speck out of your brother's eye.","7:6":"","7:7":"","7:8":"For every one that asketh receiveth; and he that seeketh findeth; and to him that knocketh it shall be opened.","7:9":"who","7:10":"who will give him a serpent?","7:11":"being evil","7:12":"you shall also do to them; for this is the law and the prophets.","7:13":"","7:14":"and restricted is the way that leads to life! Few are those who find it.","7:15":"","7:16":"or figs from thistles?","7:17":"every good tree produces good fruit; but the corrupt tree produces evil fruit.","7:18":"neither can a corrupt tree produce good fruit.","7:19":"and thrown into the fire.","7:20":"by their fruits you will know them.","7:21":"'Lord","7:22":"'Lord","7:23":"'I never knew you.  Depart from me","7:24":"","7:25":"the floods came","7:26":"and doesn't do them will be like a foolish man","7:27":"the floods came","7:28":"when Jesus had finished saying these things","7:29":"and not like the scribes.","8:1":"great multitudes followed him.","8:2":"a leper came to him and worshiped him","8:3":"and touched him","8:4":"See that you tell nobody, but go, show yourself to the priest, and offer the gift that Moses commanded, as a testimony to them.","8:5":"a centurion came to him","8:6":"Lord, my servant lies in the house paralyzed, grievously tormented.","8:7":"I will come and heal him.","8:8":"Lord, I'm not worthy for you to come under my roof.  Just say the word, and my servant will be healed.,The centurion answered and said, Lord, I am not worthy that thou shouldest come under my roof: but speak the word only, and my servant shall be healed.,,,,,,,,","8:9":"having under myself soldiers. I tell this one","8:10":"he marveled","8:11":"and will sit down with Abraham","8:12":"","8:13":"Go your way.  Let it be done for you as you have believed.  His servant was healed in that hour.","8:14":"he saw his wife's mother lying sick with a fever.","8:15":"and the fever left her.  She got up and served him.{TR reads them instead of him}","8:16":"they brought to him many possessed with demons. He cast out the spirits with a word","8:17":"saying:  He took our infirmities, and bore our diseases.{Isaiah 53:4}","8:18":"he gave the order to depart to the other side.","8:19":"and said to him","8:20":"The foxes have holes, and the birds of the sky have nests, but the Son of Man has nowhere to lay his head.","8:21":"Lord, allow me first to go and bury my father.","8:22":"Follow me, and leave the dead to bury their own dead.","8:23":"his disciples followed him.","8:24":"a violent storm came up on the sea","8:25":"and woke him up","8:26":"Why are you fearful, O you of little faith? Then he got up","8:27":"saying","8:28":"into the country of the Gergesenes","8:29":"they cried out","8:30":"And there was a good way off from them an herd of many swine feeding.","8:31":"saying","8:32":"Go!  They came out","8:33":"and went away into the city","8:34":"all the city came out to meet Jesus.  When they saw him","9:1":"and crossed over","9:2":"they brought to him a man who was paralyzed","9:3":"some of the scribes said to themselves","9:4":"knowing their thoughts","9:5":"to say","9:6":"and take up your mat","9:7":"And he arose","9:8":"they marveled and glorified God","9:9":"he saw a man called Matthew sitting at the tax collection office.  He said to him","9:10":"behold","9:11":"they said to his disciples","9:12":"he said to them","9:13":"and not sacrifice","9:14":"saying","9:15":"Can the friends of the bridegroom mourn, as long as the bridegroom is with them?  But the days will come when the bridegroom will be taken away from them, and then they will fast.,And Jesus said unto them, Can the children of the bridechamber mourn, as long as the bridegroom is with them? but the days will come, when the bridegroom shall be taken from them, and then shall they fast.,,,,,,,,","9:16":"and a worse hole is made.","9:17":"or else the skins would burst","9:18":"behold","9:19":"as did his disciples.","9:20":"a woman who had an issue of blood for twelve years came behind him","9:21":"If I just touch his garment, I will be made well.","9:22":"turning around and seeing her","9:23":"and saw the flute players","9:24":"Make room, because the girl isn't dead, but sleeping.  They were ridiculing him.","9:25":"he entered in","9:26":"And the fame hereof went abroad into all that land.","9:27":"two blind men followed him","9:28":"the blind men came to him. Jesus said to them","9:29":"saying","9:30":"saying","9:31":"But they","9:32":"behold","9:33":"the mute man spoke. The multitudes marveled","9:34":"By the prince of the demons, he casts out demons.","9:35":"teaching in their synagogues","9:36":"he was moved with compassion for them","9:37":"The harvest indeed is plentiful, but the laborers are few.,Then saith he unto his disciples, The harvest truly is plenteous, but the labourers are few;,,,,,,,,","9:38":"","10:1":"and gave them authority over unclean spirits","10:2":"Simon","10:3":"whose surname was{NU omits Lebbaeus, whose surname was} Thaddaeus;","10:4":"who also betrayed him.","10:5":"and charged them","10:6":"go to the lost sheep of the house of Israel.","10:7":"preach","10:8":"cleanse the lepers{TR adds , raise the dead}","10:9":"nor silver","10:10":"neither two coats","10:11":"find out who in it is worthy; and stay there until you go on.","10:12":"greet it.","10:13":"let your peace come on it","10:14":"nor hear your words","10:15":"it will be more tolerable for the land of Sodom and Gomorrah in the day of judgment than for that city.","10:16":"","10:17":"and in their synagogues they will scourge you.","10:18":"and you will be brought before governors and kings for my sake","10:19":"don't be anxious how or what you will say","10:20":"but the Spirit of your Father who speaks in you.","10:21":"","10:22":"but he who endures to the end will be saved.","10:23":"flee into the next","10:24":"","10:25":"and the servant like his lord.  If they have called the master of the house Beelzebul","10:26":"for there is nothing covered that will not be revealed; and hidden that will not be known.","10:27":"speak in the light; and what you hear whispered in the ear","10:28":"but are not able to kill the soul.  Rather","10:29":"","10:30":"But the very hairs of your head are all numbered.","10:31":"Fear ye not therefore","10:32":"him I will also confess before my Father who is in heaven.","10:33":"him I will also deny before my Father who is in heaven.","10:34":"","10:35":"and a daughter against her mother","10:36":"And a man's foes shall be they of his own household.","10:37":"He that loveth father or mother more than me is not worthy of me: and he that loveth son or daughter more than me is not worthy of me.","10:38":"isn't worthy of me.","10:39":"He that findeth his life shall lose it: and he that loseth his life for my sake shall find it.","10:40":"and he who receives me receives him who sent me.","10:41":"He that receiveth a prophet in the name of a prophet shall receive a prophet's reward; and he that receiveth a righteous man in the name of a righteous man shall receive a righteous man's reward.","10:42":"most certainly I tell you he will in no way lose his reward.,And whosoever shall give to drink unto one of these little ones a cup of cold water only in the name of a disciple, verily I say unto you, he shall in no wise lose his reward.,,,,,,,,","11:1":"he departed from there to teach and preach in their cities.","11:2":"he sent two of his disciples","11:3":"Are you he who comes, or should we look for another?","11:4":"Go and tell John the things which you hear and see:,Jesus answered and said unto them, Go and shew John again those things which ye do hear and see:,,,,,,,,","11:5":"the lame walk","11:6":"","11:7":"Jesus began to say to the multitudes concerning John","11:8":"those who wear soft clothing are in king's houses.","11:9":"I tell you","11:10":"of whom it is written","11:11":"among those who are born of women there has not arisen anyone greater than John the Baptizer; yet he who is least in the Kingdom of Heaven is greater than he.","11:12":"the Kingdom of Heaven suffers violence","11:13":"For all the prophets and the law prophesied until John.","11:14":"this is Elijah","11:15":"let him hear.","11:16":"","11:17":"'We played the flute for you","11:18":"and they say","11:19":"and they say","11:20":"because they didn't repent.","11:21":"","11:22":"it will be more tolerable for Tyre and Sidon on the day of judgment than for you.","11:23":"Capernaum","11:24":"on the day of judgment","11:25":"Jesus answered","11:26":"Father","11:27":"except the Father; neither does anyone know the Father","11:28":"","11:29":"and learn from me","11:30":"and my burden is light.,For my yoke is easy, and my burden is light.,,,,,,,,","12:1":"Jesus went on the Sabbath day through the grain fields. His disciples were hungry and began to pluck heads of grain and to eat.","12:2":"when they saw it","12:3":"Haven't you read what David did, when he was hungry, and those who were with him;,But he said unto them, Have ye not read what David did, when he was an hungred, and they that were with him;,,,,,,,,","12:4":"and ate the show bread","12:5":"that on the Sabbath day","12:6":"But I say unto you","12:7":"'I desire mercy","12:8":"","12:9":"and went into their synagogue.","12:10":"Is it lawful to heal on the Sabbath day? that they might accuse him.","12:11":"What man is there among you, who has one sheep, and if this one falls into a pit on the Sabbath day, won't he grab on to it, and lift it out?,And he said unto them, What man shall there be among you, that shall have one sheep, and if it fall into a pit on the sabbath day, will he not lay hold on it, and lift it out?,,,,,,,,","12:12":"","12:13":"Stretch out your hand.  He stretched it out; and it was restored whole","12:14":"and conspired against him","12:15":"perceiving that","12:16":"And charged them that they should not make him known:","12:17":"saying","12:18":"","12:19":"nor shout; neither will anyone hear his voice in the streets.","12:20":"until he leads justice to victory.","12:21":"the nations will hope.{Isaiah 42:1-4},And in his name shall the Gentiles trust.,,,,,,,,","12:22":"blind and mute","12:23":"and said","12:24":"they said","12:25":"Jesus said to them","12:26":"he is divided against himself. How then will his kingdom stand?","12:27":"by whom do your children cast them out?  Therefore they will be your judges.","12:28":"then the Kingdom of God has come upon you.","12:29":"and plunder his goods","12:30":"","12:31":"every sin and blasphemy will be forgiven men","12:32":"it will be forgiven him; but whoever speaks against the Holy Spirit","12:33":"","12:34":"how can you","12:35":"and the evil man out of his evil treasure{TR adds of the heart} brings out evil things.","12:36":"they will give account of it in the day of judgment.","12:37":"and by your words you will be condemned.,For by thy words thou shalt be justified, and by thy words thou shalt be condemned.,,,,,,,,","12:38":"Teacher, we want to see a sign from you.","12:39":"An evil and adulterous generation seeks after a sign, but no sign will be given it but the sign of Jonah the prophet.,But he answered and said unto them, An evil and adulterous generation seeketh after a sign; and there shall no sign be given to it, but the sign of the prophet Jonas:,,,,,,,,","12:40":"so will the Son of Man be three days and three nights in the heart of the earth.","12:41":"and will condemn it","12:42":"and will condemn it","12:43":"when he is gone out of the man","12:44":"'I will return into my house from which I came out","12:45":"and takes with himself seven other spirits more evil than he is","12:46":"behold","12:47":"Behold, your mother and your brothers stand outside, seeking to speak to you.","12:48":"Who is my mother? Who are my brothers?","12:49":"and said","12:50":"he is my brother","13:1":"and sat by the seaside.","13:2":"so that he entered into a boat","13:3":"saying","13:4":"some seeds fell by the roadside","13:5":"where they didn't have much soil","13:6":"they were scorched.  Because they had no root","13:7":"And some fell among thorns; and the thorns sprung up","13:8":"and yielded fruit: some one hundred times as much","13:9":"let him hear.,Who hath ears to hear, let him hear.,,,,,,,,","13:10":"and said to him","13:11":"To you it is given to know the mysteries of the Kingdom of Heaven, but it is not given to them.,He answered and said unto them, Because it is given unto you to know the mysteries of the kingdom of heaven, but to them it is not given.,,,,,,,,","13:12":"to him will be given","13:13":"because seeing they don't see","13:14":"which says","13:15":"their ears are dull of hearing","13:16":"","13:17":"and didn't see them; and to hear the things which you hear","13:18":"","13:19":"and doesn't understand it","13:20":"this is he who hears the word","13:21":"but endures for a while. When oppression or persecution arises because of the word","13:22":"this is he who hears the word","13:23":"this is he who hears the word","13:24":"saying","13:25":"his enemy came and sowed darnel weeds{darnel is a weed grass (probably bearded darnel or lolium temulentum) that looks very much like wheat until it is mature","13:26":"then the darnel weeds appeared also.","13:27":"'Sir","13:28":"'Do you want us to go and gather them up?'","13:29":"","13:30":"and in the harvest time I will tell the reapers","13:31":"saying","13:32":"it is greater than the herbs","13:33":"Another parable spake he unto them; The kingdom of heaven is like unto leaven","13:34":"he didn't speak to them","13:35":"saying","13:36":"and went into the house. His disciples came to him","13:37":"He who sows the good seed is the Son of Man,,He answered and said unto them, He that soweth the good seed is the Son of man;,,,,,,,,","13:38":"these are the children of the Kingdom; and the darnel weeds are the children of the evil one.","13:39":"and the reapers are angels.","13:40":"As therefore the tares are gathered and burned in the fire; so shall it be in the end of this world.","13:41":"and they will gather out of his Kingdom all things that cause stumbling","13:42":"And shall cast them into a furnace of fire: there shall be wailing and gnashing of teeth.","13:43":"let him hear.","13:44":"","13:45":"","13:46":"he went and sold all that he had","13:47":"","13:48":"when it was filled","13:49":"and separate the wicked from among the righteous","13:50":"","13:51":"Have you understood all these things? They answered him","13:52":"Therefore, every scribe who has been made a disciple in the Kingdom of Heaven is like a man who is a householder, who brings out of his treasure new and old things.","13:53":"he departed from there.","13:54":"he taught them in their synagogue","13:55":"and his brothers","13:56":"","13:57":"A prophet is not without honor, except in his own country, and in his own house.","13:58":"And he did not many mighty works there because of their unbelief.","14:1":"Herod the tetrarch heard the report concerning Jesus","14:2":"This is John the Baptizer. He is risen from the dead.  That is why these powers work in him.","14:3":"and bound him","14:4":"It is not lawful for you to have her.","14:5":"he feared the multitude","14:6":"the daughter of Herodias danced among them and pleased Herod.","14:7":"Whereupon he promised with an oath to give her whatsoever she would ask.","14:8":"being prompted by her mother","14:9":"but for the sake of his oaths","14:10":"And he sent","14:11":"and given to the young lady: and she brought it to her mother.","14:12":"and took the body","14:13":"he withdrew from there in a boat","14:14":"and he saw a great multitude.  He had compassion on them","14:15":"his disciples came to him","14:16":"They don't need to go away. You give them something to eat.","14:17":"We only have here five loaves and two fish.","14:18":"Bring them here to me.","14:19":"and looking up to heaven","14:20":"and were filled.  They took up twelve baskets full of that which remained left over from the broken pieces.","14:21":"besides women and children.","14:22":"and to go ahead of him to the other side","14:23":"he went up into the mountain by himself to pray.  When evening had come","14:24":"distressed by the waves","14:25":"{The night was equally divided into four watches","14:26":"they were troubled","14:27":"saying Cheer up! It is I!{or, I AM!} Don't be afraid.","14:28":"Lord, if it is you, command me to come to you on the waters.","14:29":"Come!  Peter stepped down from the boat","14:30":"he was afraid","14:31":"took hold of him","14:32":"the wind ceased.","14:33":"saying","14:34":"they came to the land of Gennesaret.","14:35":"they sent into all that surrounding region","14:36":"tassel} of his garment.  As many as touched it were made whole.","15:1":"saying","15:2":"Why do thy disciples transgress the tradition of the elders? for they wash not their hands when they eat bread.","15:3":"Why do you also disobey the commandment of God because of your tradition?,But he answered and said unto them, Why do ye also transgress the commandment of God by your tradition?,,,,,,,,","15:4":"'Honor your father and your mother","15:5":"'Whoever may tell his father or his mother","15:6":"And honour not his father or his mother","15:7":"saying","15:8":"and honor me with their lips; but their heart is far from me.","15:9":"teaching as doctrine rules made by men.'{Isaiah 29:13},But in vain they do worship me, teaching for doctrines the commandments of men.,,,,,,,,","15:10":"and said to them","15:11":"this defiles the man.,Not that which goeth into the mouth defileth a man; but that which cometh out of the mouth, this defileth a man.,,,,,,,,","15:12":"and said to him","15:13":"Every plant which my heavenly Father didn't plant will be uprooted.,But he answered and said, Every plant, which my heavenly Father hath not planted, shall be rooted up.,,,,,,,,","15:14":"both will fall into a pit.,Let them alone: they be blind leaders of the blind. And if the blind lead the blind, both shall fall into the ditch.,,,,,,,,","15:15":"Explain the parable to us.","15:16":"Do you also still not understand?,And Jesus said, Are ye also yet without understanding?,,,,,,,,","15:17":"and then out of the body?","15:18":"and they defile the man.","15:19":"murders","15:20":"","15:21":"and withdrew into the region of Tyre and Sidon.","15:22":"a Canaanite woman came out from those borders","15:23":"saying","15:24":"I wasn't sent to anyone but the lost sheep of the house of Israel.","15:25":"saying","15:26":"It is not appropriate to take the children's bread and throw it to the dogs.","15:27":"Yes, Lord, but even the dogs eat the crumbs which fall from their masters' table.","15:28":"Woman, great is your faith! Be it done to you even as you desire.  And her daughter was healed from that hour.","15:29":"and came near to the sea of Galilee; and he went up into the mountain","15:30":"having with them the lame","15:31":"injured whole","15:32":"I have compassion on the multitude, because they continue with me now three days and have nothing to eat.  I don't want to send them away fasting, or they might faint on the way.","15:33":"Where should we get so many loaves in a deserted place as to satisfy so great a multitude?","15:34":"How many loaves do you have? They said","15:35":"And he commanded the multitude to sit down on the ground.","15:36":"and gave to the disciples","15:37":"and were filled.  They took up seven baskets full of the broken pieces that were left over.","15:38":"besides women and children.","15:39":"got into the boat","16:1":"and testing him","16:2":"When it is evening, you say, 'It will be fair weather, for the sky is red.',He answered and said unto them, When it is evening, ye say, It will be fair weather: for the sky is red.,,,,,,,,","16:3":"'It will be foul weather today","16:4":"and there will be no sign given to it","16:5":"And when his disciples were come to the other side","16:6":"Take heed and beware of the yeast of the Pharisees and Sadducees.","16:7":"saying","16:8":"perceiving it","16:9":"neither remember the five loaves for the five thousand","16:10":"and how many baskets you took up?","16:11":"","16:12":"but of the teaching of the Pharisees and Sadducees.","16:13":"he asked his disciples","16:14":"Some say John the Baptizer, some, Elijah, and others, Jeremiah, or one of the prophets.","16:15":"But who do you say that I am?","16:16":"You are the Christ, the Son of the living God.","16:17":"Blessed are you, Simon Bar Jonah, for flesh and blood has not revealed this to you, but my Father who is in heaven.,And Jesus answered and said unto him, Blessed art thou, Simon Barjona: for flesh and blood hath not revealed it unto thee, but my Father which is in heaven.,,,,,,,,","16:18":"{Peter's name","16:19":"and whatever you bind on earth will have been bound in heaven; and whatever you release on earth will have been released in heaven.,And I will give unto thee the keys of the kingdom of heaven: and whatsoever thou shalt bind on earth shall be bound in heaven: and whatsoever thou shalt loose on earth shall be loosed in heaven.,,,,,,,,","16:20":"Then charged he his disciples that they should tell no man that he was Jesus the Christ.","16:21":"Jesus began to show his disciples that he must go to Jerusalem and suffer many things from the elders","16:22":"and began to rebuke him","16:23":"and said to Peter","16:24":"If anyone desires to come after me, let him deny himself, and take up his cross, and follow me.,Then said Jesus unto his disciples, If any man will come after me, let him deny himself, and take up his cross, and follow me.,,,,,,,,","16:25":"and whoever will lose his life for my sake will find it.","16:26":"if he gains the whole world","16:27":"and then he will render to everyone according to his deeds.","16:28":"there are some standing here who will in no way taste of death","17:1":"Jesus took with him Peter","17:2":"and his garments became as white as the light.","17:3":"Moses and Elijah appeared to them talking with him.","17:4":"and said to Jesus","17:5":"behold","17:6":"they fell on their faces","17:7":"Get up, and don't be afraid.","17:8":"they saw no one","17:9":"Jesus commanded them","17:10":"saying","17:11":"Elijah indeed comes first, and will restore all things,,And Jesus answered and said unto them, Elias truly shall first come, and restore all things.,,,,,,,,","17:12":"and they didn't recognize him","17:13":"Then the disciples understood that he spake unto them of John the Baptist.","17:14":"a man came to him","17:15":"","17:16":"and they could not cure him.,And I brought him to thy disciples, and they could not cure him.,,,,,,,,","17:17":"Faithless and perverse generation! How long will I be with you?  How long will I bear with you? Bring him here to me.","17:18":"the demon went out of him","17:19":"and said","17:20":"Because of your unbelief.  For most certainly I tell you, if you have faith as a grain of mustard seed, you will tell this mountain, 'Move from here to there,' and it will move; and nothing will be impossible for you.,And Jesus said unto them, Because of your unbelief: for verily I say unto you, If ye have faith as a grain of mustard seed, ye shall say unto this mountain, Remove hence to yonder place; and it shall remove; and nothing shall be impossible unto you.,,,,,,,,","17:21":"","17:22":"Jesus said to them","17:23":"and the third day he will be raised up. They were exceedingly sorry.,And they shall kill him, and the third day he shall be raised again. And they were exceeding sorry.,,,,,,,,","17:24":"those who collected the didrachma coins{A didrachma is a Greek silver coin worth 2 drachmas","17:25":"Yes. When he came into the house","17:26":"From strangers.  Jesus said to him","17:27":"lest we cause them to stumble","18:1":"saying","18:2":"and set him in the midst of them","18:3":"Most certainly I tell you, unless you turn, and become as little children, you will in no way enter into the Kingdom of Heaven.,And said, Verily I say unto you, Except ye be converted, and become as little children, ye shall not enter into the kingdom of heaven.,,,,,,,,","18:4":"the same is the greatest in the Kingdom of Heaven.","18:5":"","18:6":"it would be better for him that a huge millstone should be hung around his neck","18:7":"","18:8":"cut it off","18:9":"pluck it out","18:10":"for I tell you that in heaven their angels always see the face of my Father who is in heaven.","18:11":"For the Son of man is come to save that which was lost.","18:12":"","18:13":"most certainly I tell you","18:14":"Even so it is not the will of your Father which is in heaven","18:15":"","18:16":"take one or two more with you","18:17":"tell it to the assembly. If he refuses to hear the assembly also","18:18":"whatever things you bind on earth will have been bound in heaven","18:19":"assuredly I tell you","18:20":"there I am in the midst of them.,For where two or three are gathered together in my name, there am I in the midst of them.,,,,,,,,","18:21":"Lord, how often shall my brother sin against me, and I forgive him? Until seven times?","18:22":"I don't tell you until seven times, but, until seventy times seven.,Jesus saith unto him, I say not unto thee, Until seven times: but, Until seventy times seven.,,,,,,,,","18:23":"who wanted to reconcile accounts with his servants.","18:24":"one was brought to him who owed him ten thousand talents.{Ten thousand talents represents an extremely large sum of money","18:25":"his lord commanded him to be sold","18:26":"saying","18:27":"being moved with compassion","18:28":"","18:29":"","18:30":"but went and cast him into prison","18:31":"they were exceedingly sorry","18:32":"and said to him","18:33":"even as I had mercy on you?'","18:34":"and delivered him to the tormentors","18:35":"if you don't each forgive your brother from your hearts for his misdeeds.,So likewise shall my heavenly Father do also unto you, if ye from your hearts forgive not every one his brother their trespasses.,,,,,,,,","19:1":"he departed from Galilee","19:2":"and he healed them there.","19:3":"testing him","19:4":"Haven't you read that he who made them from the beginning made them male and female,{Genesis 1:27},And he answered and said unto them, Have ye not read, that he which made them at the beginning made them male and female,,,,,,,,,","19:5":"'For this cause a man shall leave his father and mother","19:6":"but one flesh.  What therefore God has joined together","19:7":"Why then did Moses command us to give her a bill of divorce, and divorce her?","19:8":"Moses, because of the hardness of your hearts, allowed you to divorce your wives, but from the beginning it has not been so.,He saith unto them, Moses because of the hardness of your hearts suffered you to put away your wives: but from the beginning it was not so.,,,,,,,,","19:9":"except for sexual immorality","19:10":"If this is the case of the man with his wife, it is not expedient to marry.","19:11":"Not all men can receive this saying, but those to whom it is given.,But he said unto them, All men cannot receive this saying, save they to whom it is given.,,,,,,,,","19:12":"and there are eunuchs who were made eunuchs by men; and there are eunuchs who made themselves eunuchs for the Kingdom of Heaven's sake.  He who is able to receive it","19:13":"that he should lay his hands on them and pray; and the disciples rebuked them.","19:14":"Allow the little children, and don't forbid them to come to me; for the Kingdom of Heaven belongs to ones like these.","19:15":"and departed from there.","19:16":"one came to him and said","19:17":"Why do you call me good?  No one is good but one, that is, God.  But if you want to enter into life, keep the commandments.","19:18":"Which ones?  Jesus said","19:19":"'You shall love your neighbor as yourself.'{Leviticus 19:18},Honour thy father and thy mother: and, Thou shalt love thy neighbour as thyself.,,,,,,,,","19:20":"All these things I have observed from my youth.  What do I still lack?","19:21":"If you want to be perfect, go, sell what you have, and give to the poor, and you will have treasure in heaven; and come, follow me.","19:22":"he went away sad","19:23":"Most certainly I say to you, a rich man will enter into the Kingdom of Heaven with difficulty.,Then said Jesus unto his disciples, Verily I say unto you, That a rich man shall hardly enter into the kingdom of heaven.,,,,,,,,","19:24":"it is easier for a camel to go through a needle's eye","19:25":"they were exceedingly astonished","19:26":"Jesus said","19:27":"Behold, we have left everything, and followed you.  What then will we have?","19:28":"Most certainly I tell you that you who have followed me, in the regeneration when the Son of Man will sit on the throne of his glory, you also will sit on twelve thrones, judging the twelve tribes of Israel.,And Jesus said unto them, Verily I say unto you, That ye which have followed me, in the regeneration when the Son of man shall sit in the throne of his glory, ye also shall sit upon twelve thrones, judging the twelve tribes of Israel.,,,,,,,,","19:29":"or brothers","19:30":"But many that are first shall be last; and the last shall be first.","20:1":"","20:2":"he sent them into his vineyard.","20:3":"{Time was measured from sunrise to sunset","20:4":"'You also go into the vineyard","20:5":"{noon and 3:00 P. M.} and did likewise.","20:6":"and found others standing idle.  He said to them","20:7":"'You also go into the vineyard","20:8":"the lord of the vineyard said to his manager","20:9":"","20:10":"they supposed that they would receive more; and they likewise each received a denarius.","20:11":"they murmured against the master of the household","20:12":"'These last have spent one hour","20:13":"","20:14":"and go your way.  It is my desire to give to this last just as much as to you.","20:15":"because I am good?'","20:16":"and the first last. For many are called","20:17":"he took the twelve disciples aside","20:18":"","20:19":"to scourge","20:20":"kneeling and asking a certain thing of him.","20:21":"What do you want?  She said to him","20:22":"You don't know what you are asking. Are you able to drink the cup that I am about to drink, and be baptized with the baptism that I am baptized with? They said to him","20:23":"You will indeed drink my cup, and be baptized with the baptism that I am baptized with, but to sit on my right hand and on my left hand is not mine to give; but it is for whom it has been prepared by my Father.","20:24":"they were indignant with the two brothers.","20:25":"and said","20:26":"but whoever desires to become great among you shall be{TR reads let him be instead of shall be} your servant.","20:27":"","20:28":"but to serve","20:29":"a great multitude followed him.","20:30":"two blind men sitting by the road","20:31":"telling them that they should be quiet","20:32":"and called them","20:33":"Lord, that our eyes may be opened.","20:34":"being moved with compassion","21:1":"and came to Bethsphage","21:2":"Go into the village that is opposite you, and immediately you will find a donkey tied, and a colt with her. Untie them, and bring them to me.,Saying unto them, Go into the village over against you, and straightway ye shall find an ass tied, and a colt with her: loose them, and bring them unto me.,,,,,,,,","21:3":"you shall say","21:4":"that it might be fulfilled which was spoken through the prophet","21:5":"Tell ye the daughter of Sion","21:6":"and did just as Jesus commanded them","21:7":"and laid their clothes on them; and he sat on them.","21:8":"and spread them on the road.","21:9":"and who followed kept shouting","21:10":"all the city was stirred up","21:11":"This is the prophet, Jesus, from Nazareth of Galilee.","21:12":"and drove out all of those who sold and bought in the temple","21:13":"It is written, 'My house shall be called a house of prayer,'{Isaiah 56:7} but you have made it a den of robbers!{Jeremiah 7:11}","21:14":"and he healed them.","21:15":"and the children who were crying in the temple and saying","21:16":"Do you hear what these are saying? Jesus said to them","21:17":"and went out of the city to Bethany","21:18":"as he returned to the city","21:19":"he came to it","21:20":"they marveled","21:21":"Most certainly I tell you, if you have faith, and don't doubt, you will not only do what was done to the fig tree, but even if you told this mountain, 'Be taken up and cast into the sea,' it would be done.,Jesus answered and said unto them, Verily I say unto you, If ye have faith, and doubt not, ye shall not only do this which is done to the fig tree, but also if ye shall say unto this mountain, Be thou removed, and be thou cast into the sea; it shall be done.,,,,,,,,","21:22":"whatever you ask in prayer","21:23":"the chief priests and the elders of the people came to him as he was teaching","21:24":"I also will ask you one question, which if you tell me, I likewise will tell you by what authority I do these things.,And Jesus answered and said unto them, I also will ask you one thing, which if ye tell me, I in like wise will tell you by what authority I do these things.,,,,,,,,","21:25":"where was it from?  From heaven or from men? They reasoned with themselves, saying, If we say","21:26":"'From men","21:27":"and said","21:28":"and he came to the first","21:29":"'I will not","21:30":"and said the same thing.  He answered","21:31":"Whether of them twain did the will of his father? They say unto him","21:32":"and you didn't believe him","21:33":"","21:34":"he sent his servants to the farmers","21:35":"beat one","21:36":"he sent other servants more than the first: and they treated them the same way.","21:37":"saying","21:38":"when they saw the son","21:39":"and threw him out of the vineyard","21:40":"what will he do to those farmers?,When the lord therefore of the vineyard cometh, what will he do unto those husbandmen?,,,,,,,,","21:41":"He will miserably destroy those miserable men, and will lease out the vineyard to other farmers, who will give him the fruit in its season.","21:42":"Did you never read in the Scriptures, 'The stone which the builders rejected, the same was made the head of the corner.  This was from the Lord. It is marvelous in our eyes?'{Psalm 118:22-23},Jesus saith unto them, Did ye never read in the scriptures, The stone which the builders rejected, the same is become the head of the corner: this is the Lord's doing, and it is marvellous in our eyes?,,,,,,,,","21:43":"","21:44":"but on whoever it will fall","21:45":"they perceived that he spoke about them.","21:46":"they feared the multitudes","22:1":"saying","22:2":"","22:3":"but they would not come.","22:4":"saying","22:5":"and went their ways","22:6":"and treated them shamefully","22:7":"he was angry","22:8":"","22:9":"and as many as you may find","22:10":"and gathered together as many as they found","22:11":"he saw there a man who didn't have on wedding clothing","22:12":"'Friend","22:13":"'Bind him hand and foot","22:14":"but few chosen.,For many are called, but few are chosen.,,,,,,,,","22:15":"Then went the Pharisees","22:16":"along with the Herodians","22:17":"what do you think?  Is it lawful to pay taxes to Caesar","22:18":"and said","22:19":"","22:20":"Whose is this image and inscription?","22:21":"Caesar's. Then he said to them","22:22":"they marveled","22:23":"","22:24":"Teacher, Moses said, 'If a man dies, having no children, his brother shall marry his wife, and raise up seed for his brother.',Saying, Master, Moses said, If a man die, having no children, his brother shall marry his wife, and raise up seed unto his brother.,,,,,,,,","22:25":"and having no seed left his wife to his brother.","22:26":"and the third","22:27":"the woman died.","22:28":"whose wife will she be of the seven? For they all had her.,Therefore in the resurrection whose wife shall she be of the seven? for they all had her.,,,,,,,,","22:29":"You are mistaken, not knowing the Scriptures, nor the power of God.,Jesus answered and said unto them, Ye do err, not knowing the scriptures, nor the power of God.,,,,,,,,","22:30":"nor are given in marriage","22:31":"haven't you read that which was spoken to you by God","22:32":"and the God of Isaac","22:33":"they were astonished at his teaching.","22:34":"when they heard that he had silenced the Sadducees","22:35":"a lawyer","22:36":"Master","22:37":"'You shall love the Lord your God with all your heart, with all your soul, and with all your mind.'{Deuteronomy 6:5},Jesus said unto him, Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind.,,,,,,,,","22:38":"This is the first and great commandment.","22:39":"'You shall love your neighbor as yourself.'{Leviticus 19:18}","22:40":"","22:41":"Jesus asked them a question","22:42":"What do you think of the Christ?  Whose son is he? They said to him","22:43":"How then does David in the Spirit call him Lord, saying,,He saith unto them, How then doth David in spirit call him Lord, saying,,,,,,,,,","22:44":"sit on my right hand","22:45":"If David then call him Lord","22:46":"neither did any man dare ask him any more questions from that day forth.","23:1":"","23:2":"The scribes and the Pharisees sat on Moses' seat.,Saying The scribes and the Pharisees sit in Moses' seat:,,,,,,,,","23:3":"observe and do","23:4":"and lay them on men's shoulders; but they themselves will not lift a finger to help them.","23:5":"enlarge the fringes{or","23:6":"the best seats in the synagogues","23:7":"and to be called 'Rabbi","23:8":"' for one is your teacher","23:9":"for one is your Father","23:10":"for one is your master","23:11":"But he that is greatest among you shall be your servant.","23:12":"and whoever humbles himself will be exalted.","23:13":"","23:14":"","23:15":"scribes and Pharisees","23:16":"","23:17":"the gold","23:18":"it is nothing; but whoever swears by the gift that is on it","23:19":"the gift","23:20":"swears by it","23:21":"swears by it","23:22":"swears by the throne of God","23:23":"","23:24":"who strain out a gnat","23:25":"","23:26":"first clean the inside of the cup and of the platter","23:27":"","23:28":"but inwardly you are full of hypocrisy and iniquity.","23:29":"","23:30":"'If we had lived in the days of our fathers","23:31":"Wherefore ye be witnesses unto yourselves","23:32":"then","23:33":"you offspring of vipers","23:34":"behold","23:35":"from the blood of righteous Abel to the blood of Zachariah son of Barachiah","23:36":"all these things will come upon this generation.","23:37":"","23:38":"your house is left to you desolate.","23:39":"you will not see me from now on","24:1":"and was going on his way. His disciples came to him to show him the buildings of the temple.","24:2":"Don't you see all of these things? Most certainly I tell you, there will not be left here one stone on another, that will not be thrown down.","24:3":"the disciples came to him privately","24:4":"Be careful that no one leads you astray.,And Jesus answered and said unto them, Take heed that no man deceive you.,,,,,,,,","24:5":"saying","24:6":"for all this must happen","24:7":"and kingdom against kingdom; and there will be famines","24:8":"All these are the beginning of sorrows.","24:9":"and will kill you. You will be hated by all of the nations for my name's sake.","24:10":"and will deliver up one another","24:11":"and will lead many astray.","24:12":"the love of many will grow cold.","24:13":"the same will be saved.","24:14":"and then the end will come.","24:15":"","24:16":"Then let them which be in Judaea flee into the mountains:","24:17":"Let him which is on the housetop not come down to take any thing out of his house:","24:18":"Neither let him which is in the field return back to take his clothes.","24:19":"And woe unto them that are with child","24:20":"nor on a Sabbath","24:21":"such as has not been from the beginning of the world until now","24:22":"no flesh would have been saved. But for the sake of the chosen ones","24:23":"","24:24":"and false prophets","24:25":"","24:26":"'Behold","24:27":"and is seen even to the west","24:28":"there is where the vultures{or","24:29":"the sun will be darkened","24:30":"and they will see the Son of Man coming on the clouds of the sky with power and great glory.","24:31":"and they will gather together his chosen ones from the four winds","24:32":"","24:33":"when you see all these things","24:34":"this generation{The word for generation (genea) can also be translated as race.} will not pass away","24:35":"but my words will not pass away.","24:36":"not even the angels of heaven","24:37":"","24:38":"marrying and giving in marriage","24:39":"and took them all away","24:40":"Then shall two be in the field; the one shall be taken","24:41":"one will be taken and one will be left.","24:42":"for you don't know in what hour your Lord comes.","24:43":"that if the master of the house had known in what watch of the night the thief was coming","24:44":"for in an hour that you don't expect","24:45":"","24:46":"Blessed is that servant","24:47":"Verily I say unto you","24:48":"'My lord is delaying his coming","24:49":"and eat and drink with the drunkards","24:50":"and in an hour when he doesn't know it","24:51":"and appoint his portion with the hypocrites.  There is where the weeping and grinding of teeth will be.","25:1":"","25:2":"and five were wise.","25:3":"when they took their lamps","25:4":"But the wise took oil in their vessels with their lamps.","25:5":"they all slumbered and slept.","25:6":"'Behold!  The bridegroom is coming! Come out to meet him!'","25:7":"and trimmed their lamps.{The end of the wick of an oil lamp needs to be cut off periodically to avoid having it become clogged with carbon deposits. The wick height is also adjusted so that the flame burns evenly and gives good light without producing a lot of smoke.}","25:8":"'Give us some of your oil","25:9":"saying","25:10":"the bridegroom came","25:11":"saying","25:12":"'Most certainly I tell you","25:13":"for you don't know the day nor the hour in which the Son of Man is coming.","25:14":"","25:15":"to another two","25:16":"and made another five talents.","25:17":"And likewise he that had received two","25:18":"and hid his lord's money.","25:19":"","25:20":"saying","25:21":"","25:22":"","25:23":"","25:24":"","25:25":"and went away and hid your talent in the earth. Behold","25:26":"","25:27":"and at my coming I should have received back my own with interest.","25:28":"and give it to him who has the ten talents.","25:29":"and he will have abundance","25:30":"where there will be weeping and gnashing of teeth.'","25:31":"","25:32":"and he will separate them one from another","25:33":"but the goats on the left.","25:34":"'Come","25:35":"and you gave me food to eat; I was thirsty","25:36":"and you clothed me; I was sick","25:37":"","25:38":"and take you in; or naked","25:39":"or in prison","25:40":"","25:41":"'Depart from me","25:42":"and you didn't give me food to eat; I was thirsty","25:43":"and you didn't take me in; naked","25:44":"","25:45":"","25:46":"but the righteous into eternal life.,And these shall go away into everlasting punishment: but the righteous into life eternal.,,,,,,,,","26:1":"when Jesus had finished all these words","26:2":"Ye know that after two days is the feast of the passover","26:3":"the scribes","26:4":"and kill him.","26:5":"Not during the feast, lest a riot occur among the people.","26:6":"in the house of Simon the leper","26:7":"and she poured it on his head as he sat at the table.","26:8":"they were indignant","26:9":"and given to the poor.,For this ointment might have been sold for much, and given to the poor.,,,,,,,,","26:10":"knowing this","26:11":"For ye have the poor always with you; but me ye have not always.","26:12":"she did it to prepare me for burial.","26:13":"wherever this Good News is preached in the whole world","26:14":"who was called Judas Iscariot","26:15":"What are you willing to give me, that I should deliver him to you?  They weighed out for him thirty pieces of silver.","26:16":"And from that time he sought opportunity to betray him.","26:17":"the disciples came to Jesus","26:18":"Go into the city to a certain person, and tell him, 'The Teacher says, My time is at hand.  I will keep the Passover at your house with my disciples.'","26:19":"and they prepared the Passover.","26:20":"he was reclining at the table with the twelve disciples.","26:21":"he said","26:22":"and each began to ask him","26:23":"He who dipped his hand with me in the dish, the same will betray me.,And he answered and said, He that dippeth his hand with me in the dish, the same shall betray me.,,,,,,,,","26:24":"even as it is written of him","26:25":"who betrayed him","26:26":"Jesus took bread","26:27":"gave thanks","26:28":"which is poured out for many for the remission of sins.","26:29":"until that day when I drink it anew with you in my Father's Kingdom.,But I say unto you, I will not drink henceforth of this fruit of the vine, until that day when I drink it new with you in my Father's kingdom.,,,,,,,,","26:30":"they went out to the Mount of Olives.","26:31":"All of you will be made to stumble because of me tonight, for it is written, 'I will strike the shepherd, and the sheep of the flock will be scattered.'{Zechariah 13:7},Then saith Jesus unto them, All ye shall be offended because of me this night: for it is written, I will smite the shepherd, and the sheep of the flock shall be scattered abroad.,,,,,,,,","26:32":"I will go before you into Galilee.,But after I am risen again, I will go before you into Galilee.,,,,,,,,","26:33":"Even if all will be made to stumble because of you, I will never be made to stumble.","26:34":"Most certainly I tell you that tonight, before the rooster crows, you will deny me three times.","26:35":"Even if I must die with you, I will not deny you.  All of the disciples also said likewise.","26:36":"and said to his disciples","26:37":"and began to be sorrowful and severely troubled.","26:38":"My soul is exceedingly sorrowful, even to death.  Stay here, and watch with me.","26:39":"fell on his face","26:40":"and found them sleeping","26:41":"that you don't enter into temptation. The spirit indeed is willing","26:42":"a second time he went away","26:43":"for their eyes were heavy.","26:44":"went away","26:45":"and said to them","26:46":"let's be going.  Behold","26:47":"behold","26:48":"saying","26:49":"and said","26:50":"Friend, why are you here?  Then they came and laid hands on Jesus","26:51":"one of those who were with Jesus stretched out his hand","26:52":"Put your sword back into its place, for all those who take the sword will die by the sword.,Then said Jesus unto him, Put up again thy sword into his place: for all they that take the sword shall perish with the sword.,,,,,,,,","26:53":"and he would even now send me more than twelve legions of angels?","26:54":"","26:55":"Have you come out as against a robber with swords and clubs to seize me? I sat daily in the temple teaching, and you didn't arrest me.,In that same hour said Jesus to the multitudes, Are ye come out as against a thief with swords and staves for to take me? I sat daily with you teaching in the temple, and ye laid no hold on me.,,,,,,,,","26:56":"that the Scriptures of the prophets might be fulfilled.  Then all the disciples left him, and fled.,But all this was done, that the scriptures of the prophets might be fulfilled. Then all the disciples forsook him, and fled.,,,,,,,,","26:57":"where the scribes and the elders were gathered together.","26:58":"to the court of the high priest","26:59":"the elders","26:60":"they found none.  But at last two false witnesses came forward","26:61":"This man said, 'I am able to destroy the temple of God, and to build it in three days.'","26:62":"and said to him","26:63":"I adjure you by the living God, that you tell us whether you are the Christ, the Son of God.","26:64":"You have said it.  Nevertheless, I tell you, after this you will see the Son of Man sitting at the right hand of Power, and coming on the clouds of the sky.","26:65":"saying","26:66":"","26:67":"and some slapped him","26:68":"Prophesy to us, you Christ!  Who hit you?","26:69":"and a maid came to him","26:70":"saying","26:71":"someone else saw him","26:72":"I don't know the man.","26:73":"Surely you are also one of them, for your speech makes you known.","26:74":"I don't know the man! Immediately the rooster crowed.","26:75":"Before the rooster crows, you will deny me three times. He went out and wept bitterly.","27:1":"all the chief priests and the elders of the people took counsel against Jesus to put him to death:","27:2":"and led him away","27:3":"who betrayed him","27:4":"I have sinned in that I betrayed innocent blood. But they said","27:5":"and departed. He went away and hanged himself.","27:6":"and said","27:7":"and bought the potter's field with them","27:8":"Wherefore that field was called","27:9":"saying","27:10":"as the Lord commanded me.{Zechariah 11:12-13; Jeremiah 19:1-13; 32:6-9},And gave them for the potter's field, as the Lord appointed me.,,,,,,,,","27:11":"saying","27:12":"he answered nothing.","27:13":"Don't you hear how many things they testify against you?","27:14":"not even one word","27:15":"whom they desired.","27:16":"called Barabbas.","27:17":"Pilate said to them","27:18":"For he knew that for envy they had delivered him.","27:19":"his wife sent to him","27:20":"and destroy Jesus.","27:21":"Which of the two do you want me to release to you?  They said","27:22":"What then shall I do to Jesus, who is called Christ?  They all said to him","27:23":"Why?  What evil has he done? But they cried out exceedingly","27:24":"but rather that a disturbance was starting","27:25":"May his blood be on us, and on our children!","27:26":"but Jesus he flogged and delivered to be crucified.","27:27":"and gathered the whole garrison together against him.","27:28":"and put a scarlet robe on him.","27:29":"and a reed in his right hand; and they kneeled down before him","27:30":"and took the reed and struck him on the head.","27:31":"they took the robe off of him","27:32":"they found a man of Cyrene","27:33":"The place of a skull.","27:34":"he would not drink.","27:35":"they divided his clothing among them","27:36":"And sitting down they watched him there;","27:37":"THIS IS JESUS, THE KING OF THE JEWS.","27:38":"one on his right hand and one on the left.","27:39":"wagging their heads","27:40":"You who destroy the temple, and build it in three days, save yourself!  If you are the Son of God, come down from the cross!","27:41":"with the scribes","27:42":"","27:43":"if he wants him; for he said","27:44":"The thieves also","27:45":"Now from the sixth hour there was darkness over all the land unto the ninth hour.","27:46":"saying","27:47":"when they heard it","27:48":"and took a sponge","27:49":"Let him be.  Let's see whether Elijah comes to save him.","27:50":"and yielded up his spirit.","27:51":"the veil of the temple was torn in two from the top to the bottom.  The earth quaked and the rocks were split.","27:52":"and many bodies of the saints who had fallen asleep were raised;","27:53":"they entered into the holy city and appeared to many.","27:54":"and those who were with him watching Jesus","27:55":"who had followed Jesus from Galilee","27:56":"Mary the mother of James and Joses","27:57":"a rich man from Arimathaea","27:58":"and asked for Jesus' body.  Then Pilate commanded the body to be given up.","27:59":"and wrapped it in a clean linen cloth","27:60":"which he had hewn out in the rock","27:61":"and the other Mary","27:62":"which was the day after the Preparation Day","27:63":"Sir, we remember what that deceiver said while he was still alive:  'After three days I will rise again.',Saying, Sir, we remember that that deceiver said, while he was yet alive, After three days I will rise again.,,,,,,,,","27:64":"lest perhaps his disciples come at night and steal him away","27:65":"You have a guard.  Go, make it as secure as you can.","27:66":"sealing the stone.","28:1":"as it began to dawn on the first day of the week","28:2":"there was a great earthquake","28:3":"and his clothing white as snow.","28:4":"the guards shook","28:5":"Don't be afraid, for I know that you seek Jesus, who has been crucified.,And the angel answered and said unto the women, Fear not ye: for I know that ye seek Jesus, which was crucified.,,,,,,,,","28:6":"for he has risen","28:7":"'He has risen from the dead","28:8":"and ran to bring his disciples word.","28:9":"behold","28:10":"Don't be afraid.  Go tell my brothers{The word for brothers here may be also correctly translated brothers and sisters or siblings.} that they should go into Galilee, and there they will see me.","28:11":"behold","28:12":"and had taken counsel","28:13":"Say that his disciples came by night, and stole him away while we slept.,Saying, Say ye, His disciples came by night, and stole him away while we slept.,,,,,,,,","28:14":"we will persuade him and make you free of worry.,And if this come to the governor's ears, we will persuade him, and secure you.,,,,,,,,","28:15":"and continues until this day.","28:16":"to the mountain where Jesus had sent them.","28:17":"they bowed down to him","28:18":"saying","28:19":"and make disciples of all nations","28:20":"I am with you always"}