{"1:1":"Ahaz","1:2":"you peoples","1:3":"behold","1:4":"and the valleys split apart","1:5":"","1:6":"like places for planting vineyards; and I will pour down its stones into the valley","1:7":"and all her temple gifts will be burned with fire","1:8":"and moan like the daughters of owls.","1:9":"even to Jerusalem.","1:10":"Declare ye it not at Gath","1:11":"inhabitant of Shaphir","1:12":"because evil has come down from Yahweh to the gate of Jerusalem.","1:13":"inhabitant of Lachish. She was the beginning of sin to the daughter of Zion; For the transgressions of Israel were found in you.","1:14":"Therefore shalt thou give presents to Moreshethgath: the houses of Achzib shall be a lie to the kings of Israel.","1:15":"inhabitant of Mareshah. He who is the glory of Israel will come to Adullam.","1:16":"and cut off your hair for the children of your delight.  Enlarge your baldness like the vulture; for they have gone into captivity from you!","2:1":"they practice it","2:2":"and seize them; and houses","2:3":"","2:4":"and lament with a doleful lamentation","2:5":"Therefore thou shalt have none that shall cast a cord by lot in the congregation of the LORD.","2:6":"Prophesy ye not","2:7":"O house of Jacob:  Is the Spirit of Yahweh angry? Are these his doings?  Don't my words do good to him who walks blamelessly?","2:8":"returning from battle.","2:9":"The women of my people have ye cast out from their pleasant houses; from their children have ye taken away my glory for ever.","2:10":"and depart!  For this is not your resting place","2:11":"If a man walking in the spirit and falsehood do lie","2:12":"Jacob","2:13":"and go out.  And their king passes on before them","3:1":"Please listen, you heads of Jacob, and rulers of the house of Israel:  Isn't it for you to know justice?,And I said, Hear, I pray you, O heads of Jacob, and ye princes of the house of Israel; Is it not for you to know judgment?, וָאֹמַר שִׁמְעוּ־נָא רָאשֵׁי יַעֲקֹב וּקְצִינֵי בֵּית יִשְׂרָאֵל הֲלוֹא לָכֶם לָדַעַת אֶת־הַמִּשְׁפָּט׃ ‬,And I said: Hear, I pray you, ye heads of Jacob, And rulers of the house of Israel: Is it not for you to know justice?,καὶ ἐρεῖ ἀκούσατε δὴ ταῦτα αἱ ἀρχαὶ οἴκου ιακωβ καὶ οἱ κατάλοιποι οἴκου ισραηλ οὐχ ὑμῖν ἐστιν τοῦ γνῶναι τὸ κρίμα,And he shall say, Hear now these words, ye heads of the house of Jacob, and ye remnant of the house of Israel; is it not for you to know judgment?,,,,","3:2":"and love the evil; who tear off their skin","3:3":"and flay their skin from off them","3:4":"but he will not answer them. Yes","3:5":"they proclaim","3:6":"","3:7":"and the diviners confounded. Yes","3:8":"I am full of power by the Spirit of Yahweh","3:9":"you heads of the house of Jacob","3:10":"and Jerusalem with iniquity.","3:11":"and her priests teach for a price","3:12":"and Jerusalem will become heaps of rubble","4:1":"it will happen that the mountain of Yahweh's temple will be established on the top of the mountains","4:2":"Come, and let us go up to the mountain of Yahweh, and to the house of the God of Jacob; and he will teach us of his ways, and we will walk in his paths. For out of Zion will go forth the law","4:3":"and will decide concerning strong nations afar off.  They will beat their swords into plowshares","4:4":"But they shall sit every man under his vine and under his fig tree; and none shall make them afraid: for the mouth of the LORD of hosts hath spoken it.","4:5":"For all people will walk every one in the name of his god","4:6":"I will assemble that which is lame, and I will gather that which is driven away, and that which I have afflicted;,In that day, saith the LORD, will I assemble her that halteth, and I will gather her that is driven out, and her that I have afflicted;, בַּיּוֹם הַהוּא נְאֻם־יְהוָה אֹסְפָה הַצֹּלֵעָה וְהַנִּדָּחָה אֲקַבֵּצָה וַאֲשֶׁר הֲרֵעֹתִי׃ ‬,In that day, saith the LORD, will I assemble her that halteth, And I will gather her that is driven away, And her that I have afflicted;,ἐν τῇ ἡμέρᾳ ἐκείνῃ λέγει κύριος συνάξω τὴν συντετριμμένην καὶ τὴν ἐξωσμένην εἰσδέξομαι καὶ οὓς ἀπωσάμην,In that day, saith the Lord, I will gather her that is bruised, and will receive her that is cast out, and those whom I rejected.,,,,","4:7":"and that which was cast far off a strong nation:  and Yahweh will reign over them on Mount Zion from then on","4:8":"tower of the flock","4:9":"that pains have taken hold of you as of a woman in travail?","4:10":"and labor to bring forth","4:11":"that say","4:12":"neither do they understand his counsel; for he has gathered them like the sheaves to the threshing floor.","4:13":"daughter of Zion; for I will make your horn iron","5:1":"daughter of troops. He has laid siege against us.  They will strike the judge of Israel with a rod on the cheek.","5:2":"Bethlehem Ephrathah","5:3":"Therefore will he give them up","5:4":"and shall shepherd in the strength of Yahweh","5:5":"and when he marches through our fortresses","5:6":"and the land of Nimrod in its gates.  He will deliver us from the Assyrian","5:7":"like dew from Yahweh","5:8":"in the midst of many peoples","5:9":"and let all of your enemies be cut off.","5:10":"That I will cut off your horses out of the midst of you, and will destroy your chariots.,And it shall come to pass in that day, saith the LORD, that I will cut off thy horses out of the midst of thee, and I will destroy thy chariots:, וְהָיָה בַיּוֹם־הַהוּא נְאֻם־יְהוָה וְהִכְרַתִּי סוּסֶיךָ מִקִּרְבֶּךָ וְהַאֲבַדְתִּי מַרְכְּבֹתֶיךָ׃ ‬,And it shall come to pass in that day, saith the LORD, That I will cut off thy horses out of the midst of thee, And will destroy thy chariots;,5:9 καὶ ἔσται ἐν ἐκείνῃ τῇ ἡμέρᾳ λέγει κύριος ἐξολεθρεύσω τοὺς ἵππους σου ἐκ μέσου σου καὶ ἀπολῶ τὰ ἅρματά σου,And it shall come to pass in that day, saith the Lord, that I will utterly destroy the horses out of the midst of thee, and destroy thy chariots;,,,,","5:11":"and will tear down all your strongholds.","5:12":"And I will cut off witchcrafts out of thine hand; and thou shalt have no more soothsayers:","5:13":"Thy graven images also will I cut off","5:14":"And I will pluck up thy groves out of the midst of thee: so will I destroy thy cities.","5:15":"and wrath on the nations that didn't listen.,And I will execute vengeance in anger and fury upon the heathen, such as they have not heard., וְעָשִׂיתִי בְּאַף וּבְחֵמָה נָקָם אֶת־הַגּוֹיִם אֲשֶׁר לֹא שָׁמֵעוּ׃ ס ‬,And I will execute vengeance in anger and fury upon the nations, Because they hearkened not.,5:14 καὶ ποιήσω ἐν ὀργῇ καὶ ἐν θυμῷ ἐκδίκησιν ἐν τοῖς ἔθνεσιν ἀνθ' ὧν οὐκ εἰσήκουσαν,and I will execute vengeance on the heathen in anger and wrath, because they hearkened not.,,,,","6:1":"","6:2":"you mountains","6:3":"what have I done to you?  How have I burdened you? Answer me!","6:4":"and redeemed you out of the house of bondage.  I sent before you Moses","6:5":"remember now what Balak king of Moab devised","6:6":"and bow myself before the exalted God?  Shall I come before him with burnt offerings","6:7":"Will the LORD be pleased with thousands of rams","6:8":"O man","6:9":"and wisdom sees your name: Listen to the rod, and he who appointed it.,The LORD's voice crieth unto the city, and the man of wisdom shall see thy name: hear ye the rod, and who hath appointed it., קוֹל יְהוָה לָעִיר יִקְרָא וְתוּשִׁיָּה יִרְאֶה שְׁמֶךָ שִׁמְעוּ מַטֶּה וּמִי יְעָדָהּ׃ ‬,Hark! the LORD crieth unto the city And it is wisdom to have regard for Thy name Hear ye the rod, and who hath appointed it.,φωνὴ κυρίου τῇ πόλει ἐπικληθήσεται καὶ σώσει φοβουμένους τὸ ὄνομα αὐτοῦ ἄκουε φυλή καὶ τίς κοσμήσει πόλιν,The Lord's voice shall be proclaimed in the city, and he shall save those that fear his name: hear, O tribe; and who shall order the city?,,,,","6:10":"and a short ephah{An ephah is a measure of volume","6:11":"and with a bag of deceitful weights?","6:12":"her inhabitants speak lies","6:13":"Therefore also will I make thee sick in smiting thee","6:14":"but not be satisfied.  Your humiliation will be in your midst.  You will store up","6:15":"but won't reap.  You will tread the olives","6:16":"and all the works of the house of Ahab.  You walk in their counsels","7:1":"I am like one who gathers the summer fruits","7:2":"and there is no one upright among men.  They all lie in wait for blood; every man hunts his brother with a net.","7:3":"That they may do evil with both hands earnestly","7:4":"even your visitation","7:5":"be careful of the words of your mouth!","7:6":"the daughter rises up against her mother","7:7":"I will look to Yahweh.  I will wait for the God of my salvation.  My God will hear me.","7:8":"my enemy.  When I fall","7:9":"because I have sinned against him","7:10":"and shame will cover her who said to me","7:11":"he will extend your boundary.","7:12":"and from Egypt even to the River","7:13":"for the fruit of their doings.","7:14":"the flock of your heritage","7:15":"According to the days of thy coming out of the land of Egypt will I shew unto him marvellous things.","7:16":"The nations shall see and be confounded at all their might: they shall lay their hand upon their mouth","7:17":"and will be afraid because of you.","7:18":"who pardons iniquity","7:19":"He will turn again","7:20":"and mercy to Abraham"}