{"1:1":"in the twentieth year","1:2":"one of my brothers","1:3":"The remnant who are left of the captivity there in the province are in great affliction and reproach: the wall of Jerusalem also is broken down","1:4":"when I heard these words","1:5":"I beg you","1:6":"and your eyes open","1:7":"and have not kept the commandments","1:8":"I beg you","1:9":"and keep my commandments and do them","1:10":"whom you have redeemed by your great power","1:11":"I beg you","2:1":"in the twentieth year of Artaxerxes the king","2:2":"Why is your face sad","2:3":"Let the king live forever:  why should not my face be sad","2:4":"For what do you make request? So I prayed to the God of heaven.","2:5":"If it please the king","2:6":"For how long shall your journey be? and when will you return? So it pleased the king to send me; and I set him a time.","2:7":"If it please the king","2:8":"that he may give me timber to make beams for the gates of the castle which appertains to the house","2:9":"and gave them the king's letters.  Now the king had sent with me captains of the army and horsemen.","2:10":"and Tobiah the servant","2:11":"and was there three days.","2:12":"I and some few men with me; neither told I any man what my God put into my heart to do for Jerusalem; neither was there any animal with me","2:13":"even toward the jackal's well","2:14":"Then I went on to the gate of the fountain","2:15":"and viewed the wall; and I turned back","2:16":"or what I did; neither had I as yet told it to the Jews","2:17":"You see the evil case that we are in","2:18":"as also of the king's words that he had spoken to me. They said","2:19":"and Tobiah the servant","2:20":"and said to them","3:1":"and they built the sheep gate; they sanctified it","3:2":"And next unto him builded the men of Jericho. And next to them builded Zaccur the son of Imri.","3:3":"and set up the doors of it","3:4":"the son of Hakkoz. Next to them repaired Meshullam the son of Berechiah","3:5":"And next unto them the Tekoites repaired; but their nobles put not their necks to the work of their LORD.","3:6":"and set up the doors of it","3:7":"and Jadon the Meronothite","3:8":"goldsmiths. Next to him repaired Hananiah one of the perfumers","3:9":"the ruler of half the district of Jerusalem.","3:10":"over against his house.  Next to him repaired Hattush the son of Hashabneiah.","3:11":"and Hasshub the son of Pahathmoab","3:12":"the ruler of half the district of Jerusalem","3:13":"and the inhabitants of Zanoah; they built it","3:14":"the ruler of the district of Beth Haccherem; he built it","3:15":"the ruler of the district of Mizpah; he built it","3:16":"the ruler of half the district of Beth Zur","3:17":"Rehum the son of Bani. Next to him repaired Hashabiah","3:18":"Bavvai the son of Henadad","3:19":"the ruler of Mizpah","3:20":"from the turning [of the wall] to the door of the house of Eliashib the high priest.","3:21":"from the door of the house of Eliashib even to the end of the house of Eliashib.","3:22":"the men of the Plain.","3:23":"After him repaired Benjamin and Hashub over against their house. After him repaired Azariah the son of Maaseiah the son of Ananiah by his house.","3:24":"from the house of Azariah to the turning [of the wall]","3:25":"and the tower that stands out from the upper house of the king","3:26":"to the place over against the water gate toward the east","3:27":"over against the great tower that stands out","3:28":"everyone over against his own house.","3:29":"the keeper of the east gate.","3:30":"and Hanun the sixth son of Zalaph","3:31":"and of the merchants","3:32":"And between the going up of the corner unto the sheep gate repaired the goldsmiths and the merchants.","4:1":"he was angry","4:2":"and said","4:3":"and he said","4:4":"our God; for we are despised:  and turn back their reproach on their own head","4:5":"and don't let their sin be blotted out from before you; for they have provoked [you] to anger before the builders.","4:6":"So built we the wall; and all the wall was joined together unto the half thereof: for the people had a mind to work.","4:7":"Tobiah","4:8":"and to cause confusion therein.","4:9":"and set a watch against them day and night","4:10":"The strength of the bearers of burdens is decayed","4:11":"They shall not know","4:12":"they said to us ten times from all places","4:13":"in the open places","4:14":"and rose up","4:15":"when our enemies heard that it was known to us","4:16":"that half of my servants worked in the work","4:17":"and with the other held his weapon;","4:18":"everyone had his sword girded by his side","4:19":"and to the rulers and to the rest of the people","4:20":"resort you there to us; our God will fight for us.","4:21":"So we laboured in the work: and half of them held the spears from the rising of the morning till the stars appeared.","4:22":"Let everyone with his servant lodge within Jerusalem","4:23":"nor my brothers","5:1":"And there was a great cry of the people and of their wives against their brethren the Jews.","5:2":"We","5:3":"We are mortgaging our fields","5:4":"We have borrowed money for the king's tribute [on] our fields and our vineyards.","5:5":"our children as their children:  and behold","5:6":"And I was very angry when I heard their cry and these words.","5:7":"and contended with the nobles and the rulers","5:8":"We after our ability have redeemed our brothers the Jews","5:9":"The thing that you do is not good:  ought you not to walk in the fear of our God","5:10":"my brothers and my servants","5:11":"even this day","5:12":"We will restore them","5:13":"and said","5:14":"from the twentieth year even to the two and thirtieth year of Artaxerxes the king","5:15":"and took of them bread and wine","5:16":"also I continued in the work of this wall","5:17":"of the Jews and the rulers","5:18":"and once in ten days store of all sorts of wine: yet for all this I didn't demand the bread of the governor","5:19":"my God","6:1":"when it was reported to Sanballat and Tobiah","6:2":"saying","6:3":"saying","6:4":"Yet they sent unto me four times after this sort; and I answered them after the same manner.","6:5":"","6:6":"It is reported among the nations","6:7":"saying","6:8":"saying","6:9":"saying","6:10":"who was shut up; and he said","6:11":"Should such a man as I flee? and who is there that","6:12":"and behold","6:13":"that I should be afraid","6:14":"my God","6:15":"in fifty-two days.","6:16":"when all our enemies heard [of it]","6:17":"and [the letters] of Tobiah came to them.","6:18":"because he was the son-in-law of Shecaniah the son of Arah; and his son Jehohanan had taken the daughter of Meshullam the son of Berechiah as wife.","6:19":"and reported my words to him.  Tobiah sent letters to put me in fear.","7:1":"when the wall was built","7:2":"and Hananiah the governor of the castle","7:3":"Don't let the gates of Jerusalem be opened until the sun be hot; and while they stand [on guard]","7:4":"and the houses were not built.","7:5":"and the rulers","7:6":"who went up out of the captivity of those who had been carried away","7:7":"Jeshua","7:8":"two thousand one hundred seventy-two.","7:9":"three hundred seventy-two.","7:10":"six hundred fifty-two.","7:11":"of the children of Jeshua and Joab","7:12":"one thousand two hundred fifty-four.","7:13":"eight hundred forty-five.","7:14":"seven hundred sixty.","7:15":"six hundred forty-eight.","7:16":"six hundred twenty-eight.","7:17":"two thousand three hundred twenty-two.","7:18":"six hundred sixty-seven.","7:19":"two thousand sixty-seven.","7:20":"six hundred fifty-five.","7:21":"of Hezekiah","7:22":"three hundred Twenty-eight.","7:23":"three hundred twenty-four.","7:24":"one hundred twelve.","7:25":"ninety-five.","7:26":"one hundred eighty-eight.","7:27":"one hundred twenty-eight.","7:28":"forty-two.","7:29":"Chephirah","7:30":"six hundred twenty-one.","7:31":"one hundred and twenty-two.","7:32":"a hundred twenty-three.","7:33":"fifty-two.","7:34":"one thousand two hundred fifty-four.","7:35":"three hundred twenty.","7:36":"three hundred forty-five.","7:37":"Hadid","7:38":"three thousand nine hundred thirty.","7:39":"of the house of Jeshua","7:40":"one thousand fifty-two.","7:41":"one thousand two hundred forty-seven.","7:42":"one thousand [and] seventeen.","7:43":"of Kadmiel","7:44":"one hundred forty-eight.","7:45":"the children of Ater","7:46":"the children of Hasupha","7:47":"the children of Sia","7:48":"the children of Hagaba","7:49":"the children of Giddel","7:50":"the children of Rezin","7:51":"the children of Uzza","7:52":"the children of Meunim","7:53":"the children of Hakupha","7:54":"the children of Mehida","7:55":"the children of Sisera","7:56":"the children of Hatipha.","7:57":"the children of Sophereth","7:58":"the children of Darkon","7:59":"the children of Hattil","7:60":"and the children of Solomon's servants","7:61":"Tel Harsha","7:62":"the children of Tobiah","7:63":"the children of Hakkoz","7:64":"but it was not found:  therefore were they deemed polluted and put from the priesthood.","7:65":"that they should not eat of the most holy things","7:66":"","7:67":"of whom there were seven thousand three hundred thirty-seven: and they had two hundred forty-five singing men and singing women.","7:68":"two hundred forty-five;","7:69":"four hundred thirty-five; [their] donkeys","7:70":"fifty basins","7:71":"and two thousand two hundred minas of silver.","7:72":"and two thousand minas of silver","7:73":"and the Levites","8:1":"which Yahweh had commanded to Israel.","8:2":"both men and women","8:3":"in the presence of the men and the women","8:4":"which they had made for the purpose; and beside him stood Mattithiah","8:5":"all the people stood up:","8:6":"the great God.  All the people answered","8:7":"and Bani","8:8":"in the law of God","8:9":"who was the governor","8:10":"Go your way","8:11":"saying","8:12":"and to drink","8:13":"the priests","8:14":"how that Yahweh had commanded by Moses","8:15":"and in Jerusalem","8:16":"and brought them","8:17":"and lived in the booths; for since the days of Jeshua the son of Nun to that day the children of Israel had not done so. There was very great gladness.","8:18":"from the first day to the last day","9:1":"and with sackcloth","9:2":"and stood and confessed their sins","9:3":"and read in the book of the law of Yahweh their God a fourth part of the day; and [another] fourth part they confessed","9:4":"Jeshua","9:5":"Jeshua","9:6":"even you alone; you have made heaven","9:7":"who did choose Abram","9:8":"and made a covenant with him to give the land of the Canaanite","9:9":"and heard their cry by the Red Sea{or","9:10":"and on all his servants","9:11":"so that they went through the midst of the sea on the dry land; and their pursuers you did cast into the depths","9:12":"to give them light in the way in which they should go.","9:13":"and spoke with them from heaven","9:14":"and commanded them commandments","9:15":"and brought forth water for them out of the rock for their thirst","9:16":"and didn't listen to your commandments","9:17":"neither were mindful of your wonders that you did among them","9:18":"when they had made them a molten calf","9:19":"to lead them in the way; neither the pillar of fire by night","9:20":"and didn't withhold your manna from their mouth","9:21":"forty years did you sustain them in the wilderness","9:22":"which you did allot after their portions:  so they possessed the land of Sihon","9:23":"and brought them into the land concerning which you did say to their fathers","9:24":"and you subdued before them the inhabitants of the land","9:25":"and a fat land","9:26":"and rebelled against you","9:27":"who distressed them:  and in the time of their trouble","9:28":"they did evil again before you; therefore left you them in the hand of their enemies","9:29":"that you might bring them again to your law.  Yet they dealt proudly","9:30":"and testified against them by your Spirit through your prophets: yet would they not give ear:  therefore gave you them into the hand of the peoples of the lands.","9:31":"nor forsake them; for you are a gracious and merciful God.","9:32":"our God","9:33":"but we have done wickedly;","9:34":"our princes","9:35":"and in your great goodness that you gave them","9:36":"we are servants this day","9:37":"and over our livestock","9:38":"and write it; and our princes","10:1":"the son of Hacaliah","10:2":"Azariah","10:3":"Amariah","10:4":"Shebaniah","10:5":"Meremoth","10:6":"Ginnethon","10:7":"Abijah","10:8":"Bilgai","10:9":"Jeshua the son of Azaniah","10:10":"Shebaniah","10:11":"Rehob","10:12":"Sherebiah","10:13":"Bani","10:14":"Pahathmoab","10:15":"Azgad","10:16":"Bigvai","10:17":"Hezekiah","10:18":"Hashum","10:19":"Anathoth","10:20":"Meshullam","10:21":"Zadok","10:22":"Hanan","10:23":"Hananiah","10:24":"Pilha","10:25":"Hashabnah","10:26":"Hanan","10:27":"Harim","10:28":"the priests","10:29":"their nobles","10:30":"nor take their daughters for our sons;","10:31":"that we would not buy of them on the Sabbath","10:32":"to charge ourselves yearly with the third part of a shekel for the service of the house of our God;","10:33":"and for the continual meal offering","10:34":"the priests","10:35":"and the first fruits of all fruit of all manner of trees","10:36":"and of our livestock","10:37":"and our wave offerings","10:38":"when the Levites take tithes:  and the Levites shall bring up the tithe of the tithes to the house of our God","10:39":"of the new wine","11:1":"to bring one of ten to dwell in Jerusalem the holy city","11:2":"And the people blessed all the men","11:3":"[to wit]","11:4":"and of the children of Benjamin.  Of the children of Judah:  Athaiah the son of Uzziah","11:5":"the son of Colhozeh","11:6":"All the sons of Perez that dwelt at Jerusalem were four hundred threescore and eight valiant men.","11:7":"the son of Joed","11:8":"Sallai","11:9":"And Joel the son of Zichri was their overseer: and Judah the son of Senuah was second over the city.","11:10":"Jachin","11:11":"the son of Meshullam","11:12":"eight hundred twenty-two; and Adaiah the son of Jeroham","11:13":"chiefs of fathers' [houses]","11:14":"mighty men of valor","11:15":"the son of Azrikam","11:16":"of the chiefs of the Levites","11:17":"the son of Zabdi","11:18":"All the Levites in the holy city were two hundred fourscore and four.","11:19":"Akkub","11:20":"of the priests","11:21":"But the Nethinims dwelt in Ophel: and Ziha and Gispa were over the Nethinims.","11:22":"the son of Hashabiah","11:23":"and a settled provision for the singers","11:24":"of the children of Zerah the son of Judah","11:25":"with their fields","11:26":"and in Moladah","11:27":"and in Beersheba and the towns of it","11:28":"and in Meconah and in the towns of it","11:29":"and in Zorah","11:30":"Adullam","11:31":"at Michmash and Aija","11:32":"Nob","11:33":"Ramah","11:34":"Zeboim","11:35":"and Ono","11:36":"certain divisions in Judah [were joined] to Benjamin.","12:1":"and Jeshua:  Seraiah","12:2":"Malluch","12:3":"Rehum","12:4":"Ginnethoi","12:5":"Maadiah","12:6":"and Joiarib","12:7":"Amok","12:8":"Binnui","12:9":"their brothers","12:10":"and Joiakim became the father of Eliashib","12:11":"and Jonathan became the father of Jaddua.","12:12":"heads of fathers' [houses]: of Seraiah","12:13":"Meshullam; of Amariah","12:14":"Jonathan; of Shebaniah","12:15":"Adna; of Meraioth","12:16":"Zechariah; of Ginnethon","12:17":"Zichri; of Miniamin","12:18":"Shammua; of Shemaiah","12:19":"Mattenai; of Jedaiah","12:20":"Kallai; of Amok","12:21":"Hashabiah; of Jedaiah","12:22":"in the days of Eliashib","12:23":"heads of fathers' [houses]","12:24":"Sherebiah","12:25":"and Bakbukiah","12:26":"the son of Jozadak","12:27":"to bring them to Jerusalem","12:28":"both out of the plain round about Jerusalem","12:29":"and out of the fields of Geba and Azmaveth: for the singers had built them villages round about Jerusalem.","12:30":"and the gates","12:31":"and appointed two great companies who gave thanks and went in procession. [One went] on the right hand on the wall toward the dung gate;","12:32":"and half of the princes of Judah","12:33":"Ezra","12:34":"and Benjamin","12:35":"the son of Shemaiah","12:36":"Shemaiah","12:37":"and straight before them","12:38":"and I after them","12:39":"and by the old gate","12:40":"and I","12:41":"Eliakim","12:42":"and Shemaiah","12:43":"and rejoiced; for God had made them rejoice with great joy; and the women also and the children rejoiced:  so that the joy of Jerusalem was heard even afar off.","12:44":"for the wave offerings","12:45":"and the charge of the purification","12:46":"and songs of praise and thanksgiving to God.","12:47":"and in the days of Nehemiah","13:1":"that an Ammonite and a Moabite should not enter into the assembly of God forever","13:2":"but hired Balaam against them","13:3":"when they had heard the law","13:4":"Eliashib the priest","13:5":"where before they laid the meal offerings","13:6":"","13:7":"and understood the evil that Eliashib had done for Tobiah","13:8":"And it grieved me sore: therefore I cast forth all the household stuff to Tobiah out of the chamber.","13:9":"and they cleansed the chambers: and there brought I again the vessels of the house of God","13:10":"who did the work","13:11":"and said","13:12":"Then brought all Judah the tithe of the corn and the new wine and the oil unto the treasuries.","13:13":"Shelemiah the priest","13:14":"my God","13:15":"and bringing in sheaves","13:16":"who brought in fish","13:17":"and said to them","13:18":"and did not our God bring all this evil on us","13:19":"when the gates of Jerusalem began to be dark before the Sabbath","13:20":"So the merchants and sellers of all kind of ware lodged without Jerusalem once or twice.","13:21":"and said to them","13:22":"and that they should come and keep the gates","13:23":"of Ammon","13:24":"and could not speak in the Jews' language","13:25":"and cursed them","13:26":"and he was beloved of his God","13:27":"to trespass against our God in marrying foreign women?","13:28":"the son of Eliashib the high priest","13:29":"my God","13:30":"and appointed charges for the priests and for the Levites","13:31":"at times appointed"}