{"1:1":"in the Tent of Meeting","1:2":"by their families","1:3":"all who are able to go out to war in Israel.  You and Aaron shall number them by their divisions.","1:4":"And with you there shall be a man of every tribe; every one head of the house of his fathers.","1:5":"And these are the names of the men that shall stand with you: of the tribe of Reuben; Elizur the son of Shedeur.","1:6":"Of Simeon; Shelumiel the son of Zurishaddai.","1:7":"Of Judah; Nahshon the son of Amminadab.","1:8":"Of Issachar; Nethaneel the son of Zuar.","1:9":"Of Zebulun; Eliab the son of Helon.","1:10":"Of the children of Joseph: of Ephraim; Elishama the son of Ammihud: of Manasseh; Gamaliel the son of Pedahzur.","1:11":"Of Benjamin; Abidan the son of Gideoni.","1:12":"Of Dan; Ahiezer the son of Ammishaddai.","1:13":"Of Asher; Pagiel the son of Ocran.","1:14":"Of Gad; Eliasaph the son of Deuel.","1:15":"τῶν νεφθαλι αχιρε υἱὸς αιναν","1:16":"the princes of the tribes of their fathers; they were the heads of the thousands of Israel.","1:17":"And Moses and Aaron took these men which are expressed by their names:","1:18":"by their fathers' houses","1:19":"so he numbered them in the wilderness of Sinai.","1:20":"Israel's firstborn","1:21":"of the tribe of Reuben","1:22":"their generations","1:23":"of the tribe of Simeon","1:24":"their generations","1:25":"of the tribe of Gad","1:26":"their generations","1:27":"of the tribe of Judah","1:28":"their generations","1:29":"of the tribe of Issachar","1:30":"their generations","1:31":"of the tribe of Zebulun","1:32":"of the children of Ephraim","1:33":"of the tribe of Ephraim","1:34":"their generations","1:35":"of the tribe of Manasseh","1:36":"their generations","1:37":"of the tribe of Benjamin","1:38":"their generations","1:39":"of the tribe of Dan","1:40":"their generations","1:41":"of the tribe of Asher","1:42":"their generations","1:43":"of the tribe of Naphtali","1:44":"whom Moses and Aaron numbered","1:45":"from twenty years old and upward","1:46":"Even all they that were numbered were six hundred thousand and three thousand and five hundred and fifty.","1:47":"But the Levites after the tribe of their fathers were not numbered among them.","1:48":"saying","1:49":"neither shalt thou take the sum of them among the children of Israel;","1:50":"and over all its furnishings","1:51":"the Levites shall take it down; and when the tabernacle is to be set up","1:52":"every man by his own camp","1:53":"that there may be no wrath on the congregation of the children of Israel:  and the Levites shall be responsible for the Tabernacle of the Testimony.,But the Levites shall pitch round about the tabernacle of testimony, that there be no wrath upon the congregation of the children of Israel: and the Levites shall keep the charge of the tabernacle of testimony.,  וְהַלְוִיִּם יַחֲנוּ סָבִיב לְמִשְׁכַּן הָעֵדֻת וְלֹא־יִהְיֶה קֶצֶף עַל־עֲדַת בְּנֵי יִשְׂרָאֵל וְשָׁמְרוּ הַלְוִיִּם אֶת־מִשְׁמֶרֶת מִשְׁכַּן הָעֵדוּת׃ ‬,But the Levites shall pitch round about the tabernacle of the testimony, that there be no wrath upon the congregation of the children of Israel; and the Levites shall keep the charge of the tabernacle of the testimony.","1:54":"so they did.","2:1":"saying","2:2":"Every man of the children of Israel shall pitch by his own standard","2:3":"according to their divisions: and the prince of the children of Judah shall be Nahshon the son of Amminadab.","2:4":"and those who were numbered of them","2:5":"And those that do pitch next unto him shall be the tribe of Issachar: and Nethaneel the son of Zuar shall be captain of the children of Issachar.","2:6":"and those who were numbered of it","2:7":"Then the tribe of Zebulun: and Eliab the son of Helon shall be captain of the children of Zebulun.","2:8":"and those who were numbered of it","2:9":"according to their divisions. They shall set out first.","2:10":"","2:11":"and those who were numbered of it","2:12":"","2:13":"and those who were numbered of them","2:14":"","2:15":"and those who were numbered of them","2:16":"","2:17":"","2:18":"","2:19":"and those who were numbered of them","2:20":"","2:21":"and those who were numbered of them","2:22":"","2:23":"and those who were numbered of them","2:24":"","2:25":"","2:26":"and those who were numbered of them","2:27":"","2:28":"and those who were numbered of them","2:29":"","2:30":"and those who were numbered of them","2:31":"All they that were numbered in the camp of Dan were an hundred thousand and fifty and seven thousand and six hundred. They shall go hindmost with their standards.","2:32":"These are those which were numbered of the children of Israel by the house of their fathers: all those that were numbered of the camps throughout their hosts were six hundred thousand and three thousand and five hundred and fifty.","2:33":"But the Levites were not numbered among the children of Israel; as the LORD commanded Moses.","2:34":"so they encamped by their standards","3:1":"These also are the generations of Aaron and Moses in the day that the LORD spake with Moses in mount Sinai.","3:2":"and Abihu","3:3":"the priests who were anointed","3:4":"when they offered strange fire before Yahweh","3:5":"saying","3:6":"and set them before Aaron the priest","3:7":"and the charge of the whole congregation before the Tent of Meeting","3:8":"and the obligations of the children of Israel","3:9":"And thou shalt give the Levites unto Aaron and to his sons: they are wholly given unto him out of the children of Israel.","3:10":"and they shall keep their priesthood.  The stranger who comes near shall be put to death.,And thou shalt appoint Aaron and his sons, and they shall wait on their priest's office: and the stranger that cometh nigh shall be put to death.,  וְאֶת־אַהֲרֹן וְאֶת־בָּנָיו תִּפְקֹד וְשָׁמְרוּ אֶת־כְּהֻנָּתָם וְהַזָּר הַקָּרֵב יוּמָת׃ פ ‬,And thou shalt appoint Aaron and his sons, that they may keep their priesthood; and the common man that draweth nigh shall be put to death.","3:11":"saying","3:12":"behold","3:13":"both man and animal. They shall be mine.  I am Yahweh.,Because all the firstborn are mine; for on the day that I smote all the firstborn in the land of Egypt I hallowed unto me all the firstborn in Israel, both man and beast: mine shall they be: I am the LORD.,  כִּי לִי כָּל־בְּכוֹר בְּיוֹם הַכֹּתִי כָל־בְּכוֹר בְּאֶרֶץ מִצְרַיִם הִקְדַּשְׁתִּי לִי כָל־בְּכוֹר בְּיִשְׂרָאֵל מֵאָדָם עַד־בְּהֵמָה לִי יִהְיוּ אֲנִי יְהוָה׃ ס ‬,for all the first-born are Mine: on the day that I smote all the first-born in the land of Egypt I hallowed unto Me all the first-born in Israel, both man and beast, Mine they shall be: I am the LORD.","3:14":"saying","3:15":"Number the children of Levi after the house of their fathers","3:16":"as he was commanded.","3:17":"and Kohath","3:18":"And these are the names of the sons of Gershon by their families; Libni","3:19":"and Izhar","3:20":"And the sons of Merari by their families; Mahli","3:21":"and the family of the Shimeites:  these are the families of the Gershonites.","3:22":"according to the number of all the males","3:23":"The families of the Gershonites shall pitch behind the tabernacle westward.","3:24":"And the chief of the house of the father of the Gershonites shall be Eliasaph the son of Lael.","3:25":"and the tent","3:26":"and the screen for the door of the court","3:27":"and the family of the Izharites","3:28":"from a month old and upward","3:29":"The families of the sons of Kohath shall pitch on the side of the tabernacle southward.","3:30":"And the chief of the house of the father of the families of the Kohathites shall be Elizaphan the son of Uzziel.","3:31":"the table","3:32":"with the oversight of those who keep the charge of the sanctuary.","3:33":"and the family of the Mushites.  These are the families of Merari.","3:34":"according to the number of all the males","3:35":"And the chief of the house of the father of the families of Merari was Zuriel the son of Abihail: these shall pitch on the side of the tabernacle northward.","3:36":"its bars","3:37":"their sockets","3:38":"in front of the Tent of Meeting toward the sunrise","3:39":"whom Moses and Aaron numbered at the commandment of Yahweh","3:40":"Number all the firstborn males of the children of Israel from a month old and upward, and take the number of their names.,And the LORD said unto Moses, Number all the firstborn of the males of the children of Israel from a month old and upward, and take the number of their names.,  וַיֹּאמֶר יְהוָה אֶל־מֹשֶׁה פְּקֹד כָּל־בְּכֹר זָכָר לִבְנֵי יִשְׂרָאֵל מִבֶּן־חֹדֶשׁ וָמָעְלָה וְשָׂא אֵת מִסְפַּר שְׁמֹתָם׃ ‬,And the LORD said unto Moses: Number all the first-born males of the children of Israel from a month old and upward","3:41":"καὶ λήμψῃ τοὺς λευίτας ἐμοί ἐγὼ κύριος ἀντὶ πάντων τῶν πρωτοτόκων τῶν υἱῶν ισραηλ καὶ τὰ κτήνη τῶν λευιτῶν ἀντὶ πάντων τῶν πρωτοτόκων ἐν τοῖς κτήνεσιν τῶν υἱῶν ισραηλ","3:42":"as Yahweh commanded him","3:43":"from a month old and upward","3:44":"saying","3:45":"and the cattle of the Levites instead of their cattle; and the Levites shall be Mine","3:46":"who exceed the number of the Levites","3:47":"Thou shalt even take five shekels apiece by the poll","3:48":"with which the remainder of them is redeemed","3:49":"And Moses took the redemption money of them that were over and above them that were redeemed by the Levites:","3:50":"one thousand three hundred sixty-five shekels","3:51":"according to the word of Yahweh","4:1":"saying","4:2":"by their families","4:3":"all who enter into the service","4:4":"the most holy things.","4:5":"Aaron shall go in","4:6":"and shall spread over it a cloth all of blue","4:7":"and put on it the dishes","4:8":"and cover the same with a covering of sealskin","4:9":"and cover the lampstand of the light","4:10":"and shall put it on the frame.","4:11":"and cover it with a covering of sealskin","4:12":"with which they minister in the sanctuary","4:13":"and spread a purple cloth on it.","4:14":"with which they minister about it","4:15":"","4:16":"And to the office of Eleazar the son of Aaron the priest pertaineth the oil for the light","4:17":"saying","4:18":"μὴ ὀλεθρεύσητε τῆς φυλῆς τὸν δῆμον τὸν κααθ ἐκ μέσου τῶν λευιτῶν","4:19":"that they may live","4:20":"lest they die.,But they shall not go in to see when the holy things are covered, lest they die.,  וְלֹא־יָבֹאוּ לִרְאוֹת כְּבַלַּע אֶת־הַקֹּדֶשׁ וָמֵתוּ׃ פ ‬,but they shall not go in to see the holy things as they are being covered, lest they die. \f ...","4:21":"saying","4:22":"by their fathershouses, by their families;,λαβὲ τὴν ἀρχὴν τῶν υἱῶν γεδσων καὶ τούτους κατ' οἴκους πατριῶν αὐτῶν κατὰ δήμους αὐτῶν,Take the sum of the children of Gedson, and these according to the houses of their lineage, according to their families.,נשא את ראש בני גרשון גם הם לבית אבתם למשפחותם,Take also the sum of the sons of Gershon, throughout the houses of their fathers, by their families;,קַבֵּל יָת חֻשְׁבַּן בְּנֵי גֵרְשׁוֹן אַף אִנוּן לְבֵית אֲבָהַתְהוֹן לְזַרְעֲיַתְהוֹן ,Take the account of the sons of Gershon also, after the house of their fathers, by their families;","4:23":"to do the work in the Tent of Meeting.","4:24":"in serving and in bearing burdens:","4:25":"and the Tent of Meeting","4:26":"and the screen for the door of the gate of the court","4:27":"in all their burden","4:28":"This is the service of the families of the sons of Gershon in the tabernacle of the congregation: and their charge shall be under the hand of Ithamar the son of Aaron the priest.","4:29":"υἱοὶ μεραρι κατὰ δήμους αὐτῶν κατ' οἴκους πατριῶν αὐτῶν ἐπισκέψασθε αὐτούς","4:30":"everyone who enters on the service","4:31":"according to all their service in the Tent of Meeting:  the tabernacle's boards","4:32":"and their sockets","4:33":"according to all their service","4:34":"and by their fathers' houses","4:35":"everyone who entered into the service","4:36":"And those that were numbered of them by their families were two thousand seven hundred and fifty.","4:37":"all who served in the Tent of Meeting","4:38":"their families","4:39":"everyone who entered into the service","4:40":"by their families","4:41":"all who served in the Tent of Meeting","4:42":"by their families","4:43":"everyone who entered into the service","4:44":"were three thousand two hundred.","4:45":"whom Moses and Aaron numbered according to the commandment of Yahweh by Moses.","4:46":"whom Moses and Aaron and the princes of Israel numbered","4:47":"everyone who entered in to do the work of service","4:48":"were eight thousand five hundred eighty.","4:49":"everyone according to his service","5:1":"saying","5:2":"that they put out of the camp every leper","5:3":"outside of the camp shall you put them; that they not defile their camp","5:4":"and put them out outside of the camp; as Yahweh spoke to Moses","5:5":"saying","5:6":"","5:7":"and he shall make restitution for his guilt in full","5:8":"the restitution for guilt which is made to Yahweh shall be the priest's; besides the ram of the atonement","5:9":"which they present to the priest","5:10":"it shall be his.,And every man's hallowed things shall be his: whatsoever any man giveth the priest, it shall be his.,  וְאִישׁ אֶת־קֳדָשָׁיו לוֹ יִהְיוּ אִישׁ אֲשֶׁר־יִתֵּן לַכֹּהֵן לוֹ יִהְיֶה׃ פ ‬,And every man's hallowed things shall be his: whatsoever any man giveth the priest, it shall be his.,καὶ ἑκάστου τὰ ἡγιασμένα αὐτοῦ ἔσται ἀνὴρ ὃς ἐὰν δῷ τῷ ἱερεῖ αὐτῷ ἔσται,And the hallowed things of every man shall be his; and whatever man shall give any thing to the priest, the gift shall be his.,ואיש את קדשיו לו יהיה ואיש אשר יתן לכהן לו יהיה,And every man's hallowed things shall be his: whatsoever any man giveth the priest, it shall be his.,וּגְבַר יָת מַעֲשַׂר קוּדְשֵׁהּ דִלֵהּ יְהוֹן גְבַר דְיִתֵּן לְכַהֲנָא דִלֵהּ יְהֵא ,And the consecrated tenths of every man shall be his, and whatsoever a man giveth unto the priest shall be his.","5:11":"saying","5:12":"","5:13":"and it is hidden from the eyes of her husband","5:14":"and he is jealous of his wife","5:15":"and shall bring her offering for her:  the tenth part of an ephah of barley meal. He shall pour no oil on it","5:16":"and set her before Yahweh;","5:17":"and put it into the water.","5:18":"and let the hair of the woman's head go loose","5:19":"and shall tell the woman","5:20":"being under your husband","5:21":"and the priest shall tell the woman","5:22":"and make your body swell","5:23":"","5:24":"And he shall cause the woman to drink the bitter water that causeth the curse: and the water that causeth the curse shall enter into her","5:25":"and shall wave the meal offering before Yahweh","5:26":"as the memorial of it","5:27":"then it shall happen","5:28":"but is clean; then she shall be free","5:29":"","5:30":"and he is jealous of his wife; then he shall set the woman before Yahweh","5:31":"and that woman shall bear her iniquity.,Then shall the man be guiltless from iniquity, and this woman shall bear her iniquity.,  וְנִקָּה הָאִישׁ מֵעָוֺן וְהָאִשָּׁה הַהִוא תִּשָּׂא אֶת־עֲוֺנָהּ׃ פ ‬,And the man shall be clear from iniquity, and that woman shall bear her iniquity.,καὶ ἀθῷος ἔσται ὁ ἄνθρωπος ἀπὸ ἁμαρτίας καὶ ἡ γυνὴ ἐκείνη λήμψεται τὴν ἁμαρτίαν αὐτῆς,Then the man shall be clear from sin, and that woman shall bear her sin.,ונקה האיש מעון והאשה ההיא תשא את עונה,Then shall the man be guiltless from iniquity, and this woman shall bear her iniquity.,וִיהֵי זַכָּאָה גַבְרָא מֵחוֹבָא וְאִתְּתָא הַהִיא תְּקַבֵּל יָת חוֹבָהּ ,And the man shall be innocent from guilt,(9) but the woman shall bear her sin.","6:1":"saying","6:2":"","6:3":"or vinegar of fermented drink","6:4":"from the seeds even to the skins.","6:5":"","6:6":"","6:7":"or for his mother","6:8":"All the days of his separation he is holy unto the LORD.","6:9":"","6:10":"to the door of the Tent of Meeting.","6:11":"and the other for a burnt offering","6:12":"and shall bring a male lamb a year old for a trespass offering; but the former days shall be void","6:13":"","6:14":"one male lamb a year old without blemish for a burnt offering","6:15":"cakes of fine flour mixed with oil","6:16":"and shall offer his sin offering","6:17":"with the basket of unleavened bread.  The priest shall offer also its meal offering","6:18":"and shall take the hair of the head of his separation","6:19":"and one unleavened cake out of the basket","6:20":"together with the breast that is waved and the thigh that is offered.  After that the Nazirite may drink wine.","6:21":"This is the law of the Nazarite who hath vowed","6:22":"saying","6:23":"","6:24":"and keep you.","6:25":"and be gracious to you.","6:26":"and give you peace.'","6:27":"And they shall put my name upon the children of Israel","7:1":"and had anointed it and sanctified it","7:2":"the heads of their fathers' houses","7:3":"six covered wagons","7:4":"saying","7:5":"Take it of them","7:6":"and gave them to the Levites.","7:7":"according to their service:","7:8":"according to their service","7:9":"because the service of the sanctuary belonged to them; they carried it on their shoulders.","7:10":"even the princes gave their offerings before the altar.","7:11":"They shall offer their offering, each prince on his day, for the dedication of the altar.","7:12":"of the tribe of Judah","7:13":"the weight of which was one hundred thirty shekels","7:14":"full of incense;","7:15":"one ram","7:16":"One kid of the goats for a sin offering:","7:17":"two oxen","7:18":"prince of Issachar","7:19":"the weight of which was one hundred thirty shekels","7:20":"full of incense;","7:21":"one ram","7:22":"One kid of the goats for a sin offering:","7:23":"two oxen","7:24":"prince of the children of Zebulun","7:25":"the weight of which was a hundred and thirty shekels","7:26":"full of incense;","7:27":"one ram","7:28":"One kid of the goats for a sin offering:","7:29":"two oxen","7:30":"prince of the children of Reuben","7:31":"the weight of which was one hundred thirty shekels","7:32":"full of incense;","7:33":"one ram","7:34":"One kid of the goats for a sin offering:","7:35":"two oxen","7:36":"prince of the children of Simeon","7:37":"the weight of which was one hundred thirty shekels","7:38":"full of incense;","7:39":"one ram","7:40":"One kid of the goats for a sin offering:","7:41":"two oxen","7:42":"Eliasaph the son of Deuel","7:43":"the weight of which was one hundred thirty shekels","7:44":"full of incense;","7:45":"one ram","7:46":"One kid of the goats for a sin offering:","7:47":"two oxen","7:48":"prince of the children of Ephraim","7:49":"the weight of which was one hundred thirty shekels","7:50":"full of incense;","7:51":"one ram","7:52":"One kid of the goats for a sin offering:","7:53":"two oxen","7:54":"prince of the children of Manasseh","7:55":"the weight of which was one hundred thirty shekels","7:56":"full of incense;","7:57":"one ram","7:58":"One kid of the goats for a sin offering:","7:59":"two oxen","7:60":"prince of the children of Benjamin","7:61":"the weight of which was one hundred thirty shekels","7:62":"full of incense;","7:63":"one ram","7:64":"One kid of the goats for a sin offering:","7:65":"two oxen","7:66":"prince of the children of Dan","7:67":"the weight of which was one hundred thirty shekels","7:68":"full of incense;","7:69":"one ram","7:70":"One kid of the goats for a sin offering:","7:71":"two oxen","7:72":"prince of the children of Asher","7:73":"the weight of which was one hundred thirty shekels","7:74":"full of incense;","7:75":"one ram","7:76":"One kid of the goats for a sin offering:","7:77":"two oxen","7:78":"prince of the children of Naphtali","7:79":"the weight of which was one hundred thirty shekels","7:80":"full of incense;","7:81":"one ram","7:82":"One kid of the goats for a sin offering:","7:83":"two oxen","7:84":"on the day when it was anointed","7:85":"and each bowl seventy; all the silver of the vessels two thousand four hundred shekels","7:86":"full of incense","7:87":"the rams twelve","7:88":"the rams sixty","7:89":"he heard his voice speaking to him from above the mercy seat that was on the ark of the Testimony","8:1":"saying","8:2":"Speak unto Aaron and say unto him","8:3":"as Yahweh commanded Moses.","8:4":"beaten work of gold. From its base to its flowers","8:5":"saying","8:6":"and cleanse them.","8:7":"to cleanse them:  sprinkle the water of cleansing on them","8:8":"and its meal offering","8:9":"And thou shalt bring the Levites before the tabernacle of the congregation: and thou shalt gather the whole assembly of the children of Israel together:","8:10":"","8:11":"on the behalf of the children of Israel","8:12":"and you shall offer the one for a sin offering","8:13":"and before his sons","8:14":"and the Levites shall be mine.","8:15":"","8:16":"even the firstborn of all the children of Israel","8:17":"both man and animal.  On the day that I struck all the firstborn in the land of Egypt","8:18":"And I have taken the Levites for all the firstborn of the children of Israel.","8:19":"to do the service of the children of Israel in the Tent of Meeting","8:20":"and Aaron","8:21":"and they washed their clothes; and Aaron offered them for a wave offering before Yahweh; and Aaron made atonement for them to cleanse them.","8:22":"the Levites went in to do their service in the Tent of Meeting before Aaron","8:23":"saying","8:24":"τοῦτό ἐστιν τὸ περὶ τῶν λευιτῶν ἀπὸ πεντεκαιεικοσαετοῦς καὶ ἐπάνω εἰσελεύσονται ἐνεργεῖν ἐν τῇ σκηνῇ τοῦ μαρτυρίου","8:25":"and shall serve no more","8:26":"to keep the charge","9:1":"in the first month of the second year after they had come out of the land of Egypt","9:2":"εἰπὸν καὶ ποιείτωσαν οἱ υἱοὶ ισραηλ τὸ πασχα καθ' ὥραν αὐτοῦ","9:3":"at evening","9:4":"that they should keep the Passover.","9:5":"on the fourteenth day of the month","9:6":"who were unclean because of the dead body of a man","9:7":"We are unclean because of the dead body of a man.  Why are we kept back, that we may not offer the offering of Yahweh in its appointed season among the children of Israel?","9:8":"Wait, that I may hear what Yahweh will command concerning you.","9:9":"saying","9:10":"","9:11":"on the fourteenth day at evening they shall keep it; they shall eat it with unleavened bread and bitter herbs.","9:12":"nor break a bone of it.  According to all the statute of the Passover they shall keep it.","9:13":"and is not on a journey","9:14":"and desires to keep the Passover to Yahweh; according to the statute of the Passover","9:15":"the cloud covered the tabernacle","9:16":"and the appearance of fire by night.","9:17":"then after that the children of Israel traveled; and in the place where the cloud remained","9:18":"the children of Israel traveled","9:19":"then the children of Israel kept the charge of Yahweh","9:20":"and according to the commandment of Yahweh they traveled.","9:21":"they traveled: or by day and by night","9:22":"or a month","9:23":"and at the commandment of Yahweh they traveled.  They kept the charge of Yahweh","10:1":"saying","10:2":"and for the journeying of the camps.","10:3":"all the congregation shall gather themselves to you at the door of the tent of meeting.","10:4":"then the princes","10:5":"the camps that lie on the east side shall take their journey.","10:6":"the camps that lie on the south side shall take their journey:  they shall blow an alarm for their journeys.","10:7":"you shall blow","10:8":"the priests","10:9":"then you shall sound an alarm with the trumpets; and you shall be remembered before Yahweh your God","10:10":"and in your set feasts","10:11":"in the second month","10:12":"And the children of Israel took their journeys out of the wilderness of Sinai; and the cloud rested in the wilderness of Paran.","10:13":"And they first took their journey according to the commandment of the LORD by the hand of Moses.","10:14":"In the first place went the standard of the camp of the children of Judah according to their armies: and over his host was Nahshon the son of Amminadab.","10:15":"And over the host of the tribe of the children of Issachar was Nethaneel the son of Zuar.","10:16":"And over the host of the tribe of the children of Zebulun was Eliab the son of Helon.","10:17":"who bore the tent","10:18":"And the standard of the camp of Reuben set forward according to their armies: and over his host was Elizur the son of Shedeur.","10:19":"And over the host of the tribe of the children of Simeon was Shelumiel the son of Zurishaddai.","10:20":"And over the host of the tribe of the children of Gad was Eliasaph the son of Deuel.","10:21":"bearing the sanctuary: and [the others] did set up the tent against their coming.","10:22":"And the standard of the camp of the children of Ephraim set forward according to their armies: and over his host was Elishama the son of Ammihud.","10:23":"And over the host of the tribe of the children of Manasseh was Gamaliel the son of Pedahzur.","10:24":"And over the host of the tribe of the children of Benjamin was Abidan the son of Gideoni.","10:25":"which was the rearward of all the camps","10:26":"And over the host of the tribe of the children of Asher was Pagiel the son of Ocran.","10:27":"And over the host of the tribe of the children of Naphtali was Ahira the son of Enan.","10:28":"Thus were the journeyings of the children of Israel according to their armies","10:29":"the son of Reuel the Midianite","10:30":"I will not go; but I will depart to my own land","10:31":"Don't leave us","10:32":"if you go with us","10:33":"to seek out a resting place for them.","10:34":"when they set forward from the camp.","10:35":"when the ark set forward","10:36":"he said","11:1":"[speaking] evil in the ears of Yahweh: and when Yahweh heard it","11:2":"and the fire abated.","11:3":"because the fire of Yahweh burnt among them.","11:4":"and said","11:5":"which we ate in Egypt for nothing; the cucumbers","11:6":"But now our soul is dried away: there is nothing at all","11:7":"and the appearance of it as the appearance of bdellium.","11:8":"and gathered it","11:9":"the manna fell on it.","11:10":"every man at the door of his tent:  and the anger of Yahweh was kindled greatly; and Moses was displeased.","11:11":"Why have you dealt ill with your servant? and why haven't I found favor in your sight","11:12":"that you should tell me","11:13":"saying","11:14":"because it is too heavy for me.","11:15":"please kill me out of hand","11:16":"Gather to me seventy men of the elders of Israel","11:17":"and will put it on them; and they shall bear the burden of the people with you","11:18":"Sanctify yourselves against tomorrow","11:19":"nor two days","11:20":"until it come out at your nostrils","11:21":"The people","11:22":"to suffice them? or shall all the fish of the sea be gathered together for them","11:23":"Has Yahweh's hand grown short? now shall you see whether my word shall happen to you or not.","11:24":"and told the people the words of Yahweh: and he gathered seventy men of the elders of the people","11:25":"and spoke to him","11:26":"the name of the one was Eldad","11:27":"and told Moses","11:28":"the minister of Moses","11:29":"Are you jealous for my sake? I wish that all Yahweh's people were prophets","11:30":"he and the elders of Israel.","11:31":"and brought quails from the sea","11:32":"and all the night","11:33":"before it was chewed","11:34":"because there they buried the people who lusted.","11:35":"And the people journeyed from Kibrothhattaavah unto Hazeroth; and abode at Hazeroth.","12:1":"And Miriam and Aaron spake against Moses because of the Ethiopian woman whom he had married: for he had married an Ethiopian woman.","12:2":"Has Yahweh indeed spoken only with Moses?  Hasn't he spoken also with us?  Yahweh heard it.","12:3":"above all the men who were on the surface of the earth.","12:4":"and to Aaron","12:5":"and stood at the door of the Tent","12:6":"Hear now my words:  if there be a prophet among you","12:7":"My servant Moses is not so","12:8":"even manifestly","12:9":"And the anger of the LORD was kindled against them; and he departed.","12:10":"Miriam was leprous","12:11":"Oh","12:12":"I pray","12:13":"saying","12:14":"If her father had but spit in her face","12:15":"And Miriam was shut out from the camp seven days: and the people journeyed not till Miriam was brought in again.","12:16":"and encamped in the wilderness of Paran.","13:1":"saying","13:2":"that they may spy out the land of Canaan","13:3":"And Moses by the commandment of the LORD sent them from the wilderness of Paran: all those men were heads of the children of Israel.","13:4":"Shammua the son of Zaccur.","13:5":"Shaphat the son of Hori.","13:6":"Caleb the son of Jephunneh.","13:7":"Igal the son of Joseph.","13:8":"Hoshea the son of Nun.","13:9":"Palti the son of Raphu.","13:10":"Gaddiel the son of Sodi.","13:11":"[namely]","13:12":"Ammiel the son of Gemalli.","13:13":"Sethur the son of Michael.","13:14":"Nahbi the son of Vophsi.","13:15":"Geuel the son of Machi.","13:16":"These are the names of the men which Moses sent to spy out the land. And Moses called Oshea the son of Nun Jehoshua.","13:17":"and said to them","13:18":"what it is; and the people who dwell therein","13:19":"whether it is good or bad; and what cities they are that they dwell in","13:20":"whether it is fat or lean","13:21":"and spied out the land from the wilderness of Zin to Rehob","13:22":"and came to Hebron; and Ahiman","13:23":"and cut down from there a branch with one cluster of grapes","13:24":"because of the cluster which the children of Israel cut down from there.","13:25":"And they returned from searching of the land after forty days.","13:26":"and to Aaron","13:27":"and said","13:28":"and the cities are fortified","13:29":"and the Jebusite","13:30":"and said","13:31":"We aren't able to go up against the people; for they are stronger than we.","13:32":"saying","13:33":"the sons of Anak","14:1":"and cried; and the people wept that night.","14:2":"Would that we had died in the land of Egypt! or would that we had died in this wilderness!","14:3":"to fall by the sword? Our wives and our little ones will be a prey:  wouldn't it be better for us to return into Egypt?","14:4":"Let us make a captain","14:5":"Then Moses and Aaron fell on their faces before all the assembly of the congregation of the children of Israel.","14:6":"who were of those who spied out the land","14:7":"saying","14:8":"then he will bring us into this land","14:9":"neither fear the people of the land; for they are bread for us:  their defense is removed from over them","14:10":"But all the congregation bade stone them with stones. And the glory of the LORD appeared in the tabernacle of the congregation before all the children of Israel.","14:11":"How long will this people despise me? and how long will they not believe in me","14:12":"and disinherit them","14:13":"Then the Egyptians will hear it; for you brought up this people in your might from among them;","14:14":"and your cloud stands over them","14:15":"then the nations which have heard the fame of you will speak","14:16":"therefore he has slain them in the wilderness.","14:17":"according as you have spoken","14:18":"and abundant in loving kindness","14:19":"Please","14:20":"I have pardoned according to your word:","14:21":"as I live","14:22":"and my signs","14:23":"neither shall any of those who despised me see it:","14:24":"because he had another spirit with him","14:25":"and get you into the wilderness by the way to the Red Sea{or","14:26":"saying","14:27":"that murmur against me?  I have heard the murmurings of the children of Israel","14:28":"As I live","14:29":"according to your whole number","14:30":"concerning which I swore that I would make you dwell therein","14:31":"that you said should be a prey","14:32":"your dead bodies shall fall in this wilderness.","14:33":"and shall bear your prostitution","14:34":"even forty days","14:35":"Yahweh","14:36":"whom Moses sent to spy out the land","14:37":"died by the plague before Yahweh.","14:38":"and Caleb the son of Jephunneh","14:39":"And Moses told these sayings unto all the children of Israel: and the people mourned greatly.","14:40":"and got them up to the top of the mountain","14:41":"Why now do you disobey the commandment of Yahweh","14:42":"for Yahweh isn't among you; that you not be struck down before your enemies.","14:43":"and you shall fall by the sword:  because you are turned back from following Yahweh","14:44":"and Moses","14:45":"and the Canaanite who lived in that mountain","15:1":"saying","15:2":"and tell them","15:3":"a burnt offering","15:4":"Then shall he that offereth his offering unto the LORD bring a meat offering of a tenth deal of flour mingled with the fourth part of an hin of oil.","15:5":"the fourth part of a hin","15:6":"you shall prepare for a meal offering two tenth parts [of an ephah] of fine flour mixed with the third part of a hin of oil:","15:7":"of a sweet savor to Yahweh.","15:8":"or for a sacrifice","15:9":"Then shall he bring with a bullock a meat offering of three tenth deals of flour mingled with half an hin of oil.","15:10":"for an offering made by fire","15:11":"or for each ram","15:12":"so shall you do to everyone according to their number.","15:13":"in offering an offering made by fire","15:14":"or whoever may be among you throughout your generations","15:15":"there shall be one statute for you","15:16":"and for the stranger who lives as a foreigner with you.","15:17":"saying","15:18":"and tell them","15:19":"you shall offer up a wave offering to Yahweh.","15:20":"so shall you heave it.","15:21":"Of the first of your dough ye shall give unto the LORD an heave offering in your generations.","15:22":"and not observe all these commandments","15:23":"from the day that Yahweh gave commandment","15:24":"if it be done unwittingly","15:25":"and they shall be forgiven; for it was an error","15:26":"and the stranger who lives as a foreigner among them; for in respect of all the people it was done unwittingly.","15:27":"then he shall offer a female goat a year old for a sin offering.","15:28":"when he sins unwittingly","15:29":"for him who is native-born among the children of Israel","15:30":"whether he is native-born or a foreigner","15:31":"and has broken his commandment","15:32":"they found a man gathering sticks on the Sabbath day.","15:33":"and to all the congregation.","15:34":"because it had not been declared what should be done to him.","15:35":"The man shall surely be put to death: all the congregation shall stone him with stones outside of the camp.","15:36":"and stoned him to death with stones; as Yahweh commanded Moses.","15:37":"saying","15:38":"and tell them that they should make them fringes{or","15:39":"tassel}","15:40":"and be holy to your God.","15:41":"who brought you out of the land of Egypt","16:1":"the son of Izhar","16:2":"with certain of the children of Israel","16:3":"and said to them","16:4":"he fell on his face:","16:5":"saying","16:6":"Korah","16:7":"and put incense on them before Yahweh tomorrow: and it shall be that the man whom Yahweh does choose","16:8":"Hear now","16:9":"that the God of Israel has separated you from the congregation of Israel","16:10":"and all your brothers the sons of Levi with you? and seek you the priesthood also?","16:11":"what is he who you murmur against him?","16:12":"the sons of Eliab; and they said","16:13":"to kill us in the wilderness","16:14":"nor given us inheritance of fields and vineyards: will you put out the eyes of these men? we won't come up.","16:15":"and said to Yahweh","16:16":"You and all your company go before Yahweh","16:17":"and put incense on them","16:18":"and put fire in them","16:19":"And Korah gathered all the congregation against them unto the door of the tabernacle of the congregation: and the glory of the LORD appeared unto all the congregation.","16:20":"saying","16:21":"that I may consume them in a moment.","16:22":"and said","16:23":"saying","16:24":"saying","16:25":"And Moses rose up and went unto Dathan and Abiram; and the elders of Israel followed him.","16:26":"saying","16:27":"Dathan","16:28":"Hereby you shall know that Yahweh has sent me to do all these works; for [I have] not [done them] of my own mind.","16:29":"or if they be visited after the visitation of all men; then Yahweh hasn't sent me.","16:30":"and the ground open its mouth","16:31":"as he made an end of speaking all these words","16:32":"and swallowed them up","16:33":"and all that appertained to them","16:34":"Lest the earth swallow us up.","16:35":"and devoured the two hundred fifty men who offered the incense.","16:36":"saying","16:37":"that he take up the censers out of the burning","16:38":"The censers of these sinners against their own souls","16:39":"which those who were burnt had offered; and they beat them out for a covering of the altar","16:40":"to the end that no stranger","16:41":"saying","16:42":"when the congregation was assembled against Moses and against Aaron","16:43":"And Moses and Aaron came before the tabernacle of the congregation.","16:44":"saying","16:45":"that I may consume them in a moment.  They fell on their faces.","16:46":"Take your censer","16:47":"and ran into the midst of the assembly; and behold","16:48":"And he stood between the dead and the living; and the plague was stayed.","16:49":"besides those who died about the matter of Korah.","16:50":"And Aaron returned unto Moses unto the door of the tabernacle of the congregation: and the plague was stayed.","17:1":"saying","17:2":"and take of them rods","17:3":"And thou shalt write Aaron's name upon the rod of Levi: for one rod shall be for the head of the house of their fathers.","17:4":"where I meet with you.","17:5":"that the rod of the man whom I shall choose shall bud:  and I will make to cease from me the murmurings of the children of Israel","17:6":"for each prince one","17:7":"And Moses laid up the rods before the LORD in the tabernacle of witness.","17:8":"that Moses went into the tent of the testimony; and behold","17:9":"and took every man his rod.","17:10":"Put back the rod of Aaron before the testimony","17:11":"so did he.","17:12":"saying","17:13":"who comes near to the tent of Yahweh","18:1":"You and your sons and your fathers' house with you shall bear the iniquity of the sanctuary; and you and your sons with you shall bear the iniquity of your priesthood.","18:2":"the tribe of Levi","18:3":"and the charge of all the Tent: only they shall not come near to the vessels of the sanctuary and to the altar","18:4":"and keep the charge of the tent of meeting","18:5":"and the charge of the altar; that there be wrath no more on the children of Israel.","18:6":"behold","18:7":"and for that within the veil; and you shall serve:  I give you the priesthood as a service of gift: and the stranger who comes near shall be put to death.","18:8":"I","18:9":"[reserved] from the fire: every offering of theirs","18:10":"In the most holy place shalt thou eat it; every male shall eat it: it shall be holy unto thee.","18:11":"even all the wave offerings of the children of Israel; I have given them to you","18:12":"and all the best of the vintage","18:13":"which they bring to Yahweh","18:14":"Every thing devoted in Israel shall be thine.","18:15":"of all flesh which they offer to Yahweh","18:16":"according to your estimation","18:17":"or the firstborn of a sheep","18:18":"as the wave offering breast and as the right thigh","18:19":"which the children of Israel offer to Yahweh","18:20":"You shall have no inheritance in their land","18:21":"behold","18:22":"lest they bear sin","18:23":"and they shall bear their iniquity:  it shall be a statute forever throughout your generations; and among the children of Israel they shall have no inheritance.","18:24":"which they offer as a wave offering to Yahweh","18:25":"saying","18:26":"and tell them","18:27":"as though it were the grain of the threshing floor","18:28":"which you receive of the children of Israel; and of it you shall give Yahweh's wave offering to Aaron the priest.","18:29":"of all the best of it","18:30":"When you heave the best of it from it","18:31":"you and your households: for it is your reward in return for your service in the tent of meeting.","18:32":"when you have heaved from it the best of it:  and you shall not profane the holy things of the children of Israel","19:1":"saying","19:2":"saying","19:3":"and he shall bring her forth outside of the camp","19:4":"and sprinkle her blood toward the front of the tent of meeting seven times.","19:5":"and her flesh","19:6":"and hyssop","19:7":"and he shall bathe his flesh in water","19:8":"and bathe his flesh in water","19:9":"and lay them up outside of the camp in a clean place; and it shall be kept for the congregation of the children of Israel for a water for impurity:  it is a sin offering.","19:10":"and be unclean until the even:  and it shall be to the children of Israel","19:11":"He that toucheth the dead body of any man shall be unclean seven days.","19:12":"and on the seventh day he shall be clean:  but if he doesn't purify himself the third day","19:13":"the body of a man who has died","19:14":"and everyone who is in the tent","19:15":"which has no covering bound on it","19:16":"or a dead body","19:17":"And for an unclean person they shall take of the ashes of the burnt heifer of purification for sin","19:18":"and dip it in the water","19:19":"and on the seventh day:  and on the seventh day he shall purify him; and he shall wash his clothes","19:20":"and shall not purify himself","19:21":"and he who touches the water for impurity shall be unclean until even.","19:22":"And whatsoever the unclean person toucheth shall be unclean; and the soul that toucheth it shall be unclean until even.","20:1":"even the whole congregation","20:2":"And there was no water for the congregation: and they gathered themselves together against Moses and against Aaron.","20:3":"and spoke","20:4":"that we should die there","20:5":"to bring us in to this evil place? it is no place of seed","20:6":"and fell on their faces: and the glory of Yahweh appeared to them.","20:7":"saying","20:8":"and assemble the congregation","20:9":"as he commanded him.","20:10":"and he said to them","20:11":"and struck the rock with his rod twice: and water came forth abundantly","20:12":"Because you didn't believe in me","20:13":"and he was sanctified in them.","20:14":"Thus says your brother Israel","20:15":"and we lived in Egypt a long time; and the Egyptians dealt ill with us","20:16":"he heard our voice","20:17":"neither will we drink of the water of the wells:  we will go along the king's highway; we will not turn aside to the right hand nor to the left","20:18":"You shall not pass through me","20:19":"We will go up by the highway; and if we drink of your water","20:20":"You shall not pass through.  Edom came out against him with much people","20:21":"Thus Edom refused to give Israel passage through his border: wherefore Israel turned away from him.","20:22":"even the whole congregation","20:23":"by the border of the land of Edom","20:24":"because you rebelled against my word at the waters of Meribah.","20:25":"and bring them up to Mount Hor;","20:26":"and put them on Eleazar his son: and Aaron shall be gathered [to his people]","20:27":"And Moses did as the LORD commanded: and they went up into mount Hor in the sight of all the congregation.","20:28":"and put them on Eleazar his son; and Aaron died there on the top of the mountain: and Moses and Eleazar came down from the mountain.","20:29":"they wept for Aaron thirty days","21:1":"the king of Arad","21:2":"and said","21:3":"and delivered up the Canaanites; and they utterly destroyed them and their cities: and the name of the place was called Hormah.","21:4":"Sea of Reeds}","21:5":"and against Moses","21:6":"and they bit the people; and much people of Israel died.","21:7":"and said","21:8":"Make you a fiery serpent","21:9":"and set it on the standard: and it happened","21:10":"and encamped in Oboth.","21:11":"and encamped at Iyeabarim","21:12":"and encamped in the valley of Zered.","21:13":"and encamped on the other side of the Arnon","21:14":"Vaheb in Suphah, the valleys of the Arnon,,Wherefore it is said in the book of the wars of the LORD, What he did in the Red sea, and in the brooks of Arnon,,  עַל־כֵּן יֵאָמַר בְּסֵפֶר מִלְחֲמֹת יְהוָה אֶת־וָהֵב בְּסוּפָה וְאֶת־הַנְּחָלִים אַרְנוֹן׃ ‬,wherefore it is said in the book of the Wars of the LORD: Vaheb in Suphah, And the valleys of Arnon,,διὰ τοῦτο λέγεται ἐν βιβλίῳ πόλεμος τοῦ κυρίου τὴν ζωοβ ἐφλόγισεν καὶ τοὺς χειμάρρους αρνων,Therefore it is said in a book, A war of the Lord has set on fire Zoob, and the brooks of Arnon.,על כן יאמר בספר מלחמות יהוה את והב בסופה ואת הנחלים ארנן,Wherefore it is said in the book of the wars of the LORD, What he did in the Red sea, and in the brooks of Arnon,עַל כֵּן יִתְאַמַר בְּסִפְרָא קְרָבִין דַעֲבַד יְיָ עַל יַמָא דְסוּף וּגְבוּרָן דְעַל נַחֲלֵי אַרְנוֹן ,Wherefore it is said in the Book of the Wars, That which the Lord did by the Sea of Suph, and the great deeds which (He wrought) by the torrents of Arnon,","21:15":"leans on the border of Moab.,And at the stream of the brooks that goeth down to the dwelling of Ar, and lieth upon the border of Moab.,  וְאֶשֶׁד הַנְּחָלִים אֲשֶׁר נָטָה לְשֶׁבֶת עָר וְנִשְׁעַן לִגְבוּל מוֹאָב׃ ‬,And the slope of the valleys That inclineth toward the seat of Ar, And leaneth upon the border of Moab.,καὶ τοὺς χειμάρρους κατέστησεν κατοικίσαι ηρ καὶ πρόσκειται τοῖς ὁρίοις μωαβ,And he has appointed brooks to cause Er to dwell there; and it lies near to the coasts of Moab.,אשר הנחלם ואשר נטה לשבת עיר ונשען לגבול מואב,And at the stream of the brooks that goeth down to the dwelling of Ar, and lieth upon the border of Moab.,וְשָׁפוּךְ נַחֲלַיָא דְמִדַבְּרִין לְקָבֵל לְחָיַת וּמִסְתְּמִיךְ לִתְחוּם מוֹאָב ,and at the flowing of the streams which lead towards Lechayath, and are joined at the confine of Moab.","21:16":"Gather the people together","21:17":"","21:18":"which the princes dug","21:19":"And from Mattanah to Nahaliel: and from Nahaliel to Bamoth:","21:20":"to the top of Pisgah","21:21":"saying","21:22":"or into vineyard; we will not drink of the water of the wells: we will go by the king's highway","21:23":"and went out against Israel into the wilderness","21:24":"and possessed his land from the Arnon to the Jabbok","21:25":"in Heshbon","21:26":"who had fought against the former king of Moab","21:27":"Come to Heshbon. Let the city of Sihon be built and established;,Wherefore they that speak in proverbs say, Come into Heshbon, let the city of Sihon be built and prepared:,  עַל־כֵּן יֹאמְרוּ הַמֹּשְׁלִים בֹּאוּ חֶשְׁבּוֹן תִּבָּנֶה וְתִכּוֹנֵן עִיר סִיחוֹן׃ ‬,Wherefore they that speak in parables say: Come ye to Heshbon! Let the city of Sihon be built and established!,διὰ τοῦτο ἐροῦσιν οἱ αἰνιγματισταί ἔλθετε εἰς εσεβων ἵνα οἰκοδομηθῇ καὶ κατασκευασθῇ πόλις σηων,Therefore say they who deal in dark speeches, Come to Esebon, that the city of Seon may be built and prepared.,על כן יאמרו המשלים באי חשבון תבנה ותכונן עיר סיחון,For Heshbon [was] the city of Sihon the king of the Amorites, who had fought against the former king of Moab, and taken all his land out of his hand, even unto Arnon.,עַל כֵּן יֵימְרוּן מְתָלַיָא עוּלוּ לְחֶשְׁבּוֹן תִּתְבְּנֵי וְתִשְׁתַּכְלַל קַרְתָּא דְסִיחוֹן ,Therefore, say the proverbs:Come to Heshbon; let the city of Sihon be builded and finished:","21:28":"a flame from the city of Sihon. It has devoured Ar of Moab","21:29":"Moab!  You are undone","21:30":"Which reaches to Medeba.,We have shot at them; Heshbon is perished even unto Dibon, and we have laid them waste even unto Nophah, which reacheth unto Medeba.,  וַנִּירָם אָבַד חֶשְׁבּוֹן עַד־דִּיבוֹן וַנַּשִּׁים עַד־נֹפַח אֲשֶׁר‪[4]‬ עַד־מֵידְבָא׃ ‬,We have shot at them Heshbon is perished even unto Dibon, And we have laid waste even unto Nophah, Which reacheth unto Medeba.,καὶ τὸ σπέρμα αὐτῶν ἀπολεῖται εσεβων ἕως δαιβων καὶ αἱ γυναῖκες ἔτι προσεξέκαυσαν πῦρ ἐπὶ μωαβ,And their seed shall perish from Esebon to Daebon; and their women have yet farther kindled a fire against Moab.,ונרם אבדה חשבון עד דיבון ונשים עד הנפח אש על מידבא,Woe to thee, Moab! thou art undone, O people of Chemosh: he hath given his sons that escaped, and his daughters, into captivity unto Sihon king of the Amorites.,וּמַלְכוּ פְסָקַת מֵחֶשְׁבּוֹן עֲדָא שׁוּלְטַן מִדִיבוֹן וְצֲדִיאוּ עַד נֹפַח דִסְמִיךְ עַד מֵידְבָא ,And the kingdom hath ceased from Heshbon, the dominion hath passed away from Dibon, they have laid waste unto Nophak which joineth Medeba.","21:31":"Thus Israel dwelt in the land of the Amorites.","21:32":"and drove out the Amorites who were there.","21:33":"he and all his people","21:34":"Don't fear him:  for I have delivered him into your hand","21:35":"and his sons and all his people","22:1":"and encamped in the plains of Moab beyond the Jordan at Jericho.","22:2":"And Balak the son of Zippor saw all that Israel had done to the Amorites.","22:3":"because they were many: and Moab was distressed because of the children of Israel.","22:4":"Now will this multitude lick up all that is round about us","22:5":"to Pethor","22:6":"that we may strike them","22:7":"and spoke to him the words of Balak.","22:8":"Lodge here this night","22:9":"and said","22:10":"Balak the son of Zippor","22:11":"the people that is come out of Egypt","22:12":"You shall not go with them; you shall not curse the people; for they are blessed.","22:13":"and said to the princes of Balak","22:14":"and they went to Balak","22:15":"more","22:16":"and said to him","22:17":"and whatever you say to me I will do.  Please come therefore","22:18":"If Balak would give me his house full of silver and gold","22:19":"please wait also here this night","22:20":"and said to him","22:21":"and saddled his donkey","22:22":"and his two servants were with him.","22:23":"with his sword drawn in his hand; and the donkey turned aside out of the way","22:24":"a wall being on this side","22:25":"and she thrust herself to the wall","22:26":"and stood in a narrow place","22:27":"and she lay down under Balaam: and Balaam's anger was kindled","22:28":"and she said to Balaam","22:29":"Because you have mocked me","22:30":"Am I not your donkey","22:31":"and he saw the angel of Yahweh standing in the way","22:32":"Why have you struck your donkey these three times? behold","22:33":"and turned aside before me these three times: unless she had turned aside from me","22:34":"I have sinned; for I didn't know that you stood in the way against me: now therefore","22:35":"Go with the men; but only the word that I shall speak to you","22:36":"he went out to meet him to the City of Moab","22:37":"Didn't I earnestly send to you to call you? why didn't you come to me? am I not able indeed to promote you to honor?","22:38":"Behold","22:39":"and they came to Kiriath Huzoth.","22:40":"and sent to Balaam","22:41":"that Balak took Balaam","23:1":"Build me here seven altars","23:2":"And Balak did as Balaam had spoken; and Balak and Balaam offered on every altar a bullock and a ram.","23:3":"Stand by your burnt offering","23:4":"I have prepared the seven altars","23:5":"and said","23:6":"and behold","23:7":"and said","23:8":"whom God has not cursed?  How shall I defy","23:9":"From the hills I see him: behold","23:10":"Or number the fourth part of Israel?  Let me die the death of the righteous","23:11":"What have you done to me? I took you to curse my enemies","23:12":"Must I not take heed to speak that which Yahweh puts in my mouth?","23:13":"Please come with me to another place","23:14":"to the top of Pisgah","23:15":"Stand here by your burnt offering","23:16":"and put a word in his mouth","23:17":"and behold","23:18":"and said","23:19":"that he should lie","23:20":"I have received a command to bless.  He has blessed","23:21":"He hath not beheld iniquity in Jacob","23:22":"God brought them out of Egypt; he hath as it were the strength of an unicorn.","23:23":"What has God done!","23:24":"the people rises up as a lioness","23:25":"Neither curse them at all","23:26":"Didn't I tell you","23:27":"Come now","23:28":"that looks down on the desert.","23:29":"Build me here seven altars","23:30":"and offered up a bull and a ram on every altar.","24:1":"he didn't go","24:2":"and he saw Israel dwelling according to their tribes; and the Spirit of God came on him.","24:3":"and said","24:4":"who hears the words of God","24:5":"Jacob","24:6":"as gardens by the riverside","24:7":"He shall pour the water out of his buckets","24:8":"shall break their bones in pieces","24:9":"he lay down as a lion","24:10":"and he struck his hands together; and Balak said to Balaam","24:11":"behold","24:12":"Didn't I also tell your messengers who you sent to me","24:13":"I can't go beyond the word of Yahweh","24:14":"behold","24:15":"and said","24:16":"who hears the words of God","24:17":"but not now.  I see him","24:18":"his enemies","24:19":"and shall destroy the remnant from the city.","24:20":"and took up his parable","24:21":"and took up his parable","24:22":"until Asshur carries you away captive.","24:23":"and said","24:24":"and shall afflict Eber. He also shall come to destruction.","24:25":"and went and returned to his place; and Balak also went his way.","25:1":"And Israel abode in Shittim","25:2":"and bowed down to their gods.","25:3":"And Israel joined himself unto Baalpeor: and the anger of the LORD was kindled against Israel.","25:4":"Take all the chiefs of the people","25:5":"Kill you everyone his men who have joined themselves to Baal Peor.","25:6":"one of the children of Israel came and brought to his brothers a Midianite woman in the sight of Moses","25:7":"the son of Eleazar","25:8":"and thrust both of them through","25:9":"And those that died in the plague were twenty and four thousand.","25:10":"saying","25:11":"the son of Eleazar","25:12":"Behold","25:13":"and to his seed after him","25:14":"who was slain with the Midianite woman","25:15":"the daughter of Zur; he was head of the people of a fathers' house in Midian.","25:16":"saying","25:17":"and strike them;","25:18":"with which they have deceived you in the matter of Peor","26:1":"that Yahweh spoke to Moses and to Eleazar the son of Aaron the priest","26:2":"from twenty years old and upward","26:3":"saying","26:4":"from twenty years old and upward; as Yahweh commanded Moses and the children of Israel","26:5":"the firstborn of Israel; the sons of Reuben: [of] Hanoch","26:6":"the family of the Hezronites; of Carmi","26:7":"These are the families of the Reubenites: and they that were numbered of them were forty and three thousand and seven hundred and thirty.","26:8":"And the sons of Pallu; Eliab.","26:9":"and Dathan","26:10":"and swallowed them up together with Korah","26:11":"the sons of Korah didn't die.","26:12":"the family of the Nemuelites; of Jamin","26:13":"the family of the Zerahites; of Shaul","26:14":"twenty-two thousand two hundred.","26:15":"the family of the Zephonites; of Haggi","26:16":"the family of the Oznites; of Eri","26:17":"the family of the Arodites; of Areli","26:18":"forty thousand and five hundred.","26:19":"The sons of Judah were Er and Onan: and Er and Onan died in the land of Canaan.","26:20":"the family of the Shelanites; of Perez","26:21":"the family of the Hezronites; of Hamul","26:22":"seventy-six thousand five hundred.","26:23":"the family of the Tolaites; of Puvah","26:24":"the family of the Jashubites; of Shimron","26:25":"sixty-four thousand three hundred.","26:26":"the family of the Seredites; of Elon","26:27":"sixty thousand five hundred.","26:28":"The sons of Joseph after their families were Manasseh and Ephraim.","26:29":"the family of the Machirites; and Machir became the father of Gilead; of Gilead","26:30":"the family of the Iezerites; of Helek","26:31":"the family of the Asrielites; and [of] Shechem","26:32":"the family of the Shemidaites; and [of] Hepher","26:33":"but daughters: and the names of the daughters of Zelophehad were Mahlah","26:34":"These are the families of Manasseh","26:35":"the family of the Shuthelahites; of Becher","26:36":"the family of the Eranites.","26:37":"thirty-two thousand five hundred. These are the sons of Joseph after their families.","26:38":"the family of the Belaites; of Ashbel","26:39":"the family of the Shuphamites; of Hupham","26:40":"the family of the Ardites; of Naaman","26:41":"These are the sons of Benjamin after their families: and they that were numbered of them were forty and five thousand and six hundred.","26:42":"the family of the Shuhamites.  These are the families of Dan after their families.","26:43":"according to those who were numbered of them","26:44":"the family of the Imnites; of Ishvi","26:45":"the family of the Heberites; of Malchiel","26:46":"And the name of the daughter of Asher was Sarah.","26:47":"fifty-three thousand and four hundred.","26:48":"the family of the Jahzeelites; of Guni","26:49":"the family of the Jezerites; of Shillem","26:50":"These are the families of Naphtali according to their families: and they that were numbered of them were forty and five thousand and four hundred.","26:51":"six hundred one thousand seven hundred thirty.","26:52":"saying","26:53":"Unto these the land shall be divided for an inheritance according to the number of names.","26:54":"and to the fewer you shall give the less inheritance: to everyone according to those who were numbered of him shall his inheritance be given.","26:55":"the land shall be divided by lot: according to the names of the tribes of their fathers they shall inherit.","26:56":"According to the lot shall the possession thereof be divided between many and few.","26:57":"the family of the Gershonites; of Kohath","26:58":"the family of the Hebronites","26:59":"the daughter of Levi","26:60":"Eleazar and Ithamar.","26:61":"when they offered strange fire before Yahweh.","26:62":"every male from a month old and upward:  for they were not numbered among the children of Israel","26:63":"who numbered the children of Israel in the plains of Moab by the Jordan at Jericho.","26:64":"who numbered the children of Israel in the wilderness of Sinai.","26:65":"They shall surely die in the wilderness. There was not left a man of them","27:1":"the son of Hepher","27:2":"and before Eleazar the priest","27:3":"and he was not among the company of those who gathered themselves together against Yahweh in the company of Korah:  but he died in his own sin; and he had no sons.","27:4":"because he had no son?  Give to us a possession among the brothers of our father.","27:5":"And Moses brought their cause before the LORD.","27:6":"saying","27:7":"The daughters of Zelophehad speak right: thou shalt surely give them a possession of an inheritance among their father's brethren; and thou shalt cause the inheritance of their father to pass unto them.","27:8":"saying","27:9":"then you shall give his inheritance to his brothers.","27:10":"then you shall give his inheritance to his father's brothers.","27:11":"then you shall give his inheritance to his kinsman who is next to him of his family","27:12":"Go up into this mountain of Abarim","27:13":"you also shall be gathered to your people","27:14":"in the strife of the congregation","27:15":"saying","27:16":"the God of the spirits of all flesh","27:17":"and who may come in before them","27:18":"Take Joshua the son of Nun","27:19":"and before all the congregation; and give him a charge in their sight.","27:20":"that all the congregation of the children of Israel may obey.","27:21":"who shall inquire for him by the judgment of the Urim before Yahweh: at his word shall they go out","27:22":"and set him before Eleazar the priest","27:23":"and gave him a charge","28:1":"saying","28:2":"and tell them","28:3":"This is the offering made by fire which you shall offer to Yahweh:  male lambs a year old without blemish","28:4":"and the other lamb shall you offer at even;","28:5":"mixed with the fourth part of a hin of beaten oil.","28:6":"which was ordained in Mount Sinai for a sweet savor","28:7":"And the drink offering thereof shall be the fourth part of an hin for the one lamb: in the holy place shalt thou cause the strong wine to be poured unto the LORD for a drink offering.","28:8":"and as the drink offering of it","28:9":"and two tenth parts [of an ephah] of fine flour for a meal offering","28:10":"besides the continual burnt offering","28:11":"and one ram","28:12":"mixed with oil","28:13":"an offering made by fire to Yahweh.","28:14":"and the third part of a hin for the ram","28:15":"and the drink offering of it.","28:16":"on the fourteenth day of the month","28:17":"And in the fifteenth day of this month is the feast: seven days shall unleavened bread be eaten.","28:18":"In the first day shall be an holy convocation; ye shall do no manner of servile work therein:","28:19":"a burnt offering to Yahweh:  two young bulls","28:20":"fine flour mixed with oil: three tenth parts shall you offer for a bull","28:21":"A several tenth deal shalt thou offer for every lamb","28:22":"to make atonement for you.","28:23":"which is for a continual burnt offering.","28:24":"for seven days","28:25":"And on the seventh day ye shall have an holy convocation; ye shall do no servile work.","28:26":"when you offer a new meal offering to Yahweh in your [feast of] weeks","28:27":"one ram","28:28":"fine flour mixed with oil","28:29":"A several tenth deal unto one lamb","28:30":"to make atonement for you.","28:31":"and the meal offering of it","29:1":"on the first day of the month","29:2":"one ram","29:3":"fine flour mixed with oil","29:4":"And one tenth deal for one lamb","29:5":"to make atonement for you;","29:6":"and the meal offering of it","29:7":"And ye shall have on the tenth day of this seventh month an holy convocation; and ye shall afflict your souls: ye shall not do any work therein:","29:8":"one ram","29:9":"fine flour mixed with oil","29:10":"A several tenth deal for one lamb","29:11":"and the continual burnt offering","29:12":"and you shall keep a feast to Yahweh seven days:","29:13":"an offering made by fire","29:14":"fine flour mixed with oil","29:15":"And a several tenth deal to each lamb of the fourteen lambs:","29:16":"besides the continual burnt offering","29:17":"two rams","29:18":"for the rams","29:19":"and the meal offering of it","29:20":"two rams","29:21":"for the rams","29:22":"and the meal offering of it","29:23":"two rams","29:24":"for the rams","29:25":"the meal offering of it","29:26":"two rams","29:27":"for the rams","29:28":"besides the continual burnt offering","29:29":"two rams","29:30":"for the rams","29:31":"the meal offering of it","29:32":"two rams","29:33":"for the rams","29:34":"the meal offering of it","29:35":"On the eighth day ye shall have a solemn assembly: ye shall do no servile work therein:","29:36":"an offering made by fire","29:37":"for the ram","29:38":"besides the continual burnt offering","29:39":"besides your vows","29:40":"And Moses told the children of Israel according to all that the LORD commanded Moses.","30:1":"saying","30:2":"or swears an oath to bind his soul with a bond","30:3":"and binds herself by a bond","30:4":"and her bond with which she has bound her soul","30:5":"none of her vows","30:6":"while her vows are on her","30:7":"and hold his peace at her in the day that he hears it; then her vows shall stand","30:8":"then he shall make void her vow which is on her","30:9":"or of her who is divorced","30:10":"or bound her soul by a bond with an oath","30:11":"and held his peace at her","30:12":"then whatever proceeded out of her lips concerning her vows","30:13":"and every binding oath to afflict the soul","30:14":"then he establishes all her vows","30:15":"then he shall bear her iniquity.","30:16":"which Yahweh commanded Moses","31:1":"saying","31:2":"Avenge the children of Israel of the Midianites: afterward shalt thou be gathered unto thy people.","31:3":"saying","31:4":"throughout all the tribes of Israel","31:5":"out of the thousands of Israel","31:6":"one thousand of every tribe","31:7":"as Yahweh commanded Moses; and they killed every male.","31:8":"and Rekem","31:9":"and all their flocks","31:10":"and all their encampments","31:11":"and all the prey","31:12":"and the prey","31:13":"and Eleazar the priest","31:14":"the captains of thousands and the captains of hundreds","31:15":"Have you saved all the women alive?","31:16":"these caused the children of Israel","31:17":"and kill every woman who has known man by lying with him.","31:18":"who have not known man by lying with him","31:19":"and whoever has touched any slain","31:20":"and all that is made of skin","31:21":"This is the statute of the law which Yahweh has commanded Moses:","31:22":"and the silver","31:23":"you shall make to go through the fire","31:24":"and you shall be clean; and afterward you shall come into the camp.","31:25":"saying","31:26":"both of man and of animal","31:27":"who went out to battle","31:28":"[both] of the persons","31:29":"and give it to Eleazar the priest","31:30":"you shall take one drawn out of every fifty","31:31":"And Moses and Eleazar the priest did as the LORD commanded Moses.","31:32":"over and above the booty which the men of war took","31:33":"","31:34":"","31:35":"of the women who had not known man by lying with him.","31:36":"which was the portion of those who went out to war","31:37":"And the LORD's tribute of the sheep was six hundred and threescore and fifteen.","31:38":"And the beeves were thirty and six thousand; of which the LORD's tribute was threescore and twelve.","31:39":"And the asses were thirty thousand and five hundred; of which the LORD's tribute was threescore and one.","31:40":"And the persons were sixteen thousand; of which the LORD's tribute was thirty and two persons.","31:41":"which was Yahweh's wave offering","31:42":"which Moses divided off from the men who warred","31:43":"","31:44":"","31:45":"","31:46":"","31:47":"Moses took one drawn out of every fifty","31:48":"the captains of thousands","31:49":"Your servants have taken the sum of the men of war who are under our charge","31:50":"what every man has gotten","31:51":"even all worked jewels.","31:52":"of the captains of thousands","31:53":"every man for himself.)","31:54":"and brought it into the tent of meeting","32:1":"and the land of Gilead","32:2":"and to Eleazar the priest","32:3":"and Dibon","32:4":"is a land for livestock; and your servants have livestock.","32:5":"If we have found favor in your sight","32:6":"and to the children of Reuben","32:7":"And wherefore discourage ye the heart of the children of Israel from going over into the land which the LORD hath given them?","32:8":"when I sent them from Kadesh Barnea to see the land.","32:9":"and saw the land","32:10":"and he swore","32:11":"from twenty years old and upward","32:12":"and Joshua the son of Nun; because they have wholly followed Yahweh.","32:13":"and he made them wander back and forth in the wilderness forty years","32:14":"you are risen up in your fathers' place","32:15":"he will yet again leave them in the wilderness; and you will destroy all this people.","32:16":"and said","32:17":"until we have brought them to their place: and our little ones shall dwell in the fortified cities because of the inhabitants of the land.","32:18":"until the children of Israel have inherited every man his inheritance.","32:19":"and forward; because our inheritance is fallen to us on this side of the Jordan eastward.","32:20":"If you will do this thing","32:21":"until he has driven out his enemies from before him","32:22":"and be guiltless towards Yahweh","32:23":"behold","32:24":"and folds for your sheep; and do that which has proceeded out of your mouth.","32:25":"saying","32:26":"our wives","32:27":"every man who is armed for war","32:28":"and to Joshua the son of Nun","32:29":"If the children of Gad and the children of Reuben will pass with you over the Jordan","32:30":"they shall have possessions among you in the land of Canaan.","32:31":"saying","32:32":"and the possession of our inheritance [shall remain] with us beyond the Jordan.","32:33":"even to the children of Gad","32:34":"and Ataroth","32:35":"and Jazer","32:36":"and Beth Haran:  fortified cities","32:37":"and Elealeh","32:38":"and Baal Meon","32:39":"and took it","32:40":"And Moses gave Gilead unto Machir the son of Manasseh; and he dwelt therein.","32:41":"and called them Havvoth Jair.","32:42":"and the villages of it","33:1":"when they went forth out of the land of Egypt by their armies under the hand of Moses and Aaron.","33:2":"And Moses wrote their goings out according to their journeys by the commandment of the LORD: and these are their journeys according to their goings out.","33:3":"on the fifteenth day of the first month; on the next day after the Passover the children of Israel went out with a high hand in the sight of all the Egyptians","33:4":"whom Yahweh had struck among them:  on their gods also Yahweh executed judgments.","33:5":"and encamped in Succoth.","33:6":"and encamped in Etham","33:7":"and turned back to Pihahiroth","33:8":"and passed through the midst of the sea into the wilderness:  and they went three days' journey in the wilderness of Etham","33:9":"and came to Elim:  and in Elim were twelve springs of water","33:10":"and encamped by the Red Sea{or","33:11":"Sea of Reeds}","33:12":"and encamped in Dophkah.","33:13":"and encamped in Alush.","33:14":"and encamped in Rephidim","33:15":"and encamped in the wilderness of Sinai.","33:16":"and encamped in Kibroth Hattaavah.","33:17":"and encamped in Hazeroth.","33:18":"and encamped in Rithmah.","33:19":"and encamped in Rimmon Perez.","33:20":"and encamped in Libnah.","33:21":"and encamped in Rissah.","33:22":"and encamped in Kehelathah.","33:23":"and encamped in Mount Shepher.","33:24":"and encamped in Haradah.","33:25":"and encamped in Makheloth.","33:26":"and encamped in Tahath.","33:27":"and encamped in Terah.","33:28":"and encamped in Mithkah.","33:29":"and encamped in Hashmonah.","33:30":"and encamped in Moseroth.","33:31":"and encamped in Bene Jaakan.","33:32":"and encamped in Hor Haggidgad.","33:33":"and encamped in Jotbathah.","33:34":"and encamped in Abronah.","33:35":"and encamped in Ezion Geber.","33:36":"and encamped in the wilderness of Zin (the same is Kadesh).","33:37":"and encamped in Mount Hor","33:38":"and died there","33:39":"And Aaron was an hundred and twenty and three years old when he died in mount Hor.","33:40":"the king of Arad","33:41":"and encamped in Zalmonah.","33:42":"and encamped in Punon.","33:43":"and encamped in Oboth.","33:44":"and encamped in Iye Abarim","33:45":"and encamped in Dibon Gad.","33:46":"and encamped in Almon Diblathaim.","33:47":"and encamped in the mountains of Abarim","33:48":"and encamped in the plains of Moab by the Jordan at Jericho.","33:49":"from Beth Jeshimoth even to Abel Shittim in the plains of Moab.","33:50":"saying","33:51":"and tell them","33:52":"and destroy all their figured [stones]","33:53":"and dwell therein; for to you have I given the land to possess it.","33:54":"and to the fewer you shall give the less inheritance: wherever the lot falls to any man","33:55":"then shall those who you let remain of them be as pricks in your eyes","33:56":"so will I do to you.","34:1":"saying","34:2":"and tell them","34:3":"and your south border shall be from the end of the Salt Sea eastward;","34:4":"and pass along to Zin; and the goings out of it shall be southward of Kadesh Barnea; and it shall go forth to Hazar Addar","34:5":"and the goings out of it shall be at the sea.","34:6":"you shall have the great sea and the border [of it]: this shall be your west border.","34:7":"And this shall be your north border: from the great sea ye shall point out for you mount Hor:","34:8":"From mount Hor ye shall point out your border unto the entrance of Hamath; and the goings forth of the border shall be to Zedad:","34:9":"and the goings out of it shall be at Hazar Enan:  this shall be your north border.","34:10":"And ye shall point out your east border from Hazarenan to Shepham:","34:11":"on the east side of Ain; and the border shall go down","34:12":"and the goings out of it shall be at the Salt Sea.  This shall be your land according to the borders of it round about.","34:13":"saying","34:14":"and the tribe of the children of Gad according to their fathers' houses","34:15":"toward the sunrise.","34:16":"saying","34:17":"and Joshua the son of Nun.","34:18":"to divide the land for inheritance.","34:19":"Caleb the son of Jephunneh.","34:20":"Shemuel the son of Ammihud.","34:21":"Elidad the son of Chislon.","34:22":"Bukki the son of Jogli.","34:23":"Hanniel the son of Ephod.","34:24":"Kemuel the son of Shiphtan.","34:25":"Elizaphan the son of Parnach.","34:26":"Paltiel the son of Azzan.","34:27":"Ahihud the son of Shelomi.","34:28":"Pedahel the son of Ammihud.","34:29":"These are they whom the LORD commanded to divide the inheritance unto the children of Israel in the land of Canaan.","35:1":"saying","35:2":"Command the children of Israel","35:3":"and for their substance","35:4":"which you shall give to the Levites","35:5":"and for the south side two thousand cubits","35:6":"they shall be the six cities of refuge","35:7":"So all the cities which ye shall give to the Levites shall be forty and eight cities: them shall ye give with their suburbs.","35:8":"from the many you shall take many; and from the few you shall take few:  everyone according to his inheritance which he inherits shall give of his cities to the Levites.","35:9":"saying","35:10":"and tell them","35:11":"that the manslayer who kills any person unwittingly may flee there.","35:12":"that the manslayer not die","35:13":"And of these cities which ye shall give six cities shall ye have for refuge.","35:14":"and three cities shall you give in the land of Canaan; they shall be cities of refuge.","35:15":"and for the stranger and for the foreigner living among them","35:16":"so that he died","35:17":"by which a man may die","35:18":"by which a man may die","35:19":"he shall put him to death.","35:20":"or hurled at him","35:21":"so that he died; he who struck him shall surely be put to death; he is a murderer: the avenger of blood shall put the murderer to death","35:22":"or hurled on him anything without lying in wait","35:23":"by which a man may die","35:24":"Then the congregation shall judge between the slayer and the revenger of blood according to these judgments:","35:25":"and the congregation shall restore him to his city of refuge","35:26":"where he flees","35:27":"and the avenger of blood kill the manslayer; he shall not be guilty of blood","35:28":"Because he should have remained in the city of his refuge until the death of the high priest: but after the death of the high priest the slayer shall return into the land of his possession.","35:29":"So these things shall be for a statute of judgment unto you throughout your generations in all your dwellings.","35:30":"the murderer shall be slain at the mouth of witnesses:  but one witness shall not testify against any person that he die.","35:31":"Moreover ye shall take no satisfaction for the life of a murderer","35:32":"that he may come again to dwell in the land","35:33":"it pollutes the land; and no expiation can be made for the land for the blood that is shed therein","35:34":"in the midst of which I dwell:  for I","36:1":"the son of Machir","36:2":"Yahweh commanded my lord to give the land for inheritance by lot to the children of Israel: and my lord was commanded by Yahweh to give the inheritance of Zelophehad our brother to his daughters.","36:3":"then will their inheritance be taken away from the inheritance of our fathers","36:4":"then will their inheritance be added to the inheritance of the tribe whereunto they shall belong:  so will their inheritance be taken away from the inheritance of the tribe of our fathers.","36:5":"saying","36:6":"saying","36:7":"So shall not the inheritance of the children of Israel remove from tribe to tribe: for every one of the children of Israel shall keep himself to the inheritance of the tribe of his fathers.","36:8":"who possesses an inheritance in any tribe of the children of Israel","36:9":"Neither shall the inheritance remove from one tribe to another tribe; but every one of the tribes of the children of Israel shall keep himself to his own inheritance.","36:10":"so did the daughters of Zelophehad:","36:11":"Tirzah","36:12":"And they were married into the families of the sons of Manasseh the son of Joseph","36:13":"These are the commandments and the judgments"}