{"1:1":"servants of Jesus Christ; To all the saints in Christ Jesus who are at Philippi","1:2":"and peace from God","1:3":"","1:4":"","1:5":"For your fellowship in the gospel from the first day until now;","1:6":"that he who began a good work in you will complete it until the day of Jesus Christ.","1:7":"because I have you in my heart","1:8":"how I long after all of you in the tender mercies of Christ Jesus.","1:9":"that your love may abound yet more and more in knowledge and all discernment;","1:10":"That ye may approve things that are excellent; that ye may be sincere and without offence till the day of Christ.","1:11":"which are through Jesus Christ","1:12":"brothers","1:13":"and to all the rest","1:14":"being confident through my bonds","1:15":"and some also out of good will.","1:16":"thinking that they add affliction to my chains;","1:17":"knowing that I am appointed for the defense of the Good News.","1:18":"whether in pretense or in truth","1:19":"through your supplication and the supply of the Spirit of Jesus Christ","1:20":"that I will in no way be disappointed","1:21":"and to die is gain.","1:22":"this will bring fruit from my work; yet I don't make known what I will choose.","1:23":"having the desire to depart and be with Christ","1:24":"to remain in the flesh is more needful for your sake.","1:25":"I know that I will remain","1:26":"That your rejoicing may be more abundant in Jesus Christ for me by my coming to you again.","1:27":"that","1:28":"which is for them a proof of destruction","1:29":"not only to believe in him","1:30":"and now hear is in me.","2:1":"if any consolation of love","2:2":"by being like-minded","2:3":"but in humility","2:4":"but each of you also to the things of others.","2:5":"which was also in Christ Jesus","2:6":"existing in the form of God","2:7":"taking the form of a servant","2:8":"he humbled himself","2:9":"and gave to him the name which is above every name;","2:10":"of those in heaven","2:11":"to the glory of God the Father.","2:12":"my beloved","2:13":"for his good pleasure.","2:14":"","2:15":"children of God without blemish in the midst of a crooked and perverse generation","2:16":"that I didn't run in vain nor labor in vain.","2:17":"and if I am poured out on the sacrifice and service of your faith","2:18":"you also rejoice","2:19":"that I also may be cheered up when I know how you are doing.","2:20":"who will truly care about you.","2:21":"not the things of Jesus Christ.","2:22":"that","2:23":"as soon as I see how it will go with me.","2:24":"But I trust in the Lord that I also myself shall come shortly.","2:25":"my brother","2:26":"and was very troubled","2:27":"nearly to death","2:28":"that","2:29":"and hold such in honor","2:30":"risking his life to supply that which was lacking in your service toward me.","3:1":"my brothers","3:2":"beware of the evil workers","3:3":"who worship God in the Spirit","3:4":"I yet more:","3:5":"of the stock of Israel","3:6":"persecuting the assembly; concerning the righteousness which is in the law","3:7":"what things were gain to me","3:8":"and I count all things to be loss for the excellency of the knowledge of Christ Jesus","3:9":"not having a righteousness of my own","3:10":"and the power of his resurrection","3:11":"If by any means I might attain unto the resurrection of the dead.","3:12":"or am already made perfect; but I press on","3:13":"I don't regard myself as yet having taken hold","3:14":"I press toward the mark for the prize of the high calling of God in Christ Jesus.","3:15":"as many as are perfect","3:16":"to the extent that we have already attained","3:17":"be imitators together of me","3:18":"of whom I told you often","3:19":"whose god is the belly","3:20":"from where we also wait for a Savior","3:21":"according to the working by which he is able even to subject all things to himself.","4:1":"my brothers","4:2":"and I exhort Syntyche","4:3":"I beg you also","4:4":"Rejoice!","4:5":"Let your moderation be known unto all men. The Lord is at hand.","4:6":"but in everything","4:7":"which surpasses all understanding","4:8":"brothers","4:9":"received","4:10":"that now at length you have revived your thought for me; in which you did indeed take thought","4:11":"for I have learned in whatever state I am","4:12":"and I know also how to abound. In everything and in all things I have learned the secret both to be filled and to be hungry","4:13":"who strengthens me.","4:14":"Notwithstanding ye have well done","4:15":"you Philippians","4:16":"For even in Thessalonica ye sent once and again unto my necessity.","4:17":"but I seek for the fruit that increases to your account.","4:18":"and abound.  I am filled","4:19":"But my God shall supply all your need according to his riches in glory by Christ Jesus.","4:20":"Now unto God and our Father be glory for ever and ever. Amen.","4:21":"Salute every saint in Christ Jesus. The brethren which are with me greet you.","4:22":"especially those who are of Caesar's household.","4:23":"The grace of our Lord Jesus Christ be with you all. Amen."}