{"1:1":"the son of David","1:2":"To know wisdom and instruction; to perceive the words of understanding;","1:3":"in righteousness","1:4":"knowledge and discretion to the young man:","1:5":"and increase in learning; that the man of understanding may attain to sound counsel:","1:6":"and parables","1:7":"The fear of the LORD is the beginning of knowledge: but fools despise wisdom and instruction.","1:8":"listen to your father's instruction","1:9":"and chains around your neck.","1:10":"if sinners entice you","1:11":"Come with us, Let's lay in wait for blood; let's lurk secretly for the innocent without cause;,If they say, Come with us, let us lay wait for blood, let us lurk privily for the innocent without cause:, אִם־יֹאמְרוּ לְכָה אִתָּנוּ נֶאֶרְבָה לְדָם נִצְפְּנָה לְנָקִי חִנָּם׃ ‬,If they say: Come with us","1:12":"and whole","1:13":"We shall find all precious substance","1:14":"τὸν δὲ σὸν κλῆρον βάλε ἐν ἡμῖν κοινὸν δὲ βαλλάντιον κτησώμεθα πάντες καὶ μαρσίππιον ἓν γενηθήτω ἡμῖν","1:15":"don't walk in the way with them.  Keep your foot from their path","1:16":"For their feet run to evil","1:17":"Surely in vain the net is spread in the sight of any bird.","1:18":"And they lay wait for their own blood; they lurk privily for their own lives.","1:19":"So are the ways of every one that is greedy of gain; which taketh away the life of the owners thereof.","1:20":"Wisdom crieth without; she uttereth her voice in the streets:","1:21":"she utters her words:","1:22":"ye thoughtless","1:23":"I will pour out my spirit on you. I will make known my words to you.","1:24":"and you have refused; I have stretched out my hand","1:25":"and wanted none of my reproof;","1:26":"I also will laugh at your calamity; I will mock when your fear cometh;","1:27":"when your disaster comes on like a whirlwind; when distress and anguish come on you.","1:28":"but I will not answer. They will seek me diligently","1:29":"and didn't choose the fear of Yahweh.","1:30":"They would none of my counsel: they despised all my reproof.","1:31":"and be filled with their own schemes.","1:32":"For the turning away of the simple shall slay them","1:33":"and will be at ease","2:1":"if you will receive my words","2:2":"and apply your heart to understanding;","2:3":"if you call out for discernment","2:4":"and search for her as for hidden treasures:","2:5":"and find the knowledge of God.","2:6":"For the LORD giveth wisdom: out of his mouth cometh knowledge and understanding.","2:7":"He layeth up sound wisdom for the righteous: he is a buckler to them that walk uprightly.","2:8":"and preserve the way of his saints.","2:9":"equity and every good path.","2:10":"When wisdom entereth into thine heart","2:11":"","2:12":"from the men who speak perverse things;","2:13":"to walk in the ways of darkness;","2:14":"and delight in the perverseness of evil;","2:15":"and wayward in their paths:","2:16":"even from the foreigner who flatters with her words;","2:17":"and forgets the covenant of her God:","2:18":"her paths to the dead.","2:19":"neither do they attain to the paths of life:","2:20":"and keep the paths of the righteous.","2:21":"For the upright shall dwell in the land","2:22":"But the wicked shall be cut off from the earth","3:1":"don't forget my teaching; but let your heart keep my commandments:","3:2":"and years of life","3:3":"Let not mercy and truth forsake thee: bind them about thy neck; write them upon the table of thine heart:","3:4":"and good understanding in the sight of God and man.","3:5":"and don't lean on your own understanding.","3:6":"and he will make your paths straight.","3:7":"and depart from evil.","3:8":"and nourishment to your bones.","3:9":"with the first fruits of all your increase:","3:10":"and your vats will overflow with new wine.","3:11":"don't despise Yahweh's discipline","3:12":"he reproves; even as a father reproves the son in whom he delights.","3:13":"the man who gets understanding.","3:14":"and her return is better than fine gold.","3:15":"She is more precious than rubies: and all the things thou canst desire are not to be compared unto her.","3:16":"Length of days is in her right hand; and in her left hand riches and honour.","3:17":"Her ways are ways of pleasantness","3:18":"She is a tree of life to them that lay hold upon her: and happy is every one that retaineth her.","3:19":"he established the heavens.","3:20":"the depths were broken up","3:21":"let them not depart from your eyes.  Keep sound wisdom and discretion:","3:22":"and grace for your neck.","3:23":"Then shalt thou walk in thy way safely","3:24":"you will not be afraid.  Yes","3:25":"neither of the desolation of the wicked","3:26":"and will keep your foot from being taken.","3:27":"when it is in the power of your hand to do it.","3:28":"Go, and come again; tomorrow I will give it to you, when you have it by you.","3:29":"seeing he dwells securely by you.","3:30":"if he has done you no harm.","3:31":"Envy thou not the oppressor","3:32":"but his friendship is with the upright.","3:33":"but he blesses the habitation of the righteous.","3:34":"but he gives grace to the humble.","3:35":"but shame will be the promotion of fools.","4:1":"sons","4:2":"For I give you good doctrine","4:3":"tender and an only child in the sight of my mother.","4:4":"and said to me:  Let your heart retain my words. Keep my commandments, and live.,He taught me also, and said unto me, Let thine heart retain my words: keep my commandments, and live., וַיֹּרֵנִי וַיֹּאמֶר לִי יִתְמָךְ־דְּבָרַי לִבֶּךָ שְׁמֹר מִצְוֺתַי וֶחְיֵה׃ ‬,And he taught me, and said unto me: Let thy heart hold fast my words","4:5":"neither swerve from the words of my mouth.","4:6":"and she will preserve you.  Love her","4:7":"though it costs all your possessions","4:8":"and she will exalt you.  She will bring you to honor","4:9":"ἵνα δῷ τῇ σῇ κεφαλῇ στέφανον χαρίτων στεφάνῳ δὲ τρυφῆς ὑπερασπίσῃ σου","4:10":"my son","4:11":"I have taught thee in the way of wisdom; I have led thee in right paths.","4:12":"your steps will not be hampered.  When you run","4:13":"for she is your life.","4:14":"Enter not into the path of the wicked","4:15":"and don't pass by it.  Turn from it","4:16":"unless they do evil.  Their sleep is taken away","4:17":"and drink the wine of violence.","4:18":"that shines more and more until the perfect day.","4:19":"The way of the wicked is as darkness: they know not at what they stumble.","4:20":"attend to my words.  Turn your ear to my sayings.","4:21":"Let them not depart from thine eyes; keep them in the midst of thine heart.","4:22":"and health to their whole body.","4:23":"for out of it is the wellspring of life.","4:24":"Put away from thee a froward mouth","4:25":"Let thine eyes look right on","4:26":"Ponder the path of thy feet","4:27":"Turn not to the right hand nor to the left: remove thy foot from evil.","5:1":"pay attention to my wisdom.  Turn your ear to my understanding:","5:2":"that your lips may preserve knowledge.","5:3":"","5:4":"and as sharp as a two-edged sword.","5:5":"Her feet go down to death; her steps take hold on hell.","5:6":"and she doesn't know it.","5:7":"my sons","5:8":"","5:9":"and your years to the cruel one;","5:10":"and your labors enrich another man's house.","5:11":"when your flesh and your body are consumed","5:12":"How I have hated instruction, and my heart despised reproof;,And say, How have I hated instruction, and my heart despised reproof;, וְאָמַרְתָּ אֵיךְ שָׂנֵאתִי מוּסָר וְתוֹכַחַת נָאַץ לִבִּי׃ ‬,And say: How have I hated instruction","5:13":"nor turned my ear to those who instructed me!","5:14":"in the midst of the gathered assembly.,I was almost in all evil in the midst of the congregation and assembly., כִּמְעַט הָיִיתִי בְכָל־רָע בְּתוֹךְ קָהָל וְעֵדָה׃ ‬,I was well nigh in all evil In the midst of the congregation and assembly.","5:15":"running water out of your own well.","5:16":"streams of water in the public squares?","5:17":"not for strangers with you.","5:18":"Let thy fountain be blessed: and rejoice with the wife of thy youth.","5:19":"Let her be as the loving hind and pleasant roe; let her breasts satisfy thee at all times; and be thou ravished always with her love.","5:20":"my son","5:21":"For the ways of man are before the eyes of the LORD","5:22":"His own iniquities shall take the wicked himself","5:23":"he will go astray.","6:1":"if you have become collateral for your neighbor","6:2":"Thou art snared with the words of thy mouth","6:3":"my son","6:4":"nor slumber to your eyelids.","6:5":"like a gazelle from the hand of the hunter","6:6":"you sluggard.  Consider her ways","6:7":"overseer","6:8":"and gathers her food in the harvest.","6:9":"sluggard?  When will you arise out of your sleep?","6:10":"a little slumber","6:11":"and your scarcity as an armed man.","6:12":"a man of iniquity","6:13":"who signals with his feet","6:14":"who devises evil continually","6:15":"and that without remedy.","6:16":"seven which are an abomination to him:","6:17":"a lying tongue","6:18":"feet that are swift in running to mischief","6:19":"and he who sows discord among brothers.","6:20":"keep your father's commandment","6:21":"Bind them continually upon thine heart","6:22":"it will lead you.  When you sleep","6:23":"and the law is light. Reproofs of instruction are the way of life","6:24":"from the flattery of the wayward wife's tongue.","6:25":"neither let her captivate you with her eyelids.","6:26":"For by means of a whorish woman a man is brought to a piece of bread: and the adultress will hunt for the precious life.","6:27":"and his clothes not be burned?","6:28":"and his feet not be scorched?","6:29":"So he that goeth in to his neighbour's wife; whosoever toucheth her shall not be innocent.","6:30":"if he steals to satisfy himself when he is hungry:","6:31":"he shall restore seven times. He shall give all the wealth of his house.","6:32":"But whoso committeth adultery with a woman lacketh understanding: he that doeth it destroyeth his own soul.","6:33":"A wound and dishonour shall he get; and his reproach shall not be wiped away.","6:34":"For jealousy is the rage of a man: therefore he will not spare in the day of vengeance.","6:35":"neither will he rest content","7:1":"keep my words.  Lay up my commandments within you.","7:2":"Keep my commandments","7:3":"Bind them upon thy fingers","7:4":"You are my sister.  Call understanding your relative","7:5":"from the foreigner who flatters with her words.","7:6":"I looked out through my lattice.","7:7":"","7:8":"he went the way to her house","7:9":"in the evening of the day","7:10":"there a woman met him with the attire of a prostitute","7:11":"(She is loud and stubborn; her feet abide not in her house:","7:12":"now in the squares","7:13":"and kissed him.  With an impudent face she said to him:","7:14":"","7:15":"to diligently seek your face","7:16":"with striped cloths of the yarn of Egypt.","7:17":"aloes","7:18":"let's take our fill of loving until the morning. Let's solace ourselves with loving.","7:19":"For the goodman is not at home","7:20":"ἔνδεσμον ἀργυρίου λαβὼν ἐν χειρὶ αὐτοῦ δι' ἡμερῶν πολλῶν ἐπανήξει εἰς τὸν οἶκον αὐτοῦ","7:21":"she led him astray.  With the flattering of her lips","7:22":"as an ox goes to the slaughter","7:23":"as a bird hurries to the snare","7:24":"sons","7:25":"","7:26":"all her slain are a mighty army.","7:27":"going down to the chambers of death.","8:1":"Doth not wisdom cry? and understanding put forth her voice?","8:2":"where the paths meet","8:3":"at the entry of the city","8:4":"O men","8:5":"understand prudence.  You fools","8:6":"for I will speak excellent things.  The opening of my lips is for right things.","8:7":"For my mouth shall speak truth; and wickedness is an abomination to my lips.","8:8":"All the words of my mouth are in righteousness; there is nothing froward or perverse in them.","8:9":"right to those who find knowledge.","8:10":"Receive my instruction","8:11":"For wisdom is better than rubies; and all the things that may be desired are not to be compared to it.","8:12":"","8:13":"arrogance","8:14":"Counsel is mine","8:15":"and princes decree justice.","8:16":"and all the righteous rulers of the earth.","8:17":"I love them that love me; and those that seek me early shall find me.","8:18":"honor","8:19":"yes","8:20":"in the midst of the paths of justice;","8:21":"That I may cause those that love me to inherit substance; and I will fill their treasures.","8:22":"","8:23":"from the beginning","8:24":"I was brought forth","8:25":"before the hills","8:26":"nor the fields","8:27":"I was there; when he set a circle on the surface of the deep","8:28":"when the springs of the deep became strong","8:29":"that the waters should not violate his commandment","8:30":"always rejoicing before him","8:31":"Rejoicing in the habitable part of his earth; and my delights were with the sons of men.","8:32":"","8:33":"and be wise.  Don't refuse it.","8:34":"watching daily at my gates","8:35":"finds life","8:36":"οἱ δὲ εἰς ἐμὲ ἁμαρτάνοντες ἀσεβοῦσιν τὰς ἑαυτῶν ψυχάς καὶ οἱ μισοῦντές με ἀγαπῶσιν θάνατον","9:1":"Wisdom hath builded her house","9:2":"She hath killed her beasts; she hath mingled her wine; she hath also furnished her table.","9:3":"She hath sent forth her maidens: she crieth upon the highest places of the city","9:4":"she says to him","9:5":"eat of my bread","9:6":"and live.  Walk in the way of understanding.,Forsake the foolish, and live; and go in the way of understanding., עִזְבוּ פְתָאיִם וִחְיוּ וְאִשְׁרוּ בְּדֶרֶךְ בִּינָה׃ ‬,Forsake all thoughtlessness, and live; And walk in the way of understanding.,ἀπολείπετε ἀφροσύνην καὶ ζήσεσθε καὶ ζητήσατε φρόνησιν ἵνα βιώσητε καὶ κατορθώσατε ἐν γνώσει σύνεσιν,Leave folly, that ye may reign for ever; and seek wisdom, and improve understanding by knowledge.,,,,","9:7":"He that reproveth a scorner getteth to himself shame: and he that rebuketh a wicked man getteth himself a blot.","9:8":"lest he hate you.  Reprove a wise man","9:9":"and he will be still wiser. Teach a righteous man","9:10":"The fear of the LORD is the beginning of wisdom: and the knowledge of the holy is understanding.","9:11":"For by me thy days shall be multiplied","9:12":"you are wise for yourself.  If you mock","9:13":"Undisciplined","9:14":"on a seat in the high places of the city","9:15":"who go straight on their ways","9:16":"she says to him","9:17":"Stolen waters are sweet","9:18":"that her guests are in the depths of Sheol.","10:1":"The proverbs of Solomon. A wise son maketh a glad father: but a foolish son is the heaviness of his mother.","10:2":"but righteousness delivers from death.","10:3":"but he thrusts away the desire of the wicked.","10:4":"but the hand of the diligent brings wealth.","10:5":"but he who sleeps during the harvest is a son who causes shame.","10:6":"but violence covers the mouth of the wicked.","10:7":"but the name of the wicked will rot.","10:8":"but a chattering fool will fall.","10:9":"but he who perverts his ways will be found out.","10:10":"but a chattering fool will fall.","10:11":"but violence covers the mouth of the wicked.","10:12":"but love covers all wrongs.","10:13":"but a rod is for the back of him who is void of understanding.","10:14":"but the mouth of the foolish is near ruin.","10:15":"The rich man's wealth is his strong city: the destruction of the poor is their poverty.","10:16":"The labour of the righteous tendeth to life: the fruit of the wicked to sin.","10:17":"but he who forsakes reproof leads others astray.","10:18":"He that hideth hatred with lying lips","10:19":"but he who restrains his lips does wisely.","10:20":"The tongue of the just is as choice silver: the heart of the wicked is little worth.","10:21":"but the foolish die for lack of understanding.","10:22":"and he adds no trouble to it.","10:23":"but wisdom is a man of understanding's pleasure.","10:24":"will overtake them","10:25":"the wicked is no more; but the righteous stand firm forever.","10:26":"and as smoke to the eyes","10:27":"but the years of the wicked shall be shortened.","10:28":"but the hope of the wicked will perish.","10:29":"but it is a destruction to the workers of iniquity.","10:30":"but the wicked will not dwell in the land.","10:31":"but the perverse tongue will be cut off.","10:32":"but the mouth of the wicked is perverse.","11:1":"but accurate weights are his delight.","11:2":"then comes shame","11:3":"but the perverseness of the treacherous shall destroy them.","11:4":"but righteousness delivers from death.","11:5":"but the wicked shall fall by his own wickedness.","11:6":"but the unfaithful will be trapped by evil desires.","11:7":"hope perishes","11:8":"and the wicked takes his place.","11:9":"but the righteous will be delivered through knowledge.","11:10":"the city rejoices. When the wicked perish","11:11":"the city is exalted","11:12":"but a man of understanding holds his peace.","11:13":"but one who is of a trustworthy spirit is one who keeps a secret.","11:14":"the nation falls","11:15":"but he who refuses pledges of collateral is secure.","11:16":"but violent men obtain riches.","11:17":"but he who is cruel troubles his own flesh.","11:18":"but one who sows righteousness reaps a sure reward.","11:19":"As righteousness tendeth to life: so he that pursueth evil pursueth it to his own death.","11:20":"but those whose ways are blameless are his delight.","11:21":"the evil man will not be unpunished","11:22":"is a beautiful woman who lacks discretion.","11:23":"The desire of the righteous is only good: but the expectation of the wicked is wrath.","11:24":"and increases yet more. There is one who withholds more than is appropriate","11:25":"The liberal soul shall be made fat: and he that watereth shall be watered also himself.","11:26":"but blessing will be on the head of him who sells it.","11:27":"but he who searches after evil","11:28":"but the righteous shall flourish as the green leaf.","11:29":"He that troubleth his own house shall inherit the wind: and the fool shall be servant to the wise of heart.","11:30":"The fruit of the righteous is a tree of life; and he that winneth souls is wise.","11:31":"the righteous shall be repaid in the earth; how much more the wicked and the sinner!","12:1":"but he who hates reproof is stupid.","12:2":"but he will condemn a man of wicked devices.","12:3":"but the root of the righteous shall not be moved.","12:4":"but a disgraceful wife is as rottenness in his bones.","12:5":"but the advice of the wicked is deceitful.","12:6":"but the speech of the upright rescues them.","12:7":"and are no more","12:8":"but he who has a warped mind shall be despised.","12:9":"and has a servant","12:10":"but the tender mercies of the wicked are cruel.","12:11":"but he who chases fantasies is void of understanding.","12:12":"but the root of the righteous flourishes.","12:13":"but the righteous shall come out of trouble.","12:14":"A man shall be satisfied with good by the fruit of his mouth: and the recompence of a man's hands shall be rendered unto him.","12:15":"but he who is wise listens to counsel.","12:16":"but one who overlooks an insult is prudent.","12:17":"but a false witness lies.","12:18":"but the tongue of the wise heals.","12:19":"but a lying tongue is only momentary.","12:20":"but joy comes to the promoters of peace.","12:21":"but the wicked shall be filled with evil.","12:22":"but those who do the truth are his delight.","12:23":"but the hearts of fools proclaim foolishness.","12:24":"but laziness ends in slave labor.","12:25":"but a kind word makes it glad.","12:26":"but the way of the wicked leads them astray.","12:27":"but the possessions of diligent men are prized.","12:28":"In the way of righteousness is life: and in the pathway thereof there is no death.","13:1":"but a scoffer doesn't listen to rebuke.","13:2":"a man enjoys good things; but the unfaithful crave violence.","13:3":"He that keepeth his mouth keepeth his life: but he that openeth wide his lips shall have destruction.","13:4":"and has nothing","13:5":"but a wicked man brings shame and disgrace.","13:6":"but wickedness overthrows the sinner.","13:7":"yet have nothing. There are some who pretend to be poor","13:8":"but the poor hear no threats.","13:9":"but the lamp of the wicked is snuffed out.","13:10":"but with ones who take advice is wisdom.","13:11":"but he who gathers by hand makes it grow.","13:12":"but when longing is fulfilled","13:13":"but he who respects a command will be rewarded.","13:14":"to turn from the snares of death.","13:15":"Good understanding giveth favour: but the way of transgressors is hard.","13:16":"but a fool exposes folly.","13:17":"but a trustworthy envoy gains healing.","13:18":"but he who heeds correction shall be honored.","13:19":"but fools detest turning from evil.","13:20":"but a companion of fools suffers harm.","13:21":"but prosperity rewards the righteous.","13:22":"but the wealth of the sinner is stored for the righteous.","13:23":"but injustice sweeps it away.","13:24":"but one who loves him is careful to discipline him.","13:25":"but the belly of the wicked goes hungry.","14:1":"but the foolish one tears it down with her own hands.","14:2":"but he who is perverse in his ways despises him.","14:3":"but the lips of the wise protect them.","14:4":"the crib is clean","14:5":"but a false witness pours out lies.","14:6":"and doesn't find it","14:7":"for you won't find knowledge on his lips.","14:8":"but the folly of fools is deceit.","14:9":"but among the upright there is good will.","14:10":"The heart knoweth his own bitterness; and a stranger doth not intermeddle with his joy.","14:11":"but the tent of the upright will flourish.","14:12":"but in the end it leads to death.","14:13":"and mirth may end in heaviness.","14:14":"The backslider in heart shall be filled with his own ways: and a good man shall be satisfied from himself.","14:15":"but the prudent man carefully considers his ways.","14:16":"and shuns evil","14:17":"and a crafty man is hated.","14:18":"but the prudent are crowned with knowledge.","14:19":"and the wicked at the gates of the righteous.","14:20":"but the rich person has many friends.","14:21":"but blessed is he who has pity on the poor.","14:22":"Do they not err that devise evil? but mercy and truth shall be to them that devise good.","14:23":"but the talk of the lips leads only to poverty.","14:24":"but the folly of fools crowns them with folly.","14:25":"but a false witness is deceitful.","14:26":"and he will be a refuge for his children.","14:27":"turning people from the snares of death.","14:28":"but in the lack of people is the destruction of the prince.","14:29":"but he who has a quick temper displays folly.","14:30":"but envy rots the bones.","14:31":"but he who is kind to the needy honors him.","14:32":"but in death","14:33":"and is even made known in the inward part of fools.","14:34":"but sin is a disgrace to any people.","14:35":"but his wrath is toward one who causes shame.","15:1":"but a harsh word stirs up anger.","15:2":"but the mouth of fools gush out folly.","15:3":"keeping watch on the evil and the good.","15:4":"but deceit in it crushes the spirit.","15:5":"but he who heeds reproof shows prudence.","15:6":"but the income of the wicked brings trouble.","15:7":"The lips of the wise disperse knowledge: but the heart of the foolish doeth not so.","15:8":"but the prayer of the upright is his delight.","15:9":"but he loves him who follows after righteousness.","15:10":"Correction is grievous unto him that forsaketh the way: and he that hateth reproof shall die.","15:11":"Hell and destruction are before the LORD: how much more then the hearts of the children of men?","15:12":"A scorner loveth not one that reproveth him: neither will he go unto the wise.","15:13":"A merry heart maketh a cheerful countenance: but by sorrow of the heart the spirit is broken.","15:14":"but the mouths of fools feed on folly.","15:15":"but one who has a cheerful heart enjoys a continual feast.","15:16":"with the fear of Yahweh","15:17":"where love is","15:18":"but one who is slow to anger appeases strife.","15:19":"but the path of the upright is a highway.","15:20":"but a foolish man despises his mother.","15:21":"but a man of understanding keeps his way straight.","15:22":"plans fail; but in a multitude of counselors they are established.","15:23":"A man hath joy by the answer of his mouth: and a word spoken in due season","15:24":"to keep him from going downward to Sheol.","15:25":"but he will keep the widow's borders intact.","15:26":"but the thoughts of the pure are pleasing.","15:27":"but he who hates bribes will live.","15:28":"but the mouth of the wicked gushes out evil.","15:29":"but he hears the prayer of the righteous.","15:30":"The light of the eyes rejoiceth the heart: and a good report maketh the bones fat.","15:31":"and will be at home among the wise.","15:32":"but he who listens to reproof gets understanding.","15:33":"The fear of the LORD is the instruction of wisdom; and before honour is humility.","16:1":"but the answer of the tongue is from Yahweh.","16:2":"All the ways of a man are clean in his own eyes; but the LORD weigheth the spirits.","16:3":"and your plans shall succeed.","16:4":"even the wicked for the day of evil.","16:5":"Every one that is proud in heart is an abomination to the LORD: though hand join in hand","16:6":"By mercy and truth iniquity is purged: and by the fear of the LORD men depart from evil.","16:7":"he makes even his enemies to be at peace with him.","16:8":"than great revenues with injustice.","16:9":"but Yahweh directs his steps.","16:10":"A divine sentence is in the lips of the king: his mouth transgresseth not in judgment.","16:11":"A just weight and balance are the LORD's: all the weights of the bag are his work.","16:12":"for the throne is established by righteousness.","16:13":"Righteous lips are the delight of kings; and they love him that speaketh right.","16:14":"but a wise man will pacify it.","16:15":"In the light of the king's countenance is life; and his favour is as a cloud of the latter rain.","16:16":"to get understanding is to be chosen rather than silver.","16:17":"The highway of the upright is to depart from evil: he that keepeth his way preserveth his soul.","16:18":"and a haughty spirit before a fall.","16:19":"than to divide the plunder with the proud.","16:20":"He that handleth a matter wisely shall find good: and whoso trusteth in the LORD","16:21":"The wise in heart shall be called prudent: and the sweetness of the lips increaseth learning.","16:22":"but the punishment of fools is their folly.","16:23":"and adds learning to his lips.","16:24":"sweet to the soul","16:25":"but in the end it leads to death.","16:26":"He that laboureth laboureth for himself; for his mouth craveth it of him.","16:27":"An ungodly man diggeth up evil: and in his lips there is as a burning fire.","16:28":"A froward man soweth strife: and a whisperer separateth chief friends.","16:29":"and leads him in a way that is not good.","16:30":"one who compresses his lips","16:31":"The hoary head is a crown of glory","16:32":"than he who takes a city.","16:33":"but its every decision is from Yahweh.","17:1":"than a house full of feasting with strife.","17:2":"and shall have a part in the inheritance among the brothers.","17:3":"and the furnace for gold","17:4":"A wicked doer giveth heed to false lips; and a liar giveth ear to a naughty tongue.","17:5":"Whoso mocketh the poor reproacheth his Maker: and he that is glad at calamities shall not be unpunished.","17:6":"Children's children are the crown of old men; and the glory of children are their fathers.","17:7":"much less do lying lips fit a prince.","17:8":"he prospers.","17:9":"He that covereth a transgression seeketh love; but he that repeateth a matter separateth very friends.","17:10":"A reproof entereth more into a wise man than an hundred stripes into a fool.","17:11":"An evil man seeketh only rebellion: therefore a cruel messenger shall be sent against him.","17:12":"rather than a fool in his folly.","17:13":"evil shall not depart from his house.","17:14":"therefore stop contention before quarreling breaks out.","17:15":"and he who condemns the righteous","17:16":"seeing he has no understanding?","17:17":"A friend loveth at all times","17:18":"and becomes collateral in the presence of his neighbor.","17:19":"He loveth transgression that loveth strife: and he that exalteth his gate seeketh destruction.","17:20":"and one who has a deceitful tongue falls into trouble.","17:21":"He that begetteth a fool doeth it to his sorrow: and the father of a fool hath no joy.","17:22":"but a crushed spirit dries up the bones.","17:23":"to pervert the ways of justice.","17:24":"but the eyes of a fool wander to the ends of the earth.","17:25":"and bitterness to her who bore him.","17:26":"nor to flog officials for their integrity.","17:27":"He that hath knowledge spareth his words: and a man of understanding is of an excellent spirit.","17:28":"when he keeps silent","18:1":"and defies all sound judgment.","18:2":"but only in revealing his own opinion.","18:3":"contempt also comes","18:4":"The words of a man's mouth are as deep waters","18:5":"nor to deprive the innocent of justice.","18:6":"and his mouth invites beatings.","18:7":"and his lips are a snare to his soul.","18:8":"The words of a talebearer are as wounds","18:9":"He also that is slothful in his work is brother to him that is a great waster.","18:10":"and are safe.","18:11":"like an unscalable wall in his own imagination.","18:12":"but before honor is humility.","18:13":"that is folly and shame to him.","18:14":"but a crushed spirit","18:15":"The heart of the prudent getteth knowledge; and the ear of the wise seeketh knowledge.","18:16":"and brings him before great men.","18:17":"He that is first in his own cause seemeth just; but his neighbour cometh and searcheth him.","18:18":"and keeps strong ones apart.","18:19":"A brother offended is harder to be won than a strong city: and their contentions are like the bars of a castle.","18:20":"A man's belly shall be satisfied with the fruit of his mouth; and with the increase of his lips shall he be filled.","18:21":"Death and life are in the power of the tongue: and they that love it shall eat the fruit thereof.","18:22":"and obtains favor of Yahweh.","18:23":"but the rich answer harshly.","18:24":"but there is a friend who sticks closer than a brother.","19:1":"Better is the poor that walketh in his integrity","19:2":"Also","19:3":"The foolishness of man perverteth his way: and his heart fretteth against the LORD.","19:4":"but the poor is separated from his friend.","19:5":"A false witness shall not be unpunished","19:6":"and everyone is a friend to a man who gives gifts.","19:7":"but they are gone.","19:8":"He that getteth wisdom loveth his own soul: he that keepeth understanding shall find good.","19:9":"A false witness shall not be unpunished","19:10":"much less for a servant to have rule over princes.","19:11":"The discretion of a man deferreth his anger; and it is his glory to pass over a transgression.","19:12":"but his favor is like dew on the grass.","19:13":"A foolish son is the calamity of his father: and the contentions of a wife are a continual dropping.","19:14":"but a prudent wife is from Yahweh.","19:15":"Slothfulness casteth into a deep sleep; and an idle soul shall suffer hunger.","19:16":"but he who is contemptuous in his ways shall die.","19:17":"He that hath pity upon the poor lendeth unto the LORD; and that which he hath given will he pay him again.","19:18":"for there is hope; don't be a willing party to his death.","19:19":"for if you rescue him","19:20":"that you may be wise in your latter end.","19:21":"but Yahweh's counsel will prevail.","19:22":"The desire of a man is his kindness: and a poor man is better than a liar.","19:23":"then contentment; he rests and will not be touched by trouble.","19:24":"A slothful man hideth his hand in his bosom","19:25":"and the simple will learn prudence; rebuke one who has understanding","19:26":"is a son who causes shame and brings reproach.","19:27":"my son","19:28":"and the mouth of the wicked gulps down iniquity.","19:29":"and beatings for the backs of fools.","20:1":"and beer is a brawler.  Whoever is led astray by them is not wise.","20:2":"The fear of a king is as the roaring of a lion: whoso provoketh him to anger sinneth against his own soul.","20:3":"It is an honour for a man to cease from strife: but every fool will be meddling.","20:4":"and have nothing.","20:5":"Counsel in the heart of man is like deep water; but a man of understanding will draw it out.","20:6":"but who can find a faithful man?","20:7":"The just man walketh in his integrity: his children are blessed after him.","20:8":"A king that sitteth in the throne of judgment scattereth away all evil with his eyes.","20:9":"I have made my heart pure.  I am clean and without sin?","20:10":"both of them alike are an abomination to Yahweh.","20:11":"whether his work is pure","20:12":"and the seeing eye","20:13":"lest you come to poverty.  Open your eyes","20:14":"then he boasts.","20:15":"There is gold","20:16":"Take his garment that is surety for a stranger: and take a pledge of him for a strange woman.","20:17":"but afterwards his mouth is filled with gravel.","20:18":"Every purpose is established by counsel: and with good advice make war.","20:19":"He that goeth about as a talebearer revealeth secrets: therefore meddle not with him that flattereth with his lips.","20:20":"his lamp shall be put out in blackness of darkness.","20:21":"won't be blessed in the end.","20:22":"I will pay back evil.  Wait for Yahweh","20:23":"and dishonest scales are not pleasing.","20:24":"Man's goings are of the LORD; how can a man then understand his own way?","20:25":"then later to consider his vows.","20:26":"and drives the threshing wheel over them.","20:27":"searching all his innermost parts.","20:28":"Mercy and truth preserve the king: and his throne is upholden by mercy.","20:29":"The glory of young men is their strength: and the beauty of old men is the grey head.","20:30":"and beatings purge the innermost parts.","21:1":"The king's heart is in the hand of the LORD","21:2":"but Yahweh weighs the hearts.","21:3":"To do justice and judgment is more acceptable to the LORD than sacrifice.","21:4":"and a proud heart","21:5":"The thoughts of the diligent tend only to plenteousness; but of every one that is hasty only to want.","21:6":"The getting of treasures by a lying tongue is a vanity tossed to and fro of them that seek death.","21:7":"because they refuse to do what is right.","21:8":"but the conduct of the innocent is upright.","21:9":"than to share a house with a contentious woman.","21:10":"The soul of the wicked desireth evil: his neighbour findeth no favour in his eyes.","21:11":"the simple gains wisdom. When the wise is instructed","21:12":"and brings the wicked to ruin.","21:13":"he will also cry out","21:14":"strong wrath.","21:15":"It is joy to the just to do judgment: but destruction shall be to the workers of iniquity.","21:16":"The man that wandereth out of the way of understanding shall remain in the congregation of the dead.","21:17":"He that loveth pleasure shall be a poor man: he that loveth wine and oil shall not be rich.","21:18":"The wicked shall be a ransom for the righteous","21:19":"than with a contentious and fretful woman.","21:20":"There is treasure to be desired and oil in the dwelling of the wise; but a foolish man spendeth it up.","21:21":"righteousness","21:22":"and brings down the strength of its confidence.","21:23":"Whoso keepeth his mouth and his tongue keepeth his soul from troubles.","21:24":"scoffer is his name; he works in the arrogance of pride.","21:25":"for his hands refuse to labor.","21:26":"He coveteth greedily all the day long: but the righteous giveth and spareth not.","21:27":"when he brings it with a wicked mind!","21:28":"and a man who listens speaks to eternity.","21:29":"he establishes his ways.","21:30":"There is no wisdom nor understanding nor counsel against the LORD.","21:31":"The horse is prepared against the day of battle: but safety is of the LORD.","22:1":"and loving favor is better than silver and gold.","22:2":"The rich and poor meet together: the LORD is the maker of them all.","22:3":"and hides himself; but the simple pass on","22:4":"honor","22:5":"Thorns and snares are in the way of the froward: he that doth keep his soul shall be far from them.","22:6":"and when he is old he will not depart from it.","22:7":"The rich ruleth over the poor","22:8":"and the rod of his fury will be destroyed.","22:9":"He that hath a bountiful eye shall be blessed; for he giveth of his bread to the poor.","22:10":"and strife will go out; yes","22:11":"He that loveth pureness of heart","22:12":"The eyes of the LORD preserve knowledge","22:13":"There is a lion outside!  I will be killed in the streets!","22:14":"The mouth of strange women is a deep pit: he that is abhorred of the LORD shall fall therein.","22:15":"Foolishness is bound in the heart of a child; but the rod of correction shall drive it far from him.","22:16":"both come to poverty.","22:17":"and listen to the words of the wise. Apply your heart to my teaching.","22:18":"if all of them are ready on your lips.","22:19":"I teach you today","22:20":"","22:21":"reliable words","22:22":"because he is poor; and don't crush the needy in court;","22:23":"and plunder the life of those who plunder them.","22:24":"and don't associate with one who harbors anger:","22:25":"and ensnare your soul.","22:26":"of those who are collateral for debts.","22:27":"why should he take away your bed from under you?","22:28":"which your fathers have set up.","22:29":"Seest thou a man diligent in his business? he shall stand before kings; he shall not stand before mean men.","23:1":"consider diligently what is before you;","23:2":"if you are a man given to appetite.","23:3":"seeing they are deceitful food.","23:4":"show restraint.","23:5":"Wilt thou set thine eyes upon that which is not? for riches certainly make themselves wings; they fly away as an eagle toward heaven.","23:6":"and don't crave his delicacies:","23:7":"so he is.  Eat and drink! he says to you","23:8":"and lose your good words.","23:9":"for he will despise the wisdom of your words.","23:10":"Remove not the old landmark; and enter not into the fields of the fatherless:","23:11":"For their redeemer is mighty; he shall plead their cause with thee.","23:12":"and your ears to the words of knowledge.","23:13":"he will not die.","23:14":"and save his soul from Sheol.","23:15":"if your heart is wise","23:16":"my heart will rejoice","23:17":"Let not thine heart envy sinners: but be thou in the fear of the LORD all the day long.","23:18":"and your hope will not be cut off.","23:19":"my son","23:20":"or those who gorge themselves on meat:","23:21":"For the drunkard and the glutton shall come to poverty: and drowsiness shall clothe a man with rags.","23:22":"and don't despise your mother when she is old.","23:23":"and don't sell it.  Get wisdom","23:24":"The father of the righteous shall greatly rejoice: and he that begetteth a wise child shall have joy of him.","23:25":"Thy father and thy mother shall be glad","23:26":"give me your heart; and let your eyes keep in my ways.","23:27":"For a whore is a deep ditch; and a strange woman is a narrow pit.","23:28":"she lies in wait like a robber","23:29":"Who hath woe? who hath sorrow? who hath contentions? who hath babbling? who hath wounds without cause? who hath redness of eyes?","23:30":"They that tarry long at the wine; they that go to seek mixed wine.","23:31":"when it sparkles in the cup","23:32":"it bites like a snake","23:33":"and your mind will imagine confusing things.","23:34":"you will be as he who lies down in the midst of the sea","23:35":"They have stricken me","24:1":"Be not thou envious against evil men","24:2":"and their lips talk about mischief.","24:3":"Through wisdom is an house builded; and by understanding it is established:","24:4":"And by knowledge shall the chambers be filled with all precious and pleasant riches.","24:5":"A wise man is strong; yea","24:6":"For by wise counsel thou shalt make thy war: and in multitude of counsellors there is safety.","24:7":"Wisdom is too high for a fool: he openeth not his mouth in the gate.","24:8":"He that deviseth to do evil shall be called a mischievous person.","24:9":"The thought of foolishness is sin: and the scorner is an abomination to men.","24:10":"your strength is small.","24:11":"hold back those who are staggering to the slaughter!","24:12":"Behold, we didn't know this; doesn't he who weighs the hearts consider it?  He who keeps your soul","24:13":"eat honey","24:14":"then there will be a reward","24:15":"wicked man","24:16":"and rises up again; but the wicked are overthrown by calamity.","24:17":"Rejoice not when thine enemy falleth","24:18":"and it displease him","24:19":"Fret not thyself because of evil men","24:20":"For there shall be no reward to the evil man; the candle of the wicked shall be put out.","24:21":"fear Yahweh and the king.  Don't join those who are rebellious:","24:22":"For their calamity shall rise suddenly; and who knoweth the ruin of them both?","24:23":"These things also belong to the wise. It is not good to have respect of persons in judgment.","24:24":"You are righteous; peoples shall curse him","24:25":"and a rich blessing will come on them.","24:26":"Every man shall kiss his lips that giveth a right answer.","24:27":"and get your fields ready. Afterwards","24:28":"Be not a witness against thy neighbour without cause; and deceive not with thy lips.","24:29":"I will do to him as he has done to me; I will render to the man according to his work.","24:30":"by the vineyard of the man void of understanding;","24:31":"it was all grown over with thorns.  Its surface was covered with nettles","24:32":"and considered well.  I saw","24:33":"a little slumber","24:34":"and your want as an armed man.","25:1":"which the men of Hezekiah king of Judah copied out.","25:2":"but the glory of kings is to search out a matter.","25:3":"and the earth for depth","25:4":"and material comes out for the refiner;","25:5":"and his throne will be established in righteousness.","25:6":"or claim a place among great men;","25:7":"Come up here, than that you should be put lower in the presence of the prince","25:8":"Go not forth hastily to strive","25:9":"and don't betray the confidence of another;","25:10":"and your bad reputation never depart.","25:11":"A word fitly spoken is like apples of gold in pictures of silver.","25:12":"and an ornament of fine gold","25:13":"so is a faithful messenger to those who send him; for he refreshes the soul of his masters.","25:14":"so is he who boasts of gifts deceptively.","25:15":"By long forbearing is a prince persuaded","25:16":"lest you eat too much","25:17":"lest he be weary of you","25:18":"a sword","25:19":"or a lame foot.","25:20":"or vinegar on soda","25:21":"give him food to eat.  If he is thirsty","25:22":"and Yahweh will reward you.","25:23":"The north wind driveth away rain: so doth an angry countenance a backbiting tongue.","25:24":"than to share a house with a contentious woman.","25:25":"so is good news from a far country.","25:26":"and a polluted well","25:27":"It is not good to eat much honey: so for men to search their own glory is not glory.","25:28":"He that hath no rule over his own spirit is like a city that is broken down","26:1":"and as rain in harvest","26:2":"like a darting swallow","26:3":"a bridle for the donkey","26:4":"lest you also be like him.","26:5":"lest he be wise in his own eyes.","26:6":"He that sendeth a message by the hand of a fool cutteth off the feet","26:7":"The legs of the lame are not equal: so is a parable in the mouth of fools.","26:8":"so is he who gives honor to a fool.","26:9":"so is a parable in the mouth of fools.","26:10":"so is he who hires a fool or he who hires those who pass by.","26:11":"so is a fool who repeats his folly.","26:12":"Seest thou a man wise in his own conceit? there is more hope of a fool than of him.","26:13":"There is a lion in the road! A fierce lion roams the streets!","26:14":"so does the sluggard on his bed.","26:15":"The slothful hideth his hand in his bosom; it grieveth him to bring it again to his mouth.","26:16":"The sluggard is wiser in his own conceit than seven men that can render a reason.","26:17":"He that passeth by","26:18":"arrows","26:19":"Am I not joking?","26:20":"a quarrel dies down.","26:21":"and wood to fire","26:22":"they go down into the innermost parts.","26:23":"Burning lips and a wicked heart are like a potsherd covered with silver dross.","26:24":"but he harbors evil in his heart.","26:25":"don't believe him; for there are seven abominations in his heart.","26:26":"but his wickedness will be exposed in the assembly.","26:27":"it will come back on him.","26:28":"A lying tongue hateth those that are afflicted by it; and a flattering mouth worketh ruin.","27:1":"Boast not thyself of to morrow; for thou knowest not what a day may bring forth.","27:2":"and not your own mouth; a stranger","27:3":"and sand is a burden; but a fool's provocation is heavier than both.","27:4":"and anger is overwhelming; but who is able to stand before jealousy?","27:5":"Open rebuke is better than secret love.","27:6":"Faithful are the wounds of a friend; but the kisses of an enemy are deceitful.","27:7":"every bitter thing is sweet.","27:8":"so is a man who wanders from his home.","27:9":"Ointment and perfume rejoice the heart: so doth the sweetness of a man's friend by hearty counsel.","27:10":"Thine own friend","27:11":"my son","27:12":"and suffer for it.","27:13":"Take his garment that is surety for a stranger","27:14":"it will be taken as a curse by him.","27:15":"A continual dropping in a very rainy day and a contentious woman are alike.","27:16":"or like grasping oil in his right hand.","27:17":"Iron sharpeneth iron; so a man sharpeneth the countenance of his friend.","27:18":"Whoso keepeth the fig tree shall eat the fruit thereof: so he that waiteth on his master shall be honoured.","27:19":"so a man's heart reflects the man.","27:20":"Hell and destruction are never full; so the eyes of man are never satisfied.","27:21":"and the furnace for gold; but man is refined by his praise.","27:22":"yet his foolishness will not be removed from him.","27:23":"and pay attention to your herds:","27:24":"nor does even the crown endure to all generations.","27:25":"and the new growth appears","27:26":"and the goats are the price of a field.","27:27":"for your family's food","28:1":"The wicked flee when no man pursueth: but the righteous are bold as a lion.","28:2":"a land has many rulers","28:3":"A poor man that oppresseth the poor is like a sweeping rain which leaveth no food.","28:4":"They that forsake the law praise the wicked: but such as keep the law contend with them.","28:5":"Evil men understand not judgment: but they that seek the LORD understand all things.","28:6":"than he who is perverse in his ways","28:7":"Whoso keepeth the law is a wise son: but he that is a companion of riotous men shameth his father.","28:8":"He that by usury and unjust gain increaseth his substance","28:9":"even his prayer is an abomination.","28:10":"he will fall into his own trap; but the blameless will inherit good.","28:11":"The rich man is wise in his own conceit; but the poor that hath understanding searcheth him out.","28:12":"there is great glory; but when the wicked rise","28:13":"but whoever confesses and renounces them finds mercy.","28:14":"Happy is the man that feareth alway: but he that hardeneth his heart shall fall into mischief.","28:15":"so is a wicked ruler over helpless people.","28:16":"The prince that wanteth understanding is also a great oppressor: but he that hateth covetousness shall prolong his days.","28:17":"A man that doeth violence to the blood of any person shall flee to the pit; let no man stay him.","28:18":"Whoso walketh uprightly shall be saved: but he that is perverse in his ways shall fall at once.","28:19":"He that tilleth his land shall have plenty of bread: but he that followeth after vain persons shall have poverty enough.","28:20":"A faithful man shall abound with blessings: but he that maketh haste to be rich shall not be innocent.","28:21":"To have respect of persons is not good: for for a piece of bread that man will transgress.","28:22":"and doesn't know that poverty waits for him.","28:23":"He that rebuketh a man afterwards shall find more favour than he that flattereth with the tongue.","28:24":"and says","28:25":"He that is of a proud heart stirreth up strife: but he that putteth his trust in the LORD shall be made fat.","28:26":"He that trusteth in his own heart is a fool: but whoso walketh wisely","28:27":"He that giveth unto the poor shall not lack: but he that hideth his eyes shall have many a curse.","28:28":"men hide themselves; but when they perish","29:1":"with no remedy.","29:2":"the people rejoice; but when the wicked rule","29:3":"Whoso loveth wisdom rejoiceth his father: but he that keepeth company with harlots spendeth his substance.","29:4":"but he who takes bribes tears it down.","29:5":"A man that flattereth his neighbour spreadeth a net for his feet.","29:6":"but the righteous can sing and be glad.","29:7":"The righteous considereth the cause of the poor: but the wicked regardeth not to know it.","29:8":"but wise men turn away anger.","29:9":"the fool rages or scoffs","29:10":"The bloodthirsty hate the upright: but the just seek his soul.","29:11":"but a wise man brings himself under control.","29:12":"all of his officials are wicked.","29:13":"The poor and the deceitful man meet together: the LORD lighteneth both their eyes.","29:14":"his throne shall be established forever.","29:15":"but a child left to himself causes shame to his mother.","29:16":"sin increases; but the righteous will see their downfall.","29:17":"and he will give you peace; yes","29:18":"the people cast off restraint; but one who keeps the law is blessed.","29:19":"yet he will not respond.","29:20":"Seest thou a man that is hasty in his words? there is more hope of a fool than of him.","29:21":"He that delicately bringeth up his servant from a child shall have him become his son at the length.","29:22":"and a wrathful man abounds in sin.","29:23":"but one of lowly spirit gains honor.","29:24":"but dares not testify.","29:25":"but whoever puts his trust in Yahweh is kept safe.","29:26":"but a man's justice comes from Yahweh.","29:27":"and the upright in their ways detest the wicked.","30:1":"the oracle: the man says to Ithiel","30:2":"","30:3":"neither do I have the knowledge of the Holy One.","30:4":"and descended?  Who has gathered the wind in his fists?  Who has bound the waters in his garment?  Who has established all the ends of the earth? What is his name","30:5":"","30:6":"lest he reprove you","30:7":"","30:8":"Remove far from me vanity and lies: give me neither poverty nor riches; feed me with food convenient for me:","30:9":"deny you","30:10":"","30:11":"and doesn't bless their mother.","30:12":"yet are not washed from their filthiness.","30:13":"oh how lofty are their eyes! Their eyelids are lifted up.","30:14":"and their jaws like knives","30:15":"'Enough:'","30:16":"the barren womb; the earth that is not satisfied with water; and the fire that doesn't say","30:17":"","30:18":"","30:19":"The way of an eagle in the air; the way of a serpent upon a rock; the way of a ship in the midst of the sea; and the way of a man with a maid.","30:20":"","30:21":"","30:22":"For a servant when he reigneth; and a fool when he is filled with meat;","30:23":"For an odious woman when she is married; and an handmaid that is heir to her mistress.","30:24":"","30:25":"yet they provide their food in the summer.","30:26":"yet make they their houses in the rocks.","30:27":"yet they advance in ranks.","30:28":"yet it is in kings' palaces.","30:29":"","30:30":"which is mightiest among animals","30:31":"the male goat also; and the king against whom there is no rising up.","30:32":"","30:33":"and the wringing of the nose brings forth blood; so the forcing of wrath brings forth strife.,Surely the churning of milk bringeth forth butter, and the wringing of the nose bringeth forth blood: so the forcing of wrath bringeth forth strife., כִּי מִיץ חָלָב יוֹצִיא חֶמְאָה וּמִיץ־אַף יוֹצִיא דָם וּמִיץ אַפַּיִם יוֹצִיא רִיב׃ פ ‬,For the churning of milk bringeth forth curd, And the wringing of the nose bringeth forth blood; So the forcing of wrath bringeth forth strife.,ἄμελγε γάλα καὶ ἔσται βούτυρον ἐὰν δὲ ἐκπιέζῃς μυκτῆρας ἐξελεύσεται αἷμα ἐὰν δὲ ἐξέλκῃς λόγους ἐξελεύσονται κρίσεις καὶ μάχαι,Milk out milk, and there shall be butter, and if thou wing one's nostrils there shall come out blood: so if thou extort words, there will come forth quarrels and strifes.,,,,","31:1":"The words of king Lemuel","31:2":"","31:3":"nor your ways to that which destroys kings.","31:4":"Lemuel; it is not for kings to drink wine; nor for princes to say","31:5":"and forget the law","31:6":"Give strong drink unto him that is ready to perish","31:7":"and forget his poverty","31:8":"in the cause of all who are left desolate.","31:9":"judge righteously","31:10":"with each verse starting with each letter of the Hebrew alphabet","31:11":"The heart of her husband doth safely trust in her","31:12":"and not harm","31:13":"and works eagerly with her hands.","31:14":"She is like the merchants' ships; she bringeth her food from afar.","31:15":"gives food to her household","31:16":"and buys it.  With the fruit of her hands","31:17":"and makes her arms strong.","31:18":"She perceiveth that her merchandise is good: her candle goeth not out by night.","31:19":"and her hands hold the spindle.","31:20":"she extends her hands to the needy.","31:21":"She is not afraid of the snow for her household: for all her household are clothed with scarlet.","31:22":"She maketh herself coverings of tapestry; her clothing is silk and purple.","31:23":"when he sits among the elders of the land.","31:24":"and delivers sashes to the merchant.","31:25":"Strength and honour are her clothing; and she shall rejoice in time to come.","31:26":"She openeth her mouth with wisdom; and in her tongue is the law of kindness.","31:27":"and doesn't eat the bread of idleness.","31:28":"Her children arise up","31:29":"Many daughters have done virtuously","31:30":"and beauty is vain; but a woman who fears Yahweh","31:31":"Give her of the fruit of her hands; and let her own works praise her in the gates."}