{"1:1":"nor stand in the way of sinners","1:2":"But his delight is in the law of the LORD; and in his law doth he meditate day and night.","1:3":"that brings forth its fruit in its season","1:4":"but are like the chaff which the wind drives away.","1:5":"nor sinners in the congregation of the righteous.","1:6":"but the way of the wicked shall perish.","2:1":"and the peoples plot a vain thing?","2:2":"and the rulers take counsel together","2:3":"Let us break their bands asunder","2:4":"He that sitteth in the heavens shall laugh: the LORD shall have them in derision.","2:5":"and terrify them in his wrath:","2:6":"Yet have I set my king upon my holy hill of Zion.","2:7":"You are my son. Today I have become your father.,I will declare the decree: the LORD hath said unto me, Thou art my Son; this day have I begotten thee.,  אֲסַפְּרָה אֶל חֹק יְהוָה אָמַר אֵלַי בְּנִי אַתָּה אֲנִי הַיּוֹם יְלִדְתִּיךָ׃ ‬,I will tell of the decree: The LORD said unto me: 'Thou art My son, This day have I begotten thee.,διαγγέλλων τὸ πρόσταγμα κυρίου κύριος εἶπεν πρός με υἱός μου εἶ σύ ἐγὼ σήμερον γεγέννηκά σε,declaring the ordinance of the Lord: the Lord said to me, Thou art my Son, to-day have I begotten thee.,,,,","2:8":"and I will give the nations for your inheritance","2:9":"","2:10":"you kings.  Be instructed","2:11":"and rejoice with trembling.","2:12":"Kiss the son}","3:1":"when he fled from Absalom his son.>> Yahweh","3:2":"There is no help for him in God.  Selah.","3:3":"Yahweh","3:4":"and he answers me out of his holy hill.  Selah.","3:5":"I laid me down and slept; I awaked; for the LORD sustained me.","3:6":"I will not be afraid of ten thousands of people","3:7":"Yahweh!  Save me","3:8":"Salvation belongeth unto the LORD: thy blessing is upon thy people. Selah.","4:1":"God of my righteousness. Give me relief from my distress.  Have mercy on me","4:2":"how long shall my glory be turned into dishonor? Will you love vanity","4:3":"But know that the LORD hath set apart him that is godly for himself: the LORD will hear when I call unto him.","4:4":"and don't sin.  Search your own heart on your bed","4:5":"Offer the sacrifices of righteousness","4:6":"Who will show us any good?  Yahweh","4:7":"more than when their grain and their new wine are increased.","4:8":"for you","5:1":"with the flutes.  A Psalm by David.>> Give ear to my words","5:2":"my King and my God; for to you do I pray.","5:3":"in the morning you shall hear my voice.  In the morning I will lay my requests before you","5:4":"For thou art not a God that hath pleasure in wickedness: neither shall evil dwell with thee.","5:5":"The foolish shall not stand in thy sight: thou hatest all workers of iniquity.","5:6":"Thou shalt destroy them that speak leasing: the LORD will abhor the bloody and deceitful man.","5:7":"in the abundance of your loving kindness I will come into your house.  I will bow toward your holy temple in reverence of you.","5:8":"Yahweh","5:9":"For there is no faithfulness in their mouth; their inward part is very wickedness; their throat is an open sepulchre; they flatter with their tongue.","5:10":"God.  Let them fall by their own counsels; Thrust them out in the multitude of their transgressions","5:11":"Let them always shout for joy","5:12":"you will surround him with favor as with a shield.","6:1":"upon the eight-stringed lyre.  A Psalm by David.>> Yahweh","6:2":"Yahweh","6:3":"Yahweh--how long?","6:4":"Yahweh.  Deliver my soul","6:5":"who shall give you thanks?","6:6":"I am weary with my groaning; all the night make I my bed to swim; I water my couch with my tears.","6:7":"Mine eye is consumed because of grief; it waxeth old because of all mine enemies.","6:8":"all you workers of iniquity","6:9":"The LORD hath heard my supplication; the LORD will receive my prayer.","6:10":"they shall be disgraced suddenly.","7:1":"which he sang to Yahweh","7:2":"ripping it in pieces","7:3":"my God","7:4":"if I have delivered him who without cause was my adversary)","7:5":"and overtake it; yes","7:6":"Yahweh","7:7":"So shall the congregation of the people compass thee about: for their sakes therefore return thou on high.","7:8":"Yahweh","7:9":"but establish the righteous; their minds and hearts are searched by the righteous God.","7:10":"who saves the upright in heart.","7:11":"yes","7:12":"he will sharpen his sword; he has bent and strung his bow.","7:13":"He hath also prepared for him the instruments of death; he ordaineth his arrows against the persecutors.","7:14":"he travails with iniquity.  Yes","7:15":"and has fallen into the pit which he made.","7:16":"His mischief shall return upon his own head","7:17":"and will sing praise to the name of Yahweh Most High.","8:1":"our Lord","8:2":"because of your adversaries","8:3":"the work of your fingers","8:4":"that you think of him?  What is the son of man","8:5":"{Hebrew: Elohim} and crowned him with glory and honor.","8:6":"Thou madest him to have dominion over the works of thy hands; thou hast put all things under his feet:","8:7":"yes","8:8":"the fish of the sea","8:9":"our Lord","9:1":"I will praise thee","9:2":"O Most High.","9:3":"they stumble and perish in your presence.","9:4":"For thou hast maintained my right and my cause; thou satest in the throne judging right.","9:5":"Thou hast rebuked the heathen","9:6":"O thou enemy","9:7":"But the LORD shall endure for ever: he hath prepared his throne for judgment.","9:8":"And he shall judge the world in righteousness","9:9":"The LORD also will be a refuge for the oppressed","9:10":"for you","9:11":"who dwells in Zion","9:12":"When he maketh inquisition for blood","9:13":"Yahweh.  See my affliction by those who hate me","9:14":"I will rejoice in your salvation.","9:15":"their own foot is taken.","9:16":"The LORD is known by the judgment which he executeth: the wicked is snared in the work of his own hands. Higgaion. Selah.","9:17":"even all the nations that forget God.","9:18":"nor the hope of the poor perish forever.","9:19":"Yahweh!  Don't let man prevail.  Let the nations be judged in your sight.","9:20":"Yahweh.  Let the nations know that they are only men.  Selah.","10:1":"Yahweh?  Why do you hide yourself in times of trouble?","10:2":"the wicked hunt down the weak.  They are caught in the schemes that they devise.","10:3":"and condemns Yahweh.","10:4":"in the pride of his face","10:5":"and your laws are far from his sight.  As for all his adversaries","10:6":"I shall not be shaken.  For generations I shall have no trouble.","10:7":"deceit","10:8":"he murders the innocent.  His eyes are secretly set against the helpless.","10:9":"when he draws him in his net.","10:10":"He croucheth","10:11":"God has forgotten.  He hides his face. He will never see it.","10:12":"Yahweh!  God","10:13":"and say in his heart","10:14":"Thou hast seen it; for thou beholdest mischief and spite","10:15":"seek out his wickedness until you find none.","10:16":"The LORD is King for ever and ever: the heathen are perished out of his land.","10:17":"you have heard the desire of the humble. You will prepare their heart.  You will cause your ear to hear","10:18":"that man who is of the earth may terrify no more.","11:1":"I take refuge. How can you say to my soul","11:2":"behold","11:3":"what can the righteous do?","11:4":"The LORD is in his holy temple","11:5":"but the wicked and him who loves violence his soul hates.","11:6":"sulfur","11:7":"For the righteous LORD loveth righteousness; his countenance doth behold the upright.","12:1":"Yahweh; for the godly man ceases. For the faithful fail from among the children of men.","12:2":"and with a double heart.","12:3":"and the tongue that boasts","12:4":"With our tongue we will prevail. Our lips are our own.  Who is lord over us?","12:5":"For the oppression of the poor","12:6":"as silver refined in a clay furnace","12:7":"Yahweh.  You will preserve them from this generation forever.","12:8":"when what is vile is exalted among the sons of men.","13:1":"Yahweh?  Will you forget me forever? How long will you hide your face from me?","13:2":"having sorrow in my heart every day?  How long shall my enemy triumph over me?","13:3":"and answer me","13:4":"I have prevailed against him; Lest my adversaries rejoice when I fall.","13:5":"But I have trusted in thy mercy; my heart shall rejoice in thy salvation.","13:6":"because he has been good to me.","14:1":"There is no God.  They are corrupt. They have done abominable works.  There is none who does good.","14:2":"to see if there were any who did understand","14:3":"no","14:4":"who eat up my people as they eat bread","14:5":"for God is in the generation of the righteous.","14:6":"because Yahweh is his refuge.","14:7":"then Jacob shall rejoice","15:1":"who shall dwell in your sanctuary? Who shall live on your holy hill?","15:2":"and speaks truth in his heart;","15:3":"nor does evil to his friend","15:4":"but who honors those who fear Yahweh; he who keeps an oath even when it hurts","15:5":"nor take a bribe against the innocent.  He who does these things shall never be shaken.","16:1":"God","16:2":"you have said to Yahweh","16:3":"they are the excellent ones in whom is all my delight.","16:4":"nor take their names on my lips.","16:5":"The LORD is the portion of mine inheritance and of my cup: thou maintainest my lot.","16:6":"I have a good inheritance.","16:7":"who has given me counsel.  Yes","16:8":"I shall not be moved.","16:9":"and my tongue rejoices. My body shall also dwell in safety.","16:10":"neither will you allow your holy one to see corruption.","16:11":"Thou wilt shew me the path of life: in thy presence is fulness of joy; at thy right hand there are pleasures for evermore.","17:1":"Yahweh","17:2":"Let my sentence come forth from thy presence; let thine eyes behold the things that are equal.","17:3":"and found nothing.  I have resolved that my mouth shall not disobey.","17:4":"by the word of your lips","17:5":"Hold up my goings in thy paths","17:6":"for you will answer me","17:7":"you who save those who take refuge by your right hand from their enemies.","17:8":"","17:9":"my deadly enemies","17:10":"They are inclosed in their own fat: with their mouth they speak proudly.","17:11":"They have now compassed us in our steps: they have set their eyes bowing down to the earth;","17:12":"as it were a young lion lurking in secret places.","17:13":"Yahweh","17:14":"Yahweh","17:15":"I shall see your face in righteousness. I shall be satisfied","18:1":"who spoke to Yahweh the words of this song in the day that Yahweh delivered him from the hand of all his enemies","18:2":"my fortress","18:3":"who is worthy to be praised; and I am saved from my enemies.","18:4":"The sorrows of death compassed me","18:5":"The sorrows of hell compassed me about: the snares of death prevented me.","18:6":"and cried to my God. He heard my voice out of his temple.  My cry before him came into his ears.","18:7":"because he was angry.","18:8":"There went up a smoke out of his nostrils","18:9":"and came down.  Thick darkness was under his feet.","18:10":"and flew.  Yes","18:11":"his pavilion around him","18:12":"hailstones and coals of fire.","18:13":"The LORD also thundered in the heavens","18:14":"and scattered them; Yes","18:15":"Yahweh","18:16":"He sent from above","18:17":"from those who hated me; for they were too mighty for me.","18:18":"but Yahweh was my support.","18:19":"because he delighted in me.","18:20":"The LORD rewarded me according to my righteousness; according to the cleanness of my hands hath he recompensed me.","18:21":"and have not wickedly departed from my God.","18:22":"For all his judgments were before me","18:23":"I was also upright before him","18:24":"according to the cleanness of my hands in his eyesight.","18:25":"you will show yourself perfect.","18:26":"you will show yourself pure.  With the crooked you will show yourself shrewd.","18:27":"but the haughty eyes you will bring down.","18:28":"Yahweh.  My God will light up my darkness.","18:29":"I advance through a troop.  By my God","18:30":"his way is perfect.  The word of Yahweh is tried. He is a shield to all those who take refuge in him.","18:31":"except Yahweh?  Who is a rock","18:32":"and makes my way perfect?","18:33":"and sets me on my high places.","18:34":"so that my arms bend a bow of bronze.","18:35":"Thou hast also given me the shield of thy salvation: and thy right hand hath holden me up","18:36":"My feet have not slipped.","18:37":"and overtake them.  Neither will I turn again until they are consumed.","18:38":"so that they will not be able to rise. They shall fall under my feet.","18:39":"For thou hast girded me with strength unto the battle: thou hast subdued under me those that rose up against me.","18:40":"that I might cut off those who hate me.","18:41":"but there was none to save; even to Yahweh","18:42":"Then did I beat them small as the dust before the wind: I did cast them out as the dirt in the streets.","18:43":"Thou hast delivered me from the strivings of the people; and thou hast made me the head of the heathen: a people whom I have not known shall serve me.","18:44":"As soon as they hear of me","18:45":"and shall come trembling out of their close places.","18:46":"","18:47":"and subdues peoples under me.","18:48":"you lift me up above those who rise up against me.  You deliver me from the violent man.","18:49":"Yahweh","18:50":"and shows loving kindness to his anointed","19:1":"The heavens declare the glory of God; and the firmament sheweth his handywork.","19:2":"and night after night they display knowledge.","19:3":"where their voice is not heard.","19:4":"their words to the end of the world.  In them he has set a tent for the sun","19:5":"like a strong man rejoicing to run his course.","19:6":"his circuit to its ends; There is nothing hidden from its heat.","19:7":"restoring the soul.  Yahweh's testimony is sure","19:8":"rejoicing the heart. Yahweh's commandment is pure","19:9":"enduring forever. Yahweh's ordinances are true","19:10":"yes","19:11":"Moreover by them is thy servant warned: and in keeping of them there is great reward.","19:12":"Who can understand his errors? cleanse thou me from secret faults.","19:13":"Keep back thy servant also from presumptuous sins; let them not have dominion over me: then shall I be upright","19:14":"Yahweh","20:1":"","20:2":"grant you support from Zion","20:3":"and accept your burnt sacrifice.  Selah.","20:4":"and fulfill all your counsel.","20:5":"we will set up our banners.  May Yahweh grant all your requests.","20:6":"with the saving strength of his right hand.","20:7":"and some in horses","20:8":"but we rise up","20:9":"Yahweh!  Let the King answer us when we call!","21:1":"Yahweh!  How greatly he rejoices in your salvation!","21:2":"and have not withheld the request of his lips.  Selah.","21:3":"For thou preventest him with the blessings of goodness: thou settest a crown of pure gold on his head.","21:4":"you gave it to him","21:5":"His glory is great in thy salvation: honour and majesty hast thou laid upon him.","21:6":"For thou hast made him most blessed for ever: thou hast made him exceeding glad with thy countenance.","21:7":"he shall not be moved.","21:8":"Thine hand shall find out all thine enemies: thy right hand shall find out those that hate thee.","21:9":"Thou shalt make them as a fiery oven in the time of thine anger: the LORD shall swallow them up in his wrath","21:10":"their posterity from among the children of men.","21:11":"For they intended evil against thee: they imagined a mischievous device","21:12":"when you aim drawn bows at their face.","21:13":"Yahweh","22:1":"my God","22:2":"I cry in the daytime","22:3":"you who inhabit the praises of Israel.","22:4":"and you delivered them.","22:5":"and were delivered.  They trusted in you","22:6":"and no man; a reproach of men","22:7":"saying","22:8":"He trusted on the LORD that he would deliver him: let him deliver him","22:9":"But thou art he that took me out of the womb: thou didst make me hope when I was upon my mother's breasts.","22:10":"I was cast upon thee from the womb: thou art my God from my mother's belly.","22:11":"for trouble is near.  For there is none to help.","22:12":"Many bulls have compassed me: strong bulls of Bashan have beset me round.","22:13":"lions tearing prey and roaring.","22:14":"I am poured out like water","22:15":"My strength is dried up like a potsherd; and my tongue cleaveth to my jaws; and thou hast brought me into the dust of death.","22:16":"they pin my hands and feet.{or","22:17":"I may tell all my bones: they look and stare upon me.","22:18":"They part my garments among them","22:19":"Yahweh.  You are my help: hurry to help me.","22:20":"my precious life from the power of the dog.","22:21":"from the horns of the wild oxen","22:22":"I will praise you.","22:23":"praise him!  All you descendants of Jacob","22:24":"Neither has he hidden his face from him; but when he cried to him","22:25":"My praise shall be of thee in the great congregation: I will pay my vows before them that fear him.","22:26":"The meek shall eat and be satisfied: they shall praise the LORD that seek him: your heart shall live for ever.","22:27":"All the ends of the world shall remember and turn unto the LORD: and all the kindreds of the nations shall worship before thee.","22:28":"For the kingdom is the LORD's: and he is the governor among the nations.","22:29":"even he who can't keep his soul alive.","22:30":"A seed shall serve him; it shall be accounted to the Lord for a generation.","22:31":"for he has done it.","23:1":"The LORD is my shepherd; I shall not want.","23:2":"He maketh me to lie down in green pastures: he leadeth me beside the still waters.","23:3":"He restoreth my soul: he leadeth me in the paths of righteousness for his name's sake.","23:4":"I will fear no evil","23:5":"Thou preparest a table before me in the presence of mine enemies: thou anointest my head with oil; my cup runneth over.","23:6":"and I will dwell in Yahweh's house forever.","24:1":"with its fullness; the world","24:2":"and established it on the floods.","24:3":"Who shall ascend into the hill of the LORD? or who shall stand in his holy place?","24:4":"and has not sworn deceitfully.","24:5":"righteousness from the God of his salvation.","24:6":"who seek your face-- even Jacob.  Selah.","24:7":"you gates!  Be lifted up","24:8":"Yahweh mighty in battle.","24:9":"you gates; yes","24:10":"Who is this King of glory? The LORD of hosts","25:1":"Yahweh","25:2":"I have trusted in you.  Don't let me be shamed. Don't let my enemies triumph over me.","25:3":"no one who waits for you shall be shamed.  They shall be shamed who deal treacherously without cause.","25:4":"Yahweh.  Teach me your paths.","25:5":"and teach me","25:6":"remember your tender mercies and your loving kindness","25:7":"nor my transgressions. Remember me according to your loving kindness","25:8":"therefore he will instruct sinners in the way.","25:9":"The meek will he guide in judgment: and the meek will he teach his way.","25:10":"All the paths of the LORD are mercy and truth unto such as keep his covenant and his testimonies.","25:11":"Yahweh","25:12":"What man is he that feareth the LORD? him shall he teach in the way that he shall choose.","25:13":"His soul shall dwell at ease; and his seed shall inherit the earth.","25:14":"The secret of the LORD is with them that fear him; and he will shew them his covenant.","25:15":"for he will pluck my feet out of the net.","25:16":"and have mercy on me","25:17":"The troubles of my heart are enlarged: O bring thou me out of my distresses.","25:18":"Look upon mine affliction and my pain; and forgive all my sins.","25:19":"for they are many.  They hate me with cruel hatred.","25:20":"and deliver me.  Let me not be disappointed","25:21":"for I wait for you.","25:22":"God","26:1":"Yahweh","26:2":"Yahweh","26:3":"For thy lovingkindness is before mine eyes: and I have walked in thy truth.","26:4":"neither will I go in with hypocrites.","26:5":"and will not sit with the wicked.","26:6":"so I will go about your altar","26:7":"and tell of all your wondrous works.","26:8":"I love the habitation of your house","26:9":"nor my life with bloodthirsty men;","26:10":"their right hand is full of bribes.","26:11":"I will walk in my integrity.  Redeem me","26:12":"My foot standeth in an even place: in the congregations will I bless the LORD.","27:1":"The LORD is my light and my salvation; whom shall I fear? the LORD is the strength of my life; of whom shall I be afraid?","27:2":"even my adversaries and my foes","27:3":"my heart shall not fear. Though war should rise against me","27:4":"that I will seek after","27:5":"For in the time of trouble he shall hide me in his pavilion: in the secret of his tabernacle shall he hide me; he shall set me up upon a rock.","27:6":"yes","27:7":"Yahweh","27:8":"Seek my face, my heart said to you","27:9":"neither forsake me","27:10":"then Yahweh will take me up.","27:11":"Yahweh.  Lead me in a straight path","27:12":"for false witnesses have risen up against me","27:13":"I had fainted","27:14":"and let your heart take courage. Yes","28:1":"Yahweh","28:2":"when I cry to you","28:3":"with the workers of iniquity who speak peace with their neighbors","28:4":"and according to the wickedness of their doings.  Give them according to the operation of their hands. Bring back on them what they deserve.","28:5":"nor the operation of his hands","28:6":"because he has heard the voice of my petitions.","28:7":"and I am helped.  Therefore my heart greatly rejoices. With my song I will thank him.","28:8":"The LORD is their strength","28:9":"and bless your inheritance.  Be their shepherd also","29:1":"you sons of the mighty","29:2":"Give unto the LORD the glory due unto his name; worship the LORD in the beauty of holiness.","29:3":"even Yahweh on many waters.","29:4":"The voice of the LORD is powerful; the voice of the LORD is full of majesty.","29:5":"Yahweh breaks in pieces the cedars of Lebanon.","29:6":"wild ox.","29:7":"The voice of the LORD divideth the flames of fire.","29:8":"The voice of the LORD shaketh the wilderness; the LORD shaketh the wilderness of Kadesh.","29:9":"and strips the forests bare. In his temple everything says","29:10":"Yahweh sits as King forever.","29:11":"The LORD will give strength unto his people; the LORD will bless his people with peace.","30:1":"Yahweh","30:2":"I cried to you","30:3":"you have brought up my soul from Sheol. You have kept me alive","30:4":"you saints of his.  Give thanks to his holy name.","30:5":"but joy comes in the morning.","30:6":"I said in my prosperity","30:7":"Yahweh","30:8":"Yahweh.  To Yahweh I made supplication:","30:9":"","30:10":"Yahweh","30:11":"and clothed me with gladness","30:12":"and not be silent. Yahweh my God","31:1":"Yahweh","31:2":"a house of defense to save me.","31:3":"therefore for your name's sake lead me and guide me.","31:4":"for you are my stronghold.","31:5":"Yahweh","31:6":"but I trust in Yahweh.","31:7":"for you have seen my affliction.  You have known my soul in adversities.","31:8":"And hast not shut me up into the hand of the enemy: thou hast set my feet in a large room.","31:9":"Yahweh","31:10":"my years with sighing. My strength fails because of my iniquity.  My bones are wasted away.","31:11":"A fear to my acquaintances. Those who saw me on the street fled from me.","31:12":"I am forgotten as a dead man out of mind: I am like a broken vessel.","31:13":"terror on every side","31:14":"Yahweh.  I said","31:15":"and from those who persecute me.","31:16":"Make thy face to shine upon thy servant: save me for thy mercies' sake.","31:17":"Yahweh","31:18":"which speak against the righteous insolently","31:19":"which you have laid up for those who fear you","31:20":"Thou shalt hide them in the secret of thy presence from the pride of man: thou shalt keep them secretly in a pavilion from the strife of tongues.","31:21":"for he has shown me his marvelous loving kindness in a strong city.","31:22":"I said in my haste","31:23":"all you his saints!  Yahweh preserves the faithful","31:24":"and let your heart take courage","32:1":"whose sin is covered.","32:2":"in whose spirit there is no deceit.","32:3":"my bones wasted away through my groaning all day long.","32:4":"For day and night thy hand was heavy upon me: my moisture is turned into the drought of summer. Selah.","32:5":"I will confess my transgressions to Yahweh","32:6":"let everyone who is godly pray to you in a time when you may be found.  Surely when the great waters overflow","32:7":"Thou art my hiding place; thou shalt preserve me from trouble; thou shalt compass me about with songs of deliverance. Selah.","32:8":"I will instruct thee and teach thee in the way which thou shalt go: I will guide thee with mine eye.","32:9":"or like the mule","32:10":"but loving kindness shall surround him who trusts in Yahweh.","32:11":"and rejoice","33:1":"you righteous!  Praise is fitting for the upright.","33:2":"Praise the LORD with harp: sing unto him with the psaltery and an instrument of ten strings.","33:3":"Sing unto him a new song; play skilfully with a loud noise.","33:4":"For the word of the LORD is right; and all his works are done in truth.","33:5":"He loveth righteousness and judgment: the earth is full of the goodness of the LORD.","33:6":"the heavens were made; all their army by the breath of his mouth.","33:7":"He gathereth the waters of the sea together as an heap: he layeth up the depth in storehouses.","33:8":"Let all the earth fear the LORD: let all the inhabitants of the world stand in awe of him.","33:9":"and it was done.  He commanded","33:10":"The LORD bringeth the counsel of the heathen to nought: he maketh the devices of the people of none effect.","33:11":"the thoughts of his heart to all generations.","33:12":"the people whom he has chosen for his own inheritance.","33:13":"The LORD looketh from heaven; he beholdeth all the sons of men.","33:14":"","33:15":"He fashioneth their hearts alike; he considereth all their works.","33:16":"There is no king saved by the multitude of an host: a mighty man is not delivered by much strength.","33:17":"neither does he deliver any by his great power.","33:18":"Yahweh's eye is on those who fear him","33:19":"to keep them alive in famine.","33:20":"Our soul waiteth for the LORD: he is our help and our shield.","33:21":"because we have trusted in his holy name.","33:22":"Yahweh","34:1":"who drove him away","34:2":"and be glad.","34:3":"O magnify the LORD with me","34:4":"and he answered me","34:5":"and were radiant.  Their faces shall never be covered with shame.","34:6":"and Yahweh heard him","34:7":"and delivers them.","34:8":"O taste and see that the LORD is good: blessed is the man that trusteth in him.","34:9":"you his saints","34:10":"and suffer hunger","34:11":"you children","34:12":"and loves many days","34:13":"and your lips from speaking lies.","34:14":"and do good.  seek peace","34:15":"The eyes of the LORD are upon the righteous","34:16":"to cut off the memory of them from the earth.","34:17":"and Yahweh hears","34:18":"and saves those who have a crushed spirit.","34:19":"but Yahweh delivers him out of them all.","34:20":"He keepeth all his bones: not one of them is broken.","34:21":"Evil shall slay the wicked: and they that hate the righteous shall be desolate.","34:22":"The LORD redeemeth the soul of his servants: and none of them that trust in him shall be desolate.","35:1":"Yahweh","35:2":"and stand up for my help.","35:3":"I am your salvation.","35:4":"Let them be confounded and put to shame that seek after my soul: let them be turned back and brought to confusion that devise my hurt.","35:5":"Yahweh's angel driving them on.","35:6":"Yahweh's angel pursuing them.","35:7":"For without cause have they hid for me their net in a pit","35:8":"Let destruction come upon him at unawares; and let his net that he hath hid catch himself: into that very destruction let him fall.","35:9":"And my soul shall be joyful in the LORD: it shall rejoice in his salvation.","35:10":"Yahweh, who is like you, who delivers the poor from him who is too strong for him; yes, the poor and the needy from him who robs him?","35:11":"False witnesses did rise up; they laid to my charge things that I knew not.","35:12":"to the bereaving of my soul.","35:13":"when they were sick","35:14":"as one who mourns his mother.","35:15":"they rejoiced","35:16":"they gnashed their teeth at me.","35:17":"how long will you look on?  Rescue my soul from their destruction","35:18":"I will give thee thanks in the great congregation: I will praise thee among much people.","35:19":"Let not them that are mine enemies wrongfully rejoice over me: neither let them wink with the eye that hate me without a cause.","35:20":"but they devise deceitful words against those who are quiet in the land.","35:21":"they opened their mouth wide against me. They said","35:22":"Yahweh.  Don't keep silent.  Lord","35:23":"my God!  My Lord","35:24":"Yahweh my God","35:25":"Aha!  That's the way we want it! Don't let them say","35:26":"Let them be ashamed and brought to confusion together that rejoice at mine hurt: let them be clothed with shame and dishonour that magnify themselves against me.","35:27":"who favor my righteous cause. Yes","35:28":"And my tongue shall speak of thy righteousness and of thy praise all the day long.","36:1":"the servant of Yahweh.>> An oracle is within my heart about the disobedience of the wicked: There is no fear of God before his eyes.","36:2":"too much to detect and hate his sin.","36:3":"The words of his mouth are iniquity and deceit: he hath left off to be wise","36:4":"He deviseth mischief upon his bed; he setteth himself in a way that is not good; he abhorreth not evil.","36:5":"Yahweh","36:6":"you preserve man and animal.","36:7":"God!  The children of men take refuge under the shadow of your wings.","36:8":"They shall be abundantly satisfied with the fatness of thy house; and thou shalt make them drink of the river of thy pleasures.","36:9":"For with thee is the fountain of life: in thy light shall we see light.","36:10":"your righteousness to the upright in heart.","36:11":"Let not the foot of pride come against me","36:12":"and shall not be able to rise.","37:1":"neither be envious against those who work unrighteousness.","37:2":"and wither like the green herb.","37:3":"and do good.  Dwell in the land","37:4":"and he will give you the desires of your heart.","37:5":"and he will do this:","37:6":"and your justice as the noon day sun.","37:7":"and wait patiently for him.  Don't fret because of him who prospers in his way","37:8":"and forsake wrath.  Don't fret","37:9":"but those who wait for Yahweh shall inherit the land.","37:10":"and the wicked will be no more. Yes","37:11":"and shall delight themselves in the abundance of peace.","37:12":"and gnashes at him with his teeth.","37:13":"for he sees that his day is coming.","37:14":"and have bent their bow","37:15":"Their sword shall enter into their own heart","37:16":"than the abundance of many wicked.","37:17":"but Yahweh upholds the righteous.","37:18":"The LORD knoweth the days of the upright: and their inheritance shall be for ever.","37:19":"They shall not be ashamed in the evil time: and in the days of famine they shall be satisfied.","37:20":"But the wicked shall perish","37:21":"and don't pay back","37:22":"For such as be blessed of him shall inherit the earth; and they that be cursed of him shall be cut off.","37:23":"The steps of a good man are ordered by the LORD: and he delighteth in his way.","37:24":"he shall not fall","37:25":"and now am old","37:26":"and lends.  His seed is blessed.","37:27":"and do good.  Live securely forever.","37:28":"and doesn't forsake his saints. They are preserved forever","37:29":"and live in it forever.","37:30":"The mouth of the righteous speaketh wisdom","37:31":"The law of his God is in his heart; none of his steps shall slide.","37:32":"and seeks to kill him.","37:33":"nor condemn him when he is judged.","37:34":"and keep his way","37:35":"spreading himself like a green tree in its native soil.","37:36":"and behold","37:37":"and see the upright","37:38":"they shall be destroyed together. The future of the wicked shall be cut off.","37:39":"But the salvation of the righteous is of the LORD: he is their strength in the time of trouble.","37:40":"and rescues them.  He rescues them from the wicked","38:1":"for a memorial.>> Yahweh","38:2":"your hand presses hard on me.","38:3":"neither is there any health in my bones because of my sin.","38:4":"they are too heavy for me.","38:5":"because of my foolishness.","38:6":"I am troubled; I am bowed down greatly; I go mourning all the day long.","38:7":"For my loins are filled with a loathsome disease: and there is no soundness in my flesh.","38:8":"I am feeble and sore broken: I have roared by reason of the disquietness of my heart.","38:9":"all my desire is before you.  My groaning is not hidden from you.","38:10":"it has also left me.","38:11":"My lovers and my friends stand aloof from my sore; and my kinsmen stand afar off.","38:12":"and meditate deceits all day long.","38:13":"as a deaf man","38:14":"I am as a man who doesn't hear","38:15":"Yahweh","38:16":"Don't let them gloat over me, or exalt themselves over me when my foot slips.","38:17":"For I am ready to halt","38:18":"For I will declare mine iniquity; I will be sorry for my sin.","38:19":"But mine enemies are lively","38:20":"because I follow what is good.","38:21":"Yahweh.  My God","38:22":"Lord","39:1":"I will watch my ways, so that I don't sin with my tongue. I will keep my mouth with a bridle while the wicked is before me.","39:2":"even from good. My sorrow was stirred.","39:3":"the fire burned: I spoke with my tongue:","39:4":"","39:5":"you have made my days handbreadths.  My lifetime is as nothing before you.  Surely every man stands as a breath.  Selah.,Behold, thou hast made my days as an handbreadth; and mine age is as nothing before thee: verily every man at his best state is altogether vanity. Selah.,  הִנֵּה טְפָחוֹת נָתַתָּה יָמַי וְחֶלְדִּי כְאַיִן נֶגְדֶּךָ אַךְ כָּל־הֶבֶל כָּל־אָדָם נִצָּב סֶלָה׃ ‬,Behold, Thou hast made my days as hand-breadths; And mine age is as nothing before Thee; Surely every man at his best estate is altogether vanity. Selah,38:6 ἰδοὺ παλαιστὰς ἔθου τὰς ἡμέρας μου καὶ ἡ ὑπόστασίς μου ὡσεὶ οὐθὲν ἐνώπιόν σου πλὴν τὰ σύμπαντα ματαιότης πᾶς ἄνθρωπος ζῶν διάψαλμα,38:5 Behold, thou hast made my days old; and my existence is as nothing before thee: nay, every man living is altogether vanity. Pause.,,,,","39:6":"","39:7":"Lord","39:8":"Deliver me from all my transgressions: make me not the reproach of the foolish.","39:9":"because you did it.","39:10":"Remove thy stroke away from me: I am consumed by the blow of thine hand.","39:11":"You consume his wealth like a moth.  Surely every man is but a breath.  Selah.,When thou with rebukes dost correct man for iniquity, thou makest his beauty to consume away like a moth: surely every man is vanity. Selah.,  בְּתוֹכָחוֹת עַל־עָוֺן יִסַּרְתָּ אִישׁ וַתֶּמֶס כָּעָשׁ חֲמוּדוֹ אַךְ הֶבֶל כָּל־אָדָם סֶלָה׃ ‬,With rebukes dost Thou chasten man for iniquity, And like a moth Thou makest his beauty to consume away; Surely every man is vanity. Selah,38:12 ἐν ἐλεγμοῖς ὑπὲρ ἀνομίας ἐπαίδευσας ἄνθρωπον καὶ ἐξέτηξας ὡς ἀράχνην τὴν ψυχὴν αὐτοῦ πλὴν μάτην ταράσσεται πᾶς ἄνθρωπος διάψαλμα,38:11 Thou chastenest man with rebukes for iniquity, and thou makest his life to consume away like a spider's web; nay, every man is disquieted in vain. Pause.,,,,","39:12":"","39:13":"that I may recover strength","40:1":"and heard my cry.","40:2":"out of the miry clay. He set my feet on a rock","40:3":"even praise to our God. Many shall see it","40:4":"and doesn't respect the proud","40:5":"Yahweh","40:6":"Sacrifice and offering thou didst not desire; mine ears hast thou opened: burnt offering and sin offering hast thou not required.","40:7":"Behold, I have come.  It is written about me in the book in the scroll.,Then said I, Lo, I come: in the volume of the book it is written of me,,  אָז אָמַרְתִּי הִנֵּה־בָאתִי בִּמְגִלַּת־סֵפֶר כָּתוּב עָלָי׃ ‬,Then said I: 'Lo, I am come With the roll of a book which is prescribed for me;,39:8 τότε εἶπον ἰδοὺ ἥκω ἐν κεφαλίδι βιβλίου γέγραπται περὶ ἐμοῦ,39:7 Then I said, Behold, I come: in the volume of the book it is written concerning me,,,,,","40:8":"my God.  Yes","40:9":"I will not seal my lips","40:10":"I have not hid thy righteousness within my heart; I have declared thy faithfulness and thy salvation: I have not concealed thy lovingkindness and thy truth from the great congregation.","40:11":"Yahweh.  Let your loving kindness and your truth continually preserve me.","40:12":"so that I am not able to look up. They are more than the hairs of my head.  My heart has failed me.","40:13":"Yahweh","40:14":"Let them be ashamed and confounded together that seek after my soul to destroy it; let them be driven backward and put to shame that wish me evil.","40:15":"Aha!  Aha!","40:16":"Let Yahweh be exalted!","40:17":"my God.","41:1":"Blessed is he that considereth the poor: the LORD will deliver him in time of trouble.","41:2":"and keep him alive. He shall be blessed on the earth","41:3":"and restore him from his bed of illness.","41:4":"Yahweh, have mercy on me!  Heal me, for I have sinned against you.","41:5":"Mine enemies speak evil of me","41:6":"he speaks falsehood.  His heart gathers iniquity to itself.  When he goes abroad","41:7":"All that hate me whisper together against me: against me do they devise my hurt.","41:8":"has afflicted him. Now that he lies he shall rise up no more.","41:9":"my own familiar friend","41:10":"Yahweh","41:11":"because my enemy doesn't triumph over me.","41:12":"you uphold me in my integrity","41:13":"the God of Israel","42:1":"so my soul pants after you","42:2":"for the living God.  When shall I come and appear before God?","42:3":"while they continually ask me","42:4":"and pour out my soul within me","42:5":"my soul?  Why are you disturbed within me? Hope in God!  For I shall still praise him for the saving help of his presence.","42:6":"my soul is in despair within me.  Therefore I remember you from the land of the Jordan","42:7":"Deep calleth unto deep at the noise of thy waterspouts: all thy waves and thy billows are gone over me.","42:8":"Yet the LORD will command his lovingkindness in the day time","42:9":"my rock","42:10":"my adversaries reproach me","42:11":"my soul?  Why are you disturbed within me? Hope in God!  For I shall still praise him","43:1":"God","43:2":"For thou art the God of my strength: why dost thou cast me off? why go I mourning because of the oppression of the enemy?","43:3":"send out your light and your truth.  Let them lead me. Let them bring me to your holy hill","43:4":"to God","43:5":"my soul?  Why are you disturbed within me? Hope in God!  For I shall still praise him:  my Savior","44:1":"God; our fathers have told us","44:2":"but you planted them. You afflicted the peoples","44:3":"neither did their own arm save them; but your right hand","44:4":"God.  Command victories for Jacob!","44:5":"will we push down our adversaries.  Through your name","44:6":"neither shall my sword save me.","44:7":"and have shamed those who hate us.","44:8":"we will give thanks to your name forever.  Selah.","44:9":"and brought us to dishonor","44:10":"Thou makest us to turn back from the enemy: and they which hate us spoil for themselves.","44:11":"and have scattered us among the nations.","44:12":"and have gained nothing from their sale.","44:13":"a scoffing and a derision to those who are around us.","44:14":"a shaking of the head among the peoples.","44:15":"and shame covers my face","44:16":"because of the enemy and the avenger.","44:17":"yet have we not forgotten you","44:18":"neither have our steps strayed from your path","44:19":"and covered us with the shadow of death.","44:20":"or spread forth our hands to a strange god;","44:21":"Shall not God search this out? for he knoweth the secrets of the heart.","44:22":"for your sake we are killed all day long.  We are regarded as sheep for the slaughter.","44:23":"Lord?  Arise!  Don't reject us forever.","44:24":"and forget our affliction and our oppression?","44:25":"For our soul is bowed down to the dust: our belly cleaveth unto the earth.","44:26":"Arise for our help","45:1":"My heart is inditing a good matter: I speak of the things which I have made touching the king: my tongue is the pen of a ready writer.","45:2":"therefore God has blessed you forever.","45:3":"mighty one:  your splendor and your majesty.","45:4":"humility","45:5":"with arrows in the heart of the king's enemies.","45:6":"God","45:7":"and hated wickedness. Therefore God","45:8":"aloes","45:9":"Kings' daughters were among thy honourable women: upon thy right hand did stand the queen in gold of Ophir.","45:10":"daughter","45:11":"honor him","45:12":"And the daughter of Tyre shall be there with a gift; even the rich among the people shall intreat thy favour.","45:13":"The king's daughter is all glorious within: her clothing is of wrought gold.","45:14":"her companions who follow her","45:15":"With gladness and rejoicing shall they be brought: they shall enter into the king's palace.","45:16":"Instead of thy fathers shall be thy children","45:17":"I will make thy name to be remembered in all generations: therefore shall the people praise thee for ever and ever.","46:1":"a very present help in trouble.","46:2":"though the earth changes","46:3":"though the mountains tremble with their swelling.  Selah.","46:4":"the streams of which make the city of God glad","46:5":"God is in the midst of her; she shall not be moved: God shall help her","46:6":"and the earth melted.","46:7":"The LORD of hosts is with us; the God of Jacob is our refuge. Selah.","46:8":"see Yahweh's works","46:9":"and shatters the spear.  He burns the chariots in the fire.","46:10":"Be still","46:11":"The LORD of hosts is with us; the God of Jacob is our refuge. Selah.","47:1":"all you nations.  Shout to God with the voice of triumph!","47:2":"For the LORD most high is terrible; he is a great King over all the earth.","47:3":"and peoples under our feet.","47:4":"the glory of Jacob whom he loved.  Selah.","47:5":"Yahweh with the sound of a trumpet.","47:6":"sing praises.  Sing praises to our King","47:7":"For God is the King of all the earth: sing ye praises with understanding.","47:8":"God reigneth over the heathen: God sitteth upon the throne of his holiness.","47:9":"the people of the God of Abraham.  For the shields of the earth belong to God. He is greatly exalted!","48:1":"and greatly to be praised","48:2":"the joy of the whole earth","48:3":"God is known in her palaces for a refuge.","48:4":"behold","48:5":"then they were amazed.  They were dismayed. They hurried away.","48:6":"pain","48:7":"you break the ships of Tarshish.","48:8":"so we have seen","48:9":"God","48:10":"God","48:11":"Because of your judgments.","48:12":"and go around her.  Number its towers.","48:13":"that you may tell it to the next generation.","48:14":"For this God is our God for ever and ever: he will be our guide even unto death.","49:1":"all you peoples.  Listen","49:2":"rich and poor together.","49:3":"My mouth shall speak of wisdom; and the meditation of my heart shall be of understanding.","49:4":"I will incline mine ear to a parable: I will open my dark saying upon the harp.","49:5":"when iniquity at my heels surrounds me?","49:6":"and boast in the multitude of their riches--","49:7":"nor give God a ransom for him.","49:8":"no payment is ever enough","49:9":"that he should not see corruption.","49:10":"and leave their wealth to others.","49:11":"and their dwelling places to all generations.  They name their lands after themselves.","49:12":"despite his riches","49:13":"and of those who approve their sayings.  Selah.","49:14":"far from their mansion.","49:15":"for he will receive me.  Selah.","49:16":"when the glory of his house is increased.","49:17":"For when he dieth he shall carry nothing away: his glory shall not descend after him.","49:18":"Though while he lived he blessed his soul: and men will praise thee","49:19":"He shall go to the generation of his fathers; they shall never see light.","49:20":"is like the animals that perish.","50:1":"God","50:2":"the perfection of beauty","50:3":"and does not keep silent.  A fire devours before him. It is very stormy around him.","50:4":"to the earth","50:5":"Gather my saints together unto me; those that have made a covenant with me by sacrifice.","50:6":"for God himself is judge.  Selah.","50:7":"","50:8":"I will not reprove thee for thy sacrifices or thy burnt offerings","50:9":"nor male goats from your pens.","50:10":"and the livestock on a thousand hills.","50:11":"I know all the fowls of the mountains: and the wild beasts of the field are mine.","50:12":"I would not tell you","50:13":"or drink the blood of goats?","50:14":"Offer unto God thanksgiving; and pay thy vows unto the most High:","50:15":"and you will honor me.,And call upon me in the day of trouble: I will deliver thee, and thou shalt glorify me.,  וּקְרָאֵנִי בְּיוֹם צָרָה אֲחַלֶּצְךָ וּתְכַבְּדֵנִי׃ ‬,And call upon Me in the day of trouble; I will deliver thee, and thou shalt honour Me.',49:15 καὶ ἐπικάλεσαί με ἐν ἡμέρᾳ θλίψεως καὶ ἐξελοῦμαί σε καὶ δοξάσεις με διάψαλμα,49:15 And call upon me in the day of affliction; and I will deliver thee, and thou shalt glorify me. Pause.,,,,","50:16":"What right do you have to declare my statutes, that you have taken my covenant on your lips,,But unto the wicked God saith, What hast thou to do to declare my statutes, or that thou shouldest take my covenant in thy mouth?,  וְלָרָשָׁע אָמַר אֱלֹהִים מַה־לְּךָ לְסַפֵּר חֻקָּי וַתִּשָּׂא בְרִיתִי עֲלֵי־פִיךָ׃ ‬,But unto the wicked God saith: 'What hast thou to do to declare My statutes, And that thou hast taken My covenant in thy mouth?,49:16 τῷ δὲ ἁμαρτωλῷ εἶπεν ὁ θεός ἵνα τί σὺ διηγῇ τὰ δικαιώματά μου καὶ ἀναλαμβάνεις τὴν διαθήκην μου διὰ στόματός σου,49:16 But to the sinner God has said, Why dost thou declare my ordinances, and take up my covenant in thy mouth?,,,,","50:17":"and throw my words behind you?","50:18":"you consented with him","50:19":"","50:20":"Thou sittest and speakest against thy brother; thou slanderest thine own mother's son.","50:21":"and I kept silent. You thought that the I was just like you.  I will rebuke you","50:22":"","50:23":"and prepares his way so that I will show God's salvation to him.,Whoso offereth praise glorifieth me: and to him that ordereth his conversation aright will I shew the salvation of God.,  זֹבֵחַ תּוֹדָה יְכַבְּדָנְנִי וְשָׂם דֶּרֶךְ אַרְאֶנּוּ בְּיֵשַׁע אֱלֹהִים׃ ‬,Whoso offereth the sacrifice of thanksgiving honoureth Me; And to him that ordereth his way aright Will I show the salvation of God.',49:23 θυσία αἰνέσεως δοξάσει με καὶ ἐκεῖ ὁδός ᾗ δείξω αὐτῷ τὸ σωτήριον τοῦ θεοῦ,49:23 The sacrifice of praise will glorify me: and that is the way wherein I will shew to him the salvation of God.,,,,","51:1":"when Nathan the prophet came to him","51:2":"Wash me throughly from mine iniquity","51:3":"For I acknowledge my transgressions: and my sin is ever before me.","51:4":"and you only","51:5":"I was brought forth in iniquity.  In sin my mother conceived me.","51:6":"you desire truth in the inward parts.  You teach me wisdom in the inmost place.","51:7":"and I will be clean.  Wash me","51:8":"That the bones which you have broken may rejoice.","51:9":"and blot out all of my iniquities.","51:10":"O God.  Renew a right spirit within me.","51:11":"and don't take your holy Spirit from me.","51:12":"Restore unto me the joy of thy salvation; and uphold me with thy free spirit.","51:13":"Then will I teach transgressors thy ways; and sinners shall be converted unto thee.","51:14":"O God","51:15":"open my lips.  My mouth shall declare your praise.","51:16":"or else I would give it. You have no pleasure in burnt offering.","51:17":"O God","51:18":"Do good in thy good pleasure unto Zion: build thou the walls of Jerusalem.","51:19":"in burnt offerings and in whole burnt offerings. Then they will offer bulls on your altar.","52:1":"when Doeg the Edomite came and told Saul","52:2":"like a sharp razor","52:3":"lying rather than speaking the truth.  Selah.","52:4":"you deceitful tongue.","52:5":"and pluck you out of your tent","52:6":"and fear","52:7":"Lo","52:8":"I am like a green olive tree in God's house. I trust in God's loving kindness forever and ever.","52:9":"because you have done it. I will hope in your name","53:1":"There is no God. They are corrupt","53:2":"to see if there are any who understood","53:3":"no","53:4":"who eat up my people as they eat bread","53:5":"where no fear was","53:6":"then Jacob shall rejoice","54:1":"when the Ziphites came and said to Saul","54:2":"God.  Listen to the words of my mouth.","54:3":"For strangers are risen up against me","54:4":"God is my helper.  The Lord is the one who sustains my soul.","54:5":"He shall reward evil unto mine enemies: cut them off in thy truth.","54:6":"I will sacrifice to you. I will give thanks to your name","54:7":"For he hath delivered me out of all trouble: and mine eye hath seen his desire upon mine enemies.","55:1":"God. Don't hide yourself from my supplication.","55:2":"and answer me.  I am restless in my complaint","55:3":"Because of the oppression of the wicked.  For they bring suffering on me. In anger they hold a grudge against me.","55:4":"My heart is sore pained within me: and the terrors of death are fallen upon me.","55:5":"Fearfulness and trembling are come upon me","55:6":"Oh that I had wings like a dove!  Then I would fly away, and be at rest.,And I said, Oh that I had wings like a dove! for then would I fly away, and be at rest.,  וָאֹמַר מִי־יִתֶּן־לִּי אֵבֶר כַּיּוֹנָה אָעוּפָה וְאֶשְׁכֹּנָה׃ ‬,And I said: 'Oh that I had wings like a dove! Then would I fly away, and be at rest.,54:7 καὶ εἶπα τίς δώσει μοι πτέρυγας ὡσεὶ περιστερᾶς καὶ πετασθήσομαι καὶ καταπαύσω,54:6 And I said, O that I had wings as those of a dove! then would I flee away, and be at rest.,,,,","55:7":"then I would wander far off.  I would lodge in the wilderness.  Selah.,Lo, then would I wander far off, and remain in the wilderness. Selah.,  הִנֵּה אַרְחִיק נְדֹד אָלִין בַּמִּדְבָּר סֶלָה׃ ‬,Lo, then would I wander far off, I would lodge in the wilderness. Selah,54:8 ἰδοὺ ἐμάκρυνα φυγαδεύων καὶ ηὐλίσθην ἐν τῇ ἐρήμῳ διάψαλμα,54:7 Lo! I have fled afar off, and lodged in the wilderness. Pause.,,,,","55:8":"I would hasten my escape from the windy storm and tempest.","55:9":"Lord","55:10":"Day and night they go about it upon the walls thereof: mischief also and sorrow are in the midst of it.","55:11":"Wickedness is in the midst thereof: deceit and guile depart not from her streets.","55:12":"then I could have endured it.  Neither was it he who hated me who raised himself up against me","55:13":"a man like me","55:14":"We took sweet counsel together","55:15":"in the midst of them.","55:16":"I will call on God.  Yahweh will save me.","55:17":"morning","55:18":"although there are many who oppose me.","55:19":"who is enthroned forever","55:20":"He hath put forth his hands against such as be at peace with him: he hath broken his covenant.","55:21":"but his heart was war. His words were softer than oil","55:22":"and he will sustain you. He will never allow the righteous to be moved.","55:23":"God","56:1":"when the Philistines seized him in Gath.>> Be merciful to me","56:2":"for they are many who fight proudly against me.","56:3":"I will put my trust in you.","56:4":"I praise his word.  In God","56:5":"Every day they wrest my words: all their thoughts are against me for evil.","56:6":"watching my steps","56:7":"God.","56:8":"Thou tellest my wanderings: put thou my tears into thy bottle: are they not in thy book?","56:9":"that God is for me.","56:10":"I will praise his word.  In Yahweh","56:11":"In God have I put my trust: I will not be afraid what man can do unto me.","56:12":"God.  I will give thank offerings to you.","56:13":"and prevented my feet from falling","57:1":"when he fled from Saul","57:2":"to God who accomplishes my requests for me.","57:3":"and save me","57:4":"even the sons of men","57:5":"God","57:6":"They have prepared a net for my steps; my soul is bowed down: they have digged a pit before me","57:7":"God","57:8":"my glory!  Wake up","57:9":"Lord","57:10":"and your truth to the skies.","57:11":"God","58:1":"silent ones? Do you judge blamelessly","58:2":"in your heart you plot injustice.  You measure out the violence of your hands in the earth.","58:3":"speaking lies.","58:4":"","58:5":"no matter how skillful the charmer may be.","58:6":"God","58:7":"let their arrows be made blunt.","58:8":"like the stillborn child","58:9":"he will sweep away the green and the burning alike.","58:10":"The righteous shall rejoice when he seeth the vengeance: he shall wash his feet in the blood of the wicked.","58:11":"Most certainly there is a reward for the righteous.  Most certainly there is a God who judges the earth.","59:1":"when Saul sent","59:2":"Deliver me from the workers of iniquity","59:3":"behold","59:4":"yet they are ready to attack me. Rise up","59:5":"Yahweh God of Armies","59:6":"howling like dogs","59:7":"they spew with their mouth.  Swords are in their lips","59:8":"Yahweh","59:9":"my Strength","59:10":"The God of my mercy shall prevent me: God shall let me see my desire upon mine enemies.","59:11":"or my people may forget.  Scatter them by your power","59:12":"and the words of their lips","59:13":"and they will be no more. Let them know that God rules in Jacob","59:14":"and go around the city.","59:15":"and wait all night if they aren't satisfied.","59:16":"I will sing aloud of your loving kindness in the morning.  For you have been my high tower","59:17":"my strength","60:1":"when he fought with Aram Naharaim and with Aram Zobah","60:2":"for it quakes.","60:3":"Thou hast shewed thy people hard things: thou hast made us to drink the wine of astonishment.","60:4":"that it may be displayed because of the truth.  Selah.","60:5":"save with your right hand","60:6":"","60:7":"and Manasseh is mine.  Ephraim also is the defense of my head.  Judah is my scepter.","60:8":"","60:9":"Who will bring me into the strong city? who will lead me into Edom?","60:10":"God","60:11":"for the help of man is vain.","60:12":"for it is he who will tread down our adversaries.","61:1":"God.  Listen to my prayer.","61:2":"I will call to you","61:3":"a strong tower from the enemy.","61:4":"I will abide in thy tabernacle for ever: I will trust in the covert of thy wings. Selah.","61:5":"God","61:6":"Thou wilt prolong the king's life: and his years as many generations.","61:7":"that they may preserve him.","61:8":"that I may fulfill my vows daily.","62:1":"Truly my soul waiteth upon God: from him cometh my salvation.","62:2":"my fortress--I will never be greatly shaken.","62:3":"would all of you throw him down","62:4":"but they curse inwardly.  Selah.","62:5":"wait in silence for God alone","62:6":"my fortress. I will not be shaken.","62:7":"and my refuge","62:8":"you people.  Pour out your heart before him.  God is a refuge for us.  Selah.","62:9":"and men of high degree are a lie.  In the balances they will go up. They are together lighter than a breath.","62:10":"don't set your heart on them.","62:11":"that power belongs to God.","62:12":"Lord","63:1":"when he was in the desert of Judah.>> God","63:2":"watching your power and your glory.","63:3":"my lips shall praise you.","63:4":"Thus will I bless thee while I live: I will lift up my hands in thy name.","63:5":"","63:6":"and think about you in the night watches.","63:7":"Because thou hast been my help","63:8":"My soul followeth hard after thee: thy right hand upholdeth me.","63:9":"to destroy it","63:10":"They shall fall by the sword: they shall be a portion for foxes.","63:11":"for the mouth of those who speak lies shall be silenced.","64:1":"God","64:2":"from the noisy crowd of the ones doing evil;","64:3":"and aim their arrows","64:4":"That they may shoot in secret at the perfect: suddenly do they shoot at him","64:5":"Who will see them?","64:6":"saying","64:7":"But God shall shoot at them with an arrow; suddenly shall they be wounded.","64:8":"So they shall make their own tongue to fall upon themselves: all that see them shall flee away.","64:9":"and shall wisely ponder what he has done.","64:10":"and shall take refuge in him. All the upright in heart shall praise him!","65:1":"God","65:2":"to you all men will come.","65:3":"but you atoned for our transgressions.","65:4":"and cause to come near","65:5":"you answer us","65:6":"having armed yourself with strength;","65:7":"the roaring of their waves","65:8":"They also that dwell in the uttermost parts are afraid at thy tokens: thou makest the outgoings of the morning and evening to rejoice.","65:9":"and water it.  You greatly enrich it. The river of God is full of water.  You provide them grain","65:10":"Thou waterest the ridges thereof abundantly: thou settlest the furrows thereof: thou makest it soft with showers: thou blessest the springing thereof.","65:11":"Thou crownest the year with thy goodness; and thy paths drop fatness.","65:12":"They drop upon the pastures of the wilderness: and the little hills rejoice on every side.","65:13":"The pastures are clothed with flocks; the valleys also are covered over with corn; they shout for joy","66:1":"all the earth!","66:2":"Sing forth the honour of his name: make his praise glorious.","66:3":"How awesome are your deeds!  Through the greatness of your power, your enemies submit themselves to you.,Say unto God, How terrible art thou in thy works! through the greatness of thy power shall thine enemies submit themselves unto thee.,  אִמְרוּ לֵאלֹהִים מַה־נּוֹרָא מַעֲשֶׂיךָ בְּרֹב עֻזְּךָ יְכַחֲשׁוּ לְךָ אֹיְבֶיךָ׃ ‬,Say unto God: 'How tremendous is Thy work! Through the greatness of Thy power shall Thine enemies dwindle away before Thee.,65:3 εἴπατε τῷ θεῷ ὡς φοβερὰ τὰ ἔργα σου ἐν τῷ πλήθει τῆς δυνάμεώς σου ψεύσονταί σε οἱ ἐχθροί σου,65:3 Say unto God, How awful are thy works! through the greatness of thy power thine enemies shall lie to thee.,,,,","66:4":"and will sing to you; they will sing to your name.  Selah.,All the earth shall worship thee, and shall sing unto thee; they shall sing to thy name. Selah.,  כָּל־הָאָרֶץ יִשְׁתַּחֲווּ לְךָ וִיזַמְּרוּ־לָךְ יְזַמְּרוּ שִׁמְךָ סֶלָה׃ ‬,All the earth shall worship Thee, And shall sing praises unto Thee; They shall sing praises to Thy name.' Selah,65:4 πᾶσα ἡ γῆ προσκυνησάτωσάν σοι καὶ ψαλάτωσάν σοι ψαλάτωσαν τῷ ὀνόματί σου διάψαλμα,65:4 Let all the earth worship thee, and sing to thee; let them sing to thy name. Pause.,,,,","66:5":"and see God's deeds--awesome work on behalf of the children of men.","66:6":"we rejoiced in him.","66:7":"He ruleth by his power for ever; his eyes behold the nations: let not the rebellious exalt themselves. Selah.","66:8":"you peoples!  Make the sound of his praise heard","66:9":"and doesn't allow our feet to be moved.","66:10":"God","66:11":"Thou broughtest us into the net; thou laidst affliction upon our loins.","66:12":"but you brought us to the place of abundance.","66:13":"","66:14":"and my mouth spoke","66:15":"with the offering of rams","66:16":"and hear","66:17":"I cried unto him with my mouth","66:18":"the Lord wouldn't have listened.","66:19":"God has listened.  He has heard the voice of my prayer.","66:20":"who has not turned away my prayer","67:1":"bless us","67:2":"and your salvation among all nations","67:3":"God.  Let all the peoples praise you.","67:4":"for you will judge the peoples with equity","67:5":"God.  Let all the peoples praise you.","67:6":"even our own God","67:7":"God shall bless us; and all the ends of the earth shall fear him.","68:1":"Let God arise","68:2":"so drive them away.  As wax melts before the fire","68:3":"let them rejoice with gladness.","68:4":"his name!  Rejoice before him!","68:5":"and a defender of the widows","68:6":"but the rebellious dwell in a sun-scorched land.","68:7":"when you went forth before your people","68:8":"the God of Israel.","68:9":"God","68:10":"God","68:11":"The Lord gave the word: great was the company of those that published it.","68:12":"","68:13":"the wings of a dove sheathed with silver","68:14":"it snowed on Zalmon.","68:15":"The hill of God is as the hill of Bashan; an high hill as the hill of Bashan.","68:16":"you rugged mountains","68:17":"from Sinai","68:18":"yes","68:19":"who daily bears our burdens","68:20":"the Lord","68:21":"the hairy scalp of such a one as still continues in his guiltiness.","68:22":"I will bring you again from Bashan, I will bring you again from the depths of the sea;,The Lord said, I will bring again from Bashan, I will bring my people again from the depths of the sea:,  אָמַר אֲדֹנָי מִבָּשָׁן אָשִׁיב אָשִׁיב מִמְּצֻלוֹת יָם׃ ‬,The Lord said: 'I will bring back from Bashan, I will bring them back from the depths of the sea;,67:23 εἶπεν κύριος ἐκ βασαν ἐπιστρέψω ἐπιστρέψω ἐν βυθοῖς θαλάσσης,67:22 The Lord said, I will bring again from Basan, I will bring my people again through the depths of the sea.,,,,","68:23":"dipping your foot in blood","68:24":"God","68:25":"the minstrels followed after","68:26":"Bless ye God in the congregations","68:27":"their ruler","68:28":"God","68:29":"kings shall bring presents to you.","68:30":"the multitude of the bulls","68:31":"Princes shall come out of Egypt; Ethiopia shall soon stretch out her hands unto God.","68:32":"you kingdoms of the earth!  Sing praises to the Lord!  Selah.","68:33":"which are of old; behold","68:34":"his strength is in the skies.","68:35":"God","69:1":"God","69:2":"where there is no foothold. I have come into deep waters","69:3":"looking for my God.","69:4":"being my enemies wrongfully","69:5":"you know my foolishness.  My sins aren't hidden from you.","69:6":"Lord Yahweh of Armies.  Don't let those who seek you be brought to dishonor through me","69:7":"I have borne reproach.  Shame has covered my face.","69:8":"an alien to my mother's children.","69:9":"For the zeal of thine house hath eaten me up; and the reproaches of them that reproached thee are fallen upon me.","69:10":"that was to my reproach.","69:11":"I became a byword to them.","69:12":"They that sit in the gate speak against me; and I was the song of the drunkards.","69:13":"my prayer is to you","69:14":"and don't let me sink. Let me be delivered from those who hate me","69:15":"neither let the deep swallow me up.  Don't let the pit shut its mouth on me.","69:16":"Yahweh","69:17":"for I am in distress. Answer me speedily!","69:18":"and redeem it.  Ransom me because of my enemies.","69:19":"my shame","69:20":"and I am full of heaviness. I looked for some to take pity","69:21":"they gave me vinegar to drink.","69:22":"Let their table become a snare before them: and that which should have been for their welfare","69:23":"so that they can't see. Let their backs be continually bent.","69:24":"Pour out thine indignation upon them","69:25":"Let their habitation be desolate; and let none dwell in their tents.","69:26":"For they persecute him whom thou hast smitten; and they talk to the grief of those whom thou hast wounded.","69:27":"Add iniquity unto their iniquity: and let them not come into thy righteousness.","69:28":"and not be written with the righteous.","69:29":"God","69:30":"and will magnify him with thanksgiving.","69:31":"or a bull that has horns and hoofs.","69:32":"and are glad.  You who seek after God","69:33":"and doesn't despise his captive people.","69:34":"and everything that moves therein!","69:35":"and build the cities of Judah. They shall settle there","69:36":"The seed also of his servants shall inherit it: and they that love his name shall dwell therein.","70:1":"God","70:2":"Let them be ashamed and confounded that seek after my soul: let them be turned backward","70:3":"Aha!  Aha!","70:4":"Let God be exalted!","70:5":"God.  You are my help and my deliverer.  Yahweh","71:1":"Yahweh","71:2":"and rescue me. Turn your ear to me","71:3":"for you are my rock and my fortress.","71:4":"my God","71:5":"Lord Yahweh; my confidence from my youth.","71:6":"By thee have I been holden up from the womb: thou art he that took me out of my mother's bowels: my praise shall be continually of thee.","71:7":"but you are my strong refuge.","71:8":"with your honor all the day.","71:9":"Cast me not off in the time of old age; forsake me not when my strength faileth.","71:10":"","71:11":"God has forsaken him.  Pursue and take him, for no one will rescue him.","71:12":"don't be far from me.  My God","71:13":"Let them be confounded and consumed that are adversaries to my soul; let them be covered with reproach and dishonour that seek my hurt.","71:14":"and will add to all of your praise.","71:15":"and of your salvation all day","71:16":"even of yours alone.","71:17":"you have taught me from my youth.  Until now","71:18":"even when I am old and gray-haired","71:19":"God","71:20":"who have shown us many and bitter troubles","71:21":"and comfort me again.","71:22":"my God. I sing praises to you with the lyre","71:23":"which you have redeemed","71:24":"for they are disappointed","72:1":"give the king your justice; your righteousness to the royal son.","72:2":"and your poor with justice.","72:3":"The mountains shall bring peace to the people","72:4":"and will break the oppressor in pieces.","72:5":"throughout all generations.","72:6":"as showers that water the earth.","72:7":"the righteous shall flourish","72:8":"from the River to the ends of the earth.","72:9":"They that dwell in the wilderness shall bow before him; and his enemies shall lick the dust.","72:10":"The kings of Tarshish and of the isles shall bring presents: the kings of Sheba and Seba shall offer gifts.","72:11":"all kings shall fall down before him.  All nations shall serve him.","72:12":"who has no helper.","72:13":"He shall spare the poor and needy","72:14":"He shall redeem their soul from deceit and violence: and precious shall their blood be in his sight.","72:15":"and to him shall be given of the gold of Sheba. Men shall pray for him continually.  They shall bless him all day long.","72:16":"thriving like the grass of the field.","72:17":"His name shall endure for ever: his name shall be continued as long as the sun: and men shall be blessed in him: all nations shall call him blessed.","72:18":"the God of Israel","72:19":"And blessed be his glorious name for ever: and let the whole earth be filled with his glory; Amen","72:20":"the son of Jesse.","73:1":"to those who are pure in heart.","73:2":"my feet were almost gone.  My steps had nearly slipped.","73:3":"when I saw the prosperity of the wicked.","73:4":"but their strength is firm.","73:5":"neither are they plagued like other men.","73:6":"Therefore pride compasseth them about as a chain; violence covereth them as a garment.","73:7":"Their eyes stand out with fatness: they have more than heart could wish.","73:8":"they threaten oppression.","73:9":"They set their mouth against the heavens","73:10":"and they drink up waters of abundance.","73:11":"How does God know?  Is there knowledge in the Most High?","73:12":"these are the wicked.  Being always at ease","73:13":"and washed my hands in innocence","73:14":"and punished every morning.","73:15":"I will speak thus; behold","73:16":"it was too painful for me;","73:17":"and considered their latter end.","73:18":"Surely thou didst set them in slippery places: thou castedst them down into destruction.","73:19":"How are they brought into desolation","73:20":"so","73:21":"Thus my heart was grieved","73:22":"So foolish was I","73:23":"I am continually with you.  You have held my right hand.","73:24":"and afterward receive me to glory.","73:25":"Whom have I in heaven but thee? and there is none upon earth that I desire beside thee.","73:26":"but God is the strength of my heart and my portion forever.","73:27":"behold","73:28":"that I may tell of all your works.","74:1":"why have you rejected us forever? Why does your anger smolder against the sheep of your pasture?","74:2":"which you purchased of old","74:3":"all the evil that the enemy has done in the sanctuary.","74:4":"Thine enemies roar in the midst of thy congregations; they set up their ensigns for signs.","74:5":"cutting through a thicket of trees.","74:6":"But now they break down the carved work thereof at once with axes and hammers.","74:7":"They have cast fire into thy sanctuary","74:8":"We will crush them completely. They have burned up all the places in the land where God was worshiped.","74:9":"neither is there among us anyone who knows how long.","74:10":"God","74:11":"even your right hand? Take it out of your pocket and consume them!","74:12":"working salvation in the midst of the earth.","74:13":"Thou didst divide the sea by thy strength: thou brakest the heads of the dragons in the waters.","74:14":"Thou brakest the heads of leviathan in pieces","74:15":"Thou didst cleave the fountain and the flood: thou driedst up mighty rivers.","74:16":"the night is also yours.  You have prepared the light and the sun.","74:17":"Thou hast set all the borders of the earth: thou hast made summer and winter.","74:18":"that the enemy has mocked you","74:19":"O deliver not the soul of thy turtledove unto the multitude of the wicked: forget not the congregation of thy poor for ever.","74:20":"for haunts of violence fill the dark places of the earth.","74:21":"O let not the oppressed return ashamed: let the poor and needy praise thy name.","74:22":"God!  Plead your own cause.  Remember how the foolish man mocks you all day.","74:23":"Forget not the voice of thine enemies: the tumult of those that rise up against thee increaseth continually.","75:1":"God. We give thanks","75:2":"I will judge blamelessly.","75:3":"The earth and all the inhabitants thereof are dissolved: I bear up the pillars of it. Selah.","75:4":"Don't boast!  I said to the wicked","75:5":"","75:6":"nor from the west","75:7":"and lifts up another.","75:8":"full of foaming wine mixed with spices.  He pours it out.  Indeed the wicked of the earth drink and drink it to its very dregs.","75:9":"But I will declare for ever; I will sing praises to the God of Jacob.","75:10":"but the horns of the righteous shall be lifted up.","76:1":"God is known. His name is great in Israel.","76:2":"In Salem also is his tabernacle","76:3":"the shield","76:4":"and excellent","76:5":"they have slept their last sleep. None of the men of war can lift their hands.","76:6":"God of Jacob","76:7":"even you","76:8":"and was silent","76:9":"to save all the afflicted ones of the earth.  Selah.","76:10":"Surely the wrath of man shall praise thee: the remainder of wrath shalt thou restrain.","76:11":"and fulfill them!  Let all of his neighbors bring presents to him who is to be feared.","76:12":"He shall cut off the spirit of princes: he is terrible to the kings of the earth.","77:1":"I cry to God for help","77:2":"and didn't get tired. My soul refused to be comforted.","77:3":"and I groan.  I complain","77:4":"Thou holdest mine eyes waking: I am so troubled that I cannot speak.","77:5":"the years of ancient times.","77:6":"I call to remembrance my song in the night: I commune with mine own heart: and my spirit made diligent search.","77:7":"","77:8":"Is his mercy clean gone for ever? doth his promise fail for evermore?","77:9":"in anger","77:10":"I will appeal to this:  the years of the right hand of the Most High.","77:11":"I will remember the works of the LORD: surely I will remember thy wonders of old.","77:12":"and consider your doings.","77:13":"God","77:14":"Thou art the God that doest wonders: thou hast declared thy strength among the people.","77:15":"the sons of Jacob and Joseph.  Selah.","77:16":"God.  The waters saw you","77:17":"The clouds poured out water: the skies sent out a sound: thine arrows also went abroad.","77:18":"The voice of thy thunder was in the heaven: the lightnings lightened the world: the earth trembled and shook.","77:19":"Thy way is in the sea","77:20":"by the hand of Moses and Aaron.","78:1":"my people. Turn your ears to the words of my mouth.","78:2":"","78:3":"and our fathers have told us.","78:4":"telling to the generation to come the praises of Yahweh","78:5":"and appointed a teaching in Israel","78:6":"even the children who should be born; who should arise and tell their children","78:7":"and not forget the works of God","78:8":"a stubborn and rebellious generation","78:9":"being armed and carrying bows","78:10":"and refused to walk in his law.","78:11":"his wondrous works that he had shown them.","78:12":"in the land of Egypt","78:13":"and caused them to pass through. He made the waters stand as a heap.","78:14":"and all night with a light of fire.","78:15":"and gave them drink abundantly as out of the depths.","78:16":"and caused waters to run down like rivers.","78:17":"to rebel against the Most High in the desert.","78:18":"And they tempted God in their heart by asking meat for their lust.","78:19":"they spoke against God.  They said","78:20":"he struck the rock","78:21":"and was angry.  A fire was kindled against Jacob","78:22":"and didn't trust in his salvation.","78:23":"and opened the doors of heaven.","78:24":"and gave them food from the sky.","78:25":"Man did eat angels' food: he sent them meat to the full.","78:26":"He caused an east wind to blow in the heaven: and by his power he brought in the south wind.","78:27":"He rained flesh also upon them as dust","78:28":"around their habitations.","78:29":"and were well filled.  He gave them their own desire.","78:30":"","78:31":"killed some of the fattest of them","78:32":"and didn't believe in his wondrous works.","78:33":"and their years in terror.","78:34":"then they inquired after him. They returned and sought God earnestly.","78:35":"the Most High God","78:36":"and lied to him with their tongue.","78:37":"neither were they faithful in his covenant.","78:38":"being merciful","78:39":"a wind that passes away","78:40":"and grieved him in the desert!","78:41":"and provoked the Holy One of Israel.","78:42":"nor the day when he redeemed them from the adversary;","78:43":"his wonders in the field of Zoan","78:44":"and their streams","78:45":"which devoured them; and frogs","78:46":"and their labor to the locust.","78:47":"their sycamore fig trees with frost.","78:48":"and their flocks to hot thunderbolts.","78:49":"wrath","78:50":"but gave their life over to the pestilence","78:51":"the chief of their strength in the tents of Ham.","78:52":"and guided them in the wilderness like a flock.","78:53":"so that they weren't afraid","78:54":"to this mountain","78:55":"allotted them for an inheritance by line","78:56":"and didn't keep his testimonies;","78:57":"and dealt treacherously like their fathers. They were turned aside like a deceitful bow.","78:58":"and moved him to jealousy with their engraved images.","78:59":"he was angry","78:60":"the tent which he placed among men;","78:61":"his glory into the adversary's hand.","78:62":"and was angry with his inheritance.","78:63":"The fire consumed their young men; and their maidens were not given to marriage.","78:64":"and their widows couldn't weep.","78:65":"like a mighty man who shouts by reason of wine.","78:66":"And he smote his enemies in the hinder parts: he put them to a perpetual reproach.","78:67":"and didn't choose the tribe of Ephraim","78:68":"Mount Zion which he loved.","78:69":"like the earth which he has established forever.","78:70":"and took him from the sheepfolds;","78:71":"he brought him to be the shepherd of Jacob","78:72":"and guided them by the skillfulness of his hands.","79:1":"the nations have come into your inheritance.  They have defiled your holy temple. They have laid Jerusalem in heaps.","79:2":"the flesh of your saints to the animals of the earth.","79:3":"Their blood have they shed like water round about Jerusalem; and there was none to bury them.","79:4":"a scoffing and derision to those who are around us.","79:5":"Yahweh?  Will you be angry forever?  Will your jealousy burn like fire?","79:6":"Pour out thy wrath upon the heathen that have not known thee","79:7":"and destroyed his homeland.","79:8":"for we are in desperate need.","79:9":"God of our salvation","79:10":"Where is their God?  Let it be known among the nations","79:11":"preserve those who are sentenced to death.","79:12":"Lord.","79:13":"your people and sheep of your pasture","80:1":"Shepherd of Israel","80:2":"stir up your might! Come to save us!","80:3":"God.  Cause your face to shine","80:4":"How long will you be angry against the prayer of your people?","80:5":"and given them tears to drink in large measure.","80:6":"Thou makest us a strife unto our neighbours: and our enemies laugh among themselves.","80:7":"God of Armies.  Cause your face to shine","80:8":"and planted it.","80:9":"and filled the land.","80:10":"The hills were covered with the shadow of it","80:11":"Its shoots to the River.","80:12":"so that all those who pass by the way pluck it?","80:13":"The boar out of the wood doth waste it","80:14":"we beg you","80:15":"the branch that you made strong for yourself.","80:16":"It is burned with fire","80:17":"on the son of man whom you made strong for yourself.","80:18":"and we will call on your name.","80:19":"Yahweh God of Armies.  Cause your face to shine","81:1":"our strength!  Make a joyful shout to the God of Jacob!","81:2":"and bring here the tambourine","81:3":"at the full moon","81:4":"an ordinance of the God of Jacob.","81:5":"when he went out over the land of Egypt","81:6":"","81:7":"and I delivered you.  I answered you in the secret place of thunder.  I tested you at the waters of Meribah.  Selah.,Thou calledst in trouble, and I delivered thee; I answered thee in the secret place of thunder: I proved thee at the waters of Meribah. Selah.,  בַּצָּרָה קָרָאתָ וָאֲחַלְּצֶךָּ אֶעֶנְךָ בְּסֵתֶר רַעַם אֶבְחָנְךָ עַל־מֵי מְרִיבָה סֶלָה׃ ‬,Thou didst call in trouble, and I rescued thee; I answered thee in the secret place of thunder; I proved thee at the waters of Meribah. Selah,80:8 ἐν θλίψει ἐπεκαλέσω με καὶ ἐρρυσάμην σε ἐπήκουσά σου ἐν ἀποκρύφῳ καταιγίδος ἐδοκίμασά σε ἐπὶ ὕδατος ἀντιλογίας διάψαλμα,80:7 Thou didst call upon me in trouble, and I delivered thee; I heard thee in the secret place of the storm: I proved thee at the water of Strife. Pause.,,,,","81:8":"","81:9":"neither shall you worship any foreign god.","81:10":"your God","81:11":"But my people would not hearken to my voice; and Israel would none of me.","81:12":"that they might walk in their own counsels.","81:13":"that Israel would walk in my ways!","81:14":"and turn my hand against their adversaries.","81:15":"and their punishment would last forever.","81:16":"","82:1":"God standeth in the congregation of the mighty; he judgeth among the gods.","82:2":"How long will ye judge unjustly","82:3":"","82:4":"","82:5":"neither do they understand. They walk back and forth in darkness.  All the foundations of the earth are shaken.","82:6":"You are gods, all of you are sons of the Most High.,I have said, Ye are gods; and all of you are children of the most High.,  אֲנִי־אָמַרְתִּי אֱלֹהִים אַתֶּם וּבְנֵי עֶלְיוֹן כֻּלְּכֶם׃ ‬,I said: Ye are godlike beings, And all of you sons of the Most High.,81:6 ἐγὼ εἶπα θεοί ἐστε καὶ υἱοὶ ὑψίστου πάντες,81:6 I have said, Ye are gods; and all of you children of the Most High.,,,,","82:7":"and fall like one of the rulers.,But ye shall die like men, and fall like one of the princes.,  אָכֵן כְּאָדָם תְּמוּתוּן וּכְאַחַד הַשָּׂרִים תִּפֹּלוּ׃ ‬,Nevertheless ye shall die like men, And fall like one of the princes.',81:7 ὑμεῖς δὲ ὡς ἄνθρωποι ἀποθνῄσκετε καὶ ὡς εἷς τῶν ἀρχόντων πίπτετε,81:7 But ye die as men, and fall as one of the princes.,,,,","82:8":"God","83:1":"don't keep silent. Don't keep silent","83:2":"behold","83:3":"They have taken crafty counsel against thy people","83:4":"and let's destroy them as a nation, that the name of Israel may be remembered no more.","83:5":"For they have consulted together with one consent: they are confederate against thee:","83:6":"and the Hagrites;","83:7":"Ammon","83:8":"Assur also is joined with them: they have holpen the children of Lot. Selah.","83:9":"as to Sisera","83:10":"who became as dung for the earth.","83:11":"all their princes like Zebah and Zalmunna;","83:12":"Let us take possession of God's pasturelands.","83:13":"make them like tumbleweed; like chaff before the wind.","83:14":"as the flame that sets the mountains on fire","83:15":"and terrify them with your storm.","83:16":"that they may seek your name","83:17":"let them be confounded and perish;","83:18":"whose name is Yahweh","84:1":"Yahweh of Armies!","84:2":"and even faints for the courts of Yahweh. My heart and my flesh cry out for the living God.","84:3":"the sparrow has found a home","84:4":"Blessed are they that dwell in thy house: they will be still praising thee. Selah.","84:5":"Blessed is the man whose strength is in thee; in whose heart are the ways of them.","84:6":"they make it a place of springs.  Yes","84:7":"They go from strength to strength","84:8":"God of Armies","84:9":"God our shield","84:10":"than to dwell in the tents of wickedness.","84:11":"For the LORD God is a sun and shield: the LORD will give grace and glory: no good thing will he withhold from them that walk uprightly.","84:12":"blessed is the man who trusts in you.","85:1":"you have been favorable to your land.  You have restored the fortunes of Jacob.","85:2":"Thou hast forgiven the iniquity of thy people","85:3":"Thou hast taken away all thy wrath: thou hast turned thyself from the fierceness of thine anger.","85:4":"God of our salvation","85:5":"Wilt thou be angry with us for ever? wilt thou draw out thine anger to all generations?","85:6":"that your people may rejoice in you?","85:7":"Yahweh.  Grant us your salvation.","85:8":"Yahweh","85:9":"that glory may dwell in our land.","85:10":"Mercy and truth are met together; righteousness and peace have kissed each other.","85:11":"Truth shall spring out of the earth; and righteousness shall look down from heaven.","85:12":"Yahweh will give that which is good.  Our land will yield its increase.","85:13":"And prepares the way for his steps.","86:1":"Yahweh","86:2":"for I am godly.  You","86:3":"Lord","86:4":"for to you","86:5":"Lord","86:6":"Yahweh","86:7":"for you will answer me.","86:8":"Lord","86:9":"Lord. They shall glorify your name.","86:10":"and do wondrous things.  You are God alone.","86:11":"Yahweh.  I will walk in your truth. Make my heart undivided to fear your name.","86:12":"Lord my God","86:13":"For great is thy mercy toward me: and thou hast delivered my soul from the lowest hell.","86:14":"the proud have risen up against me.  A company of violent men have sought after my soul","86:15":"Lord","86:16":"and have mercy on me!  Give your strength to your servant.  Save the son of your handmaid.","86:17":"that those who hate me may see it","87:1":"His foundation is in the holy mountains.","87:2":"The LORD loveth the gates of Zion more than all the dwellings of Jacob.","87:3":"city of God.  Selah.","87:4":"Philistia","87:5":"of Zion it will be said","87:6":"when he writes up the peoples","87:7":"All my springs are in you.","88:1":"the Ezrahite.>> Yahweh","88:2":"Let my prayer come before thee: incline thine ear unto my cry;","88:3":"For my soul is full of troubles: and my life draweth nigh unto the grave.","88:4":"","88:5":"like the slain who lie in the grave","88:6":"in the darkest depths.","88:7":"Thy wrath lieth hard upon me","88:8":"and I can't escape.","88:9":"Yahweh. I have spread out my hands to you.","88:10":"Wilt thou shew wonders to the dead? shall the dead arise and praise thee? Selah.","88:11":"Shall thy lovingkindness be declared in the grave? or thy faithfulness in destruction?","88:12":"Shall thy wonders be known in the dark? and thy righteousness in the land of forgetfulness?","88:13":"Yahweh","88:14":"why do you reject my soul?  Why do you hide your face from me?","88:15":"I am distracted.","88:16":"Thy fierce wrath goeth over me; thy terrors have cut me off.","88:17":"They came round about me daily like water; they compassed me about together.","88:18":"and my friends into darkness.","89:1":"the Ezrahite.>> I will sing of the loving kindness of Yahweh forever.  With my mouth","89:2":"Love stands firm forever.  You established the heavens.  Your faithfulness is in them.","89:3":"","89:4":"and build up your throne to all generations.'  Selah.,Thy seed will I establish for ever, and build up thy throne to all generations. Selah.,  עַד־עוֹלָם אָכִין זַרְעֶךָ וּבָנִיתִי לְדֹר־וָדוֹר כִּסְאֲךָ סֶלָה׃ ‬,For ever will I establish thy seed, And build up thy throne to all generations.' Selah,88:5 ἕως τοῦ αἰῶνος ἑτοιμάσω τὸ σπέρμα σου καὶ οἰκοδομήσω εἰς γενεὰν καὶ γενεὰν τὸν θρόνον σου διάψαλμα,88:4 I will establish thy seed for ever, and build up thy throne to all generations. Pause.,,,,","89:5":"Yahweh; your faithfulness also in the assembly of the holy ones.","89:6":"","89:7":"to be feared above all those who are around him?","89:8":"God of Armies","89:9":"you calm them.","89:10":"like one of the slain. You have scattered your enemies with your mighty arm.","89:11":"The heavens are thine","89:12":"you have created them. Tabor and Hermon rejoice in your name.","89:13":"and your right hand is exalted.","89:14":"Justice and judgment are the habitation of thy throne: mercy and truth shall go before thy face.","89:15":"Yahweh.","89:16":"they are exalted.","89:17":"our horn will be exalted.","89:18":"For the LORD is our defence; and the Holy One of Israel is our king.","89:19":"and said","89:20":"my servant.  I have anointed him with my holy oil","89:21":"With whom my hand shall be established: mine arm also shall strengthen him.","89:22":"The enemy shall not exact upon him; nor the son of wickedness afflict him.","89:23":"and strike those who hate him.","89:24":"his horn will be exalted.","89:25":"and his right hand on the rivers.","89:26":"'You are my Father","89:27":"the highest of the kings of the earth.","89:28":"My mercy will I keep for him for evermore","89:29":"and his throne as the days of heaven.","89:30":"and don't walk in my ordinances;","89:31":"and don't keep my commandments;","89:32":"and their iniquity with stripes.","89:33":"nor allow my faithfulness to fail.","89:34":"nor alter what my lips have uttered.","89:35":"I will not lie to David.","89:36":"his throne like the sun before me.","89:37":"the faithful witness in the sky.  Selah.,It shall be established for ever as the moon, and as a faithful witness in heaven. Selah.,  כְּיָרֵחַ יִכּוֹן עוֹלָם וְעֵד בַּשַּׁחַק נֶאֱמָן סֶלָה׃ ‬,It shall be established for ever as the moon; And be stedfast as the witness in sky.' Selah,88:38 καὶ ὡς ἡ σελήνη κατηρτισμένη εἰς τὸν αἰῶνα καὶ ὁ μάρτυς ἐν οὐρανῷ πιστός διάψαλμα,88:37 and as the moon that is established for ever, and as the faithful witness in heaven. Pause.,,,,","89:38":"But thou hast cast off and abhorred","89:39":"Thou hast made void the covenant of thy servant: thou hast profaned his crown by casting it to the ground.","89:40":"Thou hast broken down all his hedges; thou hast brought his strong holds to ruin.","89:41":"All that pass by the way spoil him: he is a reproach to his neighbours.","89:42":"Thou hast set up the right hand of his adversaries; thou hast made all his enemies to rejoice.","89:43":"you turn back the edge of his sword","89:44":"and thrown his throne down to the ground.","89:45":"The days of his youth hast thou shortened: thou hast covered him with shame. Selah.","89:46":"Yahweh?  Will you hide yourself forever? Will your wrath burn like fire?","89:47":"Remember how short my time is: wherefore hast thou made all men in vain?","89:48":"who shall deliver his soul from the power of Sheol?  Selah.","89:49":"where are your former loving kindnesses","89:50":"Lord","89:51":"Yahweh","89:52":"and Amen.","90:1":"the man of God.>> Lord","90:2":"before you had formed the earth and the world","90:3":"saying","90:4":"like a watch in the night.","90:5":"Thou carriest them away as with a flood; they are as a sleep: in the morning they are like grass which groweth up.","90:6":"it is withered and dry.","90:7":"For we are consumed by thine anger","90:8":"our secret sins in the light of your presence.","90:9":"For all our days are passed away in thy wrath: we spend our years as a tale that is told.","90:10":"or even by reason of strength eighty years; yet their pride is but labor and sorrow","90:11":"your wrath according to the fear that is due to you?","90:12":"that we may gain a heart of wisdom.","90:13":"Yahweh!  How long?  Have compassion on your servants!","90:14":"that we may rejoice and be glad all our days.","90:15":"for as many years as we have seen evil.","90:16":"Let thy work appear unto thy servants","90:17":"establish the work of our hands.","91:1":"He that dwelleth in the secret place of the most High shall abide under the shadow of the Almighty.","91:2":"He is my refuge and my fortress; my God, in whom I trust.","91:3":"and from the deadly pestilence.","91:4":"He shall cover thee with his feathers","91:5":"nor of the arrow that flies by day;","91:6":"nor of the destruction that wastes at noonday.","91:7":"and ten thousand at your right hand; but it will not come near you.","91:8":"and see the recompense of the wicked.","91:9":"and the Most High your dwelling place","91:10":"neither shall any plague come near your dwelling.","91:11":"to guard you in all your ways.","91:12":"so that you won't dash your foot against a stone.","91:13":"Thou shalt tread upon the lion and adder: the young lion and the dragon shalt thou trample under feet.","91:14":"","91:15":"and I will answer him.  I will be with him in trouble.  I will deliver him","91:16":"and show him my salvation.,With long life will I satisfy him, and shew him my salvation.,  אֹרֶךְ יָמִים אַשְׂבִּיעֵהוּ וְאַרְאֵהוּ בִּישׁוּעָתִי׃ ‬,With long life will I satisfy him, And make Him to behold My salvation.',90:16 μακρότητα ἡμερῶν ἐμπλήσω αὐτὸν καὶ δείξω αὐτῷ τὸ σωτήριόν μου,90:16 I will satisfy him with length of days, and shew him my salvation.,,,,","92:1":"to sing praises to your name","92:2":"and your faithfulness every night","92:3":"with the harp","92:4":"Yahweh","92:5":"Yahweh!  Your thoughts are very deep.","92:6":"neither does a fool understand this:","92:7":"and all the evil-doers flourish","92:8":"Yahweh","92:9":"behold","92:10":"But my horn shalt thou exalt like the horn of an unicorn: I shall be anointed with fresh oil.","92:11":"Mine eye also shall see my desire on mine enemies","92:12":"The righteous shall flourish like the palm tree: he shall grow like a cedar in Lebanon.","92:13":"Those that be planted in the house of the LORD shall flourish in the courts of our God.","92:14":"","92:15":"and there is no unrighteousness in him.","93:1":"The LORD reigneth","93:2":"Thy throne is established of old: thou art from everlasting.","93:3":"Yahweh","93:4":"the mighty breakers of the sea","93:5":"Yahweh","94:1":"you God to whom vengeance belongs","94:2":"you judge of the earth.  Pay back the proud what they deserve.","94:3":"how long will the wicked","94:4":"How long shall they utter and speak hard things? and all the workers of iniquity boast themselves?","94:5":"Yahweh","94:6":"and murder the fatherless.","94:7":"Yah will not see, neither will Jacob's God consider.","94:8":"you senseless among the people; you fools","94:9":"won't he hear?  He who formed the eye","94:10":"won't he punish? He who teaches man knows.","94:11":"that they are futile.","94:12":"Yah","94:13":"until the pit is dug for the wicked.","94:14":"neither will he forsake his inheritance.","94:15":"But judgment shall return unto righteousness: and all the upright in heart shall follow it.","94:16":"Who will rise up for me against the evildoers? or who will stand up for me against the workers of iniquity?","94:17":"my soul would have soon lived in silence.","94:18":"My foot is slipping!  Your loving kindness","94:19":"your comforts delight my soul.","94:20":"which brings about mischief by statute?","94:21":"and condemn the innocent blood.","94:22":"my God","94:23":"and will cut them off in their own wickedness.  Yahweh","95:1":"let's sing to Yahweh.  Let's shout aloud to the rock of our salvation!","95:2":"Let us come before his presence with thanksgiving","95:3":"a great King above all gods.","95:4":"In his hand are the deep places of the earth: the strength of the hills is his also.","95:5":"and he made it.  His hands formed the dry land.","95:6":"let's worship and bow down.  Let's kneel before Yahweh","95:7":"and the sheep in his care.  Today","95:8":"as at Meribah","95:9":"tested me","95:10":"and said","95:11":"They won't enter into my rest.","96:1":"all the earth.","96:2":"Sing unto the LORD","96:3":"his marvelous works among all the peoples.","96:4":"and greatly to be praised! He is to be feared above all gods.","96:5":"but Yahweh made the heavens.","96:6":"Honour and majesty are before him: strength and beauty are in his sanctuary.","96:7":"you families of nations","96:8":"and come into his courts.","96:9":"all the earth.","96:10":"Yahweh reigns.  The world is also established.  It can't be moved.  He will judge the peoples with equity.","96:11":"and let the earth rejoice. Let the sea roar","96:12":"Let the field be joyful","96:13":"for he comes to judge the earth. He will judge the world with righteousness","97:1":"The LORD reigneth; let the earth rejoice; let the multitude of isles be glad thereof.","97:2":"Clouds and darkness are round about him: righteousness and judgment are the habitation of his throne.","97:3":"and burns up his adversaries on every side.","97:4":"and trembles.","97:5":"at the presence of the Lord of the whole earth.","97:6":"The heavens declare his righteousness","97:7":"who boast in their idols.  Worship him","97:8":"because of your judgments","97:9":"Yahweh","97:10":"hate evil.  He preserves the souls of his saints.  He delivers them out of the hand of the wicked.","97:11":"and gladness for the upright in heart.","97:12":"you righteous people!  Give thanks to his holy Name.","98:1":"for he has done marvelous things!  His right hand","98:2":"The LORD hath made known his salvation: his righteousness hath he openly shewed in the sight of the heathen.","98:3":"He hath remembered his mercy and his truth toward the house of Israel: all the ends of the earth have seen the salvation of our God.","98:4":"all the earth!  Burst out and sing for joy","98:5":"with the harp and the voice of melody.","98:6":"make a joyful noise before the King","98:7":"and those who dwell therein.","98:8":"Let the floods clap their hands: let the hills be joyful together","98:9":"for he comes to judge the earth. He will judge the world with righteousness","99:1":"The LORD reigneth; let the people tremble: he sitteth between the cherubims; let the earth be moved.","99:2":"The LORD is great in Zion; and he is high above all the people.","99:3":"Let them praise thy great and terrible name; for it is holy.","99:4":"The king's strength also loveth judgment; thou dost establish equity","99:5":"Exalt ye the LORD our God","99:6":"Samuel among those who call on his name; they called on Yahweh","99:7":"the statute that he gave them.","99:8":"Yahweh our God.  You are a God who forgave them","99:9":"our God.  Worship at his holy hill","100:1":"all you lands!","100:2":"Serve the LORD with gladness: come before his presence with singing.","100:3":"he is God.  It is he who has made us","100:4":"into his courts with praise. Give thanks to him","100:5":"his faithfulness to all generations.","101:1":"Yahweh","101:2":"I will behave myself wisely in a perfect way. O when wilt thou come unto me? I will walk within my house with a perfect heart.","101:3":"I will set no wicked thing before mine eyes: I hate the work of them that turn aside; it shall not cleave to me.","101:4":"A froward heart shall depart from me: I will not know a wicked person.","101:5":"Whoso privily slandereth his neighbour","101:6":"that they may dwell with me.  He who walks in a perfect way","101:7":"He that worketh deceit shall not dwell within my house: he that telleth lies shall not tarry in my sight.","101:8":"I will destroy all the wicked of the land; to cut off all the workers of iniquity from Yahweh's city.","102:1":"when he is overwhelmed and pours out his complaint before Yahweh.>> Hear my prayer","102:2":"Hide not thy face from me in the day when I am in trouble; incline thine ear unto me: in the day when I call answer me speedily.","102:3":"For my days are consumed like smoke","102:4":"and withered","102:5":"my bones stick to my skin.","102:6":"I am like a pelican of the wilderness: I am like an owl of the desert.","102:7":"and have become like a sparrow that is alone on the housetop.","102:8":"Mine enemies reproach me all the day; and they that are mad against me are sworn against me.","102:9":"and mixed my drink with tears","102:10":"for you have taken me up","102:11":"My days are like a shadow that declineth; and I am withered like grass.","102:12":"Yahweh","102:13":"the set time has come.","102:14":"and have pity on her dust.","102:15":"So the heathen shall fear the name of the LORD","102:16":"When the LORD shall build up Zion","102:17":"and has not despised their prayer.","102:18":"This shall be written for the generation to come: and the people which shall be created shall praise the LORD.","102:19":"Yahweh saw the earth;","102:20":"To hear the groaning of the prisoner; to loose those that are appointed to death;","102:21":"and his praise in Jerusalem;","102:22":"the kingdoms","102:23":"He weakened my strength in the way; he shortened my days.","102:24":"My God, don't take me away in the midst of my days. Your years are throughout all generations.,I said, O my God, take me not away in the midst of my days: thy years are throughout all generations., אֹמַר אֵלִי אַל־תַּעֲלֵנִי בַּחֲצִי יָמָי בְּדוֹר דּוֹרִים שְׁנוֹתֶיךָ׃ ‬,I say: 'O my God, take me not away in the midst of my days, Thou whose years endure throughout all generations.,101:25 μὴ ἀναγάγῃς με ἐν ἡμίσει ἡμερῶν μου ἐν γενεᾷ γενεῶν τὰ ἔτη σου,101:24 Take me not away in the midst of my days: thy years are through all generations.,,,,","102:25":"you laid the foundation of the earth.  The heavens are the work of your hands.","102:26":"but you will endure.  Yes","102:27":"But thou art the same","102:28":"","103:1":"my soul!  All that is within me","103:2":"my soul","103:3":"Who forgiveth all thine iniquities; who healeth all thy diseases;","103:4":"Who redeemeth thy life from destruction; who crowneth thee with lovingkindness and tender mercies;","103:5":"so that your youth is renewed like the eagle's.","103:6":"and justice for all who are oppressed.","103:7":"his deeds to the children of Israel.","103:8":"slow to anger","103:9":"He will not always chide: neither will he keep his anger for ever.","103:10":"nor repaid us for our iniquities.","103:11":"so great is his loving kindness toward those who fear him.","103:12":"so far has he removed our transgressions from us.","103:13":"so Yahweh has compassion on those who fear him.","103:14":"For he knoweth our frame; he remembereth that we are dust.","103:15":"his days are like grass.  As a flower of the field","103:16":"and it is gone.  Its place remembers it no more.","103:17":"his righteousness to children's children;","103:18":"to those who remember to obey his precepts.","103:19":"The LORD hath prepared his throne in the heavens; and his kingdom ruleth over all.","103:20":"you angels of his","103:21":"all you armies of his","103:22":"all you works of his","104:1":"my soul.  Yahweh","104:2":"Who coverest thyself with light as with a garment: who stretchest out the heavens like a curtain:","104:3":"Who layeth the beams of his chambers in the waters: who maketh the clouds his chariot: who walketh upon the wings of the wind:","104:4":"angels} winds; his servants flames of fire.","104:5":"that it should not be moved forever.","104:6":"Thou coveredst it with the deep as with a garment: the waters stood above the mountains.","104:7":"At thy rebuke they fled; at the voice of thy thunder they hasted away.","104:8":"the valleys sank down","104:9":"Thou hast set a bound that they may not pass over; that they turn not again to cover the earth.","104:10":"He sendeth the springs into the valleys","104:11":"They give drink to every beast of the field: the wild asses quench their thirst.","104:12":"By them shall the fowls of the heaven have their habitation","104:13":"He watereth the hills from his chambers: the earth is satisfied with the fruit of thy works.","104:14":"and plants for man to cultivate","104:15":"oil to make his face to shine","104:16":"the cedars of Lebanon","104:17":"Where the birds make their nests: as for the stork","104:18":"The high hills are a refuge for the wild goats; and the rocks for the conies.","104:19":"He appointed the moon for seasons: the sun knoweth his going down.","104:20":"and it is night","104:21":"and seek their food from God.","104:22":"and they steal away","104:23":"to his labor until the evening.","104:24":"how many are your works!  In wisdom have you made them all. The earth is full of your riches.","104:25":"great and wide","104:26":"and leviathan","104:27":"that you may give them their food in due season.","104:28":"That thou givest them they gather: thou openest thine hand","104:29":"and return to the dust.","104:30":"Thou sendest forth thy spirit","104:31":"The glory of the LORD shall endure for ever: the LORD shall rejoice in his works.","104:32":"and it trembles.  He touches the mountains","104:33":"I will sing unto the LORD as long as I live: I will sing praise to my God while I have my being.","104:34":"My meditation of him shall be sweet: I will be glad in the LORD.","104:35":"my soul.  Praise Yah!","105:1":"O give thanks unto the LORD; call upon his name: make known his deeds among the people.","105:2":"sing praises to him!  Tell of all his marvelous works.","105:3":"Glory ye in his holy name: let the heart of them rejoice that seek the LORD.","105:4":"Seek the LORD","105:5":"and the judgments of his mouth","105:6":"his servant","105:7":"our God.  His judgments are in all the earth.","105:8":"the word which he commanded to a thousand generations","105:9":"his oath to Isaac","105:10":"","105:11":"To you I will give the land of Canaan, the lot of your inheritance;","105:12":"yes","105:13":"from one kingdom to another people.","105:14":"he reproved kings for their sakes","105:15":"Saying","105:16":"Moreover he called for a famine upon the land: he brake the whole staff of bread.","105:17":"He sent a man before them","105:18":"","105:19":"and Yahweh's word proved him true.","105:20":"and let him go free.","105:21":"and ruler of all of his possessions;","105:22":"and to teach his elders wisdom.","105:23":"Israel also came into Egypt; and Jacob sojourned in the land of Ham.","105:24":"and made them stronger than their adversaries.","105:25":"to conspire against his servants.","105:26":"his servant","105:27":"and wonders in the land of Ham.","105:28":"and made it dark.  They didn't rebel against his words.","105:29":"and killed their fish.","105:30":"even in the chambers of their kings.","105:31":"and swarms of flies came","105:32":"with lightning in their land.","105:33":"and shattered the trees of their country.","105:34":"and the locusts came","105:35":"And did eat up all the herbs in their land","105:36":"the first fruits of all their manhood.","105:37":"He brought them forth also with silver and gold: and there was not one feeble person among their tribes.","105:38":"for the fear of them had fallen on them.","105:39":"fire to give light in the night.","105:40":"and he brought quails","105:41":"and waters gushed out.  They ran as a river in the dry places.","105:42":"and Abraham","105:43":"his chosen with singing.","105:44":"","105:45":"and observe his laws. Praise Yah!","106:1":"for he is good","106:2":"or fully declare all his praise?","106:3":"Blessed are they that keep judgment","106:4":"Yahweh","106:5":"that I may rejoice in the gladness of your nation","106:6":"We have sinned with our fathers","106:7":"but were rebellious at the sea","106:8":"that he might make his mighty power known.","106:9":"Sea of Reeds} also","106:10":"and redeemed them from the hand of the enemy.","106:11":"And the waters covered their enemies: there was not one of them left.","106:12":"Then believed they his words; they sang his praise.","106:13":"","106:14":"and tested God in the wasteland.","106:15":"but sent leanness into their soul.","106:16":"and Aaron","106:17":"and covered the company of Abiram.","106:18":"And a fire was kindled in their company; the flame burned up the wicked.","106:19":"and worshiped a molten image.","106:20":"Thus they changed their glory into the similitude of an ox that eateth grass.","106:21":"their Savior","106:22":"and awesome things by the Red Sea{or","106:23":"had Moses","106:24":"they despised the pleasant land.  They didn't believe his word","106:25":"and didn't listen to Yahweh's voice.","106:26":"","106:27":"and scatter them in the lands.","106:28":"and ate the sacrifices of the dead.","106:29":"Thus they provoked him to anger with their inventions: and the plague brake in upon them.","106:30":"and executed judgment","106:31":"for all generations to come.","106:32":"so that Moses was troubled for their sakes;","106:33":"he spoke rashly with his lips.","106:34":"as Yahweh commanded them","106:35":"and learned their works.","106:36":"which became a snare to them.","106:37":"they sacrificed their sons and their daughters to demons.","106:38":"even the blood of their sons and of their daughters","106:39":"and prostituted themselves in their deeds.","106:40":"Therefore was the wrath of the LORD kindled against his people","106:41":"And he gave them into the hand of the heathen; and they that hated them ruled over them.","106:42":"Their enemies also oppressed them","106:43":"but they were rebellious in their counsel","106:44":"when he heard their cry.","106:45":"and repented according to the multitude of his loving kindnesses.","106:46":"He made them also to be pitied of all those that carried them captives.","106:47":"Yahweh","106:48":"the God of Israel","107:1":"for he is good","107:2":"whom he has redeemed from the hand of the adversary","107:3":"from the east and from the west","107:4":"They wandered in the wilderness in a solitary way; they found no city to dwell in.","107:5":"their soul fainted in them.","107:6":"and he delivered them out of their distresses","107:7":"that they might go to a city to live in.","107:8":"for his wonderful works to the children of men!","107:9":"For he satisfieth the longing soul","107:10":"being bound in affliction and iron","107:11":"and condemned the counsel of the Most High.","107:12":"and there was none to help.","107:13":"and he saved them out of their distresses.","107:14":"and broke their bonds in sunder.","107:15":"for his wonderful works to the children of men!","107:16":"and cut through bars of iron.","107:17":"and because of their iniquities.","107:18":"Their soul abhorreth all manner of meat; and they draw near unto the gates of death.","107:19":"he saves them out of their distresses.","107:20":"and heals them","107:21":"for his wonderful works to the children of men!","107:22":"and declare his works with singing.","107:23":"who do business in great waters;","107:24":"and his wonders in the deep.","107:25":"and raises the stormy wind","107:26":"They mount up to the heaven","107:27":"and stagger like a drunken man","107:28":"and he brings them out of their distress.","107:29":"so that its waves are still.","107:30":"so he brings them to their desired haven.","107:31":"for his wonderful works for the children of men!","107:32":"and praise him in the seat of the elders.","107:33":"water springs into a thirsty ground","107:34":"for the wickedness of those who dwell in it.","107:35":"and a dry land into water springs.","107:36":"that they may prepare a city to live in","107:37":"plant vineyards","107:38":"so that they are multiplied greatly. He doesn't allow their livestock to decrease.","107:39":"they are diminished and bowed down through oppression","107:40":"and causes them to wander in a trackless waste.","107:41":"and increases their families like a flock.","107:42":"and be glad.  All the wicked will shut their mouths.","107:43":"Whoso is wise","108:1":"God. I will sing and I will make music with my soul.","108:2":"harp and lyre!  I will wake up the dawn.","108:3":"Yahweh","108:4":"For thy mercy is great above the heavens: and thy truth reacheth unto the clouds.","108:5":"God","108:6":"save with your right hand","108:7":"","108:8":"Gilead is mine; Manasseh is mine; Ephraim also is the strength of mine head; Judah is my lawgiver;","108:9":"","108:10":"Who will bring me into the strong city? who will lead me into Edom?","108:11":"God?  You don't go forth","108:12":"for the help of man is vain.","108:13":"we will do valiantly.  For it is he who will tread down our enemies.","109:1":"don't remain silent","109:2":"For the mouth of the wicked and the mouth of the deceitful are opened against me: they have spoken against me with a lying tongue.","109:3":"and fought against me without a cause.","109:4":"they are my adversaries; but I am in prayer.","109:5":"and hatred for my love.","109:6":"Set thou a wicked man over him: and let Satan stand at his right hand.","109:7":"let him come forth guilty.  Let his prayer be turned into sin.","109:8":"Let his days be few; and let another take his office.","109:9":"and his wife a widow.","109:10":"Let his children be continually vagabonds","109:11":"Let the extortioner catch all that he hath; and let the strangers spoil his labour.","109:12":"neither let there be any to have pity on his fatherless children.","109:13":"Let his posterity be cut off; and in the generation following let their name be blotted out.","109:14":"Let the iniquity of his fathers be remembered with the LORD; and let not the sin of his mother be blotted out.","109:15":"that he may cut off the memory of them from the earth;","109:16":"but persecuted the poor and needy man","109:17":"he loved cursing","109:18":"like oil into his bones.","109:19":"for the belt that is always around him.","109:20":"of those who speak evil against my soul.","109:21":"Yahweh the Lord","109:22":"For I am poor and needy","109:23":"I am gone like the shadow when it declineth: I am tossed up and down as the locust.","109:24":"My knees are weak through fasting; and my flesh faileth of fatness.","109:25":"they shake their head.","109:26":"Yahweh","109:27":"Yahweh","109:28":"but you bless.  When they arise","109:29":"Let mine adversaries be clothed with shame","109:30":"I will praise him among the multitude.","109:31":"to save him from those who judge his soul.","110:1":"Sit at my right hand, until I make your enemies your footstool for your feet.","110:2":"The LORD shall send the rod of thy strength out of Zion: rule thou in the midst of thine enemies.","110:3":"in holy array.  Out of the womb of the morning","110:4":"and will not change his mind: You are a priest forever in the order of Melchizedek.","110:5":"The Lord at thy right hand shall strike through kings in the day of his wrath.","110:6":"He shall judge among the heathen","110:7":"He shall drink of the brook in the way: therefore shall he lift up the head.","111:1":"with each verse after the initial Praise Yah! starting with a letter of the alphabet (ordered from Alef to Tav).} I will give thanks to Yahweh with my whole heart","111:2":"pondered by all those who delight in them.","111:3":"His work is honourable and glorious: and his righteousness endureth for ever.","111:4":"He hath made his wonderful works to be remembered: the LORD is gracious and full of compassion.","111:5":"He hath given meat unto them that fear him: he will ever be mindful of his covenant.","111:6":"in giving them the heritage of the nations.","111:7":"The works of his hands are verity and judgment; all his commandments are sure.","111:8":"They stand fast for ever and ever","111:9":"He sent redemption unto his people: he hath commanded his covenant for ever: holy and reverend is his name.","111:10":"The fear of the LORD is the beginning of wisdom: a good understanding have all they that do his commandments: his praise endureth for ever.","112:1":"with each verse after the initial Praise Yah! starting with a letter of the alphabet (ordered from Alef to Tav).} Blessed is the man who fears Yahweh","112:2":"His seed shall be mighty upon earth: the generation of the upright shall be blessed.","112:3":"Wealth and riches shall be in his house: and his righteousness endureth for ever.","112:4":"gracious","112:5":"A good man sheweth favour","112:6":"Surely he shall not be moved for ever: the righteous shall be in everlasting remembrance.","112:7":"trusting in Yahweh.","112:8":"His heart is established","112:9":"he has given to the poor.  His righteousness endures forever.  His horn will be exalted with honor.","112:10":"and be grieved.  He shall gnash with his teeth","113:1":"you servants of Yahweh","113:2":"from this time forth and forevermore.","113:3":"Yahweh's name is to be praised.","113:4":"his glory above the heavens.","113:5":"our God","113:6":"Who humbleth himself to behold the things that are in heaven","113:7":"He raiseth up the poor out of the dust","113:8":"even with the princes of his people.","113:9":"as a joyful mother of children.  Praise Yah!","114:1":"the house of Jacob from a people of foreign language;","114:2":"Israel his dominion.","114:3":"and fled.  The Jordan was driven back.","114:4":"the little hills like lambs.","114:5":"you sea","114:6":"that you skipped like rams; you little hills","114:7":"you earth","114:8":"the flint into a spring of waters.","115:1":"Yahweh","115:2":"Where is their God, now?","115:3":"But our God is in the heavens: he hath done whatsoever he hath pleased.","115:4":"the work of men's hands.","115:5":"but they don't speak.  They have eyes","115:6":"but they don't hear.  They have noses","115:7":"but they don't feel.  They have feet","115:8":"everyone who trusts in them.","115:9":"trust in Yahweh!  He is their help and their shield.","115:10":"trust in Yahweh!  He is their help and their shield.","115:11":"trust in Yahweh!  He is their help and their shield.","115:12":"The LORD hath been mindful of us: he will bless us; he will bless the house of Israel; he will bless the house of Aaron.","115:13":"both small and great.","115:14":"you and your children.","115:15":"who made heaven and earth.","115:16":"The heaven","115:17":"neither any who go down into silence;","115:18":"from this time forth and forevermore. Praise Yah!","116:1":"because he listens to my voice","116:2":"therefore I will call on him as long as I live.","116:3":"the pains of Sheol got a hold of me.  I found trouble and sorrow.","116:4":"Then called I upon the name of the LORD; O LORD","116:5":"and righteous; yes","116:6":"and he saved me.","116:7":"my soul","116:8":"my eyes from tears","116:9":"I will walk before the LORD in the land of the living.","116:10":"therefore I said","116:11":"All men are liars.","116:12":"What shall I render unto the LORD for all his benefits toward me?","116:13":"and call on the name of Yahweh.","116:14":"yes","116:15":"Precious in the sight of the LORD is the death of his saints.","116:16":"truly I am your servant.  I am your servant","116:17":"and will call on the name of Yahweh.","116:18":"yes","116:19":"in the midst of you","117:1":"all you nations!  Extol him","117:2":"For his merciful kindness is great toward us: and the truth of the LORD endureth for ever. Praise ye the LORD.","118:1":"for he is good","118:2":"Let Israel now say","118:3":"Let the house of Aaron now say","118:4":"Let them now that fear the LORD say","118:5":"I called on Yah.  Yah answered me with freedom.","118:6":"The LORD is on my side; I will not fear: what can man do unto me?","118:7":"The LORD taketh my part with them that help me: therefore shall I see my desire upon them that hate me.","118:8":"than to put confidence in man.","118:9":"than to put confidence in princes.","118:10":"but in the name of Yahweh","118:11":"yes","118:12":"They compassed me about like bees: they are quenched as the fire of thorns: for in the name of the LORD I will destroy them.","118:13":"to make me fall","118:14":"The LORD is my strength and song","118:15":"","118:16":"","118:17":"but live","118:18":"but he has not given me over to death.","118:19":"Open to me the gates of righteousness: I will go into them","118:20":"This gate of the LORD","118:21":"for you have answered me","118:22":"The stone which the builders refused is become the head stone of the corner.","118:23":"This is the LORD's doing; it is marvellous in our eyes.","118:24":"This is the day which the LORD hath made; we will rejoice and be glad in it.","118:25":"we beg you","118:26":"Blessed be he that cometh in the name of the LORD: we have blessed you out of the house of the LORD.","118:27":"and he has given us light.  Bind the sacrifice with cords","118:28":"and I will give thanks to you. You are my God","118:29":"for he is good","119:1":"who walk according to Yahweh's law.","119:2":"who seek him with their whole heart.","119:3":"they do nothing wrong.  They walk in his ways.","119:4":"that we should fully obey them.","119:5":"O that my ways were directed to keep thy statutes!","119:6":"when I consider all of your commandments.","119:7":"when I learn your righteous judgments.","119:8":"I will keep thy statutes: O forsake me not utterly.","119:9":"Wherewithal shall a young man cleanse his way? by taking heed thereto according to thy word.","119:10":"I have sought you.  Don't let me wander from your commandments.","119:11":"that I might not sin against you.","119:12":"Yahweh.  Teach me your statutes.","119:13":"I have declared all the ordinances of your mouth.","119:14":"as much as in all riches.","119:15":"and consider your ways.","119:16":"I will delight myself in thy statutes: I will not forget thy word.","119:17":"Deal bountifully with thy servant","119:18":"that I may see wondrous things out of your law.","119:19":"I am a stranger in the earth: hide not thy commandments from me.","119:20":"My soul breaketh for the longing that it hath unto thy judgments at all times.","119:21":"who wander from your commandments.","119:22":"for I have kept your statutes.","119:23":"your servant will meditate on your statutes.","119:24":"and my counselors.","119:25":"My soul cleaveth unto the dust: quicken thou me according to thy word.","119:26":"and you answered me.  Teach me your statutes.","119:27":"Make me to understand the way of thy precepts: so shall I talk of thy wondrous works.","119:28":"My soul melteth for heaviness: strengthen thou me according unto thy word.","119:29":"Remove from me the way of lying: and grant me thy law graciously.","119:30":"I have chosen the way of truth: thy judgments have I laid before me.","119:31":"Yahweh.  Don't let me be disappointed.","119:32":"for you have set my heart free.","119:33":"Yahweh","119:34":"and I will keep your law.  Yes","119:35":"for I delight in them.","119:36":"not toward selfish gain.","119:37":"Turn away mine eyes from beholding vanity; and quicken thou me in thy way.","119:38":"that you may be feared.","119:39":"for your ordinances are good.","119:40":"I long for your precepts!  Revive me in your righteousness.","119:41":"Yahweh","119:42":"for I trust in your word.","119:43":"for I put my hope in your ordinances.","119:44":"forever and ever.","119:45":"for I have sought your precepts.","119:46":"and will not be disappointed.","119:47":"because I love them.","119:48":"which I love. I will meditate on your statutes.","119:49":"because you gave me hope.","119:50":"for your word has revived me.","119:51":"but I don't swerve from your law.","119:52":"Yahweh","119:53":"because of the wicked who forsake your law.","119:54":"in the house where I live.","119:55":"Yahweh","119:56":"that I keep your precepts.","119:57":"Thou art my portion","119:58":"I intreated thy favour with my whole heart: be merciful unto me according to thy word.","119:59":"and turned my steps to your statutes.","119:60":"and not delay","119:61":"but I won't forget your law.","119:62":"because of your righteous ordinances.","119:63":"of those who observe your precepts.","119:64":"Yahweh. Teach me your statutes.","119:65":"according to your word","119:66":"for I believe in your commandments.","119:67":"I went astray; but now I observe your word.","119:68":"and do good.  Teach me your statutes.","119:69":"I will keep your precepts.","119:70":"but I delight in your law.","119:71":"that I may learn your statutes.","119:72":"The law of thy mouth is better unto me than thousands of gold and silver.","119:73":"that I may learn your commandments.","119:74":"because I have put my hope in your word.","119:75":"I know that your judgments are righteous","119:76":"according to your word to your servant.","119:77":"that I may live; for your law is my delight.","119:78":"for they have overthrown me wrongfully.  I will meditate on your precepts.","119:79":"Let those that fear thee turn unto me","119:80":"that I may not be disappointed.","119:81":"My soul fainteth for thy salvation: but I hope in thy word.","119:82":"When will you comfort me?","119:83":"For I am become like a bottle in the smoke; yet do I not forget thy statutes.","119:84":"How many are the days of thy servant? when wilt thou execute judgment on them that persecute me?","119:85":"contrary to your law.","119:86":"All thy commandments are faithful: they persecute me wrongfully; help thou me.","119:87":"but I didn't forsake your precepts.","119:88":"so I will obey the statutes of your mouth.","119:89":"your word is settled in heaven forever.","119:90":"and it remains.","119:91":"for all things serve you.","119:92":"I would have perished in my affliction.","119:93":"for with them","119:94":"for I have sought your precepts.","119:95":"to destroy me. I will consider your statutes.","119:96":"but your commands are boundless.","119:97":"O how I love thy law! it is my meditation all the day.","119:98":"for your commandments are always with me.","119:99":"for your testimonies are my meditation.","119:100":"because I have kept your precepts.","119:101":"that I might observe your word.","119:102":"for you have taught me.","119:103":"more than honey to my mouth!","119:104":"I get understanding; therefore I hate every false way.","119:105":"and a light for my path.","119:106":"and have confirmed it","119:107":"Yahweh","119:108":"I beg you","119:109":"yet I won't forget your law.","119:110":"yet I haven't gone astray from your precepts.","119:111":"for they are the joy of my heart.","119:112":"even to the end.","119:113":"but I love your law.","119:114":"Thou art my hiding place and my shield: I hope in thy word.","119:115":"you evildoers","119:116":"that I may live. Let me not be ashamed of my hope.","119:117":"and I will be safe","119:118":"for their deceit is in vain.","119:119":"Thou puttest away all the wicked of the earth like dross: therefore I love thy testimonies.","119:120":"My flesh trembleth for fear of thee; and I am afraid of thy judgments.","119:121":"I have done judgment and justice: leave me not to mine oppressors.","119:122":"Be surety for thy servant for good: let not the proud oppress me.","119:123":"for your righteous word.","119:124":"Deal with thy servant according unto thy mercy","119:125":"that I may know your testimonies.","119:126":"Yahweh","119:127":"yes","119:128":"Therefore I esteem all thy precepts concerning all things to be right; and I hate every false way.","119:129":"therefore my soul keeps them.","119:130":"The entrance of thy words giveth light; it giveth understanding unto the simple.","119:131":"for I longed for your commandments.","119:132":"and have mercy on me","119:133":"Order my steps in thy word: and let not any iniquity have dominion over me.","119:134":"so I will observe your precepts.","119:135":"Make thy face to shine upon thy servant; and teach me thy statutes.","119:136":"because they don't observe your law.","119:137":"Yahweh.  Your judgments are upright.","119:138":"Thy testimonies that thou hast commanded are righteous and very faithful.","119:139":"because my enemies ignore your words.","119:140":"and your servant loves them.","119:141":"I am small and despised: yet do not I forget thy precepts.","119:142":"Thy righteousness is an everlasting righteousness","119:143":"Trouble and anguish have taken hold on me: yet thy commandments are my delights.","119:144":"that I may live.","119:145":"Yahweh!  I will keep your statutes.","119:146":"I cried unto thee; save me","119:147":"I prevented the dawning of the morning","119:148":"that I might meditate on your word.","119:149":"Yahweh","119:150":"They draw nigh that follow after mischief: they are far from thy law.","119:151":"Yahweh.  All your commandments are truth.","119:152":"that you have founded them forever.","119:153":"and deliver me","119:154":"and redeem me!  Revive me according to your promise.","119:155":"for they don't seek your statutes.","119:156":"Yahweh.  Revive me according to your ordinances.","119:157":"Many are my persecutors and mine enemies; yet do I not decline from thy testimonies.","119:158":"because they don't observe your word.","119:159":"Yahweh","119:160":"Thy word is true from the beginning: and every one of thy righteous judgments endureth for ever.","119:161":"but my heart stands in awe of your words.","119:162":"as one who finds great spoil.","119:163":"I hate and abhor lying: but thy law do I love.","119:164":"I praise you","119:165":"Great peace have they which love thy law: and nothing shall offend them.","119:166":"Yahweh.  I have done your commandments.","119:167":"My soul hath kept thy testimonies; and I love them exceedingly.","119:168":"for all my ways are before you.","119:169":"Yahweh.  Give me understanding according to your word.","119:170":"Let my supplication come before thee: deliver me according to thy word.","119:171":"for you teach me your statutes.","119:172":"for all your commandments are righteousness.","119:173":"for I have chosen your precepts.","119:174":"Yahweh.  Your law is my delight.","119:175":"that I may praise you.  Let your ordinances help me.","119:176":"for I don't forget your commandments.","120:1":"I cried to Yahweh. He answered me.","120:2":"Yahweh","120:3":"and what will be done more to you","120:4":"with coals of juniper.","120:5":"that I live in Meshech","120:6":"My soul hath long dwelt with him that hateth peace.","120:7":"but when I speak","121:1":"I will lift up mine eyes unto the hills","121:2":"who made heaven and earth.","121:3":"He will not suffer thy foot to be moved: he that keepeth thee will not slumber.","121:4":"he who keeps Israel will neither slumber nor sleep.","121:5":"The LORD is thy keeper: the LORD is thy shade upon thy right hand.","121:6":"nor the moon by night.","121:7":"The LORD shall preserve thee from all evil: he shall preserve thy soul.","121:8":"from this time forth","122:1":"Let's go to Yahweh's house!","122:2":"Jerusalem;","122:3":"that is built as a city that is compact together;","122:4":"even Yah's tribes","122:5":"the thrones of David's house.","122:6":"Pray for the peace of Jerusalem: they shall prosper that love thee.","122:7":"and prosperity within your palaces.","122:8":"I will now say","122:9":"I will seek your good.","123:1":"you who sit in the heavens.","123:2":"as the eyes of servants look to the hand of their master","123:3":"Yahweh","123:4":"with the contempt of the proud.","124:1":"let Israel now say","124:2":"when men rose up against us;","124:3":"when their wrath was kindled against us;","124:4":"the stream would have gone over our soul;","124:5":"Then the proud waters had gone over our soul.","124:6":"who has not given us as a prey to their teeth.","124:7":"and we have escaped.","124:8":"who made heaven and earth.","125:1":"which can't be moved","125:2":"so Yahweh surrounds his people from this time forth and forevermore.","125:3":"For the rod of the wicked shall not rest upon the lot of the righteous; lest the righteous put forth their hands unto iniquity.","125:4":"Yahweh","125:5":"Yahweh will lead them away with the workers of iniquity. Peace be on Israel.","126:1":"we were like those who dream.","126:2":"and our tongue with singing. Then they said among the nations","126:3":"and we are glad.","126:4":"Yahweh","126:5":"They that sow in tears shall reap in joy.","126:6":"carrying seed for sowing","127:1":"they labor in vain who build it.  Unless Yahweh watches over the city","127:2":"to stay up late","127:3":"children are a heritage of Yahweh.  The fruit of the womb is his reward.","127:4":"so are the children of youth.","127:5":"Happy is the man that hath his quiver full of them: they shall not be ashamed","128:1":"who walks in his ways.","128:2":"and it will be well with you.","128:3":"in the innermost parts of your house; your children like olive plants","128:4":"thus is the man blessed who fears Yahweh.","128:5":"and may you see the good of Jerusalem all the days of your life.","128:6":"may you see your children's children.  Peace be upon Israel.","129:1":"","129:2":"yet they have not prevailed against me.","129:3":"The plowers plowed upon my back: they made long their furrows.","129:4":"The LORD is righteous: he hath cut asunder the cords of the wicked.","129:5":"all those who hate Zion.","129:6":"which withers before it grows up;","129:7":"nor he who binds sheaves","129:8":"The blessing of Yahweh be on you. We bless you in the name of Yahweh.","130:1":"Yahweh.","130:2":"hear my voice.  Let your ears be attentive to the voice of my petitions.","130:3":"Yah","130:4":"therefore you are feared.","130:5":"I wait for the LORD","130:6":"My soul waiteth for the Lord more than they that watch for the morning: I say","130:7":"hope in Yahweh","130:8":"And he shall redeem Israel from all his iniquities.","131:1":"my heart isn't haughty","131:2":"like a weaned child with his mother","131:3":"hope in Yahweh","132:1":"remember David and all his affliction","132:2":"and vowed to the Mighty One of Jacob:","132:3":"","132:4":"or slumber to my eyelids;","132:5":"a dwelling for the Mighty One of Jacob.,Until I find out a place for the LORD, an habitation for the mighty God of Jacob., עַד־אֶמְצָא מָקוֹם לַיהוָה מִשְׁכָּנוֹת לַאֲבִיר יַעֲקֹב׃ ‬,Until I find out a place for the LORD, A dwelling-place for the Mighty One of Jacob.',131:5 ἕως οὗ εὕρω τόπον τῷ κυρίῳ σκήνωμα τῷ θεῷ ιακωβ,131:5 until I find a place for the Lord, a tabernacle for the God of Jacob.,,,,","132:6":"we heard of it in Ephrathah.  We found it in the field of Jaar:","132:7":"","132:8":"Yahweh","132:9":"","132:10":"don't turn away the face of your anointed one.","132:11":"","132:12":"my testimony that I will teach them","132:13":"For the LORD hath chosen Zion; he hath desired it for his habitation.","132:14":"","132:15":"I will abundantly bless her provision: I will satisfy her poor with bread.","132:16":"I will also clothe her priests with salvation: and her saints shall shout aloud for joy.","132:17":"There will I make the horn of David to bud: I have ordained a lamp for mine anointed.","132:18":"but on himself","133:1":"Behold","133:2":"that ran down on the beard","133:3":"that comes down on the hills of Zion: for there Yahweh gives the blessing","134:1":"all you servants of Yahweh","134:2":"Lift up your hands in the sanctuary","134:3":"The LORD that made heaven and earth bless thee out of Zion.","135:1":"you servants of Yahweh","135:2":"in the courts of our God's house.","135:3":"for Yahweh is good.  Sing praises to his name","135:4":"For the LORD hath chosen Jacob unto himself","135:5":"that our Lord is above all gods.","135:6":"that he has done","135:7":"He causeth the vapours to ascend from the ends of the earth; he maketh lightnings for the rain; he bringeth the wind out of his treasuries.","135:8":"both of man and animal;","135:9":"Egypt","135:10":"and killed mighty kings","135:11":"Og king of Bashan","135:12":"a heritage to Israel","135:13":"Yahweh","135:14":"and have compassion on his servants.","135:15":"the work of men's hands.","135:16":"but they can't speak.  They have eyes","135:17":"but they can't hear; neither is there any breath in their mouths.","135:18":"everyone who trusts in them.","135:19":"praise Yahweh!  House of Aaron","135:20":"praise Yahweh!  You who fear Yahweh","135:21":"Who dwells at Jerusalem. Praise Yah!","136:1":"for he is good; for his loving kindness endures forever.","136:2":"O give thanks unto the God of gods: for his mercy endureth for ever.","136:3":"O give thanks to the Lord of lords: for his mercy endureth for ever.","136:4":"To him who alone doeth great wonders: for his mercy endureth for ever.","136:5":"To him that by wisdom made the heavens: for his mercy endureth for ever.","136:6":"To him that stretched out the earth above the waters: for his mercy endureth for ever.","136:7":"To him that made great lights: for his mercy endureth for ever:","136:8":"The sun to rule by day: for his mercy endureth for ever:","136:9":"The moon and stars to rule by night: for his mercy endureth for ever.","136:10":"To him that smote Egypt in their firstborn: for his mercy endureth for ever:","136:11":"And brought out Israel from among them: for his mercy endureth for ever:","136:12":"and with an outstretched arm; for his loving kindness endures forever:","136:13":"Sea of Reeds} apart; for his loving kindness endures forever;","136:14":"And made Israel to pass through the midst of it: for his mercy endureth for ever:","136:15":"Sea of Reeds}; for his loving kindness endures forever:","136:16":"To him which led his people through the wilderness: for his mercy endureth for ever.","136:17":"To him which smote great kings: for his mercy endureth for ever:","136:18":"And slew famous kings: for his mercy endureth for ever:","136:19":"Sihon king of the Amorites: for his mercy endureth for ever:","136:20":"And Og the king of Bashan: for his mercy endureth for ever:","136:21":"And gave their land for an heritage: for his mercy endureth for ever:","136:22":"Even an heritage unto Israel his servant: for his mercy endureth for ever.","136:23":"Who remembered us in our low estate: for his mercy endureth for ever:","136:24":"And hath redeemed us from our enemies: for his mercy endureth for ever.","136:25":"Who giveth food to all flesh: for his mercy endureth for ever.","136:26":"O give thanks unto the God of heaven: for his mercy endureth for ever.","137:1":"there we sat down.  Yes","137:2":"we hung up our harps.","137:3":"those who led us captive asked us for songs. Those who tormented us demanded songs of joy:  Sing us one of the songs of Zion!","137:4":"How shall we sing the LORD's song in a strange land?","137:5":"Jerusalem","137:6":"If I do not remember thee","137:7":"Yahweh","137:8":"doomed to destruction","137:9":"who takes and dashes your little ones against the rock.","138:1":"I will sing praises to you.","138:2":"and give thanks to your Name for your loving kindness and for your truth; for you have exalted your Name and your Word above all.","138:3":"you answered me.  You encouraged me with strength in my soul.","138:4":"Yahweh","138:5":"they will sing of the ways of Yahweh; for great is Yahweh's glory.","138:6":"yet he looks after the lowly; but the proud","138:7":"you will revive me. You will stretch forth your hand against the wrath of my enemies. Your right hand will save me.","138:8":"Yahweh","139:1":"you have searched me","139:2":"Thou knowest my downsitting and mine uprising","139:3":"and are acquainted with all my ways.","139:4":"but","139:5":"Thou hast beset me behind and before","139:6":"Such knowledge is too wonderful for me; it is high","139:7":"Whither shall I go from thy spirit? or whither shall I flee from thy presence?","139:8":"you are there.  If I make my bed in Sheol","139:9":"and settle in the uttermost parts of the sea;","139:10":"and your right hand will hold me.","139:11":"Surely the darkness will overwhelm me; the light around me will be night;","139:12":"but the night shines as the day.  The darkness is like light to you.","139:13":"For thou hast possessed my reins: thou hast covered me in my mother's womb.","139:14":"for I am fearfully and wonderfully made. Your works are wonderful.  My soul knows that very well.","139:15":"when I was made in secret","139:16":"the days that were ordained for me","139:17":"God!  How vast is the sum of them!","139:18":"they are more in number than the sand. When I wake up","139:19":"God","139:20":"For they speak against thee wickedly","139:21":"don't I hate those who hate you?  Am I not grieved with those who rise up against you?","139:22":"I hate them with perfect hatred: I count them mine enemies.","139:23":"God","139:24":"and lead me in the everlasting way.","140:1":"Yahweh","140:2":"Which imagine mischiefs in their heart; continually are they gathered together for war.","140:3":"They have sharpened their tongues like a serpent; adders' poison is under their lips. Selah.","140:4":"keep me from the hands of the wicked.  Preserve me from the violent men who have determined to trip my feet.","140:5":"they have spread the cords of a net by the path.  They have set traps for me.  Selah.","140:6":"You are my God.  Listen to the cry of my petitions","140:7":"the Lord","140:8":"don't grant the desires of the wicked.  Don't let their evil plans succeed","140:9":"let the mischief of their own lips cover them.","140:10":"into miry pits","140:11":"Let not an evil speaker be established in the earth: evil shall hunt the violent man to overthrow him.","140:12":"and justice for the needy.","140:13":"Surely the righteous shall give thanks unto thy name: the upright shall dwell in thy presence.","141:1":"I have called on you. Come to me quickly!  Listen to my voice when I call to you.","141:2":"Let my prayer be set forth before thee as incense; and the lifting up of my hands as the evening sacrifice.","141:3":"Yahweh","141:4":"to practice deeds of wickedness with men who work iniquity.  Don't let me eat of their delicacies.","141:5":"it is kindness; let him reprove me","141:6":"for they are well spoken.","141:7":"Our bones are scattered at the grave's mouth","141:8":"Yahweh","141:9":"from the traps of the workers of iniquity.","141:10":"while I pass by.","142:1":"when he was in the cave. A Prayer.>> I cry with my voice to Yahweh.  With my voice","142:2":"I poured out my complaint before him; I shewed before him my trouble.","142:3":"you knew my path. In the way in which I walk","142:4":"and see; for there is no one who is concerned for me.  Refuge has fled from me.  No one cares for my soul.","142:5":"Yahweh.  I said","142:6":"for I am in desperate need.  deliver me from my persecutors","142:7":"that I may give thanks to your name. The righteous will surround me","143:1":"Yahweh.  Listen to my petitions.  In your faithfulness and righteousness","143:2":"for in your sight no man living is righteous.","143:3":"as those who have been long dead.","143:4":"Therefore is my spirit overwhelmed within me; my heart within me is desolate.","143:5":"I remember the days of old; I meditate on all thy works; I muse on the work of thy hands.","143:6":"like a parched land.  Selah.","143:7":"Yahweh.  My spirit fails.  Don't hide your face from me","143:8":"for I trust in you.  Cause me to know the way in which I should walk","143:9":"Yahweh","143:10":"for you are my God.  Your Spirit is good. Lead me in the land of uprightness.","143:11":"Yahweh","143:12":"cut off my enemies","144:1":"my rock","144:2":"my fortress","144:3":"what is man","144:4":"Man is like to vanity: his days are as a shadow that passeth away.","144:5":"Yahweh","144:6":"and scatter them.  Send out your arrows","144:7":"rescue me","144:8":"Whose right hand is a right hand of falsehood.","144:9":"God.  On a ten-stringed lyre","144:10":"who rescues David","144:11":"and deliver me out of the hands of foreigners","144:12":"our daughters like pillars carved to adorn a palace.","144:13":"filled with all kinds of provision. Our sheep bring forth thousands and ten thousands in our fields.","144:14":"and no going away","144:15":"Happy is that people","145:1":"with every verse (including the second half of verse 13) starting with a consecutive letter of the Hebrew alphabet.>> I will exalt you","145:2":"Every day will I bless thee; and I will praise thy name for ever and ever.","145:3":"and greatly to be praised! His greatness is unsearchable.","145:4":"and will declare your mighty acts.","145:5":"of your wondrous works","145:6":"And men shall speak of the might of thy terrible acts: and I will declare thy greatness.","145:7":"and will sing of your righteousness.","145:8":"merciful","145:9":"The LORD is good to all: and his tender mercies are over all his works.","145:10":"Yahweh.  Your saints will extol you.","145:11":"and talk about your power;","145:12":"the glory of the majesty of his kingdom.","145:13":"and loving in all his deeds.{Some manuscripts omit these last two lines.}","145:14":"and raises up all those who are bowed down.","145:15":"The eyes of all wait upon thee; and thou givest them their meat in due season.","145:16":"and satisfy the desire of every living thing.","145:17":"and gracious in all his works.","145:18":"to all who call on him in truth.","145:19":"and will save them.","145:20":"but all the wicked he will destroy.","145:21":"My mouth shall speak the praise of the LORD: and let all flesh bless his holy name for ever and ever.","146:1":"my soul.","146:2":"I will praise Yahweh.  I will sing praises to my God as long as I exist.","146:3":"each a son of man in whom there is no help.","146:4":"and he returns to the earth. In that very day","146:5":"whose hope is in Yahweh","146:6":"the sea","146:7":"Which executeth judgment for the oppressed: which giveth food to the hungry. The LORD looseth the prisoners:","146:8":"The LORD openeth the eyes of the blind: the LORD raiseth them that are bowed down: the LORD loveth the righteous:","146:9":"but the way of the wicked he turns upside down.","146:10":"O Zion","147:1":"for it is good to sing praises to our God; for it is pleasant and fitting to praise him.","147:2":"The LORD doth build up Jerusalem: he gathereth together the outcasts of Israel.","147:3":"and binds up their wounds.","147:4":"He telleth the number of the stars; he calleth them all by their names.","147:5":"and mighty in power.  His understanding is infinite.","147:6":"The LORD lifteth up the meek: he casteth the wicked down to the ground.","147:7":"","147:8":"who prepares rain for the earth","147:9":"and for the young ravens when they call.","147:10":"He delighteth not in the strength of the horse: he taketh not pleasure in the legs of a man.","147:11":"in those who hope in his loving kindness.","147:12":"Jerusalem!  Praise your God","147:13":"For he hath strengthened the bars of thy gates; he hath blessed thy children within thee.","147:14":"He maketh peace in thy borders","147:15":"He sendeth forth his commandment upon earth: his word runneth very swiftly.","147:16":"and scatters frost like ashes.","147:17":"He casteth forth his ice like morsels: who can stand before his cold?","147:18":"and melts them.  He causes his wind to blow","147:19":"He sheweth his word unto Jacob","147:20":"He hath not dealt so with any nation: and as for his judgments","148:1":"Praise ye the LORD. Praise ye the LORD from the heavens: praise him in the heights.","148:2":"all his angels!  Praise him","148:3":"sun and moon!  Praise him","148:4":"you heavens of heavens","148:5":"For he commanded","148:6":"He hath also stablished them for ever and ever: he hath made a decree which shall not pass.","148:7":"you great sea creatures","148:8":"snow and clouds; stormy wind","148:9":"Mountains","148:10":"Beasts","148:11":"Kings of the earth","148:12":"Both young men","148:13":"for his name alone is exalted. His glory is above the earth and the heavens.","148:14":"the praise of all his saints; even of the children of Israel","149:1":"his praise in the assembly of the saints.","149:2":"Let Israel rejoice in him that made him: let the children of Zion be joyful in their King.","149:3":"Let them praise his name in the dance: let them sing praises unto him with the timbrel and harp.","149:4":"For the LORD taketh pleasure in his people: he will beautify the meek with salvation.","149:5":"Let the saints be joyful in glory: let them sing aloud upon their beds.","149:6":"and a two-edged sword in their hand;","149:7":"and punishments on the peoples;","149:8":"and their nobles with fetters of iron;","149:9":"To execute upon them the judgment written: this honour have all his saints. Praise ye the LORD.","150:1":"Praise ye the LORD. Praise God in his sanctuary: praise him in the firmament of his power.","150:2":"Praise him for his mighty acts: praise him according to his excellent greatness.","150:3":"Praise him with the sound of the trumpet: praise him with the psaltery and harp.","150:4":"Praise him with the timbrel and dance: praise him with stringed instruments and organs.","150:5":"Praise him upon the loud cymbals: praise him upon the high sounding cymbals.","150:6":"Let every thing that hath breath praise the LORD. Praise ye the LORD."}