{"1:1":"which God gave him to show to his servants the things which must happen soon","1:2":"and of the testimony of Jesus Christ","1:3":"and keep the things that are written in it","1:4":"to the seven assemblies that are in Asia:  Grace to you and peace","1:5":"the faithful witness","1:6":"priests{Exodus 19:6; Isaiah 61:6} to his God and Father; to him be the glory and the dominion forever and ever.  Amen.","1:7":"he is coming with the clouds","1:8":"{TR omits God} who is and who was and who is to come, the Almighty.","1:9":"your brother and partner with you in oppression","1:10":"and I heard behind me a loud voice","1:11":"{TR adds I am the Alpha and the Omega","1:12":"I saw seven golden lampstands.","1:13":"{Daniel 7:13} clothed with a robe reaching down to his feet","1:14":"like snow. His eyes were like a flame of fire.","1:15":"as if it had been refined in a furnace.  His voice was like the voice of many waters.","1:16":"And he had in his right hand seven stars: and out of his mouth went a sharp twoedged sword: and his countenance was as the sun shineth in his strength.","1:17":"I fell at his feet like a dead man. He laid his right hand on me","1:18":"and behold","1:19":"and the things which are","1:20":"and the seven golden lampstands.  The seven stars are the angels{or","2:1":"he who walks among the seven golden lampstands says these things:","2:2":"","2:3":"and have{TR adds have labored and} not grown weary.","2:4":"that you left your first love.","2:5":"and repent and do the first works; or else I am coming to you swiftly","2:6":"that you hate the works of the Nicolaitans","2:7":"let him hear what the Spirit says to the assemblies.  To him who overcomes I will give to eat of the tree of life","2:8":"who was dead","2:9":"","2:10":"the devil is about to throw some of you into prison","2:11":"let him hear what the Spirit says to the assemblies.  He who overcomes won't be harmed by the second death.","2:12":"And to the angel of the church in Pergamos write; These things saith he which hath the sharp sword with two edges;","2:13":"","2:14":"because you have there some who hold the teaching of Balaam","2:15":"So hast thou also them that hold the doctrine of the Nicolaitanes","2:16":"or else I am coming to you quickly","2:17":"let him hear what the Spirit says to the assemblies.  To him who overcomes","2:18":"who has his eyes like a flame of fire","2:19":"","2:20":"that you tolerate your{TR","2:21":"but she refuses to repent of her sexual immorality.","2:22":"I will throw her into a bed","2:23":"and all the assemblies will know that I am he who searches the minds and hearts. I will give to each one of you according to your deeds.","2:24":"to the rest who are in Thyatira","2:25":"hold firmly that which you have","2:26":"and he who keeps my works to the end","2:27":"shattering them like clay pots;{Psalm 2:9} as I also have received of my Father:","2:28":"And I will give him the morning star.","2:29":"let him hear what the Spirit says to the assemblies.","3:1":"and the seven stars says these things: I know your works, that you have a reputation of being alive, but you are dead.,And unto the angel of the church in Sardis write; These things saith he that hath the seven Spirits of God, and the seven stars; I know thy works, that thou hast a name that thou livest, and art dead.,,,,,,,,","3:2":"and keep the things that remain","3:3":"and repent.  If therefore you won't watch","3:4":"for they are worthy.","3:5":"and I will in no way blot his name out of the book of life","3:6":"let him hear what the Spirit says to the assemblies.","3:7":"he who is true","3:8":"","3:9":"I give of the synagogue of Satan","3:10":"I also will keep you from the hour of testing","3:11":"so that no one takes your crown.","3:12":"I will make him a pillar in the temple of my God","3:13":"let him hear what the Spirit says to the assemblies.","3:14":"the Faithful and True Witness","3:15":"","3:16":"because you are lukewarm","3:17":"'I am rich","3:18":"that you may become rich; and white garments","3:19":"I reprove and chasten.  Be zealous therefore","3:20":"I stand at the door and knock.  If anyone hears my voice and opens the door","3:21":"I will give to him to sit down with me on my throne","3:22":"let him hear what the Spirit says to the assemblies.,He that hath an ear, let him hear what the Spirit saith unto the churches.,,,,,,,,","4:1":"and the first voice that I heard","4:2":"there was a throne set in heaven","4:3":"like an emerald to look at.","4:4":"dressed in white garments","4:5":"sounds","4:6":"similar to crystal.  In the midst of the throne","4:7":"and the second creature like a calf","4:8":"each one of them having six wings","4:9":"honor","4:10":"and worship him who lives forever and ever","4:11":"the Holy One","5:1":"in the right hand of him who sat on the throne","5:2":"Who is worthy to open the book, and to break its seals?","5:3":"or on the earth","5:4":"because no one was found worthy to open the book","5:5":"Don't weep.  Behold, the Lion who is of the tribe of Judah, the Root of David, has overcome; he who opens the book and its seven seals.","5:6":"and in the midst of the elders","5:7":"and he took it out of the right hand of him who sat on the throne.","5:8":"the four living creatures and the twenty-four elders fell down before the Lamb","5:9":"saying","5:10":"and we will reign on earth.,And hast made us unto our God kings and priests: and we shall reign on the earth.,,,,,,,,","5:11":"and I heard something like a voice of many angels around the throne","5:12":"Worthy is the Lamb who has been killed to receive the power, wealth, wisdom, strength, honor, glory, and blessing!","5:13":"on the earth","5:14":"Amen!  The {TR adds twenty-four}elders fell down and worshiped.{TR adds the one living forever and ever}","6:1":"and I heard one of the four living creatures saying","6:2":"a white horse","6:3":"I heard the second living creature saying","6:4":"a red horse.  To him who sat on it was given power to take peace from the earth","6:5":"I heard the third living creature saying","6:6":"A choenix{A choenix is a dry volume measure that is a little more than a litre (a little more than a quart).} of wheat for a denarius, and three choenix of barley for a denarius! Don't damage the oil and the wine!","6:7":"I heard the fourth living creature saying","6:8":"a pale horse","6:9":"I saw underneath the altar the souls of those who had been killed for the Word of God","6:10":"saying","6:11":"until their fellow servants and their brothers","6:12":"and there was a great earthquake.  The sun became black as sackcloth made of hair","6:13":"like a fig tree dropping its unripe figs when it is shaken by a great wind.","6:14":"And the heaven departed as a scroll when it is rolled together; and every mountain and island were moved out of their places.","6:15":"the princes","6:16":"Fall on us, and hide us from the face of him who sits on the throne, and from the wrath of the Lamb,,And said to the mountains and rocks, Fall on us, and hide us from the face of him that sitteth on the throne, and from the wrath of the Lamb:,,,,,,,,","6:17":"","7:1":"I saw four angels standing at the four corners of the earth","7:2":"having the seal of the living God.  He cried with a loud voice to the four angels to whom it was given to harm the earth and the sea","7:3":"Don't harm the earth, neither the sea, nor the trees, until we have sealed the bondservants of our God on their foreheads!","7:4":"one hundred forty-four thousand","7:5":"of the tribe of Reuben twelve thousand","7:6":"of the tribe of Naphtali twelve thousand","7:7":"of the tribe of Levi twelve thousand","7:8":"of the tribe of Joseph twelve thousand","7:9":"and behold","7:10":"saying","7:11":"the elders","7:12":"Amen!  Blessing, glory, wisdom, thanksgiving, honor, power, and might, be to our God forever and ever!  Amen.","7:13":"saying to me","7:14":"My lord, you know.  He said to me","7:15":"they serve him day and night in his temple.  He who sits on the throne will spread his tent over them.","7:16":"neither thirsty any more; neither will the sun beat on them","7:17":"and leads them to springs of waters of life.  And God will wipe away every tear from their eyes.,For the Lamb which is in the midst of the throne shall feed them, and shall lead them unto living fountains of waters: and God shall wipe away all tears from their eyes.,,,,,,,,","8:1":"there was silence in heaven for about half an hour.","8:2":"and seven trumpets were given to them.","8:3":"having a golden censer. Much incense was given to him","8:4":"with the prayers of the saints","8:5":"and he filled it with the fire of the altar","8:6":"And the seven angels which had the seven trumpets prepared themselves to sound.","8:7":"and there followed hail and fire","8:8":"and something like a great burning mountain was thrown into the sea.  One third of the sea became blood","8:9":"And the third part of the creatures which were in the sea","8:10":"and a great star fell from the sky","8:11":"because they were made bitter.","8:12":"and one third of the sun was struck","8:13":"and I heard an eagle","9:1":"and I saw a star from the sky which had fallen to the earth.  The key to the pit of the abyss was given to him.","9:2":"and smoke went up out of the pit","9:3":"and power was given to them","9:4":"neither any green thing","9:5":"but to torment them for five months.  Their torment was like the torment of a scorpion","9:6":"and will in no way find it. They will desire to die","9:7":"and their faces were like people's faces.","9:8":"and their teeth were like those of lions.","9:9":"like breastplates of iron. The sound of their wings was like the sound of chariots","9:10":"and stings. In their tails they have power to harm men for five months.","9:11":"destruction","9:12":"there are still two woes coming after this.","9:13":"","9:14":"Free the four angels who are bound at the great river Euphrates!","9:15":"so that they might kill one third of mankind.","9:16":"ten thousands of ten thousands}. I heard the number of them.","9:17":"and those who sat on them","9:18":"the smoke","9:19":"and in their tails. For their tails are like serpents","9:20":"who were not killed with these plagues","9:21":"nor of their sorceries","10:1":"clothed with a cloud.  A rainbow was on his head.  His face was like the sun","10:2":"and his left on the land.","10:3":"as a lion roars.  When he cried","10:4":"I was about to write; but I heard a voice from the sky saying","10:5":"","10:6":"who created heaven and the things that are in it","10:7":"when he is about to sound","10:8":"again speaking with me","10:9":"telling him to give me the little book. He said to me","10:10":"and ate it up. It was as sweet as honey in my mouth.  When I had eaten it","10:11":"You must prophesy again over many peoples, nations, languages, and kings.","11:1":"Rise, and measure God's temple, and the altar, and those who worship in it.,And there was given me a reed like unto a rod: and the angel stood, saying, Rise, and measure the temple of God, and the altar, and them that worship therein.,,,,,,,,","11:2":"and don't measure it","11:3":"and they will prophesy one thousand two hundred sixty days","11:4":"standing before the Lord of the earth.","11:5":"fire proceeds out of their mouth and devours their enemies.  If anyone desires to harm them","11:6":"that it may not rain during the days of their prophecy.  They have power over the waters","11:7":"the beast that comes up out of the abyss will make war with them","11:8":"which spiritually is called Sodom and Egypt","11:9":"tribes","11:10":"and they will be glad.  They will give gifts to one another","11:11":"the breath of life from God entered into them","11:12":"Come up here! They went up into heaven in the cloud","11:13":"and a tenth of the city fell.  Seven thousand people were killed in the earthquake","11:14":"the third woe comes quickly.","11:15":"and great voices in heaven followed","11:16":"who sit on their thrones before God's throne","11:17":"","11:18":"and your wrath came","11:19":"and the ark of the Lord's covenant was seen in his temple.  Lightnings","12:1":"and the moon under her feet","12:2":"laboring to give birth.","12:3":"a great red dragon","12:4":"and threw them to the earth.  The dragon stood before the woman who was about to give birth","12:5":"a male child","12:6":"where she has a place prepared by God","12:7":"And there was war in heaven: Michael and his angels fought against the dragon; and the dragon fought and his angels","12:8":"neither was a place found for him any more in heaven.","12:9":"the old serpent","12:10":"saying","12:11":"and because of the word of their testimony.  They didn't love their life","12:12":"heavens","12:13":"he persecuted the woman who gave birth to the male child.","12:14":"that she might fly into the wilderness to her place","12:15":"that he might cause her to be carried away by the stream.","12:16":"and the earth opened its mouth and swallowed up the river which the dragon spewed out of his mouth.","12:17":"and went away to make war with the rest of her seed","13:1":"having ten horns and seven heads. On his horns were ten crowns","13:2":"and his feet were like those of a bear","13:3":"and the whole earth marveled at the beast.","13:4":"because he gave his authority to the beast","13:5":"And there was given unto him a mouth speaking great things and blasphemies; and power was given unto him to continue forty and two months.","13:6":"to blaspheme his name","13:7":"and to overcome them.  Authority over every tribe","13:8":"everyone whose name has not been written from the foundation of the world in the book of life of the Lamb who has been killed.","13:9":"let him hear.","13:10":"he will go.  If anyone is with the sword","13:11":"and he spoke like a dragon.","13:12":"whose fatal wound was healed.","13:13":"even making fire come down out of the sky to the earth in the sight of people.","13:14":"that they should make an image to the beast who had the sword wound and lived.","13:15":"to the image of the beast","13:16":"the small and the great","13:17":"unless he has that mark","13:18":"let him calculate the number of the beast","14:1":"and behold","14:2":"like the sound of many waters","14:3":"and before the four living creatures and the elders.  No one could learn the song except the one hundred forty-four thousand","14:4":"for they are virgins.  These are those who follow the Lamb wherever he goes. These were redeemed by Jesus from among men","14:5":"for they are blameless.{TR adds before the throne of God}","14:6":"having an eternal Good News to proclaim to those who dwell on the earth","14:7":"Fear the Lord, and give him glory; for the hour of his judgment has come.  Worship him who made the heaven, the earth, the sea, and the springs of waters!","14:8":"a second angel","14:9":"a third","14:10":"which is prepared unmixed in the cup of his anger. He will be tormented with fire and sulfur in the presence of the holy angels","14:11":"those who worship the beast and his image","14:12":"those who keep the commandments of God","14:13":"Write, 'Blessed are the dead who die in the Lord from now on.'  Yes, says the Spirit","14:14":"and behold","14:15":"crying with a loud voice to him who sat on the cloud","14:16":"and the earth was reaped.","14:17":"And another angel came out of the temple which is in heaven","14:18":"he who has power over fire","14:19":"and gathered the vintage of the earth","14:20":"and blood came out from the winepress","15:1":"for in them God's wrath is finished.","15:2":"and those who overcame the beast","15:3":"the servant of God","15:4":"Lord","15:5":"and the temple of the tabernacle of the testimony in heaven was opened.","15:6":"clothed with pure","15:7":"who lives forever and ever.","15:8":"and from his power.  No one was able to enter into the temple","16:1":"saying to the seven angels","16:2":"and poured out his bowl into the earth","16:3":"and it became blood as of a dead man.  Every living thing in the sea died.","16:4":"and they became blood.","16:5":"You are righteous, who are and who were, you Holy One, because you have judged these things.,And I heard the angel of the waters say, Thou art righteous, O Lord, which art, and wast, and shalt be, because thou hast judged thus.,,,,,,,,","16:6":"and you have given them blood to drink.  They deserve this.,For they have shed the blood of saints and prophets, and thou hast given them blood to drink; for they are worthy.,,,,,,,,","16:7":"Yes, Lord God, the Almighty, true and righteous are your judgments.","16:8":"and it was given to him to scorch men with fire.","16:9":"and people blasphemed the name of God who has the power over these plagues. They didn't repent and give him glory.","16:10":"and his kingdom was darkened.  They gnawed their tongues because of the pain","16:11":"And blasphemed the God of heaven because of their pains and their sores","16:12":"the Euphrates. Its water was dried up","16:13":"and out of the mouth of the beast","16:14":"performing signs; which go forth to the kings of the whole inhabited earth","16:15":"Behold","16:16":"Megiddo.","16:17":"from the throne","16:18":"sounds","16:19":"and the cities of the nations fell.  Babylon the great was remembered in the sight of God","16:20":"and the mountains were not found.","16:21":"about the weight of a talent","17:1":"saying","17:2":"and those who dwell in the earth were made drunken with the wine of her sexual immorality.,With whom the kings of the earth have committed fornication, and the inhabitants of the earth have been made drunk with the wine of her fornication.,,,,,,,,","17:3":"full of blasphemous names","17:4":"and decked with gold and precious stones and pearls","17:5":"MYSTERY, BABYLON THE GREAT, THE MOTHER OF THE PROSTITUTES AND OF THE ABOMINATIONS OF THE EARTH.","17:6":"and with the blood of the martyrs of Jesus.  When I saw her","17:7":"Why do you wonder?  I will tell you the mystery of the woman, and of the beast that carries her, which has the seven heads and the ten horns.,And the angel said unto me, Wherefore didst thou marvel? I will tell thee the mystery of the woman, and of the beast that carrieth her, which hath the seven heads and ten horns.,,,,,,,,","17:8":"and is not; and is about to come up out of the abyss and to go into destruction. Those who dwell on the earth and whose names have not been written in the book of life from the foundation of the world will marvel when they see that the beast was","17:9":"on which the woman sits.","17:10":"the one is","17:11":"and is not","17:12":"but they receive authority as kings","17:13":"and they give their power and authority to the beast.","17:14":"and the Lamb will overcome them","17:15":"The waters which you saw, where the prostitute sits, are peoples, multitudes, nations, and languages.,And he saith unto me, The waters which thou sawest, where the whore sitteth, are peoples, and multitudes, and nations, and tongues.,,,,,,,,","17:16":"and the beast","17:17":"and to be of one mind","17:18":"which reigns over the kings of the earth.,And the woman which thou sawest is that great city, which reigneth over the kings of the earth.,,,,,,,,","18:1":"I saw another angel coming down out of the sky","18:2":"saying","18:3":"the kings of the earth committed sexual immorality with her","18:4":"saying","18:5":"and God has remembered her iniquities.","18:6":"and repay her double as she did","18:7":"and grew wanton","18:8":"mourning","18:9":"who committed sexual immorality and lived wantonly with her","18:10":"saying","18:11":"for no one buys their merchandise any more;","18:12":"silver","18:13":"incense","18:14":"and all things that were dainty and sumptuous have perished from you","18:15":"who were made rich by her","18:16":"'Woe","18:17":"and everyone who sails anywhere","18:18":"saying","18:19":"and cried","18:20":"Rejoice over her","18:21":"saying","18:22":"minstrels","18:23":"And the light of a candle shall shine no more at all in thee; and the voice of the bridegroom and of the bride shall be heard no more at all in thee: for thy merchants were the great men of the earth; for by thy sorceries were all nations deceived.","18:24":"and of all who have been slain on the earth.,And in her was found the blood of prophets, and of saints, and of all that were slain upon the earth.,,,,,,,,","19:1":"saying","19:2":"who corrupted the earth with her sexual immorality","19:3":"Hallelujah!  Her smoke goes up forever and ever.","19:4":"saying","19:5":"saying","19:6":"and like the voice of many waters","19:7":"and let us give the glory to him.  For the marriage of the Lamb has come","19:8":"pure","19:9":"Write, 'Blessed are those who are invited to the marriage supper of the Lamb.'  He said to me","19:10":"Look!  Don't do it!  I am a fellow bondservant with you and with your brothers who hold the testimony of Jesus. Worship God, for the testimony of Jesus is the Spirit of Prophecy.","19:11":"and behold","19:12":"and on his head are many crowns. He has names written and a name written which no one knows but he himself.","19:13":"And he was clothed with a vesture dipped in blood: and his name is called The Word of God.","19:14":"clothed in white","19:15":"double-edged sword","19:16":"KING OF KINGS, AND LORD OF LORDS.","19:17":"saying to all the birds that fly in the sky","19:18":"the flesh of captains","19:19":"and the kings of the earth","19:20":"and with him the false prophet who worked the signs in his sight","19:21":"the sword which came forth out of his mouth. All the birds were filled with their flesh.","20:1":"having the key of the abyss and a great chain in his hand.","20:2":"the old serpent","20:3":"and shut it","20:4":"and they sat on them","20:5":"But the rest of the dead lived not again until the thousand years were finished. This is the first resurrection.","20:6":"the second death has no power","20:7":"Satan will be released from his prison","20:8":"Gog and Magog","20:9":"and surrounded the camp of the saints","20:10":"where the beast and the false prophet are also. They will be tormented day and night forever and ever.","20:11":"and him who sat on it","20:12":"the great and the small","20:13":"Hell} gave up the dead who were in them. They were judged","20:14":"Hell} were thrown into the lake of fire. This is the second death","20:15":"he was cast into the lake of fire.","21:1":"and the sea is no more.","21:2":"New Jerusalem","21:3":"Behold, God's dwelling is with people, and he will dwell with them, and they will be his people, and God himself will be with them as their God.,And I heard a great voice out of heaven saying, Behold, the tabernacle of God is with men, and he will dwell with them, and they shall be his people, and God himself shall be with them, and be their God.,,,,,,,,","21:4":"nor crying","21:5":"Behold, I am making all things new. He said","21:6":"It is done!  I am the Alpha and the Omega, the Beginning and the End.  I will give freely to him who is thirsty from the spring of the water of life.,And he said unto me, It is done. I am Alpha and Omega, the beginning and the end. I will give unto him that is athirst of the fountain of the water of life freely.,,,,,,,,","21:7":"I will give him these things. I will be his God","21:8":"unbelieving","21:9":"who were loaded with the seven last plagues came","21:10":"and showed me the holy city","21:11":"as if it was a jasper stone","21:12":"and at the gates twelve angels; and names written on them","21:13":"On the east three gates; on the north three gates; on the south three gates; and on the west three gates.","21:14":"and on them twelve names of the twelve Apostles of the Lamb.","21:15":"a golden reed","21:16":"and its length is as great as its breadth. He measured the city with the reed","21:17":"{144 cubits is about 65.8 meters or 216 feet} by the measure of a man","21:18":"like pure glass.","21:19":"sapphire{or","21:20":"sardonyx; the sixth","21:21":"like transparent glass.","21:22":"for the Lord God","21:23":"neither of the moon","21:24":"And the nations of them which are saved shall walk in the light of it: and the kings of the earth do bring their glory and honour into it.","21:25":"","21:26":"And they shall bring the glory and honour of the nations into it.","21:27":"or one who causes an abomination or a lie","22:1":"clear as crystal","22:2":"bearing twelve kinds of fruits","22:3":"and his servants serve him.","22:4":"and his name will be on their foreheads.","22:5":"and they need no lamp light; for the Lord God will illuminate them.  They will reign forever and ever.","22:6":"These words are faithful and true. The Lord God of the spirits of the prophets sent his angel to show to his bondservants the things which must happen soon.","22:7":"Behold","22:8":"John","22:9":"See you don't do it!  I am a fellow bondservant with you and with your brothers, the prophets, and with those who keep the words of this book.  Worship God.","22:10":"Don't seal up the words of the prophecy of this book, for the time is at hand.,And he saith unto me, Seal not the sayings of the prophecy of this book: for the time is at hand.,,,,,,,,","22:11":"let him act unjustly still. He who is filthy","22:12":"","22:13":"the First and the Last","22:14":"that they may have the right to the tree of life","22:15":"the sorcerers","22:16":"Jesus","22:17":"Come!  He who hears","22:18":"if anyone adds to them","22:19":"may God take away his part from the tree of life","22:20":"Yes, I come quickly. Amen!  Yes","22:21":"The grace of our Lord Jesus Christ be with you all. Amen."}