{"1:1":"a servant of Jesus Christ","1:2":"","1:3":"who was born of the seed of David according to the flesh","1:4":"according to the Spirit of holiness","1:5":"for obedience of faith among all the nations","1:6":"Among whom are ye also the called of Jesus Christ:","1:7":"beloved of God","1:8":"I thank my God through Jesus Christ for all of you","1:9":"whom I serve in my spirit in the Good News of his Son","1:10":"if by any means now at last I may be prospered by the will of God to come to you.","1:11":"that I may impart to you some spiritual gift","1:12":"that I with you may be encouraged in you","1:13":"brothers","1:14":"both to the wise and to the foolish.","1:15":"as much as is in me","1:16":"for it is the power of God for salvation for everyone who believes; for the Jew first","1:17":"But the righteous shall live by faith.{Habakkuk 2:4}","1:18":"who suppress the truth in unrighteousness","1:19":"for God revealed it to them.","1:20":"being perceived through the things that are made","1:21":"knowing God","1:22":"they became fools","1:23":"and of birds","1:24":"that their bodies should be dishonored among themselves","1:25":"and worshiped and served the creature rather than the Creator","1:26":"God gave them up to vile passions. For their women changed the natural function into that which is against nature.","1:27":"leaving the natural function of the woman","1:28":"God gave them up to a reprobate mind","1:29":"sexual immorality","1:30":"hateful to God","1:31":"covenant breakers","1:32":"knowing the ordinance of God","2:1":"O man","2:2":"But we are sure that the judgment of God is according to truth against them which commit such things.","2:3":"O man who judges those who practice such things","2:4":"forbearance","2:5":"revelation","2:6":"Who will render to every man according to his deeds:","2:7":"honor","2:8":"and don't obey the truth","2:9":"on every soul of man who works evil","2:10":"honor","2:11":"For there is no respect of persons with God.","2:12":"For as many as have sinned without law shall also perish without law: and as many as have sinned in the law shall be judged by the law;","2:13":"but the doers of the law will be justified","2:14":"these","2:15":"their conscience testifying with them","2:16":"according to my Good News","2:17":"and rest on the law","2:18":"and approve the things that are excellent","2:19":"a light to those who are in darkness","2:20":"a teacher of babies","2:21":"don't you teach yourself? You who preach that a man shouldn't steal","2:22":"do you rob temples?","2:23":"through your disobedience of the law do you dishonor God?","2:24":"For the name of God is blasphemed among the Gentiles through you","2:25":"if you are a doer of the law","2:26":"won't his uncircumcision be accounted as circumcision?","2:27":"if it fulfills the law","2:28":"neither is that circumcision which is outward in the flesh;","2:29":"and circumcision is that of the heart","3:1":"What advantage then hath the Jew? or what profit is there of circumcision?","3:2":"they were entrusted with the oracles of God.","3:3":"For what if some did not believe? shall their unbelief make the faith of God without effect?","3:4":"let God be found true","3:5":"what will we say?  Is God unrighteous who inflicts wrath? I speak like men do.","3:6":"God forbid: for then how shall God judge the world?","3:7":"why am I also still judged as a sinner?","3:8":"and as some affirm that we say)","3:9":"in no way. For we previously charged both Jews and Greeks","3:10":"There is no one righteous; no, not one.,As it is written, There is none righteous, no, not one:,,,,,,,,","3:11":"There is none that understandeth","3:12":"no","3:13":"Their throat is an open sepulchre; with their tongues they have used deceit; the poison of asps is under their lips:","3:14":"Whose mouth is full of cursing and bitterness:","3:15":"","3:16":"Destruction and misery are in their ways:","3:17":"they haven't known.{Isaiah 59:7-8},And the way of peace have they not known:,,,,,,,,","3:18":"There is no fear of God before their eyes.","3:19":"it speaks to those who are under the law","3:20":"no flesh will be justified in his sight.  For through the law comes the knowledge of sin.","3:21":"a righteousness of God has been revealed","3:22":"","3:23":"and fall short of the glory of God;","3:24":"Being justified freely by his grace through the redemption that is in Christ Jesus:","3:25":"a propitiation}","3:26":"and the justifier of him who has faith in Jesus.","3:27":"but by a law of faith.","3:28":"Therefore we conclude that a man is justified by faith without the deeds of the law.","3:29":"of Gentiles also","3:30":"and the uncircumcised through faith.","3:31":"we establish the law.","4:1":"our forefather","4:2":"he has something to boast about","4:3":"For what saith the scripture? Abraham believed God","4:4":"the reward is not counted as grace","4:5":"but believes in him who justifies the ungodly","4:6":"","4:7":"","4:8":"","4:9":"or on the uncircumcised also?  For we say that faith was accounted to Abraham for righteousness.","4:10":"or in uncircumcision?  Not in circumcision","4:11":"a seal of the righteousness of the faith which he had while he was in uncircumcision","4:12":"but who also walk in the steps of that faith of our father Abraham","4:13":"but through the righteousness of faith.","4:14":"faith is made void","4:15":"for where there is no law","4:16":"that it may be according to grace","4:17":"I have made you a father of many nations.{Genesis 17:5} This is in the presence of him whom he believed: God","4:18":"to the end that he might become a father of many nations","4:19":"he didn't consider his own body","4:20":"looking to the promise of God","4:21":"he was able also to perform.","4:22":"And therefore it was imputed to him for righteousness.","4:23":"","4:24":"to whom it will be accounted","4:25":"and was raised for our justification.","5:1":"we have peace with God through our Lord Jesus Christ;","5:2":"By whom also we have access by faith into this grace wherein we stand","5:3":"but we also rejoice in our sufferings","5:4":"proven character; and proven character","5:5":"because God's love has been poured out into our hearts through the Holy Spirit who was given to us.","5:6":"at the right time Christ died for the ungodly.","5:7":"For scarcely for a righteous man will one die: yet peradventure for a good man some would even dare to die.","5:8":"in that while we were yet sinners","5:9":"being now justified by his blood","5:10":"while we were enemies","5:11":"but we also rejoice in God through our Lord Jesus Christ","5:12":"as sin entered into the world through one man","5:13":"sin was in the world; but sin is not charged when there is no law.","5:14":"even over those whose sins weren't like Adam's disobedience","5:15":"much more did the grace of God","5:16":"but the free gift came of many trespasses to justification.","5:17":"death reigned through the one; so much more will those who receive the abundance of grace and of the gift of righteousness reign in life through the one","5:18":"all men were condemned; even so through one act of righteousness","5:19":"even so through the obedience of the one","5:20":"that the trespass might abound; but where sin abounded","5:21":"even so grace might reign through righteousness to eternal life through Jesus Christ our Lord.","6:1":"that grace may abound?","6:2":"how could we live in it any longer?","6:3":"Know ye not","6:4":"that just like Christ was raised from the dead through the glory of the Father","6:5":"we will also be part of his resurrection;","6:6":"that our old man was crucified with him","6:7":"For he that is dead is freed from sin.","6:8":"we believe that we will also live with him;","6:9":"being raised from the dead","6:10":"he died to sin one time; but the life that he lives","6:11":"but alive to God in Christ Jesus our Lord.","6:12":"that you should obey it in its lusts.","6:13":"but present yourselves to God","6:14":"but under grace.","6:15":"because we are not under law","6:16":"his servants you are whom you obey; whether of sin to death","6:17":"that","6:18":"you became bondservants of righteousness.","6:19":"for as you presented your members as servants to uncleanness and to wickedness upon wickedness","6:20":"you were free in regard to righteousness.","6:21":"What fruit had ye then in those things whereof ye are now ashamed? for the end of those things is death.","6:22":"being made free from sin","6:23":"but the free gift of God is eternal life in Christ Jesus our Lord.","7:1":"brothers{The word for brothers here and where context allows may also be correctly translated brothers and sisters or siblings.} (for I speak to men who know the law)","7:2":"but if the husband dies","7:3":"while the husband lives","7:4":"my brothers","7:5":"the sinful passions which were through the law","7:6":"having died to that in which we were held; so that we serve in newness of the spirit","7:7":"I wouldn't have known sin","7:8":"finding occasion through the commandment","7:9":"but when the commandment came","7:10":"which was for life","7:11":"finding occasion through the commandment","7:12":"and the commandment holy","7:13":"that it might be shown to be sin","7:14":"but I am fleshly","7:15":"that I do.","7:16":"that I do","7:17":"but sin which dwells in me.","7:18":"that is","7:19":"I don't do; but the evil which I don't desire","7:20":"that I do","7:21":"that","7:22":"","7:23":"warring against the law of my mind","7:24":"O wretched man that I am! who shall deliver me from the body of this death?","7:25":"our Lord!  So then with the mind","8:1":"who don't walk according to the flesh","8:2":"For the law of the Spirit of life in Christ Jesus hath made me free from the law of sin and death.","8:3":"in that it was weak through the flesh","8:4":"who walk not after the flesh","8:5":"but those who live according to the Spirit","8:6":"but the mind of the Spirit is life and peace;","8:7":"neither indeed can it be.","8:8":"So then they that are in the flesh cannot please God.","8:9":"if it is so that the Spirit of God dwells in you.  But if any man doesn't have the Spirit of Christ","8:10":"the body is dead because of sin","8:11":"he who raised up Christ Jesus from the dead will also give life to your mortal bodies through his Spirit who dwells in you.","8:12":"brothers","8:13":"you must die; but if by the Spirit you put to death the deeds of the body","8:14":"these are children of God.","8:15":"but you received the Spirit of adoption","8:16":"The Spirit itself beareth witness with our spirit","8:17":"then heirs; heirs of God","8:18":"For I reckon that the sufferings of this present time are not worthy to be compared with the glory which shall be revealed in us.","8:19":"For the earnest expectation of the creature waiteth for the manifestation of the sons of God.","8:20":"not of its own will","8:21":"Because the creature itself also shall be delivered from the bondage of corruption into the glorious liberty of the children of God.","8:22":"For we know that the whole creation groaneth and travaileth in pain together until now.","8:23":"but ourselves also","8:24":"but hope that is seen is not hope. For who hopes for that which he sees?","8:25":"we wait for it with patience.","8:26":"the Spirit also helps our weaknesses","8:27":"because he makes intercession for the saints according to God.","8:28":"to those who are called according to his purpose.","8:29":"he also predestined to be conformed to the image of his Son","8:30":"those he also called. Whom he called","8:31":"who can be against us?","8:32":"but delivered him up for us all","8:33":"Who shall lay any thing to the charge of God's elect? It is God that justifieth.","8:34":"yes rather","8:35":"or anguish","8:36":"For your sake we are killed all day long. We were accounted as sheep for the slaughter.{Psalm 44:22}","8:37":"in all these things","8:38":"that neither death","8:39":"nor depth","9:1":"my conscience testifying with me in the Holy Spirit","9:2":"That I have great heaviness and continual sorrow in my heart.","9:3":"my relatives according to the flesh","9:4":"the glory","9:5":"and from whom is Christ as concerning the flesh","9:6":"that are of Israel.","9:7":"because they are Abraham's seed","9:8":"it is not the children of the flesh who are children of God","9:9":"At the appointed time I will come, and Sarah will have a son.{Genesis 18:10","9:10":"but Rebecca also conceived by one","9:11":"neither having done anything good or bad","9:12":"The elder will serve the younger.{Genesis 25:23}","9:13":"Jacob I loved, but Esau I hated.{Malachi 1:2-3}","9:14":"What shall we say then? Is there unrighteousness with God? God forbid.","9:15":"I will have mercy on whom I have mercy, and I will have compassion on whom I have compassion.{Exodus 33:19}","9:16":"nor of him who runs","9:17":"For this very purpose I caused you to be raised up, that I might show in you my power, and that my name might be proclaimed in all the earth.{Exodus 9:16}","9:18":"he has mercy on whom he desires","9:19":"Why does he still find fault? For who withstands his will?","9:20":"O man","9:21":"from the same lump to make one part a vessel for honor","9:22":"willing to show his wrath","9:23":"which he prepared beforehand for glory","9:24":"whom he also called","9:25":"I will call them 'my people,' which were not my people; and her 'beloved,' who was not beloved.{Hosea 2:23}","9:26":"And it shall come to pass","9:27":"If the number of the children of Israel are as the sand of the sea, it is the remnant who will be saved;,Esaias also crieth concerning Israel, Though the number of the children of Israel be as the sand of the sea, a remnant shall be saved:,,,,,,,,","9:28":"because the LORD will make a short work upon the earth.{Isaiah 10:22-23},For he will finish the work, and cut it short in righteousness: because a short work will the Lord make upon the earth.,,,,,,,,","9:29":"Unless the Lord of Armies{Greek: Sabaoth (for Hebrew:  Tze'va'ot)} had left us a seed, we would have become like Sodom, and would have been made like Gomorrah.{Isaiah 1:9}","9:30":"who didn't follow after righteousness","9:31":"following after a law of righteousness","9:32":"but as it were by works of the law.  They stumbled over the stumbling stone;","9:33":"Behold, I lay in Zion a stumbling stone and a rock of offense; and no one who believes in him will be disappointed.{Isaiah 8:14; 28:16}","10:1":"my heart's desire and my prayer to God is for Israel","10:2":"but not according to knowledge.","10:3":"and seeking to establish their own righteousness","10:4":"completion","10:5":"The one who does them will live by them.{Leviticus 18:5}","10:6":"Don't say in your heart, 'Who will ascend into heaven?'{Deuteronomy 30:12} (that is, to bring Christ down);,But the righteousness which is of faith speaketh on this wise, Say not in thine heart, Who shall ascend into heaven? (that is, to bring Christ down from above:),,,,,,,,","10:7":"'Who will descend into the abyss?'{Deuteronomy 30:13} (that is","10:8":"the word of faith","10:9":"and believe in your heart that God raised him from the dead","10:10":"one believes unto righteousness; and with the mouth confession is made unto salvation.","10:11":"Whoever believes in him will not be disappointed.{Isaiah 28:16}","10:12":"and is rich to all who call on him.","10:13":"Whoever will call on the name of the Lord will be saved.{Joel 2:32}","10:14":"How then shall they call on him in whom they have not believed? and how shall they believe in him of whom they have not heard? and how shall they hear without a preacher?","10:15":"And how shall they preach","10:16":"Lord, who has believed our report?{Isaiah 53:1}","10:17":"and hearing by the word of God.","10:18":"didn't they hear?  Yes","10:19":"didn't Israel know?  First Moses says","10:20":"and says","10:21":"All day long I stretched out my hands to a disobedient and contrary people.{Isaiah 65:2}","11:1":"did God reject his people?  May it never be! For I also am an Israelite","11:2":"which he foreknew.  Or don't you know what the Scripture says about Elijah?  How he pleads with God against Israel:","11:3":"14}","11:4":"But what saith the answer of God unto him? I have reserved to myself seven thousand men","11:5":"Even so then at this present time also there is a remnant according to the election of grace.","11:6":"then it is no longer of works; otherwise grace is no longer grace.  But if it is of works","11:7":"that he didn't obtain","11:8":"God gave them a spirit of stupor, eyes that they should not see, and ears that they should not hear, to this very day.{Deuteronomy 29:4; Isaiah 29:10}","11:9":"Let their table be made a snare, and a trap, a stumbling block, and a retribution to them.,And David saith, Let their table be made a snare, and a trap, and a stumblingblock, and a recompence unto them:,,,,,,,,","11:10":"that they may not see. Bow down their back always.{Psalm 69:22,23},Let their eyes be darkened, that they may not see, and bow down their back alway.,,,,,,,,","11:11":"did they stumble that they might fall?  May it never be! But by their fall salvation has come to the Gentiles","11:12":"and their loss the riches of the Gentiles; how much more their fullness?","11:13":"I glorify my ministry;","11:14":"and may save some of them.","11:15":"what would their acceptance be","11:16":"so is the lump.  If the root is holy","11:17":"and you","11:18":"it is not you who support the root","11:19":"Branches were broken off, that I might be grafted in.","11:20":"and you stand by your faith.  Don't be conceited","11:21":"neither will he spare you.","11:22":"severity; but toward you","11:23":"if they don't continue in their unbelief","11:24":"and were grafted contrary to nature into a good olive tree","11:25":"brothers","11:26":"There will come out of Zion the Deliverer, and he will turn away ungodliness from Jacob.,And so all Israel shall be saved: as it is written, There shall come out of Sion the Deliverer, and shall turn away ungodliness from Jacob:,,,,,,,,","11:27":"when I will take away their sins.{Isaiah 59:20-21; 27:9; Jeremiah 31:33-34},For this is my covenant unto them, when I shall take away their sins.,,,,,,,,","11:28":"they are enemies for your sake. But concerning the election","11:29":"For the gifts and calling of God are without repentance.","11:30":"but now have obtained mercy by their disobedience","11:31":"that by the mercy shown to you they may also obtain mercy.","11:32":"that he might have mercy on all.","11:33":"and his ways past tracing out!","11:34":"For who hath known the mind of the Lord? or who hath been his counsellor?","11:35":"Or who hath first given to him","11:36":"and through him","12:1":"brothers","12:2":"but be transformed by the renewing of your mind","12:3":"through the grace that was given me","12:4":"and all the members don't have the same function","12:5":"who are many","12:6":"if prophecy","12:7":"let us give ourselves to service; or he who teaches","12:8":"to his exhorting:  he who gives","12:9":"Let love be without dissimulation. Abhor that which is evil; cleave to that which is good.","12:10":"Be kindly affectioned one to another with brotherly love; in honour preferring one another;","12:11":"Not slothful in business; fervent in spirit; serving the Lord;","12:12":"Rejoicing in hope; patient in tribulation; continuing instant in prayer;","12:13":"Distributing to the necessity of saints; given to hospitality.","12:14":"and don't curse.","12:15":"Rejoice with them that do rejoice","12:16":"but associate with the humble. Don't be wise in your own conceits.","12:17":"Recompense to no man evil for evil. Provide things honest in the sight of all men.","12:18":"as much as it is up to you","12:19":"beloved","12:20":"Therefore if thine enemy hunger","12:21":"but overcome evil with good.","13:1":"for there is no authority except from God","13:2":"withstands the ordinance of God; and those who withstand will receive to themselves judgment.","13:3":"but to the evil. Do you desire to have no fear of the authority? Do that which is good","13:4":"be afraid","13:5":"not only because of the wrath","13:6":"for they are servants of God's service","13:7":"Render therefore to all their dues: tribute to whom tribute is due; custom to whom custom; fear to whom fear; honour to whom honour.","13:8":"except to love one another; for he who loves his neighbor has fulfilled the law.","13:9":"You shall not commit adultery, You shall not murder, You shall not steal, You shall not give false testimony, You shall not covet,{TR adds You shall not give false testimony,}{Exodus 20:13-15","13:10":"Love worketh no ill to his neighbour: therefore love is the fulfilling of the law.","13:11":"knowing the time","13:12":"and the day is near.  Let's therefore throw off the works of darkness","13:13":"as in the day; not in reveling and drunkenness","13:14":"and make no provision for the flesh","14:1":"but not for disputes over opinions.","14:2":"but he who is weak eats only vegetables.","14:3":"for God has accepted him.","14:4":"he will be made to stand","14:5":"One man esteemeth one day above another: another esteemeth every day alike. Let every man be fully persuaded in his own mind.","14:6":"observes it to the Lord; and he who does not observe the day","14:7":"and none dies to himself.","14:8":"we live to the Lord.  Or if we die","14:9":"rose","14:10":"why do you judge your brother?  Or you again","14:11":"'As I live,' says the Lord, 'to me every knee will bow.  Every tongue will confess to God.'{Isaiah 45:23}","14:12":"So then every one of us shall give account of himself to God.","14:13":"but judge this rather","14:14":"and am persuaded in the Lord Jesus","14:15":"you walk no longer in love.  Don't destroy with your food him for whom Christ died.","14:16":"","14:17":"but righteousness","14:18":"For he that in these things serveth Christ is acceptable to God","14:19":"let us follow after things which make for peace","14:20":"however it is evil for that man who creates a stumbling block by eating.","14:21":"drink wine","14:22":"Hast thou faith? have it to thyself before God. Happy is he that condemneth not himself in that thing which he alloweth.","14:23":"because it isn't of faith; and whatever is not of faith is sin. (14:24) Now to him who is able to establish you according to my Good News and the preaching of Jesus Christ","15:1":"and not to please ourselves.","15:2":"to be building him up.","15:3":"as it is written","15:4":"that through patience and through encouragement of the Scriptures we might have hope.","15:5":"","15:6":"That ye may with one mind and one mouth glorify God","15:7":"even as Christ also accepted you","15:8":"that he might confirm the promises given to the fathers","15:9":"Therefore will I give praise to you among the Gentiles, and sing to your name.{2 Samuel 22:50; Psalm 18:49}","15:10":"Rejoice, you Gentiles, with his people.{Deuteronomy 32:43}","15:11":"Praise the Lord, all you Gentiles!  Let all the peoples praise him.{Psalm 117:1}","15:12":"Isaiah says","15:13":"that you may abound in hope","15:14":"my brothers{The word for brothers here and where context allows may also be correctly translated brothers and sisters or siblings.}","15:15":"as reminding you","15:16":"serving as a priest the Good News of God","15:17":"I have therefore whereof I may glory through Jesus Christ in those things which pertain to God.","15:18":"for the obedience of the Gentiles","15:19":"in the power of God's Spirit; so that from Jerusalem","15:20":"making it my aim to preach the Good News","15:21":"as it is written","15:22":"","15:23":"no longer having any place in these regions","15:24":"I will come to you. For I hope to see you on my journey","15:25":"I say","15:26":"For it hath pleased them of Macedonia and Achaia to make a certain contribution for the poor saints which are at Jerusalem.","15:27":"it has been their good pleasure","15:28":"and have sealed to them this fruit","15:29":"when I come to you","15:30":"brothers","15:31":"and that my service which I have for Jerusalem may be acceptable to the saints;","15:32":"and together with you","15:33":"Now the God of peace be with you all. Amen.","16:1":"our sister","16:2":"in a way worthy of the saints","16:3":"my fellow workers in Christ Jesus","16:4":"laid down their own necks; to whom not only I give thanks","16:5":"my beloved","16:6":"who labored much for us.","16:7":"my relatives and my fellow prisoners","16:8":"my beloved in the Lord.","16:9":"our fellow worker in Christ","16:10":"the approved in Christ.  Greet those who are of the household of Aristobulus.","16:11":"my kinsman.  Greet them of the household of Narcissus","16:12":"who labor in the Lord. Greet Persis","16:13":"the chosen in the Lord","16:14":"Phlegon","16:15":"Nereus and his sister","16:16":"Salute one another with an holy kiss. The churches of Christ salute you.","16:17":"brothers","16:18":"Jesus Christ","16:19":"but innocent in that which is evil.","16:20":"And the God of peace shall bruise Satan under your feet shortly. The grace of our Lord Jesus Christ be with you. Amen.","16:21":"my fellow worker","16:22":"Tertius","16:23":"my host and host of the whole assembly","16:24":"The grace of our Lord Jesus Christ be with you all. Amen.","16:25":"Now to him that is of power to stablish you according to my gospel","16:26":"But now is made manifest","16:27":"and numbers these verses 16:25-27.}"}