{"1:1":"that there was a famine in the land.  A certain man of Bethlehem Judah went to sojourn in the country of Moab","1:2":"and the name of his wife Naomi","1:3":"Naomi's husband","1:4":"and the name of the other Ruth: and they lived there about ten years.","1:5":"And Mahlon and Chilion died also both of them; and the woman was left of her two sons and her husband.","1:6":"that she might return from the country of Moab:  for she had heard in the country of Moab how that Yahweh had visited his people in giving them bread.","1:7":"and her two daughters-in-law with her; and they went on the way to return to the land of Judah.","1:8":"Go","1:9":"each of you in the house of her husband.  Then she kissed them","1:10":"No","1:11":"Turn again","1:12":"my daughters","1:13":"my daughters","1:14":"and wept again:  and Orpah kissed her mother-in-law","1:15":"Behold","1:16":"Don't entreat me to leave you, and to return from following after you, for where you go, I will go; and where you lodge, I will lodge; your people shall be my people, and your God my God;,And Ruth said, Entreat me not to leave thee, or to return from following after thee: for whither thou goest, I will go; and where thou lodgest, I will lodge: thy people shall be my people, and thy God my God:,  וַתֹּאמֶר רוּת אַל־תִּפְגְּעִי־בִי לְעָזְבֵךְ לָשׁוּב מֵאַחֲרָיִךְ כִּי אֶל־אֲשֶׁר תֵּלְכִי אֵלֵךְ וּבַאֲשֶׁר תָּלִינִי אָלִין עַמֵּךְ עַמִּי וֵאלֹהַיִךְ אֱלֹהָי׃ ‬,And Ruth said: ‘Entreat me not to leave thee, and to return from following after thee; for whither thou goest, I will go; and where thou lodgest, I will lodge; thy people shall be my people, and thy God my God;,εἶπεν δὲ ρουθ μὴ ἀπαντήσαι ἐμοὶ τοῦ καταλιπεῖν σε ἢ ἀποστρέψαι ὄπισθέν σου ὅτι σὺ ὅπου ἐὰν πορευθῇς πορεύσομαι καὶ οὗ ἐὰν αὐλισθῇς αὐλισθήσομαι ὁ λαός σου λαός μου καὶ ὁ θεός σου θεός μου,And Ruth said, Intreat me not to leave thee, or to return from following thee; for whithersoever thou goest, I will go, and wheresoever thou lodgest, I will lodge; thy people shall be my people, and thy God my God.,,,,","1:17":"will I die","1:18":"she left off speaking to her.","1:19":"when they were come to Bethlehem","1:20":"Don't call me Naomi, call me Mara; for the Almighty has dealt very bitterly with me.,And she said unto them, Call me not Naomi, call me Mara: for the Almighty hath dealt very bitterly with me.,  וַתֹּאמֶר אֲלֵיהֶן אַל־תִּקְרֶאנָה לִי נָעֳמִי קְרֶאןָ לִי מָרָא כִּי־הֵמַר שַׁדַּי לִי מְאֹד׃ ‬,And she said unto them: Call me not Naomi [That is","1:21":"and Yahweh has brought me home again empty; why do you call me Naomi","1:22":"and Ruth the Moabitess","2:1":"a mighty man of wealth","2:2":"Let me now go to the field","2:3":"and came and gleaned in the field after the reapers: and she happened to come to the portion of the field belonging to Boaz","2:4":"Boaz came from Bethlehem","2:5":"Whose young lady is this?","2:6":"It is the Moabite lady who came back with Naomi out of the country of Moab:","2:7":"Please let me glean and gather after the reapers among the sheaves.  So she came","2:8":"Don't you hear","2:9":"and go after them: haven't I charged the young men that they shall not touch you? and when you are thirsty","2:10":"and bowed herself to the ground","2:11":"It has fully been shown me","2:12":"and a full reward be given you of Yahweh","2:13":"Let me find favor in your sight","2:14":"Come here","2:15":"Boaz commanded his young men","2:16":"and leave it","2:17":"and it was about an ephah of barley.","2:18":"and went into the city; and her mother-in-law saw what she had gleaned:  and she brought forth and gave to her that which she had left after she was sufficed.","2:19":"Where have you gleaned today? and where have you worked? blessed be he who did take knowledge of you. She shown her mother-in-law with whom she had worked","2:20":"Blessed be he of Yahweh","2:21":"Yes","2:22":"It is good","2:23":"to glean to the end of barley harvest and of wheat harvest; and she lived with her mother-in-law.","3:1":"My daughter","3:2":"with whose maidens you were? Behold","3:3":"and anoint you","3:4":"when he lies down","3:5":"All that you say I will do.","3:6":"and did according to all that her mother-in-law told her.","3:7":"and his heart was merry","3:8":"that the man was afraid","3:9":"Who are you?  She answered","3:10":"Blessed are you by Yahweh","3:11":"my daughter","3:12":"And now it is true that I am thy near kinsman: howbeit there is a kinsman nearer than I.","3:13":"and it shall be in the morning","3:14":"Let it not be known that the woman came to the threshing floor.","3:15":"Bring the mantle that is on you","3:16":"she said","3:17":"These six [measures] of barley gave he me; for he said","3:18":"Sit still, my daughter, until you know how the matter will fall; for the man will not rest, until he has finished the thing this day.","4:1":"and sat him down there: and behold","4:2":"and said","4:3":"Naomi","4:4":"saying","4:5":"What day you buy the field of the hand of Naomi","4:6":"I can't redeem it for myself","4:7":"to confirm all things: a man drew off his shoe","4:8":"Buy it for yourself. He drew off his shoe.","4:9":"and to all the people","4:10":"the wife of Mahlon","4:11":"and the elders","4:12":"whom Tamar bore to Judah","4:13":"and she became his wife; and he went in to her","4:14":"Blessed be Yahweh","4:15":"and sustain you in your old age","4:16":"and laid it in her bosom","4:17":"saying","4:18":"","4:19":"and Ram became the father of Amminadab","4:20":"and Nahshon became the father of Salmon","4:21":"and Boaz became the father of Obed","4:22":"and Jesse became the father of David."}