{"1:1":"which is Solomon's. Beloved","1:2":"Let him kiss me with the kisses of his mouth: for thy love is better than wine.","1:3":"therefore the virgins love you.","1:4":"Draw me","1:5":"but lovely","1:6":"because the sun has scorched me. My mother's sons were angry with me.  They made me keeper of the vineyards.  I haven't kept my own vineyard.","1:7":"you whom my soul loves","1:8":"most beautiful among women","1:9":"my love","1:10":"your neck with strings of jewels.","1:11":"with studs of silver. Beloved","1:12":"my perfume spread its fragrance.","1:13":"that lies between my breasts.","1:14":"My beloved is unto me as a cluster of camphire in the vineyards of Engedi.","1:15":"you are beautiful","1:16":"you are beautiful","1:17":"The beams of our house are cedar","2:1":"a lily of the valleys.  Lover","2:2":"so is my love among the daughters. Beloved","2:3":"so is my beloved among the sons.  I sat down under his shadow with great delight","2:4":"He brought me to the banqueting house","2:5":"refresh me with apples; For I am faint with love.","2:6":"His left hand is under my head","2:7":"daughters of Jerusalem","2:8":"he comes","2:9":"he stands behind our wall!  He looks in at the windows.  He glances through the lattice.","2:10":"and said to me","2:11":"behold","2:12":"and the voice of the turtledove is heard in our land.","2:13":"my love","2:14":"In the hiding places of the mountainside","2:15":"the little foxes that spoil the vineyards; for our vineyards are in blossom.  Beloved","2:16":"and I am his.  He browses among the lilies.","2:17":"and the shadows flee away","3:1":"I sought him whom my soul loves. I sought him","3:2":"and go about the city; in the streets and in the squares I will seek him whom my soul loves. I sought him","3:3":"The watchmen that go about the city found me: to whom I said","3:4":"when I found him whom my soul loves. I held him","3:5":"daughters of Jerusalem","3:6":"perfumed with myrrh and frankincense","3:7":"it is Solomon's carriage!  Sixty mighty men are around it","3:8":"and are expert in war. Every man has his sword on his thigh","3:9":"King Solomon made himself a chariot of the wood of Lebanon.","3:10":"its bottom of gold","3:11":"you daughters of Zion","4:1":"you are beautiful","4:2":"which have come up from the washing","4:3":"Thy lips are like a thread of scarlet","4:4":"whereon a thousand shields hang","4:5":"which feed among the lilies.","4:6":"and the shadows flee away","4:7":"my love.  There is no spot in you.","4:8":"my bride","4:9":"my sister","4:10":"my sister","4:11":"my bride","4:12":"my bride; a locked up spring","4:13":"with precious fruits: henna with spikenard plants","4:14":"calamus and cinnamon","4:15":"a well of living waters","4:16":"north wind; and come","5:1":"my sister","5:2":"but my heart was awake.  It is the voice of my beloved who knocks:  Open to me, my sister, my love, my dove, my undefiled; for my head is filled with dew, and my hair with the dampness of the night.","5:3":"must I put it on? I have washed my feet.  Indeed","5:4":"My beloved put in his hand by the hole of the door","5:5":"my fingers with liquid myrrh","5:6":"but I didn't find him.  I called him","5:7":"The watchmen that went about the city found me","5:8":"daughters of Jerusalem","5:9":"you fairest among women?  How is your beloved better than another beloved","5:10":"My beloved is white and ruddy","5:11":"black as a raven.","5:12":"washed with milk","5:13":"dropping liquid myrrh.","5:14":"His hands are as gold rings set with the beryl: his belly is as bright ivory overlaid with sapphires.","5:15":"excellent as the cedars.","5:16":"he is altogether lovely. This is my beloved","6:1":"you fairest among women? Where has your beloved turned","6:2":"to the beds of spices","6:3":"and my beloved is mine.  He browses among the lilies","6:4":"my love","6:5":"for they have overcome me. Your hair is like a flock of goats","6:6":"which have come up from the washing; of which every one has twins; none is bereaved among them.","6:7":"As a piece of a pomegranate are thy temples within thy locks.","6:8":"eighty concubines","6:9":"my perfect one","6:10":"beautiful as the moon","6:11":"to see the green plants of the valley","6:12":"my desire set me with my royal people's chariots.  Friends","6:13":"return","7:1":"prince's daughter! Your rounded thighs are like jewels","7:2":"no mixed wine is wanting. Your waist is like a heap of wheat","7:3":"that are twins of a roe.","7:4":"Thy neck is as a tower of ivory; thine eyes like the fishpools in Heshbon","7:5":"Thine head upon thee is like Carmel","7:6":"love","7:7":"your stature","7:8":"I will climb up into the palm tree.  I will take hold of its fruit.  Let your breasts be like clusters of the vine","7:9":"that goes down smoothly for my beloved","7:10":"I am my beloved's","7:11":"my beloved","7:12":"its blossom is open","7:13":"new and old","8:1":"who sucked the breasts of my mother!  If I found you outside","8:2":"bringing you into my mother's house","8:3":"His left hand should be under my head","8:4":"daughters of Jerusalem","8:5":"leaning on her beloved?  Under the apple tree I aroused you. There your mother conceived you.  There she was in labor and bore you.","8:6":"as a seal on your arm; for love is strong as death.  Jealousy is as cruel as Sheol. Its flashes are flashes of fire","8:7":"neither can floods drown it. If a man would give all the wealth of his house for love","8:8":"We have a little sister","8:9":"we will build on her a turret of silver. if she is a door","8:10":"and my breasts like towers","8:11":"Solomon had a vineyard at Baalhamon; he let out the vineyard unto keepers; every one for the fruit thereof was to bring a thousand pieces of silver.","8:12":"Solomon; two hundred for those who tend its fruit.  Lover","8:13":"with friends in attendance","8:14":"my beloved!  Be like a gazelle or a young stag on the mountains of spices!"}