{"1:1":"in the second year of Darius","1:2":"ὠργίσθη κύριος ἐπὶ τοὺς πατέρας ὑμῶν ὀργὴν μεγάλην","1:3":"' says Yahweh of Armies","1:4":"to whom the former prophets proclaimed","1:5":"where are they?  And the prophets","1:6":"which I commanded my servants the prophets","1:7":"which is the month Shebat","1:8":"","1:9":"'My lord","1:10":"They are the ones Yahweh has sent to go back and forth through the earth.","1:11":"and said","1:12":"O Yahweh of Armies, how long will you not have mercy on Jerusalem and on the cities of Judah, against which you have had indignation these seventy years?","1:13":"And the LORD answered the angel that talked with me with good words and comfortable words.","1:14":"Proclaim, saying, 'Thus says Yahweh of Armies:  I am jealous for Jerusalem and for Zion with a great jealousy.","1:15":"but they added to the calamity.,And I am very sore displeased with the heathen that are at ease: for I was but a little displeased, and they helped forward the affliction., וְקֶצֶף גָּדוֹל אֲנִי קֹצֵף עַל־הַגּוֹיִם הַשַּׁאֲנַנִּים אֲשֶׁר אֲנִי קָצַפְתִּי מְּעָט וְהֵמָּה עָזְרוּ לְרָעָה׃ ‬,and I am very sore displeased with the nations that are at ease; for I was but a little displeased, and they helped for evil.,καὶ ὀργὴν μεγάλην ἐγὼ ὀργίζομαι ἐπὶ τὰ ἔθνη τὰ συνεπιτιθέμενα ἀνθ' ὧν ἐγὼ μὲν ὠργίσθην ὀλίγα αὐτοὶ δὲ συνεπέθεντο εἰς κακά,And I am very angry with the heathen that combine to attack her: forasmuch as I indeed was a little angry, but they combined to attack her for evil.,,,,","1:16":"and a line shall be stretched forth over Jerusalem.'","1:17":"and Yahweh will again comfort Zion","1:18":"and saw","1:19":"What are these? He answered me","1:20":"And the LORD shewed me four carpenters.","1:21":"What are these coming to do?  He said","2:1":"and saw","2:2":"Where are you going?  He said to me","2:3":"the angel who talked with me went forth","2:4":"Run, speak to this young man, saying, 'Jerusalem will be inhabited as villages without walls, because of the multitude of men and livestock in it.,And said unto him, Run, speak to this young man, saying, Jerusalem shall be inhabited as towns without walls for the multitude of men and cattle therein:, וַיֹּאמֶר אֵלָו‪[Q]‬‪[q]‬ רֻץ דַּבֵּר אֶל־הַנַּעַר הַלָּז לֵאמֹר פְּרָזוֹת תֵּשֵׁב יְרוּשָׁלִַם מֵרֹב אָדָם וּבְהֵמָה בְּתוֹכָהּ׃ ‬,and said unto him: Run","2:5":"' says Yahweh","2:6":"' says Yahweh; 'for I have spread you abroad as the four winds of the sky","2:7":"Zion!  Escape","2:8":"For thus saith the LORD of hosts; After the glory hath he sent me unto the nations which spoiled you: for he that toucheth you toucheth the apple of his eye.","2:9":"behold","2:10":"daughter of Zion; for","2:11":"and shall be my people; and I will dwell in the midst of you","2:12":"and will again choose Jerusalem.","2:13":"all flesh","3:1":"and Satan standing at his right hand to be his adversary.","3:2":"Yahweh rebuke you, Satan!  Yes, Yahweh who has chosen Jerusalem rebuke you!  Isn't this a burning stick plucked out of the fire?","3:3":"and was standing before the angel.","3:4":"saying","3:5":"Let them set a clean turban on his head. So they set a clean turban on his head","3:6":"saying","3:7":"and if thou wilt keep My charge","3:8":"Joshua the high priest","3:9":"behold","3:10":"' says Yahweh of Armies","4:1":"and wakened me","4:2":"What do you see?  I said","4:3":"one on the right side of the bowl","4:4":"saying","4:5":"Don't you know what these are?  I said","4:6":"saying","4:7":"great mountain?  Before Zerubbabel you are a plain; and he will bring out the capstone with shouts of 'Grace","4:8":"saying","4:9":"αἱ χεῖρες ζοροβαβελ ἐθεμελίωσαν τὸν οἶκον τοῦτον καὶ αἱ χεῖρες αὐτοῦ ἐπιτελέσουσιν αὐτόν καὶ ἐπιγνώσῃ διότι κύριος παντοκράτωρ ἐξαπέσταλκέν με πρὸς σέ","4:10":"who despises the day of small things? For these seven shall rejoice","4:11":"What are these two olive trees on the right side of the lampstand and on the left side of it?","4:12":"What are these two olive branches, which are beside the two golden spouts, that pour the golden oil out of themselves?","4:13":"Don't you know what these are? I said","4:14":"These are the two anointed ones who stand by the Lord of the whole earth.","5:1":"and saw","5:2":"What do you see?  I answered","5:3":"This is the curse that goes out over the surface of the whole land; for everyone who steals shall be cut off according to it on the one side; and everyone who swears falsely shall be cut off according to it on the other side.,Then said he unto me, This is the curse that goeth forth over the face of the whole earth: for every one that stealeth shall be cut off as on this side according to it; and every one that sweareth shall be cut off as on that side according to it., וַיֹּאמֶר אֵלַי זֹאת הָאָלָה הַיּוֹצֵאת עַל־פְּנֵי כָל־הָאָרֶץ כִּי כָל־הַגֹּנֵב מִזֶּה כָּמוֹהָ נִקָּה וְכָל־הַנִּשְׁבָּע מִזֶּה כָּמוֹהָ נִקָּה׃ ‬,Then said he unto me: This is the curse that goeth forth over the face of the whole land; for every one that stealeth shall be swept away on the one side like it; and every one that sweareth shall be swept away on the other side like it.","5:4":"says Yahweh of Armies, and it will enter into the house of the thief","5:5":"and said to me","5:6":"What is it?  He said","5:7":"a talent{A talent is a weight of about 34 kilograms or 75 pounds.} of lead was lifted up); and this is a woman sitting in the midst of the ephah basket.,And, behold, there was lifted up a talent of lead: and this is a woman that sitteth in the midst of the ephah., וְהִנֵּה כִּכַּר עֹפֶרֶת נִשֵּׂאת וְזֹאת אִשָּׁה אַחַת יוֹשֶׁבֶת בְּתוֹךְ הָאֵיפָה׃ ‬,and, behold, there was lifted up a round piece of lead and this is a woman sitting in the midst of the measure.","5:8":"This is Wickedness; and he threw her down into the midst of the ephah basket; and he threw the weight of lead on its mouth.","5:9":"and saw","5:10":"Where are these carrying the ephah basket?","5:11":"To build her a house in the land of Shinar. When it is prepared, she will be set there in her own place.","6:1":"and saw","6:2":"In the first chariot were red horses; and in the second chariot black horses;","6:3":"all of them powerful.","6:4":"What are these, my lord?","6:5":"These are the four winds of the sky, which go forth from standing before the Lord of all the earth.,And the angel answered and said unto me, These are the four spirits of the heavens, which go forth from standing before the LORD of all the earth., וַיַּעַן הַמַּלְאָךְ וַיֹּאמֶר אֵלָי אֵלֶּה אַרְבַּע רֻחוֹת הַשָּׁמַיִם יוֹצְאוֹת מֵהִתְיַצֵּב עַל־אֲדוֹן כָּל־הָאָרֶץ׃ ‬,And the angel answered and said unto me: These chariots go forth to the four winds of heaven","6:6":"","6:7":"and sought to go that they might walk back and forth through the earth:  and he said","6:8":"and spoke to me","6:9":"saying","6:10":"even of Heldai","6:11":"take silver and gold","6:12":"saying","6:13":"and shall sit and rule on his throne; and he shall be a priest on his throne; and the counsel of peace shall be between them both.","6:14":"and to Tobijah","6:15":"if you will diligently obey the voice of Yahweh your God.'","7:1":"the month of Chislev.","7:2":"and their men","7:3":"and to the prophets","7:4":"saying","7:5":"","7:6":"and when you drink","7:7":"when Jerusalem was inhabited and in prosperity","7:8":"saying","7:9":"saying: Execute true judgment","7:10":"nor the fatherless","7:11":"and turned their backs","7:12":"they made their hearts as hard as flint","7:13":"as he called","7:14":"But I scattered them with a whirlwind among all the nations whom they knew not. Thus the land was desolate after them","8:1":"Again the word of the LORD of hosts came to me","8:2":"Thus saith the LORD of hosts; I was jealous for Zion with great jealousy","8:3":"Thus saith the LORD; I am returned unto Zion","8:4":"","8:5":"","8:6":"Thus saith the LORD of hosts; If it be marvellous in the eyes of the remnant of this people in these days","8:7":"","8:8":"and they will dwell in the midst of Jerusalem; and they will be my people","8:9":"","8:10":"nor any wages for an animal; neither was there any peace to him who went out or came in","8:11":"says Yahweh of Armies.,But now I will not be unto the residue of this people as in the former days, saith the LORD of hosts., וְעַתָּה לֹא כַיָּמִים הָרִאשֹׁנִים אֲנִי לִשְׁאֵרִית הָעָם הַזֶּה נְאֻם יְהוָה צְבָאוֹת׃ ‬,But now I will not be unto the remnant of this people as in the former days, saith the LORD of hosts.,καὶ νῦν οὐ κατὰ τὰς ἡμέρας τὰς ἔμπροσθεν ἐγὼ ποιῶ τοῖς καταλοίποις τοῦ λαοῦ τούτου λέγει κύριος παντοκράτωρ,But now I will not do to the remnant of this people according to the former days, saith the Lord Almighty.,,,,","8:12":"","8:13":"as you were a curse among the nations","8:14":"and I didn't repent;,For thus saith the LORD of hosts; As I thought to punish you, when your fathers provoked me to wrath, saith the LORD of hosts, and I repented not:, כִּי כֹה אָמַר יְהוָה צְבָאוֹת כַּאֲשֶׁר זָמַמְתִּי‪[U]‬ לְהָרַע לָכֶם בְּהַקְצִיף אֲבֹתֵיכֶם אֹתִי אָמַר יְהוָה צְבָאוֹת וְלֹא נִחָמְתִּי׃ ‬,For thus saith the LORD of host: As I purposed to do evil unto you, when your fathers provoked Me, saith the LORD of hosts, and I repented not;,διότι τάδε λέγει κύριος παντοκράτωρ ὃν τρόπον διενοήθην τοῦ κακῶσαι ὑμᾶς ἐν τῷ παροργίσαι με τοὺς πατέρας ὑμῶν λέγει κύριος παντοκράτωρ καὶ οὐ μετενόησα,For thus saith the Lord Almighty; As I took counsel to afflict you when your fathers provoked me, saith the Lord Almighty, and I repented not:,,,,","8:15":"So again have I thought in these days to do well unto Jerusalem and to the house of Judah: fear ye not.","8:16":"","8:17":"and love no false oath:  for all these are things that I hate","8:18":"And the word of the LORD of hosts came unto me","8:19":"Thus saith the LORD of hosts; The fast of the fourth month","8:20":"","8:21":"saying","8:22":"many peoples and strong nations will come to seek Yahweh of Armies in Jerusalem","8:23":"Thus saith the LORD of hosts; In those days it shall come to pass","9:1":"and will rest upon Damascus; for the eye of man and of all the tribes of Israel is toward Yahweh;","9:2":"also","9:3":"and heaped up silver like the dust","9:4":"the Lord will dispossess her","9:5":"and fear; Gaza also","9:6":"and I will cut off the pride of the Philistines.","9:7":"and his abominations from between his teeth; and he also will be a remnant for our God; and he will be as a chieftain in Judah","9:8":"that none pass through or return; and no oppressor will pass through them any more: for now I have seen with my eyes.","9:9":"daughter of Zion!  Shout","9:10":"and the horse from Jerusalem; and the battle bow will be cut off; and he will speak peace to the nations:  and his dominion will be from sea to sea","9:11":"because of the blood of your covenant","9:12":"you prisoners of hope!  Even today I declare that I will restore double to you.","9:13":"Zion","9:14":"and will go with whirlwinds of the south.","9:15":"and roar as through wine; and they will be filled like bowls","9:16":"lifted on high over his land.","9:17":"and how great is his beauty! Grain will make the young men flourish","10:1":"Yahweh who makes storm clouds","10:2":"and the diviners have seen a lie; and they have told false dreams.  They comfort in vain. Therefore they go their way like sheep.  They are oppressed","10:3":"and I will punish the male goats; For Yahweh of Armies has visited his flock","10:4":"from him the nail","10:5":"treading down muddy streets in the battle; and they shall fight","10:6":"","10:7":"and their heart will rejoice as through wine; yes","10:8":"and gather them; for I have redeemed them; and they will increase as they have increased.","10:9":"and will return.","10:10":"and gather them out of Assyria; and I will bring them into the land of Gilead and Lebanon; and there won't be room enough for them.","10:11":"and will strike the waves in the sea","10:12":"says Yahweh.,And I will strengthen them in the LORD; and they shall walk up and down in his name, saith the LORD., וְגִבַּרְתִּים בַּיהוָה וּבִשְׁמוֹ יִתְהַלָּכוּ נְאֻם יְהוָה׃ ס ‬,And I will strengthen them in the LORD; And they shall walk up and down in His name, Saith the LORD.,καὶ κατισχύσω αὐτοὺς ἐν κυρίῳ θεῷ αὐτῶν καὶ ἐν τῷ ὀνόματι αὐτοῦ κατακαυχήσονται λέγει κύριος,And I will strengthen them in the Lord their God; and they shall boast in his name, saith the Lord.,,,,","11:1":"Lebanon","11:2":"fir tree","11:3":"There is a voice of the howling of the shepherds; for their glory is spoiled: a voice of the roaring of young lions; for the pride of Jordan is spoiled.","11:4":"τάδε λέγει κύριος παντοκράτωρ ποιμαίνετε τὰ πρόβατα τῆς σφαγῆς","11:5":"and go unpunished. Those who sell them say","11:6":"says Yahweh; but","11:7":"especially the oppressed of the flock.  I took for myself two staffs. The one I called Favor, and the other I called Union, and I fed the flock.","11:8":"and their soul also loathed me.","11:9":"I will not feed you.  That which dies, let it die; and that which is to be cut off, let it be cut off; and let those who are left eat each other's flesh.","11:10":"and cut it apart","11:11":"And it was broken in that day: and so the poor of the flock that waited upon me knew that it was the word of the LORD.","11:12":"If you think it best, give me my wages; and if not, keep them.  So they weighed for my wages thirty pieces of silver.","11:13":"Throw it to the potter, the handsome price that I was valued at by them!  I took the thirty pieces of silver","11:14":"even Union","11:15":"Take for yourself yet again the equipment of a foolish shepherd.,And the LORD said unto me, Take unto thee yet the instruments of a foolish shepherd., וַיֹּאמֶר יְהוָה אֵלָי עוֹד קַח־לְךָ כְּלִי רֹעֶה אֱוִלִי׃ ‬,And the LORD said unto me: Take unto thee yet the instruments of a foolish shepherd.","11:16":"behold","11:17":"and on his right eye. His arm will be completely withered","12:1":"who stretches out the heavens","12:2":"","12:3":"that I will make Jerusalem a burdensome stone for all the peoples.  All who burden themselves with it will be severely wounded","12:4":"says Yahweh, I will strike every horse with terror","12:5":"'The inhabitants of Jerusalem are my strength in Yahweh of Armies their God.'","12:6":"and like a flaming torch among sheaves; and they will devour all the surrounding peoples","12:7":"that the glory of the house of David and the glory of the inhabitants of Jerusalem not be magnified above Judah.","12:8":"and the house of David will be like God","12:9":"that I will seek to destroy all the nations that come against Jerusalem.","12:10":"and on the inhabitants of Jerusalem","12:11":"like the mourning of Hadadrimmon in the valley of Megiddon.","12:12":"every family apart; the family of the house of David apart","12:13":"and their wives apart; the family of the Shimeites apart","12:14":"every family apart","13:1":"","13:2":"says Yahweh of Armies","13:3":"when anyone still prophesies","13:4":"that the prophets will each be ashamed of his vision","13:5":"'I am no prophet","13:6":"'What are these wounds between your arms?' Then he will answer","13:7":"","13:8":"says Yahweh, two parts in it will be cut off and die; but the third will be left in it.","13:9":"and will refine them as silver is refined","14:1":"a day of Yahweh comes","14:2":"the houses rifled","14:3":"as when he fought in the day of battle.","14:4":"which is before Jerusalem on the east; and the Mount of Olives will be split in two","14:5":"you shall flee","14:6":"that there will not be light","14:7":"and not night; but it will come to pass","14:8":"that living waters will go out from Jerusalem; half of them toward the eastern sea","14:9":"and his name one.","14:10":"from Geba to Rimmon south of Jerusalem; and she will be lifted up","14:11":"and there will be no more curse; but Jerusalem will dwell safely.","14:12":"and their eyes will consume away in their sockets","14:13":"that a great panic from Yahweh will be among them; and they will lay hold everyone on the hand of his neighbor","14:14":"and silver","14:15":"of the mule","14:16":"Yahweh of Armies","14:17":"that whoever of all the families of the earth doesn't go up to Jerusalem to worship the King","14:18":"and doesn't come","14:19":"and the punishment of all the nations that don't go up to keep the feast of tents.","14:20":"HOLY TO YAHWEH; and the pots in Yahweh's house will be like the bowls before the altar.","14:21":"every pot in Jerusalem and in Judah will be holy to Yahweh of Armies; and all those who sacrifice will come and take of them"}