{
  "book": "1-chronicles",
  "bookName": "1 Chronicles",
  "chapter": 26,
  "title": "Divisions of the Porters and Treasurers",
  "shortSummary": "1 Chronicles 26 details the organization and responsibilities of the Levite gatekeepers (porters) and treasurers in the temple service during King David's reign. It highlights the divisions among the Korhites and Merarites, the casting of lots for gate duties, and the stewardship of the temple treasures, emphasizing order and faithfulness in God's house.",
  "timeline": "c. 1000 BC - Reign of King David in Israel",
  "keyCharacters": [
    {
      "name": "Meshelemiah",
      "description": "A Korhite Levite, son of Kore, leader of one of the porter divisions responsible for temple gate duties."
    },
    {
      "name": "Obededom",
      "description": "A Levite whose family was blessed by God and entrusted with significant temple responsibilities, including gatekeeping and service."
    },
    {
      "name": "Shelomith",
      "description": "A descendant of Eliezer who, along with his brethren, was over all the treasures dedicated to the house of the LORD."
    },
    {
      "name": "Shebuel",
      "description": "Son of Gershom, grandson of Moses, appointed as ruler over the treasures of the house of God."
    }
  ],
  "definitions": [
    {
      "term": "Porters",
      "definition": "Levite gatekeepers assigned to guard and manage the entrances of the temple, ensuring order and security."
    },
    {
      "term": "Casting lots",
      "definition": "A biblical method of making decisions or assigning duties by chance, believed to reflect God's sovereign will."
    },
    {
      "term": "Treasures of the house of God",
      "definition": "Dedicated offerings, spoils, and valuables set apart for the maintenance and service of the temple."
    },
    {
      "term": "Korhites",
      "definition": "A clan of Levites descended from Korah, assigned specific temple duties including gatekeeping."
    }
  ],
  "outline": [
    {
      "heading": "Genealogy and Families of the Porters",
      "verseRange": "1 Chronicles 26:1-11",
      "description": "This section lists the descendants of Meshelemiah, Obededom, and Hosah, highlighting their strength and valor as Levite gatekeepers, showing God's blessing on faithful service."
    },
    {
      "heading": "Divisions and Duties of the Porters",
      "verseRange": "1 Chronicles 26:12-19",
      "description": "The Levite porters are assigned specific gates and shifts by casting lots, ensuring organized and fair distribution of temple responsibilities."
    },
    {
      "heading": "Stewards Over the Treasures",
      "verseRange": "1 Chronicles 26:20-28",
      "description": "Levitical families, including the descendants of Laadan and Gershom, are appointed to oversee the treasures dedicated to the LORD’s house, emphasizing faithful stewardship."
    },
    {
      "heading": "Officers and Mighty Men Among the Levites",
      "verseRange": "1 Chronicles 26:29-32",
      "description": "The chapter concludes by naming leaders and valiant men among the Levites who served as officers and judges, demonstrating God’s order in temple and national affairs."
    }
  ],
  "application": [
    "Trust in God’s blessing as seen in Obededom’s family, and seek to serve faithfully in whatever role God assigns.",
    "Embrace orderly service and submission to God’s appointed leaders, just as the Levites were organized by casting lots.",
    "Be faithful stewards of what God has entrusted to you, whether material possessions or spiritual gifts.",
    "Recognize the importance of godly leadership and accountability in both church and daily life."
  ],
  "keyVerses": [
    {
      "reference": "1 Chronicles 26:5",
      "text": "Ammiel the sixth, Issachar the seventh, Peulthai the eighth: for God blessed him.",
      "significance": "This verse highlights God's blessing on Obededom’s family, underscoring that faithful service in God's house brings divine favor."
    },
    {
      "reference": "1 Chronicles 26:13",
      "text": "And they cast lots, as well the small as the great, according to the house of their fathers, for every gate.",
      "significance": "This verse demonstrates the principle of divine guidance and fairness in assigning temple duties through casting lots."
    },
    {
      "reference": "1 Chronicles 26:20",
      "text": "And of the Levites, Ahijah was over the treasures of the house of God, and over the treasures of the dedicated things.",
      "significance": "It shows the importance of trustworthy stewardship over God’s dedicated possessions in the temple."
    },
    {
      "reference": "1 Chronicles 26:32",
      "text": "And his brethren, men of valour, were two thousand and seven hundred chief fathers, whom king David made rulers over the Reubenites, the Gadites, and the half tribe of Manasseh, for every matter pertaining to God, and affairs of the king.",
      "significance": "This verse reveals how God’s people were organized under godly leadership for both spiritual and civil governance."
    }
  ]
}