{
  "book": "1-corinthians",
  "bookName": "1 Corinthians",
  "chapter": 5,
  "title": "Church Discipline",
  "shortSummary": "In 1 Corinthians 5, Paul addresses a grievous case of sexual immorality within the Corinthian church and instructs the believers on the necessity of church discipline to maintain holiness. He emphasizes the importance of removing unrepentant sinners from the fellowship to protect the purity of the church and to bring about repentance and restoration.",
  "timeline": "c. AD 55 - Paul's First Letter to the Corinthians during his third missionary journey",
  "keyCharacters": [
    {
      "name": "Paul",
      "description": "The apostle writing this letter, addressing the Corinthian church with authority on matters of church discipline and holiness."
    },
    {
      "name": "The man guilty of fornication",
      "description": "A member of the Corinthian church who is involved in an incestuous relationship with his father's wife, serving as the central example of sin addressed in this chapter."
    },
    {
      "name": "The Corinthian believers",
      "description": "The church members who are called to respond to the sin in their midst with sorrow, discipline, and separation from the unrepentant offender."
    }
  ],
  "definitions": [
    {
      "term": "Fornication",
      "definition": "Sexual immorality or unlawful sexual intercourse, especially outside the bounds of marriage."
    },
    {
      "term": "Leaven",
      "definition": "A small amount of yeast used in bread-making, symbolizing how a little sin can spread and corrupt the entire community."
    },
    {
      "term": "Deliver unto Satan",
      "definition": "A phrase meaning to hand over a person to the realm outside the church's spiritual protection, often understood as excommunication for the purpose of repentance and eventual restoration."
    },
    {
      "term": "Old leaven",
      "definition": "A metaphor for the sinful nature or corrupting influence that must be removed to live a holy life."
    }
  ],
  "outline": [
    {
      "heading": "Condemnation of Immorality",
      "verseRange": "1 Corinthians 5:1-2",
      "description": "Paul rebukes the church for tolerating a blatant case of incestuous fornication and for their pride instead of mourning over the sin."
    },
    {
      "heading": "Paul’s Judgment and Authority",
      "verseRange": "1 Corinthians 5:3-5",
      "description": "Though absent physically, Paul exercises his apostolic authority to judge the offender and commands the church to discipline him for the sake of his ultimate salvation."
    },
    {
      "heading": "The Danger of Tolerating Sin",
      "verseRange": "1 Corinthians 5:6-8",
      "description": "Paul warns that boasting in sin is harmful, using the metaphor of leaven to illustrate how unrepented sin can corrupt the entire church, urging them to live in sincerity and truth."
    },
    {
      "heading": "Instructions on Association with Sinners",
      "verseRange": "1 Corinthians 5:9-13",
      "description": "Paul clarifies that while believers should not avoid all sinners in the world, they must not associate closely or share meals with unrepentant immoral believers to maintain the church’s purity."
    }
  ],
  "application": [
    "Confess and confront sin within the church community to maintain holiness and protect others from spiritual harm.",
    "Exercise church discipline with the goal of repentance and restoration, not merely punishment.",
    "Avoid pride and complacency when sin is present; instead, mourn and seek God’s cleansing power.",
    "Be discerning in fellowship, maintaining close relationships only with those who profess genuine faith and repentance."
  ],
  "keyVerses": [
    {
      "reference": "1 Corinthians 5:6",
      "text": "Your glorying is not good. Know ye not that a little leaven leaveneth the whole lump?",
      "significance": "This verse highlights the danger of allowing sin to go unchecked, as it can corrupt the entire church community."
    },
    {
      "reference": "1 Corinthians 5:5",
      "text": "To deliver such an one unto Satan for the destruction of the flesh, that the spirit may be saved in the day of the Lord Jesus.",
      "significance": "It explains the purpose of church discipline: to bring about repentance and ultimate salvation of the sinner."
    },
    {
      "reference": "1 Corinthians 5:13",
      "text": "But them that are without God judgeth. Therefore put away from among yourselves that wicked person.",
      "significance": "Paul commands the church to remove the unrepentant sinner to preserve the purity and witness of the church."
    }
  ]
}