{
  "book": "1-kings",
  "bookName": "1 Kings",
  "chapter": 14,
  "title": "Judgment on Jeroboam and Rehoboam",
  "shortSummary": "This chapter details the prophecy of judgment against Jeroboam’s house due to his idolatry and disobedience, including the death of his sick son. It also records the reign of Rehoboam in Judah, highlighting his sins and the invasion of Jerusalem by Shishak, illustrating the consequences of unfaithfulness to God.",
  "timeline": "c. 931 BC - Early divided monarchy period following Solomon's reign",
  "keyCharacters": [
    {
      "name": "Jeroboam",
      "description": "First king of the northern kingdom of Israel whose idolatry brought God’s judgment upon his house."
    },
    {
      "name": "Jeroboam’s Wife",
      "description": "Disguised herself to seek a prophetic word from Ahijah concerning their sick son."
    },
    {
      "name": "Ahijah the Prophet",
      "description": "Prophet who delivered God’s judgment against Jeroboam’s family and foretold the child’s death."
    },
    {
      "name": "Rehoboam",
      "description": "Son of Solomon and king of Judah whose reign was marked by evil and led to Egypt’s invasion."
    }
  ],
  "definitions": [
    {
      "term": "Cracknels",
      "definition": "A type of dry biscuit or cracker, often used as food provisions."
    },
    {
      "term": "Groves",
      "definition": "Sacred trees or wooden poles used in pagan worship, condemned by God as idolatrous."
    },
    {
      "term": "Sodomites",
      "definition": "Men who practiced homosexual acts, mentioned here as part of the abominations in Judah."
    },
    {
      "term": "Shiloh",
      "definition": "An ancient city in Israel where the tabernacle was located before Jerusalem became the religious center."
    }
  ],
  "outline": [
    {
      "heading": "Jeroboam’s Wife Seeks Ahijah",
      "verseRange": "1 Kings 14:1-6",
      "description": "Jeroboam’s son falls ill, prompting his wife to seek a prophetic word from Ahijah in Shiloh, disguising herself to avoid recognition. This shows the desperation and the prophetic role in Israel’s leadership."
    },
    {
      "heading": "Ahijah’s Prophecy of Judgment",
      "verseRange": "1 Kings 14:7-16",
      "description": "God reveals through Ahijah the judgment on Jeroboam’s house for idolatry and disobedience, including the child’s death and the eventual downfall of Jeroboam’s dynasty, emphasizing God’s holiness and justice."
    },
    {
      "heading": "Death of Jeroboam’s Son and Mourning",
      "verseRange": "1 Kings 14:17-18",
      "description": "Jeroboam’s son dies as foretold, and Israel mourns him, marking the fulfillment of God’s word and the seriousness of divine judgment."
    },
    {
      "heading": "Summary of Jeroboam’s Reign and Succession",
      "verseRange": "1 Kings 14:19-20",
      "description": "A brief record of Jeroboam’s reign and the succession of his son Nadab, highlighting the continuation of the northern kingdom’s troubled leadership."
    },
    {
      "heading": "Rehoboam’s Reign and Judah’s Sin",
      "verseRange": "1 Kings 14:21-24",
      "description": "Rehoboam reigns in Judah but leads the people into sin by building high places and tolerating abominations, showing that Judah also failed to fully obey God."
    },
    {
      "heading": "Shishak’s Invasion and Aftermath",
      "verseRange": "1 Kings 14:25-31",
      "description": "Egyptian king Shishak invades Jerusalem, taking treasures from the temple and palace, symbolizing the consequences of Judah’s disobedience and the ongoing conflict between the divided kingdoms."
    }
  ],
  "application": [
    "Trust God’s sovereign judgment and recognize that disobedience and idolatry bring serious consequences.",
    "Seek God’s guidance through prayer and the counsel of His servants, especially in times of crisis.",
    "Remain faithful to God alone, avoiding the temptation to compromise with worldly or idolatrous practices.",
    "Understand that leadership carries responsibility before God, and sin in leadership affects the entire community."
  ],
  "keyVerses": [
    {
      "reference": "1 Kings 14:9",
      "text": "But hast done evil above all that were before thee: for thou hast gone and made thee other gods, and molten images, to provoke me to anger, and hast cast me behind thy back:",
      "significance": "This verse highlights the core reason for God’s judgment—Jeroboam’s idolatry and rejection of God’s commandments."
    },
    {
      "reference": "1 Kings 14:12",
      "text": "Arise thou therefore, get thee to thine own house: and when thy feet enter into the city, the child shall die.",
      "significance": "God’s prophecy through Ahijah shows the certainty and immediacy of divine judgment on Jeroboam’s family."
    },
    {
      "reference": "1 Kings 14:22",
      "text": "And Judah did evil in the sight of the LORD, and they provoked him to jealousy with their sins which they had committed, above all that their fathers had done.",
      "significance": "This verse reveals that Judah, under Rehoboam, also failed to remain faithful, provoking God’s anger through persistent sin."
    },
    {
      "reference": "1 Kings 14:25",
      "text": "And it came to pass in the fifth year of king Rehoboam, that Shishak king of Egypt came up against Jerusalem:",
      "significance": "This event shows the tangible consequences of Judah’s disobedience, as foreign powers invade and plunder the land."
    }
  ]
}