{
  "book": "1-kings",
  "bookName": "1 Kings",
  "chapter": 13,
  "title": "The Man of God and the Altar",
  "shortSummary": "This chapter recounts the story of a man of God sent from Judah to prophesy against the idolatrous altar at Bethel during King Jeroboam's reign. Despite clear divine instructions, the man of God is deceived by an old prophet and disobeys God’s command, resulting in his death as a solemn warning about obedience to God's word. The chapter highlights the consequences of disobedience and the certainty of God's prophetic word.",
  "timeline": "c. 931 BC - Early divided kingdom period after Solomon’s reign",
  "keyCharacters": [
    {
      "name": "Man of God from Judah",
      "description": "A prophet sent by God to Bethel to deliver a message against Jeroboam’s altar and to pronounce judgment."
    },
    {
      "name": "King Jeroboam",
      "description": "The first king of the northern kingdom of Israel who established idolatrous worship at Bethel."
    },
    {
      "name": "Old Prophet of Bethel",
      "description": "A prophet who deceives the man of God by falsely claiming an angel instructed him to bring the man of God back to eat and drink."
    },
    {
      "name": "Josiah",
      "description": "A future king of Judah mentioned in prophecy who will destroy the idolatrous priests and altars."
    }
  ],
  "definitions": [
    {
      "term": "Altar",
      "definition": "A structure used for offering sacrifices or incense to God or idols, significant here as a symbol of false worship."
    },
    {
      "term": "Man of God",
      "definition": "A title used for a prophet or messenger sent by God to deliver His word."
    },
    {
      "term": "High places",
      "definition": "Elevated sites often used for pagan worship and idolatry, condemned by the prophets."
    },
    {
      "term": "Carcase",
      "definition": "The dead body of a person or animal; here referring to the dead body of the disobedient prophet."
    }
  ],
  "outline": [
    {
      "heading": "The Prophecy Against the Altar",
      "verseRange": "1 Kings 13:1-5",
      "description": "The man of God prophesies against Jeroboam’s altar at Bethel, predicting its destruction and the coming of King Josiah who will purge idolatry. A miraculous sign confirms the prophecy as the altar is split and ashes poured out."
    },
    {
      "heading": "Jeroboam’s Request and the Man of God’s Obedience",
      "verseRange": "1 Kings 13:6-10",
      "description": "Jeroboam asks the man of God to come to his palace, but the prophet refuses, citing God’s command not to eat or drink or return by the same way."
    },
    {
      "heading": "The Old Prophet’s Deception",
      "verseRange": "1 Kings 13:11-19",
      "description": "An old prophet from Bethel deceives the man of God by falsely claiming an angel instructed him to bring the man of God back to eat and drink, leading the man of God to disobey God’s direct command."
    },
    {
      "heading": "Judgment on the Disobedient Man of God",
      "verseRange": "1 Kings 13:20-24",
      "description": "Because of his disobedience, God pronounces judgment on the man of God, who is killed by a lion on the way home, demonstrating the seriousness of obeying God’s word."
    },
    {
      "heading": "The Burial and Prophetic Confirmation",
      "verseRange": "1 Kings 13:25-32",
      "description": "The old prophet mourns and buries the man of God, affirming the truth of the prophecy against the altar and the certainty of God’s word."
    },
    {
      "heading": "Jeroboam’s Continued Sin and Its Consequences",
      "verseRange": "1 Kings 13:33-34",
      "description": "Despite the prophecy and judgment, Jeroboam persists in his idolatry by appointing unqualified priests, which becomes a sin leading to the downfall of his house."
    }
  ],
  "application": [
    "Obedience to God’s commands is essential; partial obedience or deception leads to serious consequences.",
    "Discern carefully the source of spiritual instructions, testing them against God’s revealed word to avoid deception.",
    "God’s prophetic word is sure and will come to pass, encouraging believers to trust and stand firm in His promises.",
    "Even in difficult circumstances, pray for restoration and seek God’s mercy as Jeroboam did when his hand was withered."
  ],
  "keyVerses": [
    {
      "reference": "1 Kings 13:2",
      "text": "And he cried against the altar in the word of the LORD, and said, O altar, altar, thus saith the LORD; Behold, a child shall be born unto the house of David, Josiah by name; and upon thee shall he offer the priests of the high places that burn incense upon thee, and men's bones shall be burnt upon thee.",
      "significance": "This verse contains a prophetic announcement of judgment and the coming reform under King Josiah, highlighting God's sovereignty over idolatry."
    },
    {
      "reference": "1 Kings 13:9",
      "text": "For so was it charged me by the word of the LORD, saying, Eat no bread, nor drink water, nor turn again by the same way that thou camest.",
      "significance": "This verse emphasizes the importance of strict obedience to God’s specific commands."
    },
    {
      "reference": "1 Kings 13:22",
      "text": "But camest back, and hast eaten bread and drunk water in the place, of the which the LORD did say to thee, Eat no bread, and drink no water; thy carcase shall not come unto the sepulchre of thy fathers.",
      "significance": "This verse reveals the consequence of disobedience—death and dishonor—underscoring the seriousness of God’s instructions."
    },
    {
      "reference": "1 Kings 13:34",
      "text": "And this thing became sin unto the house of Jeroboam, even to cut it off, and to destroy it from off the face of the earth.",
      "significance": "This verse shows how Jeroboam’s persistent sin brought judgment on his entire house, illustrating the lasting impact of unrepented sin."
    }
  ]
}