{
  "book": "1-kings",
  "bookName": "1 Kings",
  "chapter": 17,
  "title": "Elijah's Provision and Power",
  "shortSummary": "1 Kings 17 recounts the prophet Elijah's declaration of drought judgment upon Israel, his miraculous provision by God through ravens and a widow, and the resurrection of the widow’s son. This chapter highlights God's sovereign power, faithfulness to His servants, and the authority of His prophet.",
  "timeline": "c. 870 BC - Reign of King Ahab in Israel",
  "keyCharacters": [
    {
      "name": "Elijah",
      "description": "A prophet from Tishbe in Gilead who boldly proclaims God's judgment and demonstrates God's power through miracles."
    },
    {
      "name": "Ahab",
      "description": "King of Israel who is confronted by Elijah with a prophecy of drought due to Israel’s sin."
    },
    {
      "name": "Widow of Zarephath",
      "description": "A widow in Zarephath who provides for Elijah and experiences God’s miraculous provision and power through him."
    },
    {
      "name": "Widow’s Son",
      "description": "The son of the widow who falls ill and dies but is restored to life through Elijah’s prayer."
    }
  ],
  "definitions": [
    {
      "term": "Tishbite",
      "definition": "A native or inhabitant of Tishbe in Gilead, identifying Elijah’s origin."
    },
    {
      "term": "Brook Cherith",
      "definition": "A stream east of the Jordan River where Elijah was divinely instructed to hide and be fed by ravens."
    },
    {
      "term": "Cruse",
      "definition": "A small jar or container, here referring to the vessel holding oil used by the widow."
    },
    {
      "term": "Man of God",
      "definition": "A title used for prophets, indicating one who speaks and acts on behalf of God."
    }
  ],
  "outline": [
    {
      "heading": "Elijah Proclaims Drought and Hides by the Brook",
      "verseRange": "1 Kings 17:1-7",
      "description": "Elijah announces a drought as judgment from God and is instructed to hide by the brook Cherith where God miraculously provides for him through ravens until the brook dries up."
    },
    {
      "heading": "God Sends Elijah to the Widow at Zarephath",
      "verseRange": "1 Kings 17:8-16",
      "description": "God directs Elijah to Zarephath where a widow miraculously provides food for him despite her scarcity, demonstrating God’s sustaining power and faithfulness."
    },
    {
      "heading": "Elijah Raises the Widow’s Son",
      "verseRange": "1 Kings 17:17-24",
      "description": "When the widow’s son dies, Elijah prays earnestly to God and the child is revived, confirming Elijah’s prophetic authority and the truth of God’s word."
    }
  ],
  "application": [
    "Trust in God's provision even in times of scarcity, knowing He can sustain His people miraculously.",
    "Obey God’s instructions promptly, as Elijah did, to experience His faithfulness and power.",
    "Pray earnestly and persistently in times of crisis, believing that God hears and responds to the prayers of His servants.",
    "Recognize and honor God’s appointed servants, understanding that their words carry divine authority."
  ],
  "keyVerses": [
    {
      "reference": "1 Kings 17:1",
      "text": "And Elijah the Tishbite, who was of the inhabitants of Gilead, said unto Ahab, As the LORD God of Israel liveth, before whom I stand, there shall not be dew nor rain these years, but according to my word.",
      "significance": "This verse establishes Elijah’s prophetic authority and introduces the drought judgment as a consequence of Israel’s sin."
    },
    {
      "reference": "1 Kings 17:14",
      "text": "For thus saith the LORD God of Israel, The barrel of meal shall not waste, neither shall the cruse of oil fail, until the day that the LORD sendeth rain upon the earth.",
      "significance": "This promise demonstrates God’s supernatural provision and faithfulness to those who trust Him."
    },
    {
      "reference": "1 Kings 17:22",
      "text": "And the LORD heard the voice of Elijah; and the soul of the child came into him again, and he revived.",
      "significance": "This verse highlights God’s power over life and death and confirms Elijah’s role as His prophet."
    },
    {
      "reference": "1 Kings 17:24",
      "text": "And the woman said to Elijah, Now by this I know that thou art a man of God, and that the word of the LORD in thy mouth is truth.",
      "significance": "This confession affirms the authenticity of Elijah’s prophetic ministry and the trustworthiness of God’s word."
    }
  ]
}