{
  "book": "1-samuel",
  "bookName": "1 Samuel",
  "chapter": 21,
  "title": "David Flees to Nob",
  "shortSummary": "In this chapter, David seeks refuge from King Saul by visiting Ahimelech the priest at Nob, where he receives consecrated bread and the sword of Goliath. Fearing for his life, David flees to the Philistine king Achish of Gath and feigns madness to escape danger. This chapter highlights David’s reliance on God’s provision and his wisdom in perilous circumstances.",
  "timeline": "c. 1050 BC - Early reign of King Saul, during David's rise and flight from Saul",
  "keyCharacters": [
    {
      "name": "David",
      "description": "The future king of Israel, fleeing from Saul’s pursuit and seeking provision and protection."
    },
    {
      "name": "Ahimelech",
      "description": "The priest at Nob who provides David with consecrated bread and the sword of Goliath."
    },
    {
      "name": "Doeg",
      "description": "An Edomite servant of Saul present at Nob, who later plays a key role in reporting David’s visit."
    },
    {
      "name": "Achish",
      "description": "The Philistine king of Gath, to whom David flees and before whom he feigns madness."
    }
  ],
  "definitions": [
    {
      "term": "Hallowed Bread",
      "definition": "Also called consecrated or holy bread; bread set apart for sacred use, specifically the showbread placed before the Lord in the tabernacle."
    },
    {
      "term": "Showbread",
      "definition": "Twelve loaves of bread placed on a table in the tabernacle as an offering before God, replaced weekly and eaten only by priests."
    },
    {
      "term": "Ephod",
      "definition": "A sacred garment worn by priests; here it refers to the place where the sword of Goliath was kept."
    },
    {
      "term": "Feigned Madness",
      "definition": "Pretending to be insane or mentally unstable as a strategy to avoid harm or suspicion."
    }
  ],
  "outline": [
    {
      "heading": "David Seeks Provision from Ahimelech",
      "verseRange": "1 Samuel 21:1-6",
      "description": "David arrives at Nob and requests bread and weapons from Ahimelech, who provides him with consecrated bread and the sword of Goliath, demonstrating God’s provision even in difficult times."
    },
    {
      "heading": "Doeg the Edomite Observes",
      "verseRange": "1 Samuel 21:7",
      "description": "Doeg, a servant of Saul, is present at Nob, setting the stage for future conflict and highlighting the danger surrounding David."
    },
    {
      "heading": "David Requests a Weapon",
      "verseRange": "1 Samuel 21:8-9",
      "description": "David asks for a weapon, and Ahimelech offers the sword of Goliath, symbolizing David’s past victory and God’s continued protection."
    },
    {
      "heading": "David Flees to Gath",
      "verseRange": "1 Samuel 21:10-12",
      "description": "Fearing Saul’s pursuit, David flees to the Philistine king Achish, but the people recognize him, causing David to fear for his life."
    },
    {
      "heading": "David Feigns Madness",
      "verseRange": "1 Samuel 21:13-15",
      "description": "To escape danger, David pretends to be mad before Achish, a clever act that preserves his life and demonstrates his wisdom under pressure."
    }
  ],
  "application": [
    "Trust God’s provision in times of need, just as David received consecrated bread and a weapon when fleeing danger.",
    "Exercise wisdom and discernment in difficult situations, including knowing when to rely on God’s protection and when to use prudent strategies.",
    "Remain faithful and holy, as shown by the requirement that the bread be eaten only by those who are ceremonially clean.",
    "Seek refuge in God’s sovereignty even when facing enemies, trusting that He can protect and guide through perilous circumstances."
  ],
  "keyVerses": [
    {
      "reference": "1 Samuel 21:6",
      "text": "So the priest gave him hallowed bread: for there was no bread there but the shewbread, that was taken from before the LORD, to put hot bread in the day when it was taken away.",
      "significance": "This verse shows God’s provision through the priest’s obedience and the sacredness of the bread, emphasizing reliance on God’s provision even in desperate times."
    },
    {
      "reference": "1 Samuel 21:9",
      "text": "And the priest said, The sword of Goliath the Philistine, whom thou slewest in the valley of Elah, behold, it is here wrapped in a cloth behind the ephod: if thou wilt take that, take it: for there is no other save that here. And David said, There is none like that; give it me.",
      "significance": "David’s acceptance of Goliath’s sword symbolizes God’s past deliverance and encourages faith in God’s continued protection."
    },
    {
      "reference": "1 Samuel 21:13",
      "text": "And he changed his behaviour before them, and feigned himself mad in their hands, and scrabbled on the doors of the gate, and let his spittle fall down upon his beard.",
      "significance": "David’s feigning madness demonstrates godly wisdom and prudence in avoiding unnecessary conflict and preserving life."
    }
  ]
}