{
  "book": "1-samuel",
  "bookName": "1 Samuel",
  "chapter": 3,
  "title": "Samuel's Calling",
  "shortSummary": "1 Samuel 3 recounts the divine calling of the young prophet Samuel during a time when God's word was rare in Israel. Through repeated calls from the LORD, Samuel learns to listen and respond obediently, marking the beginning of his prophetic ministry and God's judgment on Eli's house.",
  "timeline": "c. 1100 BC - Early period of the Judges transitioning to the prophetic era",
  "keyCharacters": [
    {
      "name": "Samuel",
      "description": "A young boy serving under Eli who receives his first prophetic call from the LORD, beginning his role as a prophet in Israel."
    },
    {
      "name": "Eli",
      "description": "The high priest and judge of Israel, who mentors Samuel but whose household faces divine judgment due to the sins of his sons."
    },
    {
      "name": "Eli's Sons",
      "description": "Hophni and Phinehas, priests who acted wickedly, provoking God's judgment against Eli's family."
    }
  ],
  "definitions": [
    {
      "term": "Open Vision",
      "definition": "A clear and direct revelation from God, often through dreams, visions, or audible voice, which was rare during Samuel's youth."
    },
    {
      "term": "Lamp of God",
      "definition": "The lamp that burned continually in the temple, symbolizing God's presence; its going out signified the end of the day's worship."
    },
    {
      "term": "Prophet",
      "definition": "A messenger chosen by God to communicate His words and will to the people."
    },
    {
      "term": "Purge",
      "definition": "To cleanse or remove sin; in this context, it refers to the permanent judgment on Eli’s house that cannot be removed by sacrifices."
    }
  ],
  "outline": [
    {
      "heading": "Samuel’s Early Service and God’s Silence",
      "verseRange": "1 Samuel 3:1-3",
      "description": "Samuel serves before Eli during a time when God's word was rare and no clear visions were given, setting the stage for a significant divine intervention."
    },
    {
      "heading": "God Calls Samuel Repeatedly",
      "verseRange": "1 Samuel 3:4-10",
      "description": "The LORD calls Samuel three times before Eli realizes it is God speaking; Samuel is instructed to respond, marking his first prophetic encounter."
    },
    {
      "heading": "The LORD’s Message of Judgment",
      "verseRange": "1 Samuel 3:11-14",
      "description": "God reveals to Samuel the coming judgment on Eli’s house because of the sins of his sons and Eli’s failure to restrain them."
    },
    {
      "heading": "Samuel’s Fear and Eli’s Encouragement",
      "verseRange": "1 Samuel 3:15-18",
      "description": "Samuel hesitates to share the vision, but Eli urges him to reveal everything, demonstrating trust in God’s sovereign will."
    },
    {
      "heading": "Samuel’s Growth and Recognition as Prophet",
      "verseRange": "1 Samuel 3:19-21",
      "description": "Samuel matures in his prophetic role, with God’s presence confirming his words and all Israel recognizing him as a true prophet."
    }
  ],
  "application": [
    "Be attentive and responsive to God’s voice, even when it is unexpected or unclear.",
    "Obedience to God’s calling requires courage and trust, especially when delivering difficult messages.",
    "Spiritual mentorship is vital; like Eli guiding Samuel, Christians should seek godly counsel and also be willing to learn.",
    "Recognize that God’s judgment is just and that sin in leadership can have lasting consequences."
  ],
  "keyVerses": [
    {
      "reference": "1 Samuel 3:10",
      "text": "And the LORD came, and stood, and called as at other times, Samuel, Samuel. Then Samuel answered, Speak; for thy servant heareth.",
      "significance": "This verse highlights Samuel’s obedient response to God’s call, setting an example of readiness to hear and obey the Lord."
    },
    {
      "reference": "1 Samuel 3:11",
      "text": "And the LORD said to Samuel, Behold, I will do a thing in Israel, at which both the ears of every one that heareth it shall tingle.",
      "significance": "God announces a significant and startling event, emphasizing the seriousness of His forthcoming judgment."
    },
    {
      "reference": "1 Samuel 3:19",
      "text": "And Samuel grew, and the LORD was with him, and did let none of his words fall to the ground.",
      "significance": "This verse confirms God’s presence with Samuel and the effectiveness of his prophetic ministry."
    },
    {
      "reference": "1 Samuel 3:21",
      "text": "And the LORD appeared again in Shiloh: for the LORD revealed himself to Samuel in Shiloh by the word of the LORD.",
      "significance": "It underscores the ongoing revelation of God to Samuel, affirming his role as a prophet and God’s continued communication with His people."
    }
  ]
}