{
  "book": "2-chronicles",
  "bookName": "2 Chronicles",
  "chapter": 10,
  "title": "Rehoboam's Folly",
  "shortSummary": "This chapter recounts the critical moment when Rehoboam, Solomon’s son, ascends to the throne and faces the demands of the northern tribes of Israel. Ignoring wise counsel, he chooses harshness over mercy, leading to the division of the kingdom and the rebellion of Israel against the house of David. The chapter highlights the consequences of pride and poor leadership.",
  "timeline": "c. 931 BC - Division of the United Kingdom of Israel after Solomon's reign",
  "keyCharacters": [
    {
      "name": "Rehoboam",
      "description": "Son of Solomon and king of Judah who chooses harsh counsel, resulting in the kingdom’s division."
    },
    {
      "name": "Jeroboam",
      "description": "Former servant of Solomon who fled to Egypt and returns to lead the northern tribes in rebellion."
    },
    {
      "name": "Old Men",
      "description": "Experienced advisors who counsel Rehoboam to be kind and humble toward the people."
    },
    {
      "name": "Young Men",
      "description": "Rehoboam’s peers who advise him to increase the burden on the people, leading to rebellion."
    },
    {
      "name": "Hadoram",
      "description": "Official over tribute sent by Rehoboam to the northern tribes, who is killed by stoning."
    }
  ],
  "definitions": [
    {
      "term": "Yoke",
      "definition": "A wooden frame used to join two animals for work; metaphorically, it represents burden or oppression."
    },
    {
      "term": "Scorpions",
      "definition": "Used metaphorically here to describe severe and painful punishment, harsher than whips."
    },
    {
      "term": "Tribute",
      "definition": "A tax or payment demanded by a ruler from his subjects or conquered peoples."
    },
    {
      "term": "Counsel",
      "definition": "Advice or guidance given to a leader, often from trusted advisors."
    }
  ],
  "outline": [
    {
      "heading": "Israel Assembles to Make Rehoboam King",
      "verseRange": "2 Chronicles 10:1-5",
      "description": "All Israel gathers at Shechem to crown Rehoboam. Jeroboam returns from Egypt to join the people’s request for lighter burdens, signaling the beginning of tension."
    },
    {
      "heading": "Rehoboam Seeks Counsel",
      "verseRange": "2 Chronicles 10:6-11",
      "description": "Rehoboam consults both the old men and the young men for advice on how to respond to the people's demands. He rejects the wise counsel of the elders and follows the harsh advice of his peers."
    },
    {
      "heading": "Rehoboam’s Harsh Response and the Kingdom’s Division",
      "verseRange": "2 Chronicles 10:12-19",
      "description": "Rehoboam answers the people with severity, increasing their burdens. This causes the ten northern tribes to rebel, rejecting Rehoboam’s rule and establishing a divided kingdom."
    }
  ],
  "application": [
    "Seek and heed godly counsel, especially from those with wisdom and experience, before making important decisions.",
    "Exercise humility and compassion in leadership, recognizing that harshness can lead to division and rebellion.",
    "Understand that pride and stubbornness can have serious consequences both personally and communally.",
    "Trust in God’s sovereign plan even when facing difficult outcomes, as seen in the fulfillment of His word through Ahijah."
  ],
  "keyVerses": [
    {
      "reference": "2 Chronicles 10:9",
      "text": "And he said unto them, What advice give ye that we may return answer to this people, which have spoken to me, saying, Ease somewhat the yoke that thy father did put upon us?",
      "significance": "This verse introduces the critical moment where Rehoboam seeks counsel, setting the stage for his fateful decision."
    },
    {
      "reference": "2 Chronicles 10:14",
      "text": "And answered them after the advice of the young men, saying, My father made your yoke heavy, but I will add thereto: my father chastised you with whips, but I will chastise you with scorpions.",
      "significance": "Rehoboam’s harsh reply reveals his pride and unwillingness to lead with mercy, directly causing the kingdom’s division."
    },
    {
      "reference": "2 Chronicles 10:15",
      "text": "So the king hearkened not unto the people: for the cause was of God, that the LORD might perform his word, which he spake by the hand of Ahijah the Shilonite to Jeroboam the son of Nebat.",
      "significance": "This verse reminds readers that God’s sovereign plan is at work, even through human failure and rebellion."
    },
    {
      "reference": "2 Chronicles 10:16",
      "text": "And when all Israel saw that the king would not hearken unto them, the people answered the king, saying, What portion have we in David? and we have none inheritance in the son of Jesse: every man to your tents, O Israel: and now, David, see to thine own house. So all Israel went to their tents.",
      "significance": "This verse marks the formal rejection of Rehoboam’s rule by the northern tribes, signifying the kingdom’s division."
    }
  ]
}