{
  "book": "2-chronicles",
  "bookName": "2 Chronicles",
  "chapter": 35,
  "title": "Josiah's Passover and Death",
  "shortSummary": "This chapter recounts King Josiah's faithful observance of the Passover, a significant revival of true worship in Judah, followed by his tragic death in battle against Pharaoh Necho of Egypt. Josiah's dedication to God and his reforms are highlighted, as well as the mourning of his people after his demise.",
  "timeline": "c. 622 BC - Josiah's 18th year of reign and Passover celebration; c. 609 BC - Josiah's death at Megiddo",
  "keyCharacters": [
    {
      "name": "Josiah",
      "description": "King of Judah who led a religious reform, restored proper worship, and celebrated a remarkable Passover before his death in battle."
    },
    {
      "name": "Necho",
      "description": "King of Egypt who warned Josiah not to interfere with his campaign against Assyria but was disobeyed, leading to Josiah's death."
    },
    {
      "name": "Hilkiah",
      "description": "A priest and ruler of the house of God who contributed to the Passover offerings."
    },
    {
      "name": "Jeremiah",
      "description": "The prophet who lamented Josiah's death and whose lamentations became an established ordinance in Israel."
    }
  ],
  "definitions": [
    {
      "term": "Passover",
      "definition": "A Jewish feast commemorating God's deliverance of Israel from Egypt, involving the sacrifice of a lamb and a sacred meal."
    },
    {
      "term": "Levites",
      "definition": "Members of the tribe of Levi set apart for religious duties and temple service in Israel."
    },
    {
      "term": "Ark",
      "definition": "The sacred chest containing the tablets of the Law, symbolizing God's presence among His people."
    },
    {
      "term": "Burnt Offering",
      "definition": "A sacrifice wholly consumed by fire on the altar, symbolizing atonement and dedication to God."
    }
  ],
  "outline": [
    {
      "heading": "Josiah's Preparation for the Passover",
      "verseRange": "2 Chronicles 35:1-6",
      "description": "Josiah organizes the priests and Levites to properly observe the Passover, emphasizing obedience to the Mosaic Law and reverence for the ark and temple."
    },
    {
      "heading": "The Magnificent Passover Celebration",
      "verseRange": "2 Chronicles 35:7-19",
      "description": "The king and his officials provide abundant offerings, and the Passover is celebrated with great solemnity and joy, unmatched since the days of Samuel."
    },
    {
      "heading": "Josiah's Death in Battle",
      "verseRange": "2 Chronicles 35:20-24",
      "description": "Despite warnings from Necho, Josiah engages in battle at Megiddo, is mortally wounded, and dies, leading to national mourning."
    },
    {
      "heading": "Lamentation and Legacy of Josiah",
      "verseRange": "2 Chronicles 35:25-27",
      "description": "The prophet Jeremiah and the people mourn Josiah's death, and his deeds are recorded for posterity, highlighting his faithfulness and reforms."
    }
  ],
  "application": [
    "Commit to wholehearted obedience in worship and service to God, following His Word as Josiah did.",
    "Support and participate in corporate worship and the ordinances God has established, such as the Lord’s Supper, remembering Christ’s sacrifice.",
    "Heed godly counsel and warnings, recognizing the importance of humility and submission to God's guidance.",
    "Honor faithful leaders and remember their godly example to inspire perseverance in faith."
  ],
  "keyVerses": [
    {
      "reference": "2 Chronicles 35:18",
      "text": "And there was no passover like to that kept in Israel from the days of Samuel the prophet; neither did all the kings of Israel keep such a passover as Josiah kept, and the priests, and the Levites, and all Judah and Israel that were present, and the inhabitants of Jerusalem.",
      "significance": "This verse highlights the extraordinary faithfulness and revival under Josiah, marking a high point in Israel’s worship history."
    },
    {
      "reference": "2 Chronicles 35:22",
      "text": "Nevertheless Josiah would not turn his face from him, but disguised himself, that he might fight with him, and hearkened not unto the words of Necho from the mouth of God, and came to fight in the valley of Megiddo.",
      "significance": "Josiah’s disobedience to divine warning led to his tragic death, underscoring the importance of heeding God’s guidance."
    },
    {
      "reference": "2 Chronicles 35:24",
      "text": "His servants therefore took him out of that chariot, and put him in the second chariot that he had; and they brought him to Jerusalem, and he died, and was buried in one of the sepulchres of his fathers. And all Judah and Jerusalem mourned for Josiah.",
      "significance": "This verse records the death and national mourning of Josiah, reflecting the deep impact of his godly leadership."
    }
  ]
}