{
  "book": "2-chronicles",
  "bookName": "2 Chronicles",
  "chapter": 27,
  "title": "The Reign of Jotham",
  "shortSummary": "This chapter details the reign of King Jotham of Judah, highlighting his righteous leadership, building projects, military victories, and the tribute he received from the Ammonites. It emphasizes his faithfulness to God and the prosperity that followed, while also noting the continued corruption of the people.",
  "timeline": "c. 750 BC - Reign of King Jotham in Judah",
  "keyCharacters": [
    {
      "name": "Jotham",
      "description": "King of Judah who reigned for sixteen years, known for doing right in the sight of the LORD and strengthening the kingdom through building and military success."
    },
    {
      "name": "Jerushah",
      "description": "Mother of Jotham, identified as the daughter of Zadok, linking Jotham to a priestly lineage."
    },
    {
      "name": "Uzziah",
      "description": "Father of Jotham and previous king of Judah, whose righteous ways Jotham followed."
    },
    {
      "name": "Ahaz",
      "description": "Son of Jotham who succeeded him as king of Judah."
    }
  ],
  "definitions": [
    {
      "term": "Talents",
      "definition": "A large unit of weight and money used in ancient times, representing a significant amount of silver or gold."
    },
    {
      "term": "Ophel",
      "definition": "A fortified hill or elevated area in Jerusalem near the temple, often associated with defense and construction."
    },
    {
      "term": "Temple of the LORD",
      "definition": "The sacred place in Jerusalem where God’s presence dwelt and where priests performed sacrifices and worship."
    },
    {
      "term": "Corruptly",
      "definition": "Behaving in a morally depraved or sinful manner, often implying idolatry or disobedience to God."
    }
  ],
  "outline": [
    {
      "heading": "Jotham’s Ascension and Character",
      "verseRange": "2 Chronicles 27:1-2",
      "description": "Jotham begins his reign at age 25, following his father Uzziah’s righteous example but refraining from entering the temple, while the people continued in corruption."
    },
    {
      "heading": "Building Projects and Fortifications",
      "verseRange": "2 Chronicles 27:3-4",
      "description": "Jotham strengthens Jerusalem by building the high gate of the temple and fortifying the city walls, as well as constructing cities, castles, and towers in Judah’s mountainous and forested regions."
    },
    {
      "heading": "Military Victory and Tribute from Ammon",
      "verseRange": "2 Chronicles 27:5-6",
      "description": "Jotham defeats the Ammonites in battle, resulting in annual tribute payments of silver, wheat, and barley, demonstrating God’s blessing on his leadership as he prepared his ways before the LORD."
    },
    {
      "heading": "Record of Jotham’s Reign and Death",
      "verseRange": "2 Chronicles 27:7-9",
      "description": "The chapter concludes by referencing additional records of Jotham’s reign and wars, noting his death and burial in the city of David, and the succession of his son Ahaz."
    }
  ],
  "application": [
    "Follow the example of Jotham by preparing your ways before the LORD through consistent obedience and faithfulness.",
    "Invest in strengthening your spiritual and physical foundations, just as Jotham built and fortified cities and the temple gate.",
    "Trust God to grant victory over your challenges when you rely on Him and lead with integrity.",
    "Recognize the importance of godly leadership and legacy, committing to raise up the next generation in the fear of the LORD."
  ],
  "keyVerses": [
    {
      "reference": "2 Chronicles 27:2",
      "text": "And he did that which was right in the sight of the LORD, according to all that his father Uzziah did: howbeit he entered not into the temple of the LORD. And the people did yet corruptly.",
      "significance": "This verse highlights Jotham’s faithfulness to God despite the ongoing spiritual decline of the people, showing the challenge of righteous leadership."
    },
    {
      "reference": "2 Chronicles 27:6",
      "text": "So Jotham became mighty, because he prepared his ways before the LORD his God.",
      "significance": "This verse underscores the biblical principle that true strength and success come from honoring God and walking in His ways."
    },
    {
      "reference": "2 Chronicles 27:9",
      "text": "And Jotham slept with his fathers, and they buried him in the city of David: and Ahaz his son reigned in his stead.",
      "significance": "This verse marks the peaceful end of Jotham’s reign and the continuation of the Davidic line through his son Ahaz."
    }
  ]
}