{
  "book": "2-chronicles",
  "bookName": "2 Chronicles",
  "chapter": 30,
  "title": "Hezekiah's Passover Restoration",
  "shortSummary": "In 2 Chronicles 30, King Hezekiah leads a nationwide call for the Israelites to return to the Lord by celebrating the Passover in Jerusalem, despite previous neglect. The chapter highlights repentance, unity, and God's gracious response to sincere worship and prayer, resulting in a joyous and extended feast.",
  "timeline": "c. 715-686 BC - Reign of Hezekiah, King of Judah",
  "keyCharacters": [
    {
      "name": "Hezekiah",
      "description": "King of Judah who initiates the call for Israel and Judah to observe the Passover and leads religious reform."
    },
    {
      "name": "Priests and Levites",
      "description": "Religious leaders responsible for sanctifying themselves and officiating the Passover according to the Law of Moses."
    },
    {
      "name": "Princes",
      "description": "Hezekiah’s officials who support the king’s decree and help spread the call for the Passover celebration."
    }
  ],
  "definitions": [
    {
      "term": "Passover",
      "definition": "A Jewish feast commemorating the Israelites' deliverance from Egypt, involving the sacrifice of a lamb and the eating of unleavened bread."
    },
    {
      "term": "Sanctify",
      "definition": "To set apart as holy or consecrate, especially referring to priests preparing themselves for sacred duties."
    },
    {
      "term": "Stiffnecked",
      "definition": "A biblical term describing stubbornness or refusal to obey God."
    },
    {
      "term": "Unleavened Bread",
      "definition": "Bread made without yeast, eaten during the Passover feast to remember the haste of Israel’s departure from Egypt."
    }
  ],
  "outline": [
    {
      "heading": "Hezekiah’s Invitation to Keep the Passover",
      "verseRange": "2 Chronicles 30:1-6",
      "description": "Hezekiah sends letters throughout Israel and Judah inviting all to Jerusalem to celebrate the Passover in the second month, emphasizing repentance and return to God."
    },
    {
      "heading": "Response of the People",
      "verseRange": "2 Chronicles 30:7-13",
      "description": "While many mock the invitation, some humble themselves and come to Jerusalem, and God grants unity among the people of Judah to obey the king’s command."
    },
    {
      "heading": "Cleansing and Celebration of the Passover",
      "verseRange": "2 Chronicles 30:14-21",
      "description": "The people remove idolatrous altars, sanctify themselves, and celebrate the Passover, even though many are not fully purified; Hezekiah prays and God heals the people."
    },
    {
      "heading": "Extended Feast and Joyful Worship",
      "verseRange": "2 Chronicles 30:22-27",
      "description": "The assembly extends the feast for seven more days with gladness, supported by generous offerings from Hezekiah and the princes, culminating in priests and Levites blessing the people."
    }
  ],
  "application": [
    "Respond to God’s call with humility and repentance, even when others reject or mock your faith.",
    "Seek unity in worship and obedience to God’s commands within the Christian community.",
    "Pray earnestly for God’s mercy and healing when facing spiritual or communal shortcomings.",
    "Celebrate God’s faithfulness with joy and thanksgiving, extending worship beyond obligation."
  ],
  "keyVerses": [
    {
      "reference": "2 Chronicles 30:6",
      "text": "Ye children of Israel, turn again unto the LORD God of Abraham, Isaac, and Israel, and he will return to the remnant of you, that are escaped out of the hand of the kings of Assyria.",
      "significance": "This verse captures the heart of Hezekiah’s message: a call to repentance with the promise of God’s gracious restoration."
    },
    {
      "reference": "2 Chronicles 30:18",
      "text": "For a multitude of the people, even many of Ephraim, and Manasseh, Issachar, and Zebulun, had not cleansed themselves, yet did they eat the passover otherwise than it was written. But Hezekiah prayed for them, saying, The good LORD pardon every one.",
      "significance": "It highlights God’s mercy responding to sincere faith and prayer, even when the people were imperfect in their observance."
    },
    {
      "reference": "2 Chronicles 30:21",
      "text": "And the children of Israel that were present at Jerusalem kept the feast of unleavened bread seven days with great gladness: and the Levites and the priests praised the LORD day by day, singing with loud instruments unto the LORD.",
      "significance": "This verse emphasizes the joy and wholehearted worship that characterized the restored Passover celebration."
    },
    {
      "reference": "2 Chronicles 30:27",
      "text": "Then the priests the Levites arose and blessed the people: and their voice was heard, and their prayer came up to his holy dwelling place, even unto heaven.",
      "significance": "It shows the powerful effect of united prayer and blessing, affirming God’s presence and approval."
    }
  ]
}