{
  "book": "2-chronicles",
  "bookName": "2 Chronicles",
  "chapter": 21,
  "title": "Jehoram's Reign and Judgment",
  "shortSummary": "This chapter recounts the reign of Jehoram, son of Jehoshaphat, who forsook the ways of his father and walked in evil like the kings of Israel. His reign was marked by fratricide, idolatry, and rebellion among Judah’s neighbors, culminating in divine judgment through disease and invasion. The chapter highlights God’s faithfulness to His covenant with David despite the king’s unfaithfulness.",
  "timeline": "c. 850 BC - Reign of Jehoram in Judah",
  "keyCharacters": [
    {
      "name": "Jehoram",
      "description": "Son of Jehoshaphat and king of Judah who reigned for eight years, known for his evil deeds and turning away from God."
    },
    {
      "name": "Jehoshaphat",
      "description": "Previous king of Judah and father of Jehoram, remembered for his faithfulness to God."
    },
    {
      "name": "Elijah",
      "description": "The prophet who sent a letter of judgment to Jehoram, pronouncing God’s punishment for his sins."
    },
    {
      "name": "Jehoahaz",
      "description": "The youngest son of Jehoram who survived the Philistine and Arabian invasion."
    }
  ],
  "definitions": [
    {
      "term": "High places",
      "definition": "Elevated sites often used for pagan worship and idolatry, condemned in the Old Testament."
    },
    {
      "term": "Whoredoms",
      "definition": "A biblical term referring to spiritual unfaithfulness or idolatry, likened to prostitution."
    },
    {
      "term": "Fenced cities",
      "definition": "Cities fortified with walls for protection, often given as gifts or strategic holdings."
    },
    {
      "term": "Bowels",
      "definition": "An archaic term for intestines or internal organs, used here to describe Jehoram’s painful disease."
    }
  ],
  "outline": [
    {
      "heading": "Jehoram’s Ascension and Fratricide",
      "verseRange": "2 Chronicles 21:1-5",
      "description": "Jehoram becomes king after Jehoshaphat’s death and kills his brothers to secure his throne, demonstrating a ruthless consolidation of power."
    },
    {
      "heading": "Jehoram’s Evil Reign and Idolatry",
      "verseRange": "2 Chronicles 21:6-11",
      "description": "Jehoram walks in the sinful ways of Israel’s kings, influenced by his marriage to Ahab’s daughter, leading Judah into idolatry and moral corruption."
    },
    {
      "heading": "Prophetic Judgment from Elijah",
      "verseRange": "2 Chronicles 21:12-15",
      "description": "Elijah sends a letter pronouncing God’s judgment on Jehoram for his sins, including a devastating plague and a painful disease."
    },
    {
      "heading": "Invasion and Suffering",
      "verseRange": "2 Chronicles 21:16-19",
      "description": "God stirs up enemies against Jehoram, resulting in plunder and captivity of his family, followed by his incurable illness."
    },
    {
      "heading": "Death and Legacy of Jehoram",
      "verseRange": "2 Chronicles 21:20",
      "description": "Jehoram dies after eight years of reign, suffering greatly and receiving a dishonorable burial, reflecting his rejected kingship."
    }
  ],
  "application": [
    "Guard against compromising your faith through ungodly influences, as Jehoram’s marriage led him away from God’s ways.",
    "Recognize that God’s covenant promises do not excuse disobedience; personal faithfulness is required.",
    "Repent promptly when confronted with sin, understanding that God’s discipline aims to restore, not merely punish.",
    "Trust in God’s justice and mercy even when facing consequences for sin, knowing He remains faithful to His covenant."
  ],
  "keyVerses": [
    {
      "reference": "2 Chronicles 21:6",
      "text": "And he walked in the way of the kings of Israel, like as did the house of Ahab: for he had the daughter of Ahab to wife: and he wrought that which was evil in the eyes of the LORD.",
      "significance": "This verse highlights Jehoram’s sinful alliance and disobedience, setting the stage for his downfall."
    },
    {
      "reference": "2 Chronicles 21:12",
      "text": "And there came a writing to him from Elijah the prophet, saying, Thus saith the LORD God of David thy father, Because thou hast not walked in the ways of Jehoshaphat thy father, nor in the ways of Asa king of Judah,",
      "significance": "God’s judgment is communicated through Elijah, emphasizing the importance of following godly predecessors."
    },
    {
      "reference": "2 Chronicles 21:14",
      "text": "Behold, with a great plague will the LORD smite thy people, and thy children, and thy wives, and all thy goods:",
      "significance": "This verse reveals the comprehensive nature of divine judgment on Jehoram’s household and kingdom."
    },
    {
      "reference": "2 Chronicles 21:20",
      "text": "Thirty and two years old was he when he began to reign, and he reigned in Jerusalem eight years, and departed without being desired. Howbeit they buried him in the city of David, but not in the sepulchres of the kings.",
      "significance": "Jehoram’s dishonored death and burial reflect the rejection of his reign due to his unfaithfulness."
    }
  ]
}