{
  "book": "2-kings",
  "bookName": "2 Kings",
  "chapter": 13,
  "title": "Jehoahaz and Joash Reign",
  "shortSummary": "2 Kings 13 recounts the reigns of Jehoahaz and his son Joash over Israel, highlighting their continued evil in the sight of the LORD and the resulting oppression by Syria. The chapter also records the final days of the prophet Elisha, his symbolic prophecy to Joash, and a miraculous resurrection through Elisha’s bones, emphasizing God's ongoing mercy despite Israel’s sin.",
  "timeline": "c. 850-830 BC - Reigns of Jehoahaz and Joash over Israel during the divided monarchy period",
  "keyCharacters": [
    {
      "name": "Jehoahaz",
      "description": "Son of Jehu and king of Israel who reigned for seventeen years; he continued the sinful practices of Jeroboam, leading to Syrian oppression."
    },
    {
      "name": "Joash (Jehoash)",
      "description": "Son of Jehoahaz and king of Israel who reigned sixteen years; he also did evil but fought against Syria and recovered some cities."
    },
    {
      "name": "Elisha",
      "description": "The prophet of God who was sick and near death; he gave a prophetic sign to Joash and performed a resurrection miracle after his death."
    },
    {
      "name": "Hazael",
      "description": "King of Syria who oppressed Israel during Jehoahaz’s reign."
    },
    {
      "name": "Benhadad",
      "description": "Son of Hazael and king of Syria who continued Syrian oppression until Joash reclaimed cities from him."
    }
  ],
  "definitions": [
    {
      "term": "Grove",
      "definition": "A site of pagan worship involving trees or wooden idols, often associated with idolatry condemned by God."
    },
    {
      "term": "Chronicles of the kings of Israel",
      "definition": "A historical record referenced in the Bible that documented the reigns and deeds of Israel’s kings."
    },
    {
      "term": "Threshing",
      "definition": "An agricultural process of separating grain from chaff; metaphorically used here to describe Israel being crushed or destroyed."
    },
    {
      "term": "Arrow of the LORD’s deliverance",
      "definition": "A prophetic symbol used by Elisha to represent God’s power to deliver Israel from their enemies."
    }
  ],
  "outline": [
    {
      "heading": "Jehoahaz’s Reign and Syrian Oppression",
      "verseRange": "2 Kings 13:1-9",
      "description": "Jehoahaz reigns over Israel, continuing the sins of Jeroboam, resulting in God’s anger and Syrian domination. Despite oppression, God shows mercy by raising a deliverer, though Israel remains sinful."
    },
    {
      "heading": "Joash’s Reign and Military Campaigns",
      "verseRange": "2 Kings 13:10-13",
      "description": "Joash succeeds Jehoahaz and also does evil but engages in military conflict with Judah and Syria, recovering cities lost to the Syrians."
    },
    {
      "heading": "Elisha’s Final Prophecy to Joash",
      "verseRange": "2 Kings 13:14-19",
      "description": "Elisha, near death, gives Joash a symbolic prophecy involving a bow and arrows, predicting deliverance from Syria. Joash’s incomplete obedience limits the extent of victory."
    },
    {
      "heading": "Elisha’s Death and a Resurrection Miracle",
      "verseRange": "2 Kings 13:20-21",
      "description": "After Elisha’s death, a dead man is revived upon touching Elisha’s bones, demonstrating God’s power working through His prophet even after death."
    },
    {
      "heading": "Continued Syrian Oppression and God’s Covenant Mercy",
      "verseRange": "2 Kings 13:22-25",
      "description": "Syria continues to oppress Israel under Hazael and Benhadad, but God’s covenant with the patriarchs restrains total destruction. Joash defeats Benhadad three times, regaining lost cities."
    }
  ],
  "application": [
    "Recognize the consequences of persistent sin and the importance of wholehearted obedience to God’s commands.",
    "Trust in God’s mercy and covenant faithfulness even when circumstances seem dire or punishment is ongoing.",
    "Respond to God’s prophetic word with full obedience, understanding that partial obedience limits His blessings.",
    "Remember that God’s power can bring life and restoration even in seemingly hopeless situations."
  ],
  "keyVerses": [
    {
      "reference": "2 Kings 13:17",
      "text": "And he said, The arrow of the LORD'S deliverance, and the arrow of deliverance from Syria: for thou shalt smite the Syrians in Aphek, till thou have consumed them.",
      "significance": "This verse highlights God’s promise of deliverance through prophetic symbolism, emphasizing His sovereignty over Israel’s enemies."
    },
    {
      "reference": "2 Kings 13:19",
      "text": "And the man of God was wroth with him, and said, Thou shouldest have smitten five or six times; then hadst thou smitten Syria till thou hadst consumed it: whereas now thou shalt smite Syria but thrice.",
      "significance": "This verse teaches the importance of full obedience to God’s instructions to receive complete victory and blessing."
    },
    {
      "reference": "2 Kings 13:21",
      "text": "And it came to pass, as they were burying a man, that, behold, they spied a band of men; and they cast the man into the sepulchre of Elisha: and when the man was let down, and touched the bones of Elisha, he revived, and stood up on his feet.",
      "significance": "This miracle demonstrates God’s power to give life and confirms the enduring spiritual authority of His prophet Elisha."
    }
  ]
}