{
  "book": "2-kings",
  "bookName": "2 Kings",
  "chapter": 7,
  "title": "The Deliverance from Famine",
  "shortSummary": "2 Kings 7 recounts the miraculous deliverance of Samaria from a severe famine during a Syrian siege. Through the prophet Elisha’s prophecy and God’s intervention, the enemy army flees, provisions become abundant, and the city is saved, demonstrating God’s power and faithfulness to His people.",
  "timeline": "c. 850 BC - During the reign of King Jehoram of Israel",
  "keyCharacters": [
    {
      "name": "Elisha",
      "description": "The prophet of God who delivers the word of the Lord predicting the end of the famine and the restoration of provisions in Samaria."
    },
    {
      "name": "The Lord on whose hand the king leaned",
      "description": "A trusted official close to King Jehoram who doubts Elisha’s prophecy and ultimately dies as foretold."
    },
    {
      "name": "Four Leprous Men",
      "description": "Outcasts who take the bold step to investigate the abandoned Syrian camp, leading to the discovery of God’s deliverance."
    },
    {
      "name": "King Jehoram",
      "description": "The king of Israel during the siege of Samaria who receives the report of the Syrian army’s flight."
    }
  ],
  "definitions": [
    {
      "term": "Leprous",
      "definition": "Affected with leprosy, a chronic infectious disease causing skin lesions and social isolation in biblical times."
    },
    {
      "term": "Shekel",
      "definition": "An ancient unit of weight and currency used in Israel, roughly equivalent to 11 grams or about 0.4 ounces."
    },
    {
      "term": "Measure",
      "definition": "A unit of dry volume used for grains; in this context, it refers to a standard quantity of flour or barley."
    },
    {
      "term": "Host",
      "definition": "An army or large group of soldiers."
    }
  ],
  "outline": [
    {
      "heading": "Elisha’s Prophecy of Provision",
      "verseRange": "2 Kings 7:1-2",
      "description": "Elisha announces God’s promise that the famine will end by the next day with abundant food sold at normal prices, though a skeptical official doubts the prophecy."
    },
    {
      "heading": "The Leprous Men’s Decision and Discovery",
      "verseRange": "2 Kings 7:3-10",
      "description": "Four desperate lepers decide to risk their lives by approaching the Syrian camp, only to find it deserted due to God’s supernatural intervention causing the enemy to flee."
    },
    {
      "heading": "Confirmation and Spoiling of the Syrian Camp",
      "verseRange": "2 Kings 7:11-16",
      "description": "The lepers report to the city officials, and the king’s messengers confirm the Syrian army’s flight, leading to the people plundering the abandoned camp and the fulfillment of Elisha’s prophecy."
    },
    {
      "heading": "The Death of the Doubting Official",
      "verseRange": "2 Kings 7:17-20",
      "description": "The official who doubted Elisha’s word is trampled to death at the city gate, fulfilling the prophet’s warning and underscoring the certainty of God’s word."
    }
  ],
  "application": [
    "Trust in God’s promises even when circumstances seem impossible, as He is faithful to fulfill His word.",
    "Step out in faith and obedience, like the lepers, who acted courageously and were used by God to bring about deliverance.",
    "Avoid skepticism toward God’s prophetic word, recognizing that doubt can lead to missed blessings or judgment.",
    "Give God glory for His miraculous provision and deliverance in times of crisis."
  ],
  "keyVerses": [
    {
      "reference": "2 Kings 7:1",
      "text": "Then Elisha said, Hear ye the word of the LORD; Thus saith the LORD, To morrow about this time shall a measure of fine flour be sold for a shekel, and two measures of barley for a shekel, in the gate of Samaria.",
      "significance": "This verse introduces God’s promise of provision and the end of famine, highlighting His sovereign control over circumstances."
    },
    {
      "reference": "2 Kings 7:6",
      "text": "For the Lord had made the host of the Syrians to hear a noise of chariots, and a noise of horses, even the noise of a great host: and they said one to another, Lo, the king of Israel hath hired against us the kings of the Hittites, and the kings of the Egyptians, to come upon us.",
      "significance": "This verse reveals God’s supernatural intervention to cause the enemy’s panic and flight without physical battle."
    },
    {
      "reference": "2 Kings 7:9",
      "text": "Then they said one to another, We do not well: this day is a day of good tidings, and we hold our peace: if we tarry till the morning light, some mischief will come upon us: now therefore come, that we may go and tell the king's household.",
      "significance": "The lepers recognize the importance of proclaiming God’s deliverance, teaching the value of sharing good news promptly."
    },
    {
      "reference": "2 Kings 7:20",
      "text": "And so it fell out unto him: for the people trode upon him in the gate, and he died.",
      "significance": "This verse confirms the fulfillment of Elisha’s prophecy and serves as a sobering reminder of the consequences of unbelief."
    }
  ]
}