{
  "book": "2-kings",
  "bookName": "2 Kings",
  "chapter": 14,
  "title": "Amaziah and Jehoash",
  "shortSummary": "2 Kings 14 recounts the reigns of Amaziah king of Judah and Jehoash king of Israel, highlighting Amaziah's partial faithfulness to God, his military victory over Edom, and subsequent defeat by Israel. The chapter also details Jeroboam II's reign and restoration of Israel's borders, demonstrating God's sovereign control over the nations despite Israel's sin.",
  "timeline": "c. 790-750 BC - Divided Kingdom period during the reigns of Amaziah of Judah and Jehoash and Jeroboam II of Israel",
  "keyCharacters": [
    {
      "name": "Amaziah",
      "description": "King of Judah who reigned for 29 years; he did right in the sight of the LORD but did not fully remove idolatry."
    },
    {
      "name": "Jehoash (Joash)",
      "description": "King of Israel who defeated Amaziah and plundered Jerusalem; he continued the sinful practices of Jeroboam I."
    },
    {
      "name": "Jeroboam II",
      "description": "Son of Joash and king of Israel who restored Israel's borders and brought temporary relief to the nation despite ongoing sin."
    },
    {
      "name": "Jehoahaz",
      "description": "Father of Jehoash and king of Israel mentioned as part of the royal lineage."
    }
  ],
  "definitions": [
    {
      "term": "High Places",
      "definition": "Elevated sites used for pagan worship and sacrifices, often condemned in the Old Testament as idolatrous."
    },
    {
      "term": "Valley of Salt",
      "definition": "A region near the Dead Sea where Amaziah defeated Edom; symbolic of God's judgment on Israel's enemies."
    },
    {
      "term": "Book of the Law of Moses",
      "definition": "The Torah or Pentateuch, containing God's commandments including justice principles such as individual responsibility for sin."
    },
    {
      "term": "Hostages",
      "definition": "People taken as security or guarantees of peace or submission, often royal family members or nobles."
    }
  ],
  "outline": [
    {
      "heading": "Amaziah’s Reign and Early Actions",
      "verseRange": "2 Kings 14:1-7",
      "description": "Amaziah begins his reign at age 25, does right before the LORD but does not remove high places; he avenges his father by killing his murderers and defeats Edom, capturing Selah."
    },
    {
      "heading": "Conflict Between Amaziah and Jehoash",
      "verseRange": "2 Kings 14:8-14",
      "description": "Amaziah challenges Jehoash to battle but ignores Jehoash’s warning; Israel defeats Judah, captures Amaziah, plunders Jerusalem, and breaks down part of its wall."
    },
    {
      "heading": "Amaziah’s Later Years and Death",
      "verseRange": "2 Kings 14:15-21",
      "description": "Jehoash dies and is succeeded by Jeroboam; Amaziah lives 15 years longer but is killed in a conspiracy, and his son Azariah becomes king."
    },
    {
      "heading": "Jeroboam II’s Reign and Restoration",
      "verseRange": "2 Kings 14:22-29",
      "description": "Jeroboam II reigns 41 years, does evil but restores Israel’s borders as prophesied by Jonah, bringing temporary relief to Israel despite ongoing sin."
    }
  ],
  "application": [
    "Trust God’s guidance fully by removing all forms of idolatry in your life, not just partial obedience.",
    "Heed wise counsel and warnings to avoid unnecessary conflict and defeat.",
    "Seek justice tempered with mercy, remembering that each person is responsible for their own sins.",
    "Recognize God's sovereignty in restoring and preserving His people even when they fall short."
  ],
  "keyVerses": [
    {
      "reference": "2 Kings 14:6",
      "text": "But the children of the murderers he slew not: according unto that which is written in the book of the law of Moses, wherein the LORD commanded, saying, The fathers shall not be put to death for the children, nor the children be put to death for the fathers; but every man shall be put to death for his own sin.",
      "significance": "This verse highlights God's justice principle of individual responsibility for sin."
    },
    {
      "reference": "2 Kings 14:10",
      "text": "Thou hast indeed smitten Edom, and thine heart hath lifted thee up: glory of this, and tarry at home: for why shouldest thou meddle to thy hurt, that thou shouldest fall, even thou, and Judah with thee?",
      "significance": "A warning against pride and overreaching that leads to downfall."
    },
    {
      "reference": "2 Kings 14:27",
      "text": "And the LORD said not that he would blot out the name of Israel from under heaven: but he saved them by the hand of Jeroboam the son of Joash.",
      "significance": "God’s mercy preserves His people despite their sin, demonstrating His faithfulness."
    }
  ]
}