{
  "book": "2-kings",
  "bookName": "2 Kings",
  "chapter": 8,
  "title": "Elisha, Kings, and Prophecy",
  "shortSummary": "2 Kings Chapter 8 highlights Elisha’s prophetic ministry during a time of famine and political upheaval. It records the restoration of a widow’s property, the rise of Hazael as king of Syria, and the reigns of Jehoram and Ahaziah in Judah, emphasizing God’s sovereign control over nations and kings.",
  "timeline": "c. 850 BC - Reigns of Jehoram and Ahaziah in Judah and Israel during the divided monarchy period",
  "keyCharacters": [
    {
      "name": "Elisha",
      "description": "The prophet of God who performs miracles, delivers God’s messages, and reveals future events, including the coming famine and the rise of Hazael."
    },
    {
      "name": "The Woman",
      "description": "A widow whose son Elisha restored to life; she is instructed to flee the famine and later successfully petitions the king to restore her property."
    },
    {
      "name": "Hazael",
      "description": "Servant of King Benhadad of Syria who visits Elisha, receives a prophecy of evil deeds, and ultimately becomes king by killing Benhadad."
    },
    {
      "name": "Jehoram (Joram) of Judah",
      "description": "Son of Jehoshaphat who reigns as king of Judah, walking in the sinful ways of Israel’s kings, yet God preserves Judah for David’s sake."
    },
    {
      "name": "Ahaziah of Judah",
      "description": "Son of Jehoram who reigns briefly and follows the evil ways of Ahab’s house, allied with Israel in war against Syria."
    }
  ],
  "definitions": [
    {
      "term": "Man of God",
      "definition": "A title used for prophets like Elisha, indicating one who speaks and acts on behalf of God."
    },
    {
      "term": "Sojourn",
      "definition": "To live temporarily in a place; the woman and her household sojourn in Philistine territory to escape famine."
    },
    {
      "term": "Chronicles of the kings",
      "definition": "Historical records or annals kept by the kingdom that detailed the reigns and deeds of kings, referenced as sources for further information."
    },
    {
      "term": "Present",
      "definition": "A gift or tribute given as a sign of respect or to seek favor, here Hazael brings a large present to Elisha."
    }
  ],
  "outline": [
    {
      "heading": "Elisha Warns of Famine and the Widow’s Restoration",
      "verseRange": "2 Kings 8:1-6",
      "description": "Elisha instructs the woman whose son he revived to flee a coming seven-year famine. After the famine, she petitions the king and has her property fully restored, demonstrating God’s provision and justice."
    },
    {
      "heading": "Elisha’s Prophecy to Hazael and the Rise of a New King",
      "verseRange": "2 Kings 8:7-15",
      "description": "Elisha prophesies to Hazael about King Benhadad’s illness and foretells his death and Hazael’s violent future reign over Syria, revealing God’s sovereign control over political events."
    },
    {
      "heading": "Jehoram’s Reign in Judah",
      "verseRange": "2 Kings 8:16-24",
      "description": "Jehoram, son of Jehoshaphat, becomes king of Judah, walking in the sinful ways of Israel’s kings due to his marriage to Ahab’s daughter, yet God preserves Judah for David’s sake despite his evil."
    },
    {
      "heading": "Ahaziah’s Brief Reign and Alliance with Israel",
      "verseRange": "2 Kings 8:25-29",
      "description": "Ahaziah, son of Jehoram, reigns one year and follows the evil ways of Ahab’s house. He allies with Israel’s king Joram in battle against Syria, setting the stage for future conflict."
    }
  ],
  "application": [
    "Trust God’s prophetic word and obey His instructions even when they require difficult actions, as the widow did by fleeing the famine.",
    "Recognize God’s sovereign authority over nations and leaders, and pray for wisdom and justice in government.",
    "Avoid alliances and influences that lead to compromise with evil, as seen in the reigns of Jehoram and Ahaziah.",
    "Seek God’s guidance in times of uncertainty and hardship, trusting that He works all things for His purposes."
  ],
  "keyVerses": [
    {
      "reference": "2 Kings 8:1",
      "text": "Then spake Elisha unto the woman, whose son he had restored to life, saying, Arise, and go thou and thine household, and sojourn wheresoever thou canst sojourn: for the LORD hath called for a famine; and it shall also come upon the land seven years.",
      "significance": "This verse highlights God’s foreknowledge and Elisha’s role as His prophet warning of coming judgment and calling for obedience."
    },
    {
      "reference": "2 Kings 8:10",
      "text": "And Elisha said unto him, Go, say unto him, Thou mayest certainly recover: howbeit the LORD hath shewed me that he shall surely die.",
      "significance": "This verse reveals the tension between God’s apparent mercy and His sovereign judgment, showing the complexity of prophetic revelation."
    },
    {
      "reference": "2 Kings 8:18",
      "text": "And he walked in the way of the kings of Israel, as did the house of Ahab: for the daughter of Ahab was his wife: and he did evil in the sight of the LORD.",
      "significance": "This verse explains the spiritual failure of Jehoram, emphasizing the influence of ungodly relationships on a king’s conduct."
    },
    {
      "reference": "2 Kings 8:24",
      "text": "And Joram slept with his fathers, and was buried with his fathers in the city of David: and Ahaziah his son reigned in his stead.",
      "significance": "This verse marks the transition of leadership in Judah, reminding readers of the brevity of life and the continuation of God’s sovereign plan."
    }
  ]
}