{
  "book": "2-kings",
  "bookName": "2 Kings",
  "chapter": 4,
  "title": "Elisha's Miracles",
  "shortSummary": "2 Kings Chapter 4 showcases several miracles performed by the prophet Elisha, demonstrating God's provision, power over death, and care for His people. Through these events, the chapter highlights God's compassion and the prophet's role as His servant, affirming faith in divine intervention.",
  "timeline": "c. 9th century BC - Ministry of Elisha in the Northern Kingdom of Israel",
  "keyCharacters": [
    {
      "name": "Elisha",
      "description": "The prophet of God who performs miracles to aid and bless the people, demonstrating God's power and care."
    },
    {
      "name": "The Shunammite Woman",
      "description": "A hospitable woman who shows kindness to Elisha and is blessed with a miraculous son through his prophecy."
    },
    {
      "name": "Gehazi",
      "description": "Elisha's servant who assists in the miracles and carries out Elisha's instructions."
    },
    {
      "name": "The Widow",
      "description": "A woman in distress who seeks Elisha's help to save her sons from slavery by a miraculous multiplication of oil."
    }
  ],
  "definitions": [
    {
      "term": "Bondmen",
      "definition": "Servants or slaves bound to work for a creditor as payment for a debt."
    },
    {
      "term": "Prophets' Sons",
      "definition": "Groups or communities of prophets who followed and learned from a leading prophet like Elisha."
    },
    {
      "term": "Pottage",
      "definition": "A thick soup or stew made by boiling vegetables or grains, common food in biblical times."
    },
    {
      "term": "New Moon",
      "definition": "A monthly festival marking the beginning of a new lunar month, often observed with religious significance."
    }
  ],
  "outline": [
    {
      "heading": "The Widow’s Oil Multiplied to Pay Debt",
      "verseRange": "2 Kings 4:1-7",
      "description": "A widow of a prophet’s son pleads for help to save her children from slavery due to debt. Elisha miraculously multiplies her small amount of oil, enabling her to sell it, pay her debt, and live with her children, illustrating God’s provision."
    },
    {
      "heading": "The Shunammite Woman’s Son Restored to Life",
      "verseRange": "2 Kings 4:8-37",
      "description": "Elisha is hospitably received by a wealthy woman from Shunem who desires a child. God grants her a son, but the child later dies. Elisha prays and performs a miracle, restoring the boy to life, demonstrating God’s power over death."
    },
    {
      "heading": "The Poisonous Stew Made Safe",
      "verseRange": "2 Kings 4:38-41",
      "description": "During a famine, Elisha instructs the sons of the prophets to prepare food. When poisonous gourds are unknowingly added, Elisha purifies the stew by God’s power, showing divine protection and care."
    },
    {
      "heading": "The Miracle of the Loaves",
      "verseRange": "2 Kings 4:42-44",
      "description": "A man brings Elisha twenty barley loaves and some grain, which Elisha miraculously multiplies to feed a hundred men with leftovers, foreshadowing Christ’s feeding miracles and God’s abundant provision."
    }
  ],
  "application": [
    "Trust God to provide in times of financial or personal crisis, as He miraculously provided for the widow.",
    "Show hospitality and faithfulness to God’s servants, as the Shunammite woman did, trusting God’s promises.",
    "Bring your burdens and losses to God in prayer, believing in His power to restore and heal.",
    "Have faith in God’s protection and provision even in difficult circumstances, relying on His word and power."
  ],
  "keyVerses": [
    {
      "reference": "2 Kings 4:7",
      "text": "Then she came and told the man of God. And he said, Go, sell the oil, and pay thy debt, and live thou and thy children of the rest.",
      "significance": "This verse highlights God’s provision through Elisha, offering hope and practical deliverance in times of need."
    },
    {
      "reference": "2 Kings 4:16",
      "text": "And he said to her, About this season, according to the time of life, thou shalt embrace a son. And she said, Nay, my lord, thou man of God, do not lie unto thine handmaid.",
      "significance": "This prophecy shows God’s power to bless and fulfill promises, even when circumstances seem impossible."
    },
    {
      "reference": "2 Kings 4:35",
      "text": "Then he returned, and walked in the house to and fro; and went up, and stretched himself upon him: and the child sneezed seven times, and the child opened his eyes.",
      "significance": "This verse demonstrates God’s power over death and the miraculous life-giving ability granted through His prophet."
    },
    {
      "reference": "2 Kings 4:44",
      "text": "So he set it before them, and they did eat, and left thereof, according to the word of the LORD.",
      "significance": "This verse affirms God’s abundant provision and faithfulness to His promises, even when resources seem insufficient."
    }
  ]
}