{
  "book": "2-kings",
  "bookName": "2 Kings",
  "chapter": 12,
  "title": "Reign and Repairs of Jehoash",
  "shortSummary": "2 Kings 12 recounts the reign of Jehoash (Joash), king of Judah, who did what was right under the guidance of the priest Jehoiada. The chapter highlights Jehoash’s efforts to repair the temple, the misuse and subsequent faithful management of temple funds, and ends with his assassination by his own servants.",
  "timeline": "c. 835-796 BC - Reign of Jehoash, King of Judah",
  "keyCharacters": [
    {
      "name": "Jehoash (Joash)",
      "description": "King of Judah who reigned for forty years; he sought to restore the temple under priestly guidance but faced challenges and was ultimately assassinated."
    },
    {
      "name": "Jehoiada",
      "description": "The high priest who instructed Jehoash and oversaw the temple repairs, ensuring the proper use of funds dedicated to the house of the LORD."
    },
    {
      "name": "Hazael",
      "description": "King of Syria who waged war against Gath and threatened Jerusalem, prompting Jehoash to pay tribute to him."
    },
    {
      "name": "Jozachar and Jehozabad",
      "description": "Servants of Jehoash who conspired and assassinated him in the house of Millo."
    }
  ],
  "definitions": [
    {
      "term": "High Places",
      "definition": "Elevated sites used for worship and sacrifices, often associated with idolatry and condemned by the Mosaic Law."
    },
    {
      "term": "Dedicated Things",
      "definition": "Items or money set apart and consecrated for the service of the temple and the LORD."
    },
    {
      "term": "Trespass Money and Sin Money",
      "definition": "Monetary offerings given as restitution for sins or offenses, which were kept by the priests rather than placed in the temple treasury."
    },
    {
      "term": "House of Millo",
      "definition": "A fortified area or structure in Jerusalem, near the city wall, where Jehoash was assassinated."
    }
  ],
  "outline": [
    {
      "heading": "Jehoash’s Early Reign and Temple Neglect",
      "verseRange": "2 Kings 12:1-6",
      "description": "Jehoash begins his reign doing right under Jehoiada’s instruction, but the people continue to worship at high places, and the temple suffers breaches that remain unrepaired for many years."
    },
    {
      "heading": "Reform in Temple Fund Management",
      "verseRange": "2 Kings 12:7-16",
      "description": "Jehoash confronts the priests about the neglected temple repairs, leading to a new system for collecting and using funds specifically for restoring the temple, demonstrating faithful stewardship."
    },
    {
      "heading": "Conflict with Syria and Tribute",
      "verseRange": "2 Kings 12:17-18",
      "description": "Hazael king of Syria attacks Gath and threatens Jerusalem, causing Jehoash to send treasures from the temple and palace as tribute to secure peace."
    },
    {
      "heading": "Jehoash’s Death and Succession",
      "verseRange": "2 Kings 12:19-21",
      "description": "Jehoash’s reign ends violently when his servants conspire and kill him; he is buried in the city of David, and his son Amaziah succeeds him."
    }
  ],
  "application": [
    "Commit to doing what is right in the sight of the LORD, especially under godly counsel and instruction.",
    "Be faithful and transparent in managing resources dedicated to God’s work, ensuring integrity in stewardship.",
    "Recognize the dangers of compromise, such as tolerating idolatry or neglecting God’s commands, and strive for wholehearted obedience.",
    "Pray for protection and wisdom in times of external threats and internal challenges, trusting God’s sovereignty over all circumstances."
  ],
  "keyVerses": [
    {
      "reference": "2 Kings 12:2",
      "text": "And Jehoash did that which was right in the sight of the LORD all his days wherein Jehoiada the priest instructed him.",
      "significance": "This verse highlights the importance of godly mentorship and obedience to the LORD as the foundation of a righteous life."
    },
    {
      "reference": "2 Kings 12:9",
      "text": "But Jehoiada the priest took a chest, and bored a hole in the lid of it, and set it beside the altar, on the right side as one cometh into the house of the LORD: and the priests that kept the door put therein all the money that was brought into the house of the LORD.",
      "significance": "This verse illustrates practical reform and accountability in the stewardship of God’s house, emphasizing transparency and dedicated use of offerings."
    },
    {
      "reference": "2 Kings 12:18",
      "text": "And Jehoash king of Judah took all the hallowed things that Jehoshaphat, and Jehoram, and Ahaziah, his fathers, kings of Judah, had dedicated, and his own hallowed things, and all the gold that was found in the treasures of the house of the LORD, and in the king's house, and sent it to Hazael king of Syria: and he went away from Jerusalem.",
      "significance": "This verse reveals the consequences of political pressure and the cost of peace when the king must give away sacred treasures, showing the tension between faith and fear."
    },
    {
      "reference": "2 Kings 12:21",
      "text": "For Jozachar the son of Shimeath, and Jehozabad the son of Shomer, his servants, smote him, and he died; and they buried him with his fathers in the city of David: and Amaziah his son reigned in his stead.",
      "significance": "This verse marks the tragic end of Jehoash’s reign, reminding readers of the consequences of internal betrayal and the fragile nature of earthly leadership."
    }
  ]
}