{
  "book": "2-kings",
  "bookName": "2 Kings",
  "chapter": 20,
  "title": "Hezekiah's Healing and Prophecy",
  "shortSummary": "This chapter recounts King Hezekiah's serious illness and miraculous healing after his heartfelt prayer to God, along with a sign confirming God's promise to extend his life. It also includes a visit from Babylonian envoys, Hezekiah's pride in his wealth, and Isaiah's prophecy of Babylonian captivity, highlighting themes of faith, God's sovereignty, and the consequences of human actions.",
  "timeline": "c. 700 BC - Reign of King Hezekiah of Judah",
  "keyCharacters": [
    {
      "name": "Hezekiah",
      "description": "King of Judah who becomes gravely ill but prays earnestly to God for healing and receives an extension of his life."
    },
    {
      "name": "Isaiah",
      "description": "The prophet who delivers God's messages to Hezekiah, including the pronouncement of death, the promise of healing, and the prophecy concerning Babylon."
    },
    {
      "name": "Berodachbaladan",
      "description": "King of Babylon who sends envoys and gifts to Hezekiah upon hearing of his illness, initiating a diplomatic exchange."
    }
  ],
  "definitions": [
    {
      "term": "Perfect heart",
      "definition": "A heart fully devoted to God, sincere and upright in faith and conduct."
    },
    {
      "term": "Dial of Ahaz",
      "definition": "A sundial or shadow clock used to measure time by the movement of the sun's shadow, referenced here as a sign from God."
    },
    {
      "term": "Eunuchs",
      "definition": "Men who have been castrated, often serving in royal courts; here symbolizing captivity and loss of royal lineage."
    },
    {
      "term": "Middle court",
      "definition": "An inner courtyard within the king's palace where Isaiah received God's message to return to Hezekiah."
    }
  ],
  "outline": [
    {
      "heading": "Hezekiah's Illness and Prayer",
      "verseRange": "2 Kings 20:1-3",
      "description": "Hezekiah is gravely ill and told by Isaiah that he will die; he turns to prayer, pleading with God to remember his faithful walk and weeps bitterly, demonstrating humility and dependence on God."
    },
    {
      "heading": "God's Promise of Healing and Extended Life",
      "verseRange": "2 Kings 20:4-7",
      "description": "Before Isaiah leaves the palace, God commands him to return and tell Hezekiah that He has heard his prayer, will heal him, add fifteen years to his life, and protect Jerusalem from Assyria."
    },
    {
      "heading": "The Sign of the Shadow Reversed",
      "verseRange": "2 Kings 20:8-11",
      "description": "Hezekiah requests a sign to confirm God's promise; Isaiah prays, and God miraculously causes the shadow on the sundial to move backward ten degrees, affirming His word."
    },
    {
      "heading": "Babylonian Envoys and Hezekiah's Pride",
      "verseRange": "2 Kings 20:12-15",
      "description": "Envoys from Babylon visit Hezekiah, who proudly shows them all his treasures, revealing a lapse in wisdom and trust in God's protection."
    },
    {
      "heading": "Isaiah's Prophecy of Babylonian Captivity",
      "verseRange": "2 Kings 20:16-18",
      "description": "Isaiah delivers God's warning that all treasures and descendants will be taken to Babylon, foretelling the exile as a consequence of Hezekiah's actions."
    },
    {
      "heading": "Hezekiah's Death and Succession",
      "verseRange": "2 Kings 20:19-21",
      "description": "The chapter concludes with a brief note on Hezekiah's death, his acceptance of God's word, and the succession of his son Manasseh."
    }
  ],
  "application": [
    "Approach God with humility and earnest prayer in times of crisis, trusting His mercy and faithfulness.",
    "Seek confirmation of God's promises through His Word and be encouraged by His sovereign power.",
    "Guard against pride and the temptation to trust in material wealth or political alliances rather than God.",
    "Accept God's discipline and warnings with a heart of faith, recognizing His plans are for ultimate good."
  ],
  "keyVerses": [
    {
      "reference": "2 Kings 20:3",
      "text": "I beseech thee, O LORD, remember now how I have walked before thee in truth and with a perfect heart, and have done that which is good in thy sight. And Hezekiah wept sore.",
      "significance": "This verse highlights Hezekiah's sincere repentance and faith, showing the power of heartfelt prayer."
    },
    {
      "reference": "2 Kings 20:6",
      "text": "And I will add unto thy days fifteen years; and I will deliver thee and this city out of the hand of the king of Assyria; and I will defend this city for mine own sake, and for my servant David's sake.",
      "significance": "God's promise to extend Hezekiah's life and protect Jerusalem underscores His covenant faithfulness."
    },
    {
      "reference": "2 Kings 20:11",
      "text": "And Isaiah the prophet cried unto the LORD: and he brought the shadow ten degrees backward, by which it had gone down in the dial of Ahaz.",
      "significance": "The miraculous sign confirms God's power over nature and His assurance to Hezekiah."
    },
    {
      "reference": "2 Kings 20:19",
      "text": "Then said Hezekiah unto Isaiah, Good is the word of the LORD which thou hast spoken. And he said, Is it not good, if peace and truth be in my days?",
      "significance": "Hezekiah's acceptance of God's judgment with peace reflects a heart trusting in God's sovereignty."
    }
  ]
}