{
  "book": "2-kings",
  "bookName": "2 Kings",
  "chapter": 9,
  "title": "Jehu Anointed King",
  "shortSummary": "In 2 Kings 9, the prophet Elisha directs a young prophet to anoint Jehu as king over Israel, initiating a divinely ordained coup against the house of Ahab. Jehu swiftly executes judgment on Joram, Ahaziah, and Jezebel, fulfilling God's promises to punish Ahab's dynasty for their idolatry and bloodshed. This chapter highlights God's sovereignty in raising leaders to carry out His justice.",
  "timeline": "c. 850 BC - The reign of Jehu and the fall of Ahab's dynasty in the Northern Kingdom of Israel",
  "keyCharacters": [
    {
      "name": "Jehu",
      "description": "Son of Jehoshaphat, anointed king of Israel by divine command to overthrow Ahab’s house and execute God's judgment."
    },
    {
      "name": "Elisha",
      "description": "Prophet of God who commissions the anointing of Jehu, acting as God's messenger to bring about His will."
    },
    {
      "name": "Joram (Jehoram)",
      "description": "King of Israel from Ahab’s family, wounded in battle and killed by Jehu as part of God's judgment."
    },
    {
      "name": "Ahaziah",
      "description": "King of Judah and ally of Joram, killed by Jehu during the coup."
    },
    {
      "name": "Jezebel",
      "description": "Wicked queen mother, wife of Ahab, notorious for promoting idolatry and persecuting prophets, killed by Jehu’s order."
    }
  ],
  "definitions": [
    {
      "term": "Anoint",
      "definition": "To ceremonially pour oil on a person’s head as a sign of divine appointment to a special office, such as kingship."
    },
    {
      "term": "Ramothgilead",
      "definition": "A city east of the Jordan River, often a strategic military site in Israel’s history."
    },
    {
      "term": "Whoredoms",
      "definition": "A biblical term referring to spiritual unfaithfulness or idolatry, often likened to adultery against God."
    },
    {
      "term": "Eunuchs",
      "definition": "Men who were castrated, often serving in royal courts as trusted attendants or officials."
    },
    {
      "term": "Plat",
      "definition": "A plot or piece of land; here referring to the field of Naboth where Joram was to be buried."
    }
  ],
  "outline": [
    {
      "heading": "Elisha commissions Jehu’s anointing",
      "verseRange": "2 Kings 9:1-10",
      "description": "Elisha sends a young prophet to anoint Jehu as king over Israel, charging him to destroy Ahab’s house as divine judgment for their sins."
    },
    {
      "heading": "Jehu proclaimed king and begins his coup",
      "verseRange": "2 Kings 9:11-14",
      "description": "Jehu reveals the prophecy to the captains, who proclaim him king; he then conspires against King Joram while he is recovering from battle wounds."
    },
    {
      "heading": "Jehu kills Joram and Ahaziah",
      "verseRange": "2 Kings 9:15-29",
      "description": "Jehu confronts and kills Joram and Ahaziah, fulfilling God’s judgment and avenging the blood of Naboth as commanded."
    },
    {
      "heading": "Jehu executes Jezebel",
      "verseRange": "2 Kings 9:30-37",
      "description": "Jezebel confronts Jehu but is thrown from a window and trampled by horses; her death fulfills Elijah’s prophecy about her fate."
    }
  ],
  "application": [
    "Trust in God’s sovereign plan even when it involves difficult judgments; He raises leaders to accomplish His purposes.",
    "Obedience to God’s commands is essential, even when it requires courage to confront evil and injustice.",
    "God’s justice will ultimately prevail against idolatry and wickedness; believers should remain faithful and prayerful.",
    "Remember that God’s promises are sure, and His word through His prophets will be fulfilled in His timing."
  ],
  "keyVerses": [
    {
      "reference": "2 Kings 9:7",
      "text": "And thou shalt smite the house of Ahab thy master, that I may avenge the blood of my servants the prophets, and the blood of all the servants of the LORD, at the hand of Jezebel.",
      "significance": "This verse reveals God’s purpose in anointing Jehu: to execute justice on Ahab’s house for their persecution of His prophets."
    },
    {
      "reference": "2 Kings 9:24",
      "text": "And Jehu drew a bow with his full strength, and smote Jehoram between his arms, and the arrow went out at his heart, and he sunk down in his chariot.",
      "significance": "This verse marks the decisive fulfillment of God’s judgment against Joram, symbolizing the end of Ahab’s dynasty."
    },
    {
      "reference": "2 Kings 9:36",
      "text": "Wherefore they came again, and told him. And he said, This is the word of the LORD, which he spake by his servant Elijah the Tishbite, saying, In the portion of Jezreel shall dogs eat the flesh of Jezebel:",
      "significance": "Jehu confirms that Jezebel’s death fulfills Elijah’s prophecy, showing God’s faithfulness to His word."
    }
  ]
}