{
  "book": "2-samuel",
  "bookName": "2 Samuel",
  "chapter": 17,
  "title": "Absalom's Rebellion Counsel",
  "shortSummary": "This chapter details the strategic counsel given during Absalom’s rebellion against King David, highlighting the contrasting advice of Ahithophel and Hushai. It demonstrates God's providential intervention in thwarting Absalom’s plans and preserving David’s life and reign. The chapter also shows the loyalty of David’s supporters and the tragic end of Ahithophel.",
  "timeline": "c. 1000 BC - The Rebellion of Absalom during King David's reign",
  "keyCharacters": [
    {
      "name": "Absalom",
      "description": "David’s son who leads a rebellion to usurp the throne, seeking counsel to defeat his father."
    },
    {
      "name": "Ahithophel",
      "description": "A wise counselor to Absalom whose advice is initially favored but ultimately rejected, leading to his suicide."
    },
    {
      "name": "Hushai",
      "description": "David’s loyal friend who infiltrates Absalom’s court to counter Ahithophel’s counsel and protect David."
    },
    {
      "name": "Jonathan and Ahimaaz",
      "description": "Messengers who faithfully deliver critical intelligence to David, enabling his escape."
    }
  ],
  "definitions": [
    {
      "term": "Weary and weak handed",
      "definition": "A phrase indicating physical and emotional exhaustion, making one vulnerable to attack."
    },
    {
      "term": "Ropes to that city",
      "definition": "A metaphor for besieging and destroying a city, implying total conquest and demolition."
    },
    {
      "term": "Sepulchre",
      "definition": "A tomb or burial place, often used in biblical contexts to denote family burial sites."
    },
    {
      "term": "Valiant men",
      "definition": "Brave and courageous warriors known for their strength and loyalty."
    }
  ],
  "outline": [
    {
      "heading": "Ahithophel’s Counsel to Pursue David",
      "verseRange": "2 Samuel 17:1-5",
      "description": "Ahithophel advises Absalom to immediately attack David with a select force, aiming to strike the king alone and cause the rest to flee, promising swift victory and peace. This counsel initially pleases Absalom and the elders."
    },
    {
      "heading": "Hushai’s Counter-Counsel",
      "verseRange": "2 Samuel 17:6-14",
      "description": "Hushai advises against Ahithophel’s plan, warning that David and his men are fierce warriors who will not be easily defeated. He counsels Absalom to gather all Israel for a full-scale battle, which leads Absalom and the elders to prefer Hushai’s advice, fulfilling God’s purpose to frustrate Ahithophel."
    },
    {
      "heading": "Hushai’s Warning to David",
      "verseRange": "2 Samuel 17:15-22",
      "description": "Hushai secretly informs the priests Zadok and Abiathar of the counsel given and instructs them to warn David to flee immediately. Jonathan and Ahimaaz deliver the message despite danger, enabling David to escape safely across the Jordan."
    },
    {
      "heading": "Ahithophel’s Suicide",
      "verseRange": "2 Samuel 17:23",
      "description": "Seeing that his advice was rejected and that Absalom’s rebellion is doomed, Ahithophel returns home, arranges his affairs, and takes his own life, marking a tragic end to his role in the rebellion."
    },
    {
      "heading": "David’s Refuge and Support",
      "verseRange": "2 Samuel 17:24-29",
      "description": "David reaches Mahanaim safely, while Absalom and Israel camp in Gilead. Loyal supporters bring provisions to David and his weary followers, demonstrating faithfulness and God’s ongoing provision."
    }
  ],
  "application": [
    "Trust in God’s providence even when circumstances seem dire, as He can turn the counsel of men to fulfill His purposes.",
    "Be discerning about advice and counsel, seeking wisdom that aligns with God’s truth rather than merely popular opinion.",
    "Remain faithful and courageous in times of trial, as exemplified by David’s loyal friends who risked their lives to serve him.",
    "Respond to God’s warnings promptly and obey His guidance to avoid unnecessary harm."
  ],
  "keyVerses": [
    {
      "reference": "2 Samuel 17:14",
      "text": "And Absalom and all the men of Israel said, The counsel of Hushai the Archite is better than the counsel of Ahithophel. For the LORD had appointed to defeat the good counsel of Ahithophel, to the intent that the LORD might bring evil upon Absalom.",
      "significance": "This verse highlights God’s sovereign control over human plans and His intervention to protect David."
    },
    {
      "reference": "2 Samuel 17:22",
      "text": "Then David arose, and all the people that were with him, and they passed over Jordan: by the morning light there lacked not one of them that was not gone over Jordan.",
      "significance": "This verse emphasizes God’s protection over David and his followers, ensuring their safe escape."
    },
    {
      "reference": "2 Samuel 17:23",
      "text": "And when Ahithophel saw that his counsel was not followed, he saddled his ass, and arose, and gat him home to his house, to his city, and put his household in order, and hanged himself, and died, and was buried in the sepulchre of his father.",
      "significance": "This verse shows the tragic consequences of rejecting God’s will and the despair that can come from opposing His plans."
    }
  ]
}