{
  "book": "acts",
  "bookName": "Acts",
  "chapter": 11,
  "title": "Gentiles Receive the Gospel",
  "shortSummary": "Acts 11 recounts the early church's pivotal moment of recognizing that the gospel is for Gentiles as well as Jews. Peter defends his actions in sharing the gospel with Gentiles, and the church in Antioch grows as believers from diverse backgrounds come together. This chapter highlights God's sovereignty in extending salvation beyond ethnic boundaries and the importance of obedience to the Holy Spirit.",
  "timeline": "c. AD 33-35 - Early Church Expansion and Gentile Inclusion",
  "keyCharacters": [
    {
      "name": "Peter",
      "description": "One of Jesus’ apostles who receives a vision from God, leading him to preach to Gentiles and defend this action to the Jerusalem church."
    },
    {
      "name": "Barnabas",
      "description": "A respected leader in the early church sent from Jerusalem to Antioch to encourage the new believers and later seeks Saul to assist in teaching."
    },
    {
      "name": "Saul (Paul)",
      "description": "A former persecutor of the church who is brought to Antioch by Barnabas to help teach the growing Gentile church."
    },
    {
      "name": "Agabus",
      "description": "A prophet from Jerusalem who foretells a coming famine, prompting the Antioch church to send aid to the believers in Judea."
    }
  ],
  "definitions": [
    {
      "term": "Circumcision",
      "definition": "The Jewish rite of removing the foreskin, symbolizing the covenant between God and Israel; here it represents Jewish identity and religious boundary."
    },
    {
      "term": "Gentiles",
      "definition": "Non-Jewish people; in this chapter, they are the new recipients of the gospel message."
    },
    {
      "term": "Holy Ghost",
      "definition": "The Holy Spirit, the third Person of the Trinity, who empowers believers and confirms God’s acceptance of Gentiles."
    },
    {
      "term": "Common or Unclean",
      "definition": "Terms referring to things or people considered ceremonially impure under Jewish law; God’s vision redefines these distinctions."
    }
  ],
  "outline": [
    {
      "heading": "Peter’s Defense of Gentile Inclusion",
      "verseRange": "Acts 11:1-18",
      "description": "Peter explains to the Jerusalem church how God revealed through a vision that the gospel was to be shared with Gentiles, affirming that God shows no partiality and grants repentance and salvation to all."
    },
    {
      "heading": "The Spread of the Gospel to Antioch",
      "verseRange": "Acts 11:19-21",
      "description": "Believers scattered by persecution preach to Jews and Gentiles in new regions, notably Antioch, where a significant number come to faith, demonstrating the gospel’s expanding reach."
    },
    {
      "heading": "Barnabas Encourages the New Church",
      "verseRange": "Acts 11:22-26",
      "description": "The Jerusalem church sends Barnabas to Antioch, where he encourages the believers and brings Saul to help teach, marking the first use of the term 'Christians' for the disciples."
    },
    {
      "heading": "Prophecy and Generosity in Antioch",
      "verseRange": "Acts 11:27-30",
      "description": "Prophets including Agabus predict a famine, prompting the Antioch church to send aid to Judean believers, reflecting early church unity and care."
    }
  ],
  "application": [
    "Trust God’s guidance even when it challenges traditional boundaries or personal biases, as Peter did with the Gentiles.",
    "Encourage and support new believers with grace and teaching, just as Barnabas did in Antioch.",
    "Be sensitive to the leading of the Holy Spirit in ministry decisions and outreach.",
    "Practice generosity and care for fellow believers, especially in times of hardship."
  ],
  "keyVerses": [
    {
      "reference": "Acts 11:17",
      "text": "Forasmuch then as God gave them the like gift as he did unto us, who believed on the Lord Jesus Christ; what was I, that I could withstand God?",
      "significance": "This verse highlights the recognition that God’s gifts and salvation are for all believers, affirming obedience to God’s will."
    },
    {
      "reference": "Acts 11:18",
      "text": "When they heard these things, they held their peace, and glorified God, saying, Then hath God also to the Gentiles granted repentance unto life.",
      "significance": "It marks the church’s acceptance that Gentiles are included in God’s plan of salvation, a foundational moment for the universal church."
    },
    {
      "reference": "Acts 11:26",
      "text": "And when he had found him, he brought him unto Antioch. And it came to pass, that a whole year they assembled themselves with the church, and taught much people. And the disciples were called Christians first in Antioch.",
      "significance": "This verse shows the establishment of a strong, teaching church in Antioch and the first use of the name 'Christian,' signifying the identity of believers."
    }
  ]
}