{
  "book": "acts",
  "bookName": "Acts",
  "chapter": 15,
  "title": "The Jerusalem Council",
  "shortSummary": "Acts 15 details the pivotal Jerusalem Council where early church leaders addressed the controversy over Gentile believers and the Mosaic Law, particularly circumcision. This chapter highlights the unity of the apostles and elders in affirming salvation by grace through faith, not by works of the law, and sets guidelines for Gentile believers to maintain fellowship with Jewish Christians.",
  "timeline": "c. AD 48-49 - Early Church Council in Jerusalem",
  "keyCharacters": [
    {
      "name": "Paul",
      "description": "A leading apostle to the Gentiles who defends the gospel of grace and participates actively in the Jerusalem Council."
    },
    {
      "name": "Barnabas",
      "description": "Paul’s companion and fellow missionary who supports the inclusion of Gentiles without circumcision."
    },
    {
      "name": "Peter",
      "description": "One of the original apostles who testifies to God’s acceptance of Gentiles by faith without the law."
    },
    {
      "name": "James",
      "description": "The leader of the Jerusalem church who delivers the final judgment and instructions regarding Gentile believers."
    },
    {
      "name": "Silas",
      "description": "A prophet and leader sent with Paul and Barnabas to deliver the council’s letter to the Gentile churches."
    }
  ],
  "definitions": [
    {
      "term": "Circumcision",
      "definition": "The physical sign of the covenant given to Abraham’s descendants, which some Jewish Christians insisted Gentile believers must undergo to be saved."
    },
    {
      "term": "Pharisees",
      "definition": "A Jewish sect known for strict adherence to the Mosaic Law, some of whom believed Gentile converts must follow the law fully."
    },
    {
      "term": "Pollutions of idols",
      "definition": "Refers to practices associated with idol worship, including eating food sacrificed to idols, which Gentile believers were instructed to avoid."
    },
    {
      "term": "Yoke",
      "definition": "A metaphor for burdensome obligations; here it refers to the Mosaic Law’s demands imposed on Gentile believers."
    }
  ],
  "outline": [
    {
      "heading": "The Controversy over Circumcision",
      "verseRange": "Acts 15:1-5",
      "description": "Certain men from Judea teach that Gentile believers must be circumcised to be saved, causing dispute and concern among the early Christians."
    },
    {
      "heading": "The Jerusalem Council Assembles",
      "verseRange": "Acts 15:6-21",
      "description": "The apostles and elders meet to deliberate; Peter, Paul, Barnabas, and James speak, affirming salvation by grace and deciding not to burden Gentiles with the full Mosaic Law but to require abstaining from certain practices."
    },
    {
      "heading": "The Letter to the Gentile Believers",
      "verseRange": "Acts 15:22-29",
      "description": "The council sends a letter with chosen representatives to Antioch, instructing Gentile believers to abstain from idolatry, fornication, strangled animals, and blood to maintain fellowship."
    },
    {
      "heading": "Reception and Strengthening of the Churches",
      "verseRange": "Acts 15:30-35",
      "description": "The letter is received with joy in Antioch, and Judas and Silas encourage the believers, strengthening the church through prophecy and teaching."
    },
    {
      "heading": "Paul and Barnabas Part Ways",
      "verseRange": "Acts 15:36-41",
      "description": "A sharp disagreement over taking John Mark leads to Paul and Barnabas separating, each continuing missionary work with different companions."
    }
  ],
  "application": [
    "Trust in salvation by grace through faith in Jesus Christ rather than relying on legalistic works or rituals.",
    "Seek unity in the church by addressing doctrinal disputes through prayerful discussion and reliance on Scripture and the Holy Spirit.",
    "Live a holy life by abstaining from practices that can cause others to stumble or that dishonor God, such as idolatry and sexual immorality.",
    "Support and encourage fellow believers through teaching, prophecy, and fellowship to strengthen the body of Christ."
  ],
  "keyVerses": [
    {
      "reference": "Acts 15:11",
      "text": "But we believe that through the grace of the Lord Jesus Christ we shall be saved, even as they.",
      "significance": "This verse clearly affirms salvation by grace through faith, not by works of the law, a foundational truth for Christian doctrine."
    },
    {
      "reference": "Acts 15:28",
      "text": "For it seemed good to the Holy Ghost, and to us, to lay upon you no greater burden than these necessary things;",
      "significance": "It shows the guidance of the Holy Spirit in the council’s decision, emphasizing the importance of spiritual discernment in church leadership."
    },
    {
      "reference": "Acts 15:29",
      "text": "That ye abstain from meats offered to idols, and from blood, and from things strangled, and from fornication: from which if ye keep yourselves, ye shall do well. Fare ye well.",
      "significance": "This verse outlines practical instructions for Gentile believers to maintain fellowship with Jewish Christians and live in holiness."
    },
    {
      "reference": "Acts 15:39",
      "text": "And the contention was so sharp between them, that they departed asunder one from the other: and so Barnabas took Mark, and sailed unto Cyprus;",
      "significance": "It highlights that even godly leaders may disagree, but ministry continues as God uses different workers for His purposes."
    }
  ]
}