{
  "book": "acts",
  "bookName": "Acts",
  "chapter": 18,
  "title": "Paul in Corinth and Ephesus",
  "shortSummary": "Acts 18 details Paul's ministry in Corinth where he partners with Aquila and Priscilla, preaches boldly, and faces opposition. The chapter also introduces Apollos, a powerful preacher, and highlights the early church's growth through teaching, encouragement, and divine guidance.",
  "timeline": "c. AD 50-52 - Paul's Second Missionary Journey",
  "keyCharacters": [
    {
      "name": "Paul",
      "description": "The apostle and missionary who preaches the gospel, teaches believers, and faces opposition in Corinth and Ephesus."
    },
    {
      "name": "Aquila",
      "description": "A Jewish tentmaker recently expelled from Rome who partners with Paul in ministry and hospitality."
    },
    {
      "name": "Priscilla",
      "description": "Wife of Aquila, co-worker with Paul, who helps instruct Apollos more accurately in the faith."
    },
    {
      "name": "Gallio",
      "description": "Roman proconsul of Achaia who dismisses the Jewish accusations against Paul, allowing him to continue his work."
    },
    {
      "name": "Apollos",
      "description": "An eloquent and knowledgeable Jewish believer who is further instructed by Priscilla and Aquila and becomes a powerful preacher."
    }
  ],
  "definitions": [
    {
      "term": "Tentmaker",
      "definition": "A craftsman who makes or repairs tents; Paul’s occupation which he used to support himself during his missionary journeys."
    },
    {
      "term": "Synagogue",
      "definition": "A Jewish place of worship and teaching where Paul reasoned and preached the gospel."
    },
    {
      "term": "Baptism of John",
      "definition": "The baptism preached by John the Baptist focusing on repentance; Apollos initially knew only this before learning about Jesus Christ."
    },
    {
      "term": "Vow",
      "definition": "A solemn promise made to God, often involving a physical sign such as shaving the head, as Paul did in Cenchrea."
    }
  ],
  "outline": [
    {
      "heading": "Paul’s Ministry in Corinth",
      "verseRange": "Acts 18:1-11",
      "description": "Paul arrives in Corinth, meets Aquila and Priscilla, works as a tentmaker, preaches in the synagogue, and receives a divine encouragement to continue despite opposition."
    },
    {
      "heading": "Legal Opposition and Gallio’s Judgment",
      "verseRange": "Acts 18:12-17",
      "description": "The Jewish leaders bring Paul before Gallio accusing him of breaking the law, but Gallio dismisses the case, allowing Paul to continue his ministry unhindered."
    },
    {
      "heading": "Paul’s Departure and Journey to Ephesus",
      "verseRange": "Acts 18:18-23",
      "description": "Paul leaves Corinth with Aquila and Priscilla, visits Ephesus where he preaches briefly, then travels to Caesarea and Antioch before strengthening disciples in Galatia and Phrygia."
    },
    {
      "heading": "Apollos’ Ministry and Instruction",
      "verseRange": "Acts 18:24-28",
      "description": "Apollos, an eloquent and knowledgeable preacher, arrives in Ephesus and is further instructed by Priscilla and Aquila, after which he boldly teaches about Jesus Christ."
    }
  ],
  "application": [
    "Be willing to work diligently in your daily occupation while also serving God faithfully, following Paul’s example as a tentmaker.",
    "Do not be discouraged by opposition or rejection; trust God’s presence and promises as Paul did when he was encouraged in a vision.",
    "Seek sound teaching and be open to correction and growth in your understanding of the gospel, as Apollos was when instructed by Priscilla and Aquila.",
    "Support and encourage fellow believers in their ministry and faith journey, just as the early church did by welcoming Apollos and strengthening disciples."
  ],
  "keyVerses": [
    {
      "reference": "Acts 18:9",
      "text": "Then spake the Lord to Paul in the night by a vision, Be not afraid, but speak, and hold not thy peace:",
      "significance": "God’s direct encouragement to Paul to boldly continue preaching despite opposition."
    },
    {
      "reference": "Acts 18:10",
      "text": "For I am with thee, and no man shall set on thee to hurt thee: for I have much people in this city.",
      "significance": "A promise of divine protection and assurance of a fruitful ministry in Corinth."
    },
    {
      "reference": "Acts 18:14",
      "text": "And when Paul was now about to open his mouth, Gallio said unto the Jews, If it were a matter of wrong or wicked lewdness, O ye Jews, reason would that I should bear with you:",
      "significance": "Gallio’s refusal to judge religious disputes allowed Paul to continue his mission unhindered."
    },
    {
      "reference": "Acts 18:28",
      "text": "For he mightily convinced the Jews, and that publickly, shewing by the scriptures that Jesus was Christ.",
      "significance": "Apollos’ effective ministry demonstrating the power of Scripture to reveal Christ."
    }
  ]
}