{
  "book": "acts",
  "bookName": "Acts",
  "chapter": 3,
  "title": "Healing and Repentance",
  "shortSummary": "Acts chapter 3 recounts the miraculous healing of a man lame from birth by Peter and John at the temple gate called Beautiful. This event leads to Peter’s powerful sermon calling the people to repentance and faith in Jesus Christ, emphasizing His resurrection and fulfillment of prophecy.",
  "timeline": "c. AD 30-33 - Early Church in Jerusalem after Pentecost",
  "keyCharacters": [
    {
      "name": "Peter",
      "description": "One of Jesus’ apostles who performs the healing miracle and preaches boldly about Jesus’ resurrection and the call to repentance."
    },
    {
      "name": "John",
      "description": "Another apostle who accompanies Peter to the temple and supports the healing and proclamation."
    },
    {
      "name": "Lame Man",
      "description": "A man crippled from birth who is miraculously healed by Peter and John, demonstrating the power of faith in Jesus Christ."
    }
  ],
  "definitions": [
    {
      "term": "Ninth hour",
      "definition": "The ninth hour refers to 3 PM, the traditional time of afternoon prayer in Jewish custom."
    },
    {
      "term": "Beautiful Gate",
      "definition": "A specific gate of the Jerusalem temple where the lame man was laid daily to beg for alms."
    },
    {
      "term": "Alms",
      "definition": "Charitable giving or donations to the poor, often expected at temple entrances."
    },
    {
      "term": "Restitution of all things",
      "definition": "The future restoration of all creation to its intended perfect state, as prophesied by the Old Testament prophets."
    }
  ],
  "outline": [
    {
      "heading": "The Healing at the Beautiful Gate",
      "verseRange": "Acts 3:1-10",
      "description": "Peter and John encounter a man lame from birth at the temple gate. Peter heals him in the name of Jesus Christ, resulting in the man walking, leaping, and praising God, which amazes the onlookers."
    },
    {
      "heading": "Peter’s Explanation and Call to Repentance",
      "verseRange": "Acts 3:11-16",
      "description": "Peter addresses the crowd, explaining that the healing was done by faith in Jesus Christ, whom they had rejected and crucified but God raised from the dead."
    },
    {
      "heading": "Acknowledging Ignorance and Fulfillment of Prophecy",
      "verseRange": "Acts 3:17-21",
      "description": "Peter acknowledges the people's ignorance in rejecting Jesus, reminds them of the fulfillment of prophecy regarding Christ’s suffering, and calls them to repent for the forgiveness of sins and times of refreshing."
    },
    {
      "heading": "The Prophetic Warning and Blessing",
      "verseRange": "Acts 3:22-26",
      "description": "Peter cites Moses’ prophecy about a coming prophet like himself, warns of destruction for those who do not listen, and declares that through Jesus, God is blessing the people by turning them from their sins."
    }
  ],
  "application": [
    "Trust in the name of Jesus Christ for healing and restoration, recognizing that true power comes from faith in Him, not from human ability.",
    "Respond to God’s call to repentance promptly, turning away from sin to receive forgiveness and spiritual renewal.",
    "Boldly proclaim the gospel and the resurrection of Jesus, knowing that God uses believers as witnesses to bring others to faith.",
    "Recognize that God’s promises and prophecies are trustworthy and that Jesus is the fulfillment of God’s covenant with His people."
  ],
  "keyVerses": [
    {
      "reference": "Acts 3:6",
      "text": "Then Peter said, Silver and gold have I none; but such as I have give I thee: In the name of Jesus Christ of Nazareth rise up and walk.",
      "significance": "This verse highlights the power of Jesus’ name to heal and restore, emphasizing faith over material wealth."
    },
    {
      "reference": "Acts 3:19",
      "text": "Repent ye therefore, and be converted, that your sins may be blotted out, when the times of refreshing shall come from the presence of the Lord;",
      "significance": "A clear call to repentance and conversion, promising forgiveness and spiritual renewal from God."
    },
    {
      "reference": "Acts 3:15",
      "text": "And killed the Prince of life, whom God hath raised from the dead; whereof we are witnesses.",
      "significance": "Peter declares Jesus’ resurrection and their role as eyewitnesses, affirming the foundation of Christian faith."
    },
    {
      "reference": "Acts 3:26",
      "text": "Unto you first God, having raised up his Son Jesus, sent him to bless you, in turning away every one of you from his iniquities.",
      "significance": "This verse emphasizes God’s purpose in sending Jesus to bring blessing through repentance and forgiveness."
    }
  ]
}