{
  "book": "exodus",
  "bookName": "Exodus",
  "chapter": 21,
  "title": "Laws on Servitude and Justice",
  "shortSummary": "Exodus 21 outlines God’s detailed laws regarding Hebrew servants, personal injury, and property damage, emphasizing justice, mercy, and social order within the covenant community. These judgments reveal God's concern for fairness and accountability in human relationships and societal responsibilities.",
  "timeline": "c. 1446 BC - The Exodus and giving of the Mosaic Law",
  "keyCharacters": [
    {
      "name": "Hebrew Servant",
      "description": "An Israelite who serves another for a limited time under specific laws governing servitude and release."
    },
    {
      "name": "Master",
      "description": "The individual who owns or employs servants and is responsible for their treatment according to God’s laws."
    },
    {
      "name": "Judge",
      "description": "The authority who oversees disputes and enforces the laws given in this chapter."
    }
  ],
  "definitions": [
    {
      "term": "Hebrew Servant",
      "definition": "An Israelite who voluntarily or involuntarily serves another for up to six years, after which he is to be set free in the seventh year."
    },
    {
      "term": "Aul",
      "definition": "A large awl or pointed instrument used to pierce the ear of a servant who chooses to remain with his master permanently."
    },
    {
      "term": "Eye for eye",
      "definition": "A principle of retributive justice ensuring that punishment corresponds directly and fairly to the offense committed."
    },
    {
      "term": "Betrothed",
      "definition": "A formal engagement or promise of marriage recognized legally and socially in ancient Israel."
    }
  ],
  "outline": [
    {
      "heading": "Regulations for Hebrew Servants",
      "verseRange": "Exodus 21:1-6",
      "description": "God provides instructions on the duration of servitude for Hebrew servants, their release, and the option for permanent service if the servant chooses to remain out of love for his master and family."
    },
    {
      "heading": "Laws Concerning Female Servants",
      "verseRange": "Exodus 21:7-11",
      "description": "Rules are given regarding the sale of daughters as maidservants, their treatment, and protections against unjust treatment or forced sale to foreigners."
    },
    {
      "heading": "Laws on Personal Injury and Murder",
      "verseRange": "Exodus 21:12-17",
      "description": "The chapter sets forth capital punishments for murder, striking parents, kidnapping, and cursing parents, emphasizing the sanctity of life and family authority."
    },
    {
      "heading": "Laws on Assault and Injury",
      "verseRange": "Exodus 21:18-27",
      "description": "Guidelines for handling injuries caused by fighting or mistreatment, including compensation and release of servants if seriously harmed."
    },
    {
      "heading": "Laws on Animal-Related Damages",
      "verseRange": "Exodus 21:28-36",
      "description": "Rules concerning liability for damages caused by animals, including the death of persons or property damage, with distinctions based on the owner’s knowledge and responsibility."
    }
  ],
  "application": [
    "Respect and uphold the dignity and rights of others, including those in servitude or under your authority, reflecting God’s justice and mercy.",
    "Seek to resolve conflicts fairly and responsibly, ensuring restitution and healing where harm has been done.",
    "Honor and obey God’s established order in family and society, recognizing the seriousness of offenses against parents and neighbors.",
    "Trust God’s laws as a guide for righteous living that promotes peace, accountability, and compassion within the community."
  ],
  "keyVerses": [
    {
      "reference": "Exodus 21:6",
      "text": "Then his master shall bring him unto the judges; he shall also bring him to the door, or unto the door post; and his master shall bore his ear through with an aul; and he shall serve him for ever.",
      "significance": "This verse highlights the solemn commitment of a servant who chooses to remain with his master permanently, symbolizing voluntary lifelong service."
    },
    {
      "reference": "Exodus 21:12",
      "text": "He that smiteth a man, so that he die, shall be surely put to death.",
      "significance": "It establishes the sanctity of human life and the principle of just punishment for murder."
    },
    {
      "reference": "Exodus 21:24",
      "text": "Eye for eye, tooth for tooth, hand for hand, foot for foot,",
      "significance": "This verse articulates the principle of proportional justice, ensuring fairness and deterring excessive punishment."
    },
    {
      "reference": "Exodus 21:26",
      "text": "And if a man smite the eye of his servant, or the eye of his maid, that it perish; he shall let him go free for his eye's sake.",
      "significance": "It demonstrates God’s concern for the welfare of servants, requiring their release if seriously injured."
    }
  ]
}