{
  "book": "ezekiel",
  "bookName": "Ezekiel",
  "chapter": 13,
  "title": "False Prophets Condemned",
  "shortSummary": "Ezekiel 13 delivers a stern rebuke against false prophets in Israel who deceive the people with lies and false visions of peace. God declares His judgment upon these prophets and prophetesses for misleading His people and corrupting His covenant community. This chapter highlights the dangers of spiritual deception and the importance of true prophecy aligned with God's word.",
  "timeline": "c. 593 BC - During the Babylonian exile, when Ezekiel prophesied to the exiled Israelites",
  "keyCharacters": [
    {
      "name": "Ezekiel",
      "description": "The prophet of God who receives and delivers God's message condemning the false prophets of Israel."
    },
    {
      "name": "False Prophets of Israel",
      "description": "Individuals who prophesy out of their own hearts, giving vain and lying messages that claim to be from the LORD but are not."
    },
    {
      "name": "Daughters of Thy People",
      "description": "Women among the Israelites who prophesy deceitfully, using symbolic items like pillows and kerchiefs to 'hunt souls' with lies."
    }
  ],
  "definitions": [
    {
      "term": "Prophet",
      "definition": "A person called by God to deliver His messages to the people, often including warnings, guidance, and future revelations."
    },
    {
      "term": "Untempered Morter",
      "definition": "Mortar mixed without proper materials, symbolizing a weak and unstable foundation or protection that will not withstand judgment."
    },
    {
      "term": "Daubing",
      "definition": "The act of plastering or coating a wall, here used metaphorically for false prophets' deceptive efforts to make Israel's protection appear secure."
    },
    {
      "term": "Hunting Souls",
      "definition": "A metaphor for misleading or ensnaring people spiritually through false teachings or deceptive practices."
    }
  ],
  "outline": [
    {
      "heading": "Introduction and Rebuke of False Prophets",
      "verseRange": "Ezekiel 13:1-5",
      "description": "God commands Ezekiel to prophesy against Israel's false prophets who speak from their own hearts and have seen nothing from God, likening them to foxes that fail to protect the people."
    },
    {
      "heading": "Condemnation for False Visions and Lies",
      "verseRange": "Ezekiel 13:6-16",
      "description": "The false prophets are condemned for giving vain visions and lying divinations, promising peace where there is none, and building a fragile wall with untempered mortar that will collapse under God's judgment."
    },
    {
      "heading": "Judgment Against Deceptive Prophetesses",
      "verseRange": "Ezekiel 13:17-23",
      "description": "God pronounces woe upon the women who prophesy deceitfully, using symbolic pillows and kerchiefs to ensnare souls, polluting God's people for gain, and promising life to the wicked, but God will tear their tools and deliver His people."
    }
  ],
  "application": [
    "Discern carefully the source of spiritual messages and test all prophecy against the Word of God to avoid deception.",
    "Recognize the danger of false assurance and trust in God's truth rather than human promises of peace.",
    "Commit to praying for true prophets who faithfully proclaim God's word and uphold His holiness.",
    "Avoid misleading others with partial truths or false hope, and seek to build others up on the solid foundation of Scripture."
  ],
  "keyVerses": [
    {
      "reference": "Ezekiel 13:3",
      "text": "Thus saith the Lord GOD; Woe unto the foolish prophets, that follow their own spirit, and have seen nothing!",
      "significance": "This verse highlights the folly and danger of false prophets who speak without divine revelation."
    },
    {
      "reference": "Ezekiel 13:10",
      "text": "Because, even because they have seduced my people, saying, Peace; and there was no peace; and one built up a wall, and, lo, others daubed it with untempered morter:",
      "significance": "It reveals how false prophets give false security to God's people, leading them astray with lies of peace."
    },
    {
      "reference": "Ezekiel 13:20",
      "text": "Wherefore thus saith the Lord GOD; Behold, I am against your pillows, wherewith ye there hunt the souls to make them fly, and I will tear them from your arms, and will let the souls go, even the souls that ye hunt to make them fly.",
      "significance": "God declares His judgment on the deceitful prophetesses and promises deliverance for His people."
    }
  ]
}