{
  "book": "ezekiel",
  "bookName": "Ezekiel",
  "chapter": 11,
  "title": "Judgment and Restoration",
  "shortSummary": "Ezekiel 11 records the prophet's vision at the east gate of the LORD's house, where he sees leaders conspiring wicked counsel. God pronounces judgment on Jerusalem for its rebellion but promises future restoration and a new heart for His people. The chapter concludes with the departure of God's glory from the city and Ezekiel's commission to speak to the exiles in Babylon.",
  "timeline": "c. 593 BC - During the Babylonian exile, prior to the fall of Jerusalem",
  "keyCharacters": [
    {
      "name": "Ezekiel",
      "description": "The prophet receiving visions and messages from God, tasked with warning Israel and the exiles."
    },
    {
      "name": "Jaazaniah son of Azur",
      "description": "One of the twenty-five men at the east gate, identified as a prince and part of the wicked counsel."
    },
    {
      "name": "Pelatiah son of Benaiah",
      "description": "Another prince among the twenty-five men; his sudden death during Ezekiel's prophecy highlights God's judgment."
    }
  ],
  "definitions": [
    {
      "term": "Caldron",
      "definition": "A large metal pot used for boiling; metaphorically represents Jerusalem as a vessel of judgment filled with the slain."
    },
    {
      "term": "Spirit of the LORD",
      "definition": "The divine presence and power of God that enables Ezekiel to prophesy and receive visions."
    },
    {
      "term": "Heart of flesh",
      "definition": "A renewed, responsive, and obedient heart given by God, replacing the hardened 'stony heart.'"
    },
    {
      "term": "Cherubims",
      "definition": "Heavenly beings associated with God's glory and presence, depicted as lifting their wings in the vision."
    }
  ],
  "outline": [
    {
      "heading": "Vision of Wicked Counsel at the East Gate",
      "verseRange": "Ezekiel 11:1-5",
      "description": "Ezekiel is brought by the Spirit to the east gate where he sees twenty-five men, including princes Jaazaniah and Pelatiah, conspiring evil plans. God reveals their rebellious thoughts and commands Ezekiel to prophesy against them."
    },
    {
      "heading": "Judgment Pronounced on Jerusalem",
      "verseRange": "Ezekiel 11:6-12",
      "description": "God declares that the city is like a caldron filled with the slain, and because of their fear and rebellion, He will bring sword and judgment upon them. The people will be scattered for their disobedience and idolatry."
    },
    {
      "heading": "Death of Pelatiah and Ezekiel’s Lament",
      "verseRange": "Ezekiel 11:13",
      "description": "As Ezekiel prophesies, Pelatiah dies suddenly, confirming the certainty of God's judgment. Ezekiel mourns, pleading for mercy on the remnant of Israel."
    },
    {
      "heading": "Promise of Restoration and New Heart",
      "verseRange": "Ezekiel 11:14-21",
      "description": "God promises to be a sanctuary for the scattered Israelites, gathering them back to their land. He will cleanse them from idolatry and give them a new heart and spirit to obey His statutes."
    },
    {
      "heading": "Departure of God’s Glory and Ezekiel’s Commission",
      "verseRange": "Ezekiel 11:22-25",
      "description": "The cherubim lift their wings and the glory of the LORD departs from the city, symbolizing God's judgment. Ezekiel is taken in vision to Babylon to deliver God's message to the exiles."
    }
  ],
  "application": [
    "Trust in God's sovereign judgment while remembering His promise of restoration for those who repent and obey.",
    "Seek a renewed heart through the Holy Spirit to walk faithfully in God's statutes and avoid the hardness of sin.",
    "Recognize the seriousness of counsel and leadership; pray for godly wisdom among those who lead the church and nation.",
    "Be encouraged that God remains a sanctuary and refuge even in times of exile and hardship."
  ],
  "keyVerses": [
    {
      "reference": "Ezekiel 11:19",
      "text": "And I will give them one heart, and I will put a new spirit within you; and I will take the stony heart out of their flesh, and will give them an heart of flesh:",
      "significance": "This verse highlights God's promise to transform His people inwardly, enabling true obedience and relationship with Him."
    },
    {
      "reference": "Ezekiel 11:23",
      "text": "And the glory of the LORD went up from the midst of the city, and stood upon the mountain which is on the east side of the city.",
      "significance": "The departure of God's glory signifies His judgment and the temporary removal of His presence from Jerusalem."
    },
    {
      "reference": "Ezekiel 11:13",
      "text": "And it came to pass, when I prophesied, that Pelatiah the son of Benaiah died. Then fell I down upon my face, and cried with a loud voice, and said, Ah Lord GOD! wilt thou make a full end of the remnant of Israel?",
      "significance": "Pelatiah's death confirms the certainty of God's judgment and Ezekiel's heartfelt intercession for Israel."
    }
  ]
}