{
  "book": "ezekiel",
  "bookName": "Ezekiel",
  "chapter": 6,
  "title": "Judgment on Israel's Idolatry",
  "shortSummary": "Ezekiel 6 pronounces God's judgment on the mountains of Israel for their idolatry and rebellion. The chapter vividly describes the destruction of altars and idols, the death of many, and the scattering of the people, yet it also promises a remnant will survive to repent and recognize the LORD's sovereignty. This chapter highlights God's holiness and justice in punishing sin while preserving hope for restoration.",
  "timeline": "c. 593 BC - Early Babylonian Exile, during Ezekiel's prophetic ministry",
  "keyCharacters": [
    {
      "name": "Ezekiel",
      "description": "The prophet called by God to deliver His messages of judgment and hope to Israel during the exile."
    },
    {
      "name": "Son of man",
      "description": "A title used by God to address Ezekiel, emphasizing his humanity and role as God's messenger."
    }
  ],
  "definitions": [
    {
      "term": "High places",
      "definition": "Elevated sites where Israelites worshipped idols and performed pagan sacrifices, condemned by God."
    },
    {
      "term": "Remnant",
      "definition": "A small surviving group of people preserved by God after judgment, who remain faithful and are used for future restoration."
    },
    {
      "term": "Abominations",
      "definition": "Detestable sins or practices, especially idolatry, that provoke God's righteous anger."
    },
    {
      "term": "Sweet savour",
      "definition": "A pleasing aroma from sacrifices offered to idols, symbolizing worship that God rejects."
    }
  ],
  "outline": [
    {
      "heading": "Divine Command to Prophesy Against the Mountains",
      "verseRange": "Ezekiel 6:1-3",
      "description": "God instructs Ezekiel to direct his prophecy toward the mountains of Israel, announcing coming judgment because of their idolatry and rebellion."
    },
    {
      "heading": "Judgment on Idolatrous Altars and Images",
      "verseRange": "Ezekiel 6:4-7",
      "description": "God declares the destruction of altars, images, and idols, with the dead bodies of Israelites left before these abominations to demonstrate His judgment."
    },
    {
      "heading": "Promise of a Preserved Remnant",
      "verseRange": "Ezekiel 6:8-10",
      "description": "Despite the coming devastation, God promises to leave a remnant who will remember Him, repent of their sins, and acknowledge His justice."
    },
    {
      "heading": "The Extent and Means of Judgment",
      "verseRange": "Ezekiel 6:11-14",
      "description": "God details the comprehensive nature of the judgment—sword, famine, and pestilence—and the desolation of the land, so that all will know He is the LORD."
    }
  ],
  "application": [
    "Recognize the seriousness of idolatry in any form and repent promptly to avoid God's discipline.",
    "Trust in God's mercy to preserve a faithful remnant even amid judgment and hardship.",
    "Remember that God's judgments are purposeful, leading to repentance and acknowledgment of His holiness.",
    "Maintain a heart fully devoted to God, avoiding divided loyalties that lead to spiritual ruin."
  ],
  "keyVerses": [
    {
      "reference": "Ezekiel 6:7",
      "text": "And the slain shall fall in the midst of you, and ye shall know that I am the LORD.",
      "significance": "This verse emphasizes that God's judgment serves to reveal His sovereign authority and holiness."
    },
    {
      "reference": "Ezekiel 6:8",
      "text": "Yet will I leave a remnant, that ye may have some that shall escape the sword among the nations, when ye shall be scattered through the countries.",
      "significance": "It highlights God's grace in preserving a faithful remnant despite widespread judgment."
    },
    {
      "reference": "Ezekiel 6:10",
      "text": "And they shall know that I am the LORD, and that I have not said in vain that I would do this evil unto them.",
      "significance": "This verse confirms the certainty and justice of God's warnings and judgments."
    }
  ]
}