{
  "book": "ezekiel",
  "bookName": "Ezekiel",
  "chapter": 29,
  "title": "Judgment on Egypt",
  "shortSummary": "Ezekiel 29 records God's prophecy against Pharaoh and Egypt, pronouncing judgment for their pride and oppression of Israel. It foretells Egypt’s desolation for forty years, their scattering among nations, and eventual restoration as a diminished kingdom. The chapter also highlights Nebuchadrezzar’s role as God’s instrument in this judgment.",
  "timeline": "c. 593 BC - During the Babylonian exile, Ezekiel prophesies against Egypt and Babylon",
  "keyCharacters": [
    {
      "name": "Pharaoh king of Egypt",
      "description": "The ruler of Egypt who is condemned for his arrogance and oppression of Israel, depicted as a great dragon in the midst of the rivers."
    },
    {
      "name": "Nebuchadrezzar king of Babylon",
      "description": "The Babylonian king who will be given Egypt as a spoil for his military service, acting as God's instrument of judgment."
    },
    {
      "name": "Ezekiel",
      "description": "The prophet who receives and delivers God's word concerning Egypt’s judgment and future restoration."
    }
  ],
  "definitions": [
    {
      "term": "Son of man",
      "definition": "A title used by God to address Ezekiel, emphasizing his human nature and role as a representative prophet."
    },
    {
      "term": "Hooks in thy jaws",
      "definition": "A metaphor for God’s control and captivity over Pharaoh, symbolizing the removal of Egypt from its place of power."
    },
    {
      "term": "Staff of reed",
      "definition": "A fragile support; Egypt was a weak and unreliable support to Israel, breaking under pressure."
    },
    {
      "term": "Basest of the kingdoms",
      "definition": "A description of Egypt’s diminished status after judgment, indicating it will no longer dominate or exalt itself."
    }
  ],
  "outline": [
    {
      "heading": "God’s Judgment Pronounced on Pharaoh and Egypt",
      "verseRange": "Ezekiel 29:1-9",
      "description": "God commands Ezekiel to prophesy against Pharaoh, describing him as a proud dragon who claims ownership of the Nile. God declares He will bring Pharaoh out of his rivers, leave him desolate, and punish Egypt for their arrogance and oppression of Israel."
    },
    {
      "heading": "Egypt’s Desolation and Scattering",
      "verseRange": "Ezekiel 29:10-16",
      "description": "God declares Egypt will be desolate and uninhabited for forty years, scattered among nations, and reduced to a lowly kingdom. This judgment will demonstrate God’s sovereignty and serve as a lesson to Israel."
    },
    {
      "heading": "Nebuchadrezzar’s Reward for Conquering Egypt",
      "verseRange": "Ezekiel 29:17-20",
      "description": "God reveals that Nebuchadrezzar will receive Egypt as a spoil for his military service, rewarding him for his conquest of Tyre and Egypt, fulfilling divine judgment through Babylon."
    },
    {
      "heading": "Future Hope for Israel",
      "verseRange": "Ezekiel 29:21",
      "description": "God promises to cause the 'horn' of Israel to bud forth, symbolizing future strength and restoration, and that His name will be known among the nations."
    }
  ],
  "application": [
    "Trust in God's sovereignty even when nations or powers seem strong and self-sufficient, remembering He can humble the proud.",
    "Avoid relying on worldly powers or alliances as a 'staff of reed'; place your confidence fully in God alone.",
    "Recognize that God uses earthly rulers and events to accomplish His purposes, calling believers to faithfulness amid trials.",
    "Take comfort that God promises restoration and future blessing for His people despite present judgment or hardship."
  ],
  "keyVerses": [
    {
      "reference": "Ezekiel 29:3",
      "text": "Speak, and say, Thus saith the Lord GOD; Behold, I am against thee, Pharaoh king of Egypt, the great dragon that lieth in the midst of his rivers, which hath said, My river is mine own, and I have made it for myself.",
      "significance": "This verse highlights Pharaoh’s pride and self-exaltation, setting the stage for God’s judgment against him."
    },
    {
      "reference": "Ezekiel 29:11",
      "text": "No foot of man shall pass through it, nor foot of beast shall pass through it, neither shall it be inhabited forty years.",
      "significance": "This verse emphasizes the extent and duration of Egypt’s desolation as a consequence of their rebellion."
    },
    {
      "reference": "Ezekiel 29:19",
      "text": "Therefore thus saith the Lord GOD; Behold, I will give the land of Egypt unto Nebuchadrezzar king of Babylon; and he shall take her multitude, and take her spoil, and take her prey; and it shall be the wages for his army.",
      "significance": "This verse shows God’s use of Nebuchadrezzar as His instrument to execute judgment and fulfill His sovereign plan."
    },
    {
      "reference": "Ezekiel 29:21",
      "text": "In that day will I cause the horn of the house of Israel to bud forth, and I will give thee the opening of the mouth in the midst of them; and they shall know that I am the LORD.",
      "significance": "This verse offers hope of Israel’s future restoration and God’s ultimate vindication of His people."
    }
  ]
}