{
  "book": "ezekiel",
  "bookName": "Ezekiel",
  "chapter": 10,
  "title": "The Glory Departs",
  "shortSummary": "Ezekiel 10 describes the departure of the glory of the LORD from the temple, symbolized through a detailed vision of cherubim and wheels full of eyes. This chapter emphasizes God's holiness and judgment as His presence moves away from the temple, signaling impending judgment on Jerusalem.",
  "timeline": "c. 593 BC - During the Babylonian exile, Ezekiel's prophetic visions",
  "keyCharacters": [
    {
      "name": "Ezekiel",
      "description": "The prophet receiving and recording the vision of the glory of the LORD departing from the temple."
    },
    {
      "name": "Man clothed with linen",
      "description": "A mysterious figure who carries out God's command to take coals of fire from between the cherubim to scatter over the city."
    },
    {
      "name": "Cherubim",
      "description": "Heavenly creatures with four faces and multiple wings, representing God's divine presence and mobility in the vision."
    }
  ],
  "definitions": [
    {
      "term": "Cherubim",
      "definition": "Angel-like beings described in Ezekiel with multiple faces and wings, symbolizing God's holiness, power, and presence."
    },
    {
      "term": "Wheels within wheels",
      "definition": "A vision of complex, intersecting wheels full of eyes, symbolizing God's omnipresence and omniscience."
    },
    {
      "term": "Glory of the LORD",
      "definition": "The visible manifestation of God's presence and holiness, often depicted as a radiant cloud or light."
    },
    {
      "term": "Man clothed with linen",
      "definition": "A symbolic figure in Ezekiel's visions who acts as God's agent in executing divine commands."
    }
  ],
  "outline": [
    {
      "heading": "The Appearance of the Sapphire Throne",
      "verseRange": "Ezekiel 10:1-5",
      "description": "Ezekiel sees a sapphire-like throne above the cherubim, and the glory of the LORD fills the temple with a bright cloud, accompanied by the powerful sound of cherubim wings, highlighting God's majestic presence."
    },
    {
      "heading": "The Command to the Man Clothed with Linen",
      "verseRange": "Ezekiel 10:2-7",
      "description": "God commands the man clothed with linen to take coals of fire from between the cherubim to scatter over the city, symbolizing coming judgment and purification."
    },
    {
      "heading": "Description of the Cherubim and Wheels",
      "verseRange": "Ezekiel 10:8-22",
      "description": "Ezekiel describes the cherubim with four faces and four wings, and the wheels full of eyes that move in perfect harmony with the cherubim, illustrating God's omnipresence and sovereign control over creation."
    },
    {
      "heading": "The Departure of the Glory of the LORD",
      "verseRange": "Ezekiel 10:18-22",
      "description": "The glory of the LORD departs from the temple, standing over the cherubim as they rise and move to the east gate, signifying God's withdrawal from Jerusalem due to its sin."
    }
  ],
  "application": [
    "Recognize the holiness of God and approach Him with reverence, understanding that His presence is not to be taken lightly.",
    "Obey God's commands promptly and faithfully, as demonstrated by the man clothed with linen who carries out God's instructions without hesitation.",
    "Trust in God's sovereign control over all things, even when His presence seems to depart, knowing He is still working out His purposes.",
    "Reflect on the seriousness of sin and the need for repentance to avoid the judgment symbolized by the scattering of coals over the city."
  ],
  "keyVerses": [
    {
      "reference": "Ezekiel 10:4",
      "text": "Then the glory of the LORD went up from the cherub, and stood over the threshold of the house; and the house was filled with the cloud, and the court was full of the brightness of the LORD'S glory.",
      "significance": "This verse highlights the visible manifestation of God's glory departing the temple, signaling a pivotal moment of judgment."
    },
    {
      "reference": "Ezekiel 10:18",
      "text": "Then the glory of the LORD departed from off the threshold of the house, and stood over the cherubims.",
      "significance": "Marks the moment when God's presence leaves the temple, emphasizing the consequences of Israel's unfaithfulness."
    },
    {
      "reference": "Ezekiel 10:19",
      "text": "And the cherubims lifted up their wings, and mounted up from the earth in my sight: when they went out, the wheels also were beside them, and every one stood at the door of the east gate of the LORD'S house; and the glory of the God of Israel was over them above.",
      "significance": "Shows the unity of God's heavenly beings and the movement of His glory, underscoring His sovereign authority."
    }
  ]
}