{
  "book": "ezekiel",
  "bookName": "Ezekiel",
  "chapter": 26,
  "title": "Judgment on Tyre",
  "shortSummary": "Ezekiel 26 pronounces God's judgment against the city of Tyre for its pride and rejoicing over Jerusalem's downfall. The chapter foretells the destruction of Tyre by many nations, especially Nebuchadnezzar of Babylon, and predicts its ultimate desolation and ruin as a testimony to God's sovereignty.",
  "timeline": "c. 593 BC - During the early years of Ezekiel's prophetic ministry under Babylonian ascendancy",
  "keyCharacters": [
    {
      "name": "Ezekiel",
      "description": "The prophet receiving and delivering God's message of judgment against Tyre."
    },
    {
      "name": "Nebuchadrezzar",
      "description": "King of Babylon, described as the instrument of God's judgment against Tyre."
    },
    {
      "name": "Tyre",
      "description": "A wealthy and powerful Phoenician city-state, condemned for its arrogance and hostility toward Jerusalem."
    }
  ],
  "definitions": [
    {
      "term": "Daughters of Tyre",
      "definition": "Refers to the smaller towns or colonies dependent on Tyre, often coastal settlements."
    },
    {
      "term": "Engines of war",
      "definition": "Ancient siege weapons or military devices used to breach city walls."
    },
    {
      "term": "Spread nets",
      "definition": "A metaphor indicating the city will become a desolate fishing spot, no longer inhabited or fortified."
    },
    {
      "term": "Buckler",
      "definition": "A small shield used in battle, symbolizing defense and protection."
    }
  ],
  "outline": [
    {
      "heading": "Introduction and Indictment of Tyre",
      "verseRange": "Ezekiel 26:1-5",
      "description": "God reveals His word to Ezekiel condemning Tyre for rejoicing over Jerusalem's destruction and promises many nations will come against Tyre, destroying its walls and towers, reducing it to a bare rock."
    },
    {
      "heading": "The Siege by Nebuchadrezzar",
      "verseRange": "Ezekiel 26:6-12",
      "description": "God declares that Nebuchadrezzar, king of Babylon, will lead a powerful army to besiege Tyre, slay its people, destroy its fortifications, and plunder its wealth."
    },
    {
      "heading": "Complete Desolation Proclaimed",
      "verseRange": "Ezekiel 26:13-14",
      "description": "The joyful sounds of Tyre will cease; it will be made like a bare rock, a place for fishermen’s nets, and will never be rebuilt, fulfilling God's sovereign decree."
    },
    {
      "heading": "The Lament of the Isles and Final Judgment",
      "verseRange": "Ezekiel 26:15-21",
      "description": "The surrounding islands and sea princes will mourn Tyre’s fall, which will be so complete that it will be forgotten and become a terror, never to be inhabited again."
    }
  ],
  "application": [
    "Trust in God's sovereignty: Recognize that God controls the rise and fall of nations and individuals, and His judgments are just.",
    "Avoid pride and rejoicing over others' misfortunes: Tyre's arrogance and gloating over Jerusalem's destruction brought God's judgment; humility is essential.",
    "Pray for cities and nations: Intercede for those who oppose God's people, trusting God to work His purposes even through judgment.",
    "Remember the consequences of opposing God: Obedience to God brings blessing, while rebellion leads to destruction and desolation."
  ],
  "keyVerses": [
    {
      "reference": "Ezekiel 26:4",
      "text": "And they shall destroy the walls of Tyrus, and break down her towers: I will also scrape her dust from her, and make her like the top of a rock.",
      "significance": "This verse vividly depicts the total destruction God will bring upon Tyre, emphasizing His power over seemingly impregnable cities."
    },
    {
      "reference": "Ezekiel 26:7",
      "text": "For thus saith the Lord GOD; Behold, I will bring upon Tyrus Nebuchadrezzar king of Babylon, a king of kings, from the north, with horses, and with chariots, and with horsemen, and companies, and much people.",
      "significance": "Identifies Nebuchadrezzar as God's chosen instrument of judgment, showing God's sovereignty over earthly rulers."
    },
    {
      "reference": "Ezekiel 26:14",
      "text": "And I will make thee like the top of a rock: thou shalt be a place to spread nets upon; thou shalt be built no more: for I the LORD have spoken it, saith the Lord GOD.",
      "significance": "Confirms the irrevocable nature of God's judgment and the permanent desolation of Tyre."
    },
    {
      "reference": "Ezekiel 26:21",
      "text": "I will make thee a terror, and thou shalt be no more: though thou be sought for, yet shalt thou never be found again, saith the Lord GOD.",
      "significance": "Highlights the complete and final destruction of Tyre, serving as a warning about opposing God's will."
    }
  ]
}