{
  "book": "ezekiel",
  "bookName": "Ezekiel",
  "chapter": 14,
  "title": "Idolatry and Judgment",
  "shortSummary": "Ezekiel 14 addresses the sin of idolatry deeply rooted in the hearts of Israel's elders and the resulting divine judgment. The chapter emphasizes God's refusal to answer those who seek Him while harboring idols and warns of severe consequences even for the righteous remnant. It calls for repentance and highlights God's sovereign justice in punishing a rebellious nation.",
  "timeline": "c. 593 BC - Early Babylonian Exile during Ezekiel's prophetic ministry",
  "keyCharacters": [
    {
      "name": "Elders of Israel",
      "description": "Leaders who approach Ezekiel with inquiries but are condemned for their idolatry and hypocrisy."
    },
    {
      "name": "Noah",
      "description": "A righteous man mentioned as an example of personal deliverance despite national judgment."
    },
    {
      "name": "Daniel",
      "description": "Another righteous figure cited who would only save himself amid God's judgment on the land."
    },
    {
      "name": "Job",
      "description": "A symbol of righteousness whose presence would not prevent God's judgment on Israel."
    }
  ],
  "definitions": [
    {
      "term": "Idols",
      "definition": "Objects or images worshiped as gods, representing spiritual unfaithfulness and rebellion against God."
    },
    {
      "term": "Stumblingblock",
      "definition": "An obstacle causing one to sin or fall away from God, here referring to iniquity placed openly before one's face."
    },
    {
      "term": "Prophet",
      "definition": "A messenger of God who communicates His word, often called upon for guidance or judgment."
    },
    {
      "term": "Remnant",
      "definition": "A small surviving group of people preserved by God after judgment, who remain faithful."
    }
  ],
  "outline": [
    {
      "heading": "The Elders' Idolatry Condemned",
      "verseRange": "Ezekiel 14:1-5",
      "description": "The elders of Israel approach Ezekiel, but God reveals their hearts are filled with idols, making their inquiries futile. God declares He will answer them according to their idolatry, exposing their estrangement from Him."
    },
    {
      "heading": "Call to Repentance and Warning of Judgment",
      "verseRange": "Ezekiel 14:6-11",
      "description": "God commands Israel to repent and turn from idols, warning that He will oppose those who persist. Prophets who are deceived will share in the punishment of those who seek false counsel."
    },
    {
      "heading": "The Inevitability of Divine Judgment",
      "verseRange": "Ezekiel 14:12-20",
      "description": "God explains that even the righteousness of Noah, Daniel, and Job cannot prevent judgment by famine, wild beasts, sword, or pestilence. Their righteousness only saves themselves, underscoring the certainty of national punishment."
    },
    {
      "heading": "The Promise of a Preserved Remnant",
      "verseRange": "Ezekiel 14:21-23",
      "description": "Despite severe judgments, God promises a remnant of sons and daughters will survive. Their conduct will bring comfort and confirm God's righteous purpose in disciplining Jerusalem."
    }
  ],
  "application": [
    "Examine your heart regularly to identify and remove any idols that hinder your relationship with God.",
    "Approach God with sincerity and repentance, understanding that He will not honor prayers from a heart divided by idolatry.",
    "Trust in God's justice and mercy, knowing that even in judgment, He preserves a faithful remnant for His purposes.",
    "Seek God's guidance through His Word and Spirit rather than relying on human wisdom or false prophets."
  ],
  "keyVerses": [
    {
      "reference": "Ezekiel 14:4",
      "text": "Therefore speak unto them, and say unto them, Thus saith the Lord GOD; Every man of the house of Israel that setteth up his idols in his heart, and putteth the stumblingblock of his iniquity before his face, and cometh to the prophet; I the LORD will answer him that cometh according to the multitude of his idols;",
      "significance": "This verse highlights God's refusal to answer those who harbor idols, emphasizing the seriousness of internal idolatry."
    },
    {
      "reference": "Ezekiel 14:14",
      "text": "Though these three men, Noah, Daniel, and Job, were in it, they should deliver but their own souls by their righteousness, saith the Lord GOD.",
      "significance": "It teaches that personal righteousness cannot prevent national judgment, underscoring God's sovereign justice."
    },
    {
      "reference": "Ezekiel 14:6",
      "text": "Therefore say unto the house of Israel, Thus saith the Lord GOD; Repent, and turn yourselves from your idols; and turn away your faces from all your abominations.",
      "significance": "A clear call to repentance, showing God's desire for His people to turn from sin and be restored."
    },
    {
      "reference": "Ezekiel 14:22",
      "text": "Yet, behold, therein shall be left a remnant that shall be brought forth, both sons and daughters: behold, they shall come forth unto you, and ye shall see their way and their doings: and ye shall be comforted concerning the evil that I have brought upon Jerusalem, even concerning all that I have brought upon it.",
      "significance": "This verse offers hope that God preserves a faithful remnant, assuring believers of His mercy amid judgment."
    }
  ]
}