{
  "book": "ezekiel",
  "bookName": "Ezekiel",
  "chapter": 27,
  "title": "Lamentation for Tyre",
  "shortSummary": "Ezekiel 27 presents a poetic lament over the city of Tyre, a wealthy and powerful maritime trading hub. The chapter details Tyre’s grandeur, extensive trade networks, and ultimate destruction as decreed by God, serving as a sobering warning about pride and reliance on material wealth.",
  "timeline": "c. 593 BC - During the Babylonian exile, Ezekiel prophesies against Tyre",
  "keyCharacters": [
    {
      "name": "Ezekiel",
      "description": "The prophet who receives and delivers God's message of judgment against Tyre."
    },
    {
      "name": "Tyre",
      "description": "A prominent Phoenician city-state renowned for its maritime commerce and wealth, personified as a majestic ship in this chapter."
    },
    {
      "name": "Merchants of Tyre",
      "description": "Various nations and peoples who traded with Tyre, highlighting its extensive commercial influence."
    }
  ],
  "definitions": [
    {
      "term": "Lamentation",
      "definition": "A poetic expression of sorrow or mourning, often used in the Bible to mourn the destruction of a city or people."
    },
    {
      "term": "Calkers",
      "definition": "Workers who seal the seams of a ship’s hull to make it watertight."
    },
    {
      "term": "Fir trees of Senir",
      "definition": "Fir wood from the region of Mount Senir, valued for shipbuilding."
    },
    {
      "term": "Isles of Chittim",
      "definition": "Islands in the Mediterranean, often associated with Cyprus, known for ivory and other luxury goods."
    }
  ],
  "outline": [
    {
      "heading": "Introduction and Call to Lament",
      "verseRange": "Ezekiel 27:1-3",
      "description": "God commands Ezekiel to pronounce a lamentation over Tyre, introducing the city as a proud and beautiful merchant located at the sea’s entrance."
    },
    {
      "heading": "Description of Tyre’s Splendor and Construction",
      "verseRange": "Ezekiel 27:4-11",
      "description": "Tyre is depicted metaphorically as a magnificent ship built with the finest materials and skilled craftsmen from various regions, emphasizing its beauty and strength."
    },
    {
      "heading": "Tyre’s Extensive Trade Network",
      "verseRange": "Ezekiel 27:12-24",
      "description": "A detailed list of nations and their goods traded with Tyre, illustrating its vast commercial reach and wealth."
    },
    {
      "heading": "Judgment and Destruction of Tyre",
      "verseRange": "Ezekiel 27:25-36",
      "description": "The lament shifts to Tyre’s downfall caused by the east wind (symbolizing an enemy attack), resulting in the loss of riches, merchants, and the city’s ultimate ruin, fulfilling God’s judgment."
    }
  ],
  "application": [
    "Recognize the danger of pride and self-reliance, as Tyre’s downfall was due to its boasting in its own beauty and wealth.",
    "Trust in God’s sovereignty over nations and commerce rather than placing confidence in material riches or human alliances.",
    "Respond to God’s warnings with repentance to avoid the fate of judgment and destruction.",
    "Pray for humility and dependence on God’s provision and protection in all areas of life."
  ],
  "keyVerses": [
    {
      "reference": "Ezekiel 27:3",
      "text": "And say unto Tyrus, O thou that art situate at the entry of the sea, which art a merchant of the people for many isles, Thus saith the Lord GOD; O Tyrus, thou hast said, I am of perfect beauty.",
      "significance": "This verse highlights Tyre’s pride and self-exaltation, setting the stage for its coming judgment."
    },
    {
      "reference": "Ezekiel 27:25",
      "text": "The ships of Tarshish did sing of thee in thy market: and thou wast replenished, and made very glorious in the midst of the seas.",
      "significance": "This verse celebrates Tyre’s former glory and prosperity as a dominant trading power."
    },
    {
      "reference": "Ezekiel 27:26",
      "text": "Thy rowers have brought thee into great waters: the east wind hath broken thee in the midst of the seas.",
      "significance": "This verse symbolizes the sudden and devastating judgment that will shatter Tyre’s power and security."
    },
    {
      "reference": "Ezekiel 27:36",
      "text": "The merchants among the people shall hiss at thee; thou shalt be a terror, and never shalt be any more.",
      "significance": "This verse confirms the finality of Tyre’s destruction and the shame that will follow."
    }
  ]
}