{
  "book": "ezekiel",
  "bookName": "Ezekiel",
  "chapter": 2,
  "title": "Commissioning of Ezekiel",
  "shortSummary": "Ezekiel 2 records God’s commissioning of the prophet Ezekiel to deliver His message to the rebellious nation of Israel. Despite their stubbornness and hostility, Ezekiel is empowered by the Spirit to stand firm and faithfully proclaim God’s words. This chapter highlights the prophet’s divine calling and the solemn responsibility of speaking God’s truth to a resistant people.",
  "timeline": "c. 593 BC - Early Babylonian Exile, during Ezekiel’s prophetic ministry",
  "keyCharacters": [
    {
      "name": "Ezekiel",
      "description": "The prophet called by God to deliver His message to the rebellious children of Israel during the Babylonian exile."
    },
    {
      "name": "The Spirit",
      "description": "The divine Spirit of God who enters Ezekiel, empowering and enabling him to stand and hear God’s commission."
    },
    {
      "name": "Children of Israel",
      "description": "The rebellious nation to whom Ezekiel is sent to prophesy, characterized by disobedience and stiffheartedness."
    }
  ],
  "definitions": [
    {
      "term": "Son of man",
      "definition": "A title used by God to address Ezekiel, emphasizing his humanity and role as a representative of mankind."
    },
    {
      "term": "Rebellious house",
      "definition": "A phrase describing Israel’s persistent disobedience and refusal to heed God’s commands."
    },
    {
      "term": "Briers and thorns",
      "definition": "Metaphorical language representing difficulties, hostility, and dangers Ezekiel will face among the people."
    },
    {
      "term": "Roll of a book",
      "definition": "A scroll containing God’s message, symbolizing the prophetic revelation Ezekiel is to receive and proclaim."
    }
  ],
  "outline": [
    {
      "heading": "Ezekiel’s Divine Commission",
      "verseRange": "Ezekiel 2:1-2",
      "description": "God commands Ezekiel to stand and listen, while the Spirit empowers him to receive the prophetic message, marking the beginning of his prophetic mission."
    },
    {
      "heading": "The Mission to a Rebellious People",
      "verseRange": "Ezekiel 2:3-5",
      "description": "God sends Ezekiel to the stubborn and rebellious children of Israel, warning that they will resist but will recognize a prophet among them."
    },
    {
      "heading": "Encouragement to Fearlessness",
      "verseRange": "Ezekiel 2:6-7",
      "description": "Ezekiel is instructed not to fear the people’s hostility or harsh words, but to faithfully speak God’s words regardless of their response."
    },
    {
      "heading": "Call to Obedience and Reception of God’s Word",
      "verseRange": "Ezekiel 2:8-10",
      "description": "Ezekiel is commanded to not be rebellious like the people, to open his mouth and consume the scroll containing lamentations, mourning, and woe, symbolizing internalizing God’s message."
    }
  ],
  "application": [
    "Trust God’s Spirit to empower you in difficult tasks, especially when facing opposition for standing for truth.",
    "Remain faithful in proclaiming God’s Word even when others reject or resist it, knowing God’s purposes will prevail.",
    "Do not fear opposition or discouragement; God calls His servants to boldness and courage in obedience.",
    "Internalize God’s Word daily, allowing it to shape your heart and equip you for ministry and witness."
  ],
  "keyVerses": [
    {
      "reference": "Ezekiel 2:2",
      "text": "And the spirit entered into me when he spake unto me, and set me upon my feet, that I heard him that spake unto me.",
      "significance": "This verse highlights the empowering presence of the Spirit enabling Ezekiel to stand and receive God’s commission."
    },
    {
      "reference": "Ezekiel 2:6",
      "text": "And thou, son of man, be not afraid of them, neither be afraid of their words, though briers and thorns be with thee, and thou dost dwell among scorpions: be not afraid of their words, nor be dismayed at their looks, though they be a rebellious house.",
      "significance": "This verse encourages courage and steadfastness in the face of hostility and rejection."
    },
    {
      "reference": "Ezekiel 2:8",
      "text": "But thou, son of man, hear what I say unto thee; Be not thou rebellious like that rebellious house: open thy mouth, and eat that I give thee.",
      "significance": "This verse calls Ezekiel to obediently receive and internalize God’s word, setting an example for all believers."
    },
    {
      "reference": "Ezekiel 2:10",
      "text": "And he spread it before me; and it was written within and without: and there was written therein lamentations, and mourning, and woe.",
      "significance": "This verse reveals the serious and sorrowful nature of the prophetic message Ezekiel is to proclaim."
    }
  ]
}