{
  "book": "ezekiel",
  "bookName": "Ezekiel",
  "chapter": 28,
  "title": "The Fall of Tyre's Prince",
  "shortSummary": "Ezekiel 28 pronounces God's judgment on the prince of Tyre for his pride and self-exaltation, warning that despite his wisdom and riches, he is merely a man and not a god. The chapter also contains a lamentation portraying the king of Tyre as a once-perfect anointed cherub who fell due to sin and pride. Finally, God declares judgment against the city of Sidon and promises restoration and safety for Israel.",
  "timeline": "c. 593 BC - During the Babylonian exile, prophetic ministry of Ezekiel",
  "keyCharacters": [
    {
      "name": "Prince of Tyre",
      "description": "The earthly ruler of Tyre who arrogantly claims divinity and is condemned for pride and corruption."
    },
    {
      "name": "King of Tyre",
      "description": "A symbolic figure described as an anointed cherub, representing the spiritual pride and fall behind Tyre's power."
    },
    {
      "name": "Son of man (Ezekiel)",
      "description": "The prophet Ezekiel, who receives and delivers God's messages and judgments."
    },
    {
      "name": "Zidon (Sidon)",
      "description": "A neighboring city to Tyre, also prophesied against for its opposition to Israel."
    }
  ],
  "definitions": [
    {
      "term": "Prince of Tyre",
      "definition": "The human ruler of the city-state of Tyre, a wealthy and influential Phoenician city."
    },
    {
      "term": "Anointed cherub",
      "definition": "A high-ranking angelic being set by God, symbolizing holiness and authority, here used metaphorically for the king of Tyre."
    },
    {
      "term": "Eden",
      "definition": "The garden of God, representing a place of original perfection and divine presence."
    },
    {
      "term": "Traffick",
      "definition": "Trade or commerce, especially extensive and profitable trading activities."
    }
  ],
  "outline": [
    {
      "heading": "Judgment on the Prince of Tyre for Pride",
      "verseRange": "Ezekiel 28:1-10",
      "description": "God condemns the prince of Tyre for his arrogance in claiming to be a god despite being only a man. His wisdom and wealth have led to pride, and God declares that foreign enemies will bring him down."
    },
    {
      "heading": "Lamentation for the King of Tyre",
      "verseRange": "Ezekiel 28:11-19",
      "description": "A poetic lament describes the king of Tyre as an anointed cherub who was once perfect and in Eden but fell due to pride and sin. His corruption through commerce leads to his destruction and disgrace."
    },
    {
      "heading": "Judgment Against Sidon",
      "verseRange": "Ezekiel 28:20-23",
      "description": "God announces judgment against Sidon, promising pestilence and sword to punish the city for its opposition to Israel, demonstrating God's sovereignty over surrounding nations."
    },
    {
      "heading": "Promise of Restoration for Israel",
      "verseRange": "Ezekiel 28:24-26",
      "description": "God promises to remove the enemies of Israel and gather His scattered people back to their land, where they will live safely and prosper, affirming His faithfulness to His covenant."
    }
  ],
  "application": [
    "Recognize the danger of pride and self-exaltation; humility before God is essential for spiritual health.",
    "Trust in God's sovereignty over all rulers and nations, knowing that He will judge injustice and wickedness.",
    "Take comfort in God's promise to restore and protect His people, encouraging faithfulness amid trials.",
    "Avoid corrupting influences of material wealth and commerce that can lead to spiritual downfall."
  ],
  "keyVerses": [
    {
      "reference": "Ezekiel 28:2",
      "text": "Son of man, say unto the prince of Tyrus, Thus saith the Lord GOD; Because thine heart is lifted up, and thou hast said, I am a God, I sit in the seat of God, in the midst of the seas; yet thou art a man, and not God, though thou set thine heart as the heart of God:",
      "significance": "This verse highlights the prince's pride and false claim to divinity, setting the stage for God's judgment."
    },
    {
      "reference": "Ezekiel 28:15",
      "text": "Thou wast perfect in thy ways from the day that thou wast created, till iniquity was found in thee.",
      "significance": "It reveals the original perfection and subsequent fall of the king of Tyre, illustrating the destructive power of sin."
    },
    {
      "reference": "Ezekiel 28:18",
      "text": "Thou hast defiled thy sanctuaries by the multitude of thine iniquities, by the iniquity of thy traffick; therefore will I bring forth a fire from the midst of thee, it shall devour thee, and I will bring thee to ashes upon the earth in the sight of all them that behold thee.",
      "significance": "This verse shows the consequences of corruption and sin, emphasizing God's righteous judgment."
    },
    {
      "reference": "Ezekiel 28:26",
      "text": "And they shall dwell safely therein, and shall build houses, and plant vineyards; yea, they shall dwell with confidence, when I have executed judgments upon all those that despise them round about them; and they shall know that I am the LORD their God.",
      "significance": "This verse offers hope and assurance of God's protection and restoration for His people."
    }
  ]
}