{
  "book": "genesis",
  "bookName": "Genesis",
  "chapter": 47,
  "title": "Joseph and Egypt's Famine",
  "shortSummary": "Genesis 47 details Joseph's wise administration during the severe famine, including the relocation of his family to Egypt and the economic restructuring under Pharaoh's authority. This chapter highlights God's providence in preserving Israel and establishing them in Goshen, setting the stage for their future growth in Egypt.",
  "timeline": "c. 1876 BC - The Sojourn of Israel in Egypt during the Famine",
  "keyCharacters": [
    {
      "name": "Joseph",
      "description": "Son of Jacob, appointed by Pharaoh to manage Egypt's resources during the famine; he secures a place for his family and administers the land's resources."
    },
    {
      "name": "Pharaoh",
      "description": "The king of Egypt who entrusts Joseph with authority over the land and welcomes Jacob and his family into Egypt."
    },
    {
      "name": "Jacob (Israel)",
      "description": "Patriarch of the Israelites, father of Joseph, who relocates to Egypt and blesses Pharaoh."
    }
  ],
  "definitions": [
    {
      "term": "Sojourn",
      "definition": "A temporary stay in a place; here it refers to the Israelites residing in Egypt without permanent settlement initially."
    },
    {
      "term": "Goshen",
      "definition": "A fertile region in Egypt assigned to the Israelites for their dwelling and livestock, symbolizing God's provision."
    },
    {
      "term": "Famine",
      "definition": "A severe scarcity of food causing widespread hunger and economic hardship, central to the events of this chapter."
    },
    {
      "term": "Seed",
      "definition": "Grain or crops used for planting to produce future harvests, essential for sustaining life and livelihood."
    }
  ],
  "outline": [
    {
      "heading": "Arrival of Jacob and Family in Egypt",
      "verseRange": "Genesis 47:1-6",
      "description": "Joseph informs Pharaoh of his family’s arrival and secures for them the land of Goshen, a place suitable for their shepherding occupation, demonstrating God's providential care."
    },
    {
      "heading": "Jacob Blessed by Pharaoh",
      "verseRange": "Genesis 47:7-10",
      "description": "Jacob is brought before Pharaoh, blesses him, and reflects on his life’s hardships, highlighting the fulfillment of God's promises through his lineage."
    },
    {
      "heading": "Provision and Settlement During the Famine",
      "verseRange": "Genesis 47:11-12",
      "description": "Joseph provides for his family and household with bread during the famine, showing his role as provider and caretaker under God's guidance."
    },
    {
      "heading": "Economic Measures During the Famine",
      "verseRange": "Genesis 47:13-26",
      "description": "Joseph implements a system where Egyptians exchange money and livestock for food, eventually selling their land to Pharaoh, establishing a new social and economic order under divine sovereignty."
    },
    {
      "heading": "Israel’s Prosperity and Jacob’s Final Request",
      "verseRange": "Genesis 47:27-31",
      "description": "Israel prospers in Goshen, living there for seventeen years; Jacob requests to be buried in Canaan, affirming his faith in God's promises to his ancestors."
    }
  ],
  "application": [
    "Trust in God's providence during times of hardship, knowing He can provide and protect His people as He did for Joseph and his family.",
    "Recognize the importance of wise stewardship and obedience to God’s guidance in managing resources and responsibilities.",
    "Value the blessing of family unity and honor God’s covenant promises through faithfulness and prayer.",
    "Commit to leaving a legacy of faith by trusting God’s promises even in uncertain circumstances, as Jacob did."
  ],
  "keyVerses": [
    {
      "reference": "Genesis 47:6",
      "text": "The land of Egypt is before thee; in the best of the land make thy father and brethren to dwell; in the land of Goshen let them dwell: and if thou knowest any men of activity among them, then make them rulers over my cattle.",
      "significance": "This verse shows Pharaoh’s favor toward Joseph’s family and God's provision in giving them a special place in Egypt."
    },
    {
      "reference": "Genesis 47:20",
      "text": "And Joseph bought all the land of Egypt for Pharaoh; for the Egyptians sold every man his field, because the famine prevailed over them: so the land became Pharaoh's.",
      "significance": "This verse highlights Joseph’s administrative wisdom and the establishment of Pharaoh’s authority over the land during the famine."
    },
    {
      "reference": "Genesis 47:27",
      "text": "And Israel dwelt in the land of Egypt, in the country of Goshen; and they had possessions therein, and grew, and multiplied exceedingly.",
      "significance": "This verse emphasizes God's blessing on Israel’s settlement and growth in Egypt despite difficult circumstances."
    },
    {
      "reference": "Genesis 47:30",
      "text": "But I will lie with my fathers, and thou shalt carry me out of Egypt, and bury me in their buryingplace. And he said, I will do as thou hast said.",
      "significance": "Jacob’s request reflects his faith in God’s promises to bring his descendants back to Canaan, affirming hope beyond the present life."
    }
  ]
}