{
  "book": "genesis",
  "bookName": "Genesis",
  "chapter": 37,
  "title": "Joseph's Betrayal",
  "shortSummary": "Genesis 37 introduces Joseph, Jacob’s favored son, whose dreams of future prominence provoke jealousy and hatred among his brothers. This chapter narrates the brothers’ conspiracy to kill Joseph, their decision to sell him into slavery in Egypt, and Jacob’s profound grief over the apparent loss of his son. It sets the stage for God’s providential plan to preserve His people through Joseph.",
  "timeline": "c. 1900 BC - Patriarchal Period",
  "keyCharacters": [
    {
      "name": "Joseph",
      "description": "Seventeen-year-old son of Jacob, favored by his father and gifted with prophetic dreams that foretell his future rise."
    },
    {
      "name": "Jacob (Israel)",
      "description": "Patriarch and father of Joseph, who shows special love to Joseph, causing tension among his sons."
    },
    {
      "name": "Reuben",
      "description": "Jacob’s eldest son who intervenes to save Joseph’s life by suggesting he be cast into a pit rather than killed."
    },
    {
      "name": "Judah",
      "description": "One of Joseph’s brothers who proposes selling Joseph to the Ishmeelites instead of killing him."
    }
  ],
  "definitions": [
    {
      "term": "Coat of many colours",
      "definition": "A richly ornamented garment given by Jacob to Joseph symbolizing special favor and status among his brothers."
    },
    {
      "term": "Sheaves",
      "definition": "Bundles of grain stalks tied together after harvest, used in Joseph’s dream to symbolize his brothers bowing to him."
    },
    {
      "term": "Ishmeelites",
      "definition": "Nomadic traders descended from Ishmael, involved in the caravan that purchased Joseph and took him to Egypt."
    },
    {
      "term": "Midianites",
      "definition": "A group of traders who facilitated the sale of Joseph to the Ishmeelites, playing a key role in his journey to Egypt."
    }
  ],
  "outline": [
    {
      "heading": "Joseph’s Favoritism and Dreams",
      "verseRange": "Genesis 37:1-11",
      "description": "Jacob’s special love for Joseph and the gift of a distinctive coat provoke jealousy among his brothers. Joseph shares two prophetic dreams indicating his future authority, increasing their hatred and envy."
    },
    {
      "heading": "Joseph Sent to His Brothers",
      "verseRange": "Genesis 37:12-17",
      "description": "Jacob sends Joseph to check on his brothers who are tending the flocks. Joseph’s journey leads him to find them in Dothan, setting the stage for the conflict."
    },
    {
      "heading": "The Brothers’ Conspiracy",
      "verseRange": "Genesis 37:18-24",
      "description": "Joseph’s brothers plot to kill him out of jealousy, but Reuben intervenes to save him by suggesting they throw him into a pit instead."
    },
    {
      "heading": "Joseph Sold into Slavery",
      "verseRange": "Genesis 37:25-28",
      "description": "While the brothers eat, a caravan of Ishmeelites passes by. Judah persuades the brothers to sell Joseph rather than kill him, and Joseph is sold for twenty pieces of silver and taken to Egypt."
    },
    {
      "heading": "Jacob’s Grief and Deception",
      "verseRange": "Genesis 37:29-35",
      "description": "Reuben discovers Joseph missing and is distraught. The brothers deceive Jacob by presenting Joseph’s bloodied coat, leading Jacob to mourn deeply, believing Joseph is dead."
    },
    {
      "heading": "Joseph’s Arrival in Egypt",
      "verseRange": "Genesis 37:36",
      "description": "The chapter closes with Joseph being sold to Potiphar, an Egyptian official, marking the beginning of his life in Egypt and God’s unfolding plan."
    }
  ],
  "application": [
    "Trust God’s providence even when circumstances seem dire, as He is working behind the scenes for His purposes.",
    "Avoid jealousy and bitterness toward others, recognizing the destructive consequences they bring.",
    "Be faithful in small tasks and obedient to God’s calling, as Joseph was faithful even as a young servant.",
    "Respond to family conflict with wisdom and seek to be a peacemaker, following Reuben’s example of intervention."
  ],
  "keyVerses": [
    {
      "reference": "Genesis 37:3",
      "text": "Now Israel loved Joseph more than all his children, because he was the son of his old age: and he made him a coat of many colours.",
      "significance": "This verse highlights the favoritism that sparks the conflict and sets the narrative in motion."
    },
    {
      "reference": "Genesis 37:20",
      "text": "Come now therefore, and let us slay him, and cast him into some pit, and we will say, Some evil beast hath devoured him: and we shall see what will become of his dreams.",
      "significance": "It reveals the brothers’ murderous intent and their scorn for Joseph’s God-given dreams."
    },
    {
      "reference": "Genesis 37:28",
      "text": "Then there passed by Midianites merchantmen; and they drew and lifted up Joseph out of the pit, and sold Joseph to the Ishmeelites for twenty pieces of silver: and they brought Joseph into Egypt.",
      "significance": "This verse marks the pivotal moment when Joseph is sold into slavery, beginning God’s plan to preserve Israel."
    },
    {
      "reference": "Genesis 37:35",
      "text": "And all his sons and all his daughters rose up to comfort him; but he refused to be comforted; and he said, For I will go down into the grave unto my son mourning. Thus his father wept for him.",
      "significance": "It shows Jacob’s deep sorrow and the human cost of sin and broken relationships."
    }
  ]
}