{
  "book": "genesis",
  "bookName": "Genesis",
  "chapter": 35,
  "title": "Return to Bethel",
  "shortSummary": "Genesis 35 recounts God's command to Jacob to return to Bethel, where he renews his covenant and receives a new name, Israel. The chapter highlights themes of obedience, purification, divine blessing, and the continuation of God's promises to the patriarchs. It also records the death of Rachel and Isaac, marking significant transitions in Israel’s family history.",
  "timeline": "c. 1900 BC - Patriarchal Period",
  "keyCharacters": [
    {
      "name": "Jacob (Israel)",
      "description": "The patriarch who obeys God's command to return to Bethel, renews his covenant, and receives the new name Israel."
    },
    {
      "name": "Rachel",
      "description": "Jacob’s beloved wife who dies giving birth to Benjamin during their journey from Bethel."
    },
    {
      "name": "Reuben",
      "description": "Jacob’s firstborn son who commits a grave sin by lying with Bilhah, his father's concubine."
    },
    {
      "name": "Deborah",
      "description": "Rebekah’s nurse who dies and is buried near Bethel during Jacob’s journey."
    }
  ],
  "definitions": [
    {
      "term": "Bethel",
      "definition": "Meaning 'House of God,' Bethel is the sacred place where God appeared to Jacob and renewed His covenant."
    },
    {
      "term": "Strange gods",
      "definition": "Idols or foreign deities that were not part of the worship of the true God, which Jacob commands to be removed."
    },
    {
      "term": "Pillar",
      "definition": "A stone monument set up to commemorate a significant divine encounter or covenant."
    },
    {
      "term": "Benjamin",
      "definition": "The youngest son of Jacob, whose name means 'son of the right hand,' born during Rachel’s death."
    }
  ],
  "outline": [
    {
      "heading": "God Commands Jacob to Return to Bethel",
      "verseRange": "Genesis 35:1-5",
      "description": "God instructs Jacob to go to Bethel and build an altar. Jacob commands his household to remove foreign gods and purify themselves, demonstrating obedience and spiritual renewal."
    },
    {
      "heading": "Jacob’s Worship and God’s Blessing",
      "verseRange": "Genesis 35:6-15",
      "description": "Jacob arrives at Bethel, builds an altar, and God appears to him again, changing his name to Israel and reaffirming the covenant promises of fruitfulness and land."
    },
    {
      "heading": "Rachel’s Death and Burial",
      "verseRange": "Genesis 35:16-20",
      "description": "During their journey, Rachel dies in childbirth and is buried near Bethlehem, marking a poignant moment in Jacob’s family history."
    },
    {
      "heading": "Family Developments and Reuben’s Sin",
      "verseRange": "Genesis 35:21-26",
      "description": "Jacob settles near the tower of Edar; Reuben sins by lying with Bilhah, and the chapter lists the twelve sons of Jacob, the foundation of Israel’s tribes."
    },
    {
      "heading": "Isaac’s Death and Burial",
      "verseRange": "Genesis 35:27-29",
      "description": "Jacob returns to his father Isaac in Hebron, where Isaac dies and is buried by his sons, closing the chapter on the patriarchal generation."
    }
  ],
  "application": [
    "Remove all idols and worldly distractions from your life to fully obey God’s call and worship Him in purity.",
    "Trust in God’s promises and covenant faithfulness even during times of transition and hardship.",
    "Honor the legacy of faith in your family by living obediently and passing down God’s truths to future generations.",
    "Recognize the seriousness of sin within the family and seek repentance and restoration through God’s grace."
  ],
  "keyVerses": [
    {
      "reference": "Genesis 35:10",
      "text": "And God said unto him, Thy name is Jacob: thy name shall not be called any more Jacob, but Israel shall be thy name: and he called his name Israel.",
      "significance": "This verse marks the divine renaming of Jacob to Israel, signifying a new identity and the fulfillment of God’s covenant promises."
    },
    {
      "reference": "Genesis 35:3",
      "text": "And let us arise, and go up to Bethel; and I will make there an altar unto God, who answered me in the day of my distress, and was with me in the way which I went.",
      "significance": "Jacob’s declaration highlights faithfulness in worship and recognition of God’s presence and help in times of trouble."
    },
    {
      "reference": "Genesis 35:18",
      "text": "And it came to pass, as her soul was in departing, (for she died) that she called his name Benoni: but his father called him Benjamin.",
      "significance": "This verse records Rachel’s death and the naming of Benjamin, emphasizing both sorrow and hope in God’s providence."
    },
    {
      "reference": "Genesis 35:29",
      "text": "And Isaac gave up the ghost, and died, and was gathered unto his people, being old and full of days: and his sons Esau and Jacob buried him.",
      "significance": "The peaceful death and burial of Isaac signify the passing of the patriarchal generation and God’s faithfulness through the family line."
    }
  ]
}