{
  "book": "genesis",
  "bookName": "Genesis",
  "chapter": 19,
  "title": "Destruction of Sodom",
  "shortSummary": "Genesis 19 recounts the visit of two angels to Sodom, Lot's hospitality, the city's wickedness, and God's judgment through fire and brimstone. The chapter also details Lot's escape, the tragic fate of his wife, and the origin of the Moabites and Ammonites through Lot's daughters. This chapter highlights God's justice, mercy, and the consequences of sin.",
  "timeline": "c. 2100 BC - Patriarchal Period during Abraham's lifetime",
  "keyCharacters": [
    {
      "name": "Lot",
      "description": "Nephew of Abraham who lives in Sodom and offers hospitality to the visiting angels; he is rescued from the city's destruction."
    },
    {
      "name": "Two Angels",
      "description": "Heavenly messengers sent by God to warn Lot and execute judgment on Sodom."
    },
    {
      "name": "Men of Sodom",
      "description": "The wicked inhabitants who demand to abuse the angels, exemplifying the city's moral depravity."
    },
    {
      "name": "Lot's Wife",
      "description": "She disobeys God's command by looking back at Sodom and is turned into a pillar of salt."
    },
    {
      "name": "Lot's Daughters",
      "description": "They preserve their family line through an incestuous act with their father after the destruction of Sodom."
    }
  ],
  "definitions": [
    {
      "term": "Brimstone",
      "definition": "Sulfur; used in the Bible to describe the fiery, destructive judgment from heaven."
    },
    {
      "term": "Unleavened Bread",
      "definition": "Bread made without yeast, symbolizing purity and haste in biblical contexts."
    },
    {
      "term": "Pillar of Salt",
      "definition": "A miraculous transformation signifying judgment and the consequences of disobedience."
    },
    {
      "term": "Sojourn",
      "definition": "A temporary stay or residence, often used in the Bible to describe living as a foreigner."
    }
  ],
  "outline": [
    {
      "heading": "The Arrival of the Angels and Lot’s Hospitality",
      "verseRange": "Genesis 19:1-3",
      "description": "Two angels arrive in Sodom and are welcomed by Lot, who insists they stay at his house, demonstrating his righteousness and hospitality amidst a corrupt city."
    },
    {
      "heading": "The Wickedness of Sodom and Lot’s Plea",
      "verseRange": "Genesis 19:4-11",
      "description": "The men of Sodom surround Lot’s house demanding to abuse the angels; Lot offers his daughters instead, highlighting the city's depravity and Lot’s desperate attempt to protect his guests."
    },
    {
      "heading": "The Warning and Escape from Judgment",
      "verseRange": "Genesis 19:12-23",
      "description": "The angels warn Lot to flee with his family; despite hesitation, Lot escapes to Zoar before God destroys Sodom and Gomorrah with fire and brimstone."
    },
    {
      "heading": "The Fate of Lot’s Wife",
      "verseRange": "Genesis 19:24-26",
      "description": "As the city is destroyed, Lot’s wife looks back in disobedience and is turned into a pillar of salt, symbolizing the consequences of rebellion against God’s command."
    },
    {
      "heading": "Lot’s Life After Sodom and the Origin of Moab and Ammon",
      "verseRange": "Genesis 19:27-38",
      "description": "Lot settles in a cave with his daughters; through an incestuous act, his daughters bear the ancestors of the Moabites and Ammonites, showing the continuation of humanity despite judgment."
    }
  ],
  "application": [
    "Demonstrate hospitality and righteousness even in a corrupt environment, following Lot’s example of welcoming strangers.",
    "Trust and obey God’s warnings promptly, as delay can lead to greater peril, shown by Lot’s initial hesitation to flee.",
    "Avoid looking back or longing for a sinful past when God calls you to move forward in obedience.",
    "Recognize God’s mercy in judgment and pray for the salvation of those living in wickedness."
  ],
  "keyVerses": [
    {
      "reference": "Genesis 19:24",
      "text": "Then the LORD rained upon Sodom and upon Gomorrah brimstone and fire from the LORD out of heaven;",
      "significance": "This verse vividly illustrates God's righteous judgment against unrepentant sin."
    },
    {
      "reference": "Genesis 19:26",
      "text": "But his wife looked back from behind him, and she became a pillar of salt.",
      "significance": "A solemn warning about the consequences of disobedience and longing for a sinful past."
    },
    {
      "reference": "Genesis 19:17",
      "text": "And it came to pass, when they had brought them forth abroad, that he said, Escape for thy life; look not behind thee, neither stay thou in all the plain; escape to the mountain, lest thou be consumed.",
      "significance": "Emphasizes the urgency of obedience and total separation from sin to receive God’s protection."
    },
    {
      "reference": "Genesis 19:29",
      "text": "And it came to pass, when God destroyed the cities of the plain, that God remembered Abraham, and sent Lot out of the midst of the overthrow, when he overthrew the cities in the which Lot dwelt.",
      "significance": "Shows God’s faithfulness to His promises and His mercy in delivering the righteous."
    }
  ]
}