{
  "book": "isaiah",
  "bookName": "Isaiah",
  "chapter": 15,
  "title": "The Burden of Moab",
  "shortSummary": "Isaiah 15 pronounces a prophetic lament over the destruction and desolation of Moab, a neighboring nation to Israel. The chapter vividly describes the mourning, devastation, and divine judgment that will come upon Moab for its sins, highlighting God's sovereignty over the nations.",
  "timeline": "c. 8th century BC - During the ministry of the prophet Isaiah, likely in the reign of King Hezekiah",
  "keyCharacters": [
    {
      "name": "Moab",
      "description": "A nation east of Israel, subject of the prophecy, facing divine judgment and destruction."
    },
    {
      "name": "Ar of Moab",
      "description": "A city in Moab mentioned as being laid waste during the night, symbolizing the suddenness of judgment."
    },
    {
      "name": "Kir of Moab",
      "description": "Another Moabite city destroyed at night, emphasizing the comprehensive nature of the calamity."
    },
    {
      "name": "Nebo and Medeba",
      "description": "Cities of Moab over which the people mourn, representing the widespread grief."
    }
  ],
  "definitions": [
    {
      "term": "Burden",
      "definition": "A prophetic oracle or message of judgment, often announcing calamity or divine displeasure."
    },
    {
      "term": "Sackcloth",
      "definition": "A coarse cloth worn as a sign of mourning, repentance, or distress in biblical times."
    },
    {
      "term": "Baldness",
      "definition": "In the ancient Near East, shaving the head was a sign of mourning and grief."
    },
    {
      "term": "Heifer of three years old",
      "definition": "A young cow used metaphorically here, possibly symbolizing Zoar as a place of refuge or weakness."
    }
  ],
  "outline": [
    {
      "heading": "The Destruction of Moabite Cities",
      "verseRange": "Isaiah 15:1-2",
      "description": "The chapter opens with a vivid description of the sudden devastation of Moab’s key cities, Ar and Kir, signaling the onset of divine judgment and the resulting mourning."
    },
    {
      "heading": "The Mourning of the People",
      "verseRange": "Isaiah 15:3-5",
      "description": "Moab’s people respond with deep grief, wearing sackcloth and lamenting over various cities, illustrating the profound sorrow and recognition of their calamity."
    },
    {
      "heading": "The Desolation of the Land",
      "verseRange": "Isaiah 15:6-7",
      "description": "The natural resources of Moab suffer as well, with dried-up waters and withered vegetation, symbolizing total ruin and loss of sustenance."
    },
    {
      "heading": "The Widespread Cry of Destruction",
      "verseRange": "Isaiah 15:8-9",
      "description": "The chapter concludes with the spreading of the lamentation throughout Moab’s borders and a graphic image of blood-filled waters, emphasizing the severity of judgment and the fate of survivors."
    }
  ],
  "application": [
    "Recognize that God is sovereign over all nations and holds them accountable for their actions, encouraging personal repentance and faithfulness.",
    "Respond to God’s warnings with humility and mourning over sin, as Moab’s sackcloth and baldness symbolize genuine sorrow.",
    "Trust in God’s justice even when facing calamity, knowing that He works all things according to His righteous purposes.",
    "Pray for those under judgment and hardship, asking God to bring repentance and restoration where possible."
  ],
  "keyVerses": [
    {
      "reference": "Isaiah 15:1",
      "text": "The burden of Moab. Because in the night Ar of Moab is laid waste, and brought to silence; because in the night Kir of Moab is laid waste, and brought to silence;",
      "significance": "This verse introduces the prophecy and highlights the sudden and complete destruction coming upon Moab."
    },
    {
      "reference": "Isaiah 15:3",
      "text": "In their streets they shall gird themselves with sackcloth: on the tops of their houses, and in their streets, every one shall howl, weeping abundantly.",
      "significance": "It vividly portrays the deep mourning and sorrow of Moab’s people in response to their devastation."
    },
    {
      "reference": "Isaiah 15:6",
      "text": "For the waters of Nimrim shall be desolate: for the hay is withered away, the grass faileth, there is no green thing.",
      "significance": "This verse symbolizes the total desolation of the land, reflecting the spiritual and physical consequences of judgment."
    },
    {
      "reference": "Isaiah 15:9",
      "text": "For the waters of Dimon shall be full of blood: for I will bring more upon Dimon, lions upon him that escapeth of Moab, and upon the remnant of the land.",
      "significance": "It emphasizes the severity of God’s judgment, extending even to the survivors, underscoring the completeness of the punishment."
    }
  ]
}