{
  "book": "isaiah",
  "bookName": "Isaiah",
  "chapter": 61,
  "title": "The Anointed Servant",
  "shortSummary": "Isaiah 61 proclaims the mission of the Lord's anointed servant to bring good news, healing, and restoration to the brokenhearted and captives. This chapter highlights God’s promise of comfort, renewal, and everlasting joy for His people, emphasizing His covenant faithfulness and the future glory of righteousness.",
  "timeline": "c. 8th century BC - Prophecies of Isaiah during the Assyrian threat to Judah",
  "keyCharacters": [
    {
      "name": "The Anointed Servant",
      "description": "The figure empowered by the Spirit of the Lord to preach good tidings, bind up the brokenhearted, and proclaim liberty; traditionally understood as a Messianic prophecy fulfilled in Jesus Christ."
    },
    {
      "name": "The Meek and Brokenhearted",
      "description": "The humble and those suffering emotional and spiritual wounds, who are the primary recipients of the servant’s message of comfort and restoration."
    },
    {
      "name": "The Gentiles",
      "description": "Non-Israelite peoples who will be blessed through the work of God’s people and whose riches and glory will be shared with God’s servants."
    }
  ],
  "definitions": [
    {
      "term": "Anointed",
      "definition": "Chosen and empowered by God, often through the symbolic act of anointing with oil, signifying divine appointment for a special mission."
    },
    {
      "term": "Acceptable year of the LORD",
      "definition": "A reference to a time of God’s favor and salvation, often linked to the Year of Jubilee, when debts were forgiven and captives freed."
    },
    {
      "term": "Trees of righteousness",
      "definition": "A metaphor for God’s people who are firmly planted and flourishing in righteousness, reflecting God’s glory."
    },
    {
      "term": "Everlasting covenant",
      "definition": "An unbreakable, eternal agreement established by God with His people, promising ongoing blessing and faithfulness."
    }
  ],
  "outline": [
    {
      "heading": "The Mission of the Anointed Servant",
      "verseRange": "Isaiah 61:1-3",
      "description": "The Spirit of the Lord empowers the servant to bring good news to the humble, heal the brokenhearted, proclaim liberty, and comfort those who mourn, promising transformation from sorrow to joy."
    },
    {
      "heading": "Restoration and Renewal of the People",
      "verseRange": "Isaiah 61:4-6",
      "description": "God’s people will rebuild desolate places and enjoy prosperity, being honored as priests and ministers, sharing in the wealth and glory of the Gentiles."
    },
    {
      "heading": "God’s Justice and Covenant Promises",
      "verseRange": "Isaiah 61:7-9",
      "description": "God declares His love for justice and His hatred of wrongdoing, promising double blessings and an everlasting covenant with His people, whose descendants will be recognized and blessed among the nations."
    },
    {
      "heading": "Joyful Praise and Righteousness",
      "verseRange": "Isaiah 61:10-11",
      "description": "The servant rejoices in God’s salvation and righteousness, likening it to a bride’s adornment, and affirms that God will cause righteousness and praise to flourish before all nations."
    }
  ],
  "application": [
    "Trust in the Spirit’s empowerment to share the gospel and bring healing to those in need around you.",
    "Embrace God’s promise of restoration by actively participating in rebuilding and renewing your spiritual life and community.",
    "Live as a priestly people, serving God with integrity and rejoicing in His blessings rather than worldly riches.",
    "Rejoice daily in the salvation and righteousness given by God, allowing it to inspire praise and witness to others."
  ],
  "keyVerses": [
    {
      "reference": "Isaiah 61:1",
      "text": "The Spirit of the Lord GOD is upon me; because the LORD hath anointed me to preach good tidings unto the meek; he hath sent me to bind up the brokenhearted, to proclaim liberty to the captives, and the opening of the prison to them that are bound;",
      "significance": "This verse introduces the servant’s divinely appointed mission, fulfilled by Christ, to bring salvation and freedom."
    },
    {
      "reference": "Isaiah 61:3",
      "text": "To appoint unto them that mourn in Zion, to give unto them beauty for ashes, the oil of joy for mourning, the garment of praise for the spirit of heaviness; that they might be called trees of righteousness, the planting of the LORD, that he might be glorified.",
      "significance": "It highlights God’s transformative power to replace sorrow with joy and establish His people in righteousness."
    },
    {
      "reference": "Isaiah 61:8",
      "text": "For I the LORD love judgment, I hate robbery for burnt offering; and I will direct their work in truth, and I will make an everlasting covenant with them.",
      "significance": "This verse reveals God’s commitment to justice and His promise of an eternal covenant with His people."
    },
    {
      "reference": "Isaiah 61:10",
      "text": "I will greatly rejoice in the LORD, my soul shall be joyful in my God; for he hath clothed me with the garments of salvation, he hath covered me with the robe of righteousness, as a bridegroom decketh himself with ornaments, and as a bride adorneth herself with her jewels.",
      "significance": "It expresses the deep joy and gratitude of the believer who is clothed in salvation and righteousness by God."
    }
  ]
}