{
  "book": "isaiah",
  "bookName": "Isaiah",
  "chapter": 42,
  "title": "The Servant of the LORD",
  "shortSummary": "Isaiah 42 presents God's chosen Servant, empowered by the Spirit to bring justice and salvation to the nations. This chapter highlights the Servant’s gentle yet powerful mission to restore and guide, emphasizing God’s sovereignty and faithfulness in fulfilling His promises.",
  "timeline": "c. 8th century BC - Isaiah's prophetic ministry during the Assyrian threat to Israel and Judah",
  "keyCharacters": [
    {
      "name": "The Servant",
      "description": "God’s chosen one, empowered by the Spirit to bring justice and salvation to the Gentiles, characterized by humility and steadfastness."
    },
    {
      "name": "God the LORD",
      "description": "The sovereign Creator who calls and empowers the Servant, declaring His glory and justice."
    },
    {
      "name": "Israel (Jacob)",
      "description": "The nation addressed in the chapter, depicted as disobedient and suffering consequences for their sin."
    }
  ],
  "definitions": [
    {
      "term": "Servant",
      "definition": "A divinely appointed individual chosen to accomplish God’s purposes, often understood as a Messianic figure in Isaiah."
    },
    {
      "term": "Gentiles",
      "definition": "Nations other than Israel; non-Jewish peoples who will receive the Servant’s justice and salvation."
    },
    {
      "term": "Brushed reed",
      "definition": "A fragile and weak plant; symbolizing those who are vulnerable and oppressed, whom the Servant will not break."
    },
    {
      "term": "Smoking flax",
      "definition": "A smoldering wick about to go out; representing faint faith or weakness that the Servant will not extinguish."
    },
    {
      "term": "Graven images",
      "definition": "Idols carved or fashioned as objects of worship, which God forbids and will not share His glory with."
    }
  ],
  "outline": [
    {
      "heading": "The Servant’s Mission and Character",
      "verseRange": "Isaiah 42:1-4",
      "description": "God introduces His Servant, empowered by the Spirit to bring justice quietly and gently to the nations, showing compassion to the weak and persevering until righteousness is established."
    },
    {
      "heading": "God’s Sovereign Declaration",
      "verseRange": "Isaiah 42:5-9",
      "description": "God declares His creative power and His calling of the Servant to be a covenant and light to the Gentiles, promising to reveal new things and fulfill His purposes."
    },
    {
      "heading": "Call to Praise and God’s Mighty Action",
      "verseRange": "Isaiah 42:10-13",
      "description": "A call for all creation to sing a new song of praise to the LORD, who will act mightily to defeat His enemies and establish His justice."
    },
    {
      "heading": "Judgment and Restoration",
      "verseRange": "Isaiah 42:14-17",
      "description": "God describes His coming judgment against the wicked and His guidance for the blind and imprisoned, promising to lead them in new ways and not forsake them."
    },
    {
      "heading": "Israel’s Spiritual Blindness and Consequences",
      "verseRange": "Isaiah 42:18-25",
      "description": "God rebukes Israel for their spiritual blindness and deafness, highlighting their failure to obey and the resulting judgment they face for trusting idols and rejecting His law."
    }
  ],
  "application": [
    "Trust in the Lord’s chosen Servant, Jesus Christ, who brings justice with gentleness and compassion, encouraging believers to imitate His humility and perseverance.",
    "Recognize God’s sovereignty in creation and redemption, responding with worship and praise as called in the chapter.",
    "Avoid idolatry and spiritual complacency by heeding God’s word and walking in obedience to His law.",
    "Rely on God’s guidance and faithfulness even in times of difficulty, trusting that He will lead and not forsake His people."
  ],
  "keyVerses": [
    {
      "reference": "Isaiah 42:1",
      "text": "Behold my servant, whom I uphold; mine elect, in whom my soul delighteth; I have put my spirit upon him: he shall bring forth judgment to the Gentiles.",
      "significance": "This verse introduces the Servant as God’s chosen one, empowered by the Spirit to bring justice to all nations, foundational for understanding the Messianic mission."
    },
    {
      "reference": "Isaiah 42:6",
      "text": "I the LORD have called thee in righteousness, and will hold thine hand, and will keep thee, and give thee for a covenant of the people, for a light of the Gentiles;",
      "significance": "God’s promise to uphold and use the Servant as a covenant and light to the Gentiles highlights the universal scope of salvation through the Messiah."
    },
    {
      "reference": "Isaiah 42:16",
      "text": "And I will bring the blind by a way that they knew not; I will lead them in paths that they have not known: I will make darkness light before them, and crooked things straight. These things will I do unto them, and not forsake them.",
      "significance": "This verse assures God’s guidance and faithfulness to those spiritually blind or lost, emphasizing His power to bring salvation and transformation."
    },
    {
      "reference": "Isaiah 42:25",
      "text": "Therefore he hath poured upon him the fury of his anger, and the strength of battle: and it hath set him on fire round about, yet he knew not; and it burned him, yet he laid it not to heart.",
      "significance": "This verse reveals the consequences of Israel’s disobedience and God’s righteous judgment, underscoring the seriousness of sin and the need for repentance."
    }
  ]
}