{
  "book": "isaiah",
  "bookName": "Isaiah",
  "chapter": 31,
  "title": "Trust in the Lord, Not Egypt",
  "shortSummary": "Isaiah 31 warns Israel against relying on Egypt's military power instead of trusting in the Lord. The chapter contrasts human strength with God's sovereign protection and calls for repentance from idolatry. It assures that God will defend Jerusalem and bring judgment on evildoers and their allies.",
  "timeline": "c. 8th century BC - During the Assyrian threat to Judah",
  "keyCharacters": [
    {
      "name": "Israel",
      "description": "God’s chosen people who are warned against seeking help from Egypt and urged to trust in the Lord."
    },
    {
      "name": "Egypt",
      "description": "The nation Israel is tempted to rely on for military assistance, symbolizing human power and fleshly strength."
    },
    {
      "name": "Assyria",
      "description": "The invading empire threatening Israel, prophesied to fall by God's judgment."
    }
  ],
  "definitions": [
    {
      "term": "Chariots",
      "definition": "Wheeled war vehicles used in ancient battles, symbolizing military strength and reliance on human power."
    },
    {
      "term": "Holy One of Israel",
      "definition": "A title for God emphasizing His holiness and unique relationship with Israel."
    },
    {
      "term": "Idols",
      "definition": "Physical objects made for worship that represent false gods, condemned as sin in the Bible."
    },
    {
      "term": "Ensign",
      "definition": "A banner or standard used in battle representing leadership and rallying point for troops."
    }
  ],
  "outline": [
    {
      "heading": "Warning Against Trusting Egypt",
      "verseRange": "Isaiah 31:1-3",
      "description": "Isaiah condemns Israel’s reliance on Egypt’s horses and chariots instead of seeking the Lord, emphasizing that Egypt is mortal and powerless compared to God."
    },
    {
      "heading": "God’s Assurance of Protection",
      "verseRange": "Isaiah 31:4-5",
      "description": "God is portrayed as a mighty lion and a protective bird who will defend Mount Zion and Jerusalem against their enemies."
    },
    {
      "heading": "Call to Repentance",
      "verseRange": "Isaiah 31:6-7",
      "description": "Israel is urged to turn back to God and abandon their idols, recognizing their sinfulness in trusting created things rather than the Creator."
    },
    {
      "heading": "Judgment on Assyria",
      "verseRange": "Isaiah 31:8-9",
      "description": "Prophecy of Assyria’s defeat by God’s hand, highlighting the fear and downfall of their leaders before the Lord’s fiery judgment in Zion and Jerusalem."
    }
  ],
  "application": [
    "Place your full trust in God rather than in worldly powers or resources, recognizing His sovereignty over all.",
    "Repent from any idolatry or misplaced confidence in material things, turning wholeheartedly to the Lord.",
    "Find comfort and courage in God’s promise to protect and deliver His people amidst trials and threats.",
    "Remember that God’s judgment is sure against evildoers, encouraging holy living and obedience."
  ],
  "keyVerses": [
    {
      "reference": "Isaiah 31:1",
      "text": "Woe to them that go down to Egypt for help; and stay on horses, and trust in chariots, because they are many; and in horsemen, because they are very strong; but they look not unto the Holy One of Israel, neither seek the LORD!",
      "significance": "This verse highlights the folly of trusting human strength over God and sets the chapter’s main theme."
    },
    {
      "reference": "Isaiah 31:4",
      "text": "For thus hath the LORD spoken unto me, Like as the lion and the young lion roaring on his prey, when a multitude of shepherds is called forth against him, he will not be afraid of their voice, nor abase himself for the noise of them: so shall the LORD of hosts come down to fight for mount Zion, and for the hill thereof.",
      "significance": "It reassures believers of God’s fearless and powerful defense of His people."
    },
    {
      "reference": "Isaiah 31:7",
      "text": "For in that day every man shall cast away his idols of silver, and his idols of gold, which your own hands have made unto you for a sin.",
      "significance": "This verse calls for genuine repentance and rejection of idolatry as a prerequisite for restoration."
    }
  ]
}