{
  "book": "isaiah",
  "bookName": "Isaiah",
  "chapter": 38,
  "title": "Hezekiah's Healing",
  "shortSummary": "Isaiah 38 recounts the illness of King Hezekiah, his earnest prayer for life, and God's gracious extension of his days by fifteen years. The chapter highlights God's power to heal and deliver, the importance of heartfelt prayer, and the hope of life beyond death.",
  "timeline": "c. 701 BC - Reign of Hezekiah, King of Judah",
  "keyCharacters": [
    {
      "name": "Hezekiah",
      "description": "King of Judah who becomes gravely ill and prays earnestly to the LORD for healing and extended life."
    },
    {
      "name": "Isaiah",
      "description": "The prophet who delivers God's message to Hezekiah about his impending death and later God's promise of healing."
    },
    {
      "name": "The LORD",
      "description": "God of Israel who hears Hezekiah’s prayer, grants him additional years of life, and promises deliverance from Assyria."
    }
  ],
  "definitions": [
    {
      "term": "Set thine house in order",
      "definition": "A phrase meaning to prepare for death by arranging one’s affairs and legacy."
    },
    {
      "term": "Sun dial of Ahaz",
      "definition": "A timekeeping device used in ancient Judah, referenced here as a sign of God's miraculous intervention."
    },
    {
      "term": "Pining sickness",
      "definition": "A wasting or consuming illness, often understood as a terminal disease."
    },
    {
      "term": "Pit of corruption",
      "definition": "A metaphor for the grave or death, emphasizing decay and separation from God."
    }
  ],
  "outline": [
    {
      "heading": "Hezekiah’s Illness and Prayer",
      "verseRange": "Isaiah 38:1-3",
      "description": "Hezekiah is gravely ill and receives a prophecy of death from Isaiah. In response, he turns to prayer, pleading with God and recalling his faithful walk."
    },
    {
      "heading": "God’s Promise of Healing",
      "verseRange": "Isaiah 38:4-8",
      "description": "God responds through Isaiah, promising to add fifteen years to Hezekiah’s life and deliver Jerusalem from Assyria, accompanied by a miraculous sign involving the sun’s shadow."
    },
    {
      "heading": "Hezekiah’s Song of Thanksgiving",
      "verseRange": "Isaiah 38:9-20",
      "description": "Hezekiah reflects on his near death experience in a poetic song, expressing sorrow, hope, and gratitude for God’s deliverance and forgiveness."
    },
    {
      "heading": "Healing and Confirmation",
      "verseRange": "Isaiah 38:21-22",
      "description": "Isaiah instructs the use of a fig poultice for Hezekiah’s boil, and Hezekiah questions the sign that will confirm his recovery and return to the house of the LORD."
    }
  ],
  "application": [
    "Trust God in times of serious illness and approach Him with honest, heartfelt prayer.",
    "Remember that God is sovereign over life and death and can grant healing and deliverance according to His will.",
    "Express gratitude through worship and testimony when God answers prayer and extends life.",
    "Look to God’s promises as a source of hope beyond physical death."
  ],
  "keyVerses": [
    {
      "reference": "Isaiah 38:5",
      "text": "Go, and say to Hezekiah, Thus saith the LORD, the God of David thy father, I have heard thy prayer, I have seen thy tears: behold, I will add unto thy days fifteen years.",
      "significance": "This verse reveals God's compassionate response to Hezekiah’s prayer, demonstrating His power to extend life."
    },
    {
      "reference": "Isaiah 38:17",
      "text": "Behold, for peace I had great bitterness : but thou hast in love to my soul delivered it from the pit of corruption: for thou hast cast all my sins behind thy back.",
      "significance": "Hezekiah acknowledges God's loving forgiveness and deliverance from death, highlighting the spiritual restoration that accompanies physical healing."
    },
    {
      "reference": "Isaiah 38:20",
      "text": "The LORD was ready to save me: therefore we will sing my songs to the stringed instruments all the days of our life in the house of the LORD.",
      "significance": "This verse emphasizes the joyful worship and praise that flow from experiencing God’s salvation."
    }
  ]
}