{
  "book": "isaiah",
  "bookName": "Isaiah",
  "chapter": 6,
  "title": "Isaiah's Vision and Commission",
  "shortSummary": "Isaiah chapter 6 presents the prophet’s awe-inspiring vision of the Lord enthroned in the temple, revealing God's holiness and glory. This encounter leads to Isaiah’s purification and commissioning to deliver a message of judgment and hope to a rebellious people.",
  "timeline": "c. 740 BC - During the reign of King Uzziah of Judah, shortly after his death",
  "keyCharacters": [
    {
      "name": "Isaiah",
      "description": "The prophet who receives a divine vision and is commissioned by God to speak to Israel."
    },
    {
      "name": "King Uzziah",
      "description": "The king of Judah whose death marks the time of Isaiah’s vision."
    },
    {
      "name": "Seraphims",
      "description": "Heavenly beings with six wings who worship God and purify Isaiah."
    }
  ],
  "definitions": [
    {
      "term": "Seraphims",
      "definition": "Angelic beings described with six wings who stand in God’s presence and proclaim His holiness."
    },
    {
      "term": "Train",
      "definition": "The long flowing robe or garment of a king or deity, symbolizing majesty and authority."
    },
    {
      "term": "Live coal",
      "definition": "A burning coal taken from the altar, symbolizing purification and cleansing from sin."
    },
    {
      "term": "Holy, holy, holy",
      "definition": "A triple repetition emphasizing the absolute holiness and perfection of God."
    }
  ],
  "outline": [
    {
      "heading": "Isaiah’s Vision of God’s Glory",
      "verseRange": "Isaiah 6:1-4",
      "description": "Isaiah sees the Lord seated on a high throne, surrounded by seraphims who declare God's holiness, filling the temple with smoke and shaking its foundations, revealing God’s majestic holiness and power."
    },
    {
      "heading": "Isaiah’s Confession and Cleansing",
      "verseRange": "Isaiah 6:5-7",
      "description": "Overwhelmed by God’s holiness, Isaiah confesses his sinfulness and unworthiness. A seraph touches his lips with a live coal from the altar, symbolizing divine forgiveness and purification."
    },
    {
      "heading": "The Divine Commission",
      "verseRange": "Isaiah 6:8-10",
      "description": "God calls for a messenger to deliver His message. Isaiah volunteers, but the message is one of judgment, causing spiritual blindness and hardness among the people."
    },
    {
      "heading": "The Duration and Outcome of Judgment",
      "verseRange": "Isaiah 6:11-13",
      "description": "Isaiah asks how long the judgment will last, and God reveals it will continue until the land is desolate, yet a faithful remnant will remain, symbolizing hope and future restoration."
    }
  ],
  "application": [
    "Approach God with reverence and humility, recognizing His holiness and our need for cleansing.",
    "Confess your sins honestly and trust in God’s power to purify and forgive.",
    "Respond promptly and willingly to God’s call to serve, even when the message is difficult.",
    "Trust in God’s sovereign plan, knowing that He preserves a faithful remnant for His purposes."
  ],
  "keyVerses": [
    {
      "reference": "Isaiah 6:3",
      "text": "And one cried unto another, and said, Holy, holy, holy, is the LORD of hosts: the whole earth is full of his glory.",
      "significance": "This verse highlights God’s absolute holiness and the universal scope of His glory."
    },
    {
      "reference": "Isaiah 6:5",
      "text": "Then said I, Woe is me! for I am undone; because I am a man of unclean lips, and I dwell in the midst of a people of unclean lips: for mine eyes have seen the King, the LORD of hosts.",
      "significance": "Isaiah’s confession reveals the natural human response to encountering God’s holiness—recognition of sin and unworthiness."
    },
    {
      "reference": "Isaiah 6:8",
      "text": "Also I heard the voice of the Lord, saying, Whom shall I send, and who will go for us? Then said I, Here am I; send me.",
      "significance": "This verse exemplifies Isaiah’s willing obedience and readiness to serve God’s mission."
    },
    {
      "reference": "Isaiah 6:13",
      "text": "But yet in it shall be a tenth, and it shall return, and shall be eaten: as a teil tree, and as an oak, whose substance is in them, when they cast their leaves: so the holy seed shall be the substance thereof.",
      "significance": "This verse promises that despite judgment, a faithful remnant will remain and God’s purposes will endure."
    }
  ]
}