{
  "book": "isaiah",
  "bookName": "Isaiah",
  "chapter": 23,
  "title": "The Burden of Tyre",
  "shortSummary": "Isaiah 23 pronounces a prophetic judgment against the ancient maritime city of Tyre, foretelling its destruction and eventual restoration after seventy years. The chapter highlights God's sovereign control over nations and His purpose in humbling proud cities that trust in their wealth and power.",
  "timeline": "c. 740-700 BC - During the ministry of Isaiah in the 8th century BC, addressing the geopolitical realities of the ancient Near East",
  "keyCharacters": [
    {
      "name": "Tyre",
      "description": "A prominent Phoenician city known for its wealth, commerce, and maritime power; the primary subject of Isaiah's prophecy."
    },
    {
      "name": "Zidon",
      "description": "Another important Phoenician city, closely linked to Tyre, whose merchants and inhabitants are addressed in the prophecy."
    },
    {
      "name": "Daughter of Tarshish",
      "description": "A poetic reference to the people connected with Tarshish, a distant maritime trading partner, symbolizing the far-reaching impact of Tyre's downfall."
    },
    {
      "name": "The LORD of hosts",
      "description": "God, who sovereignly decrees the judgment and restoration of Tyre, demonstrating His authority over all nations and kingdoms."
    }
  ],
  "definitions": [
    {
      "term": "Burden",
      "definition": "A prophetic oracle or message of judgment, often indicating a heavy or serious pronouncement from God."
    },
    {
      "term": "Tarshish",
      "definition": "A distant maritime region or city known for its ships and trade, often representing far-flung commerce in the ancient world."
    },
    {
      "term": "Chittim",
      "definition": "A biblical term for the islands or coastal regions west of Israel, often associated with Cyprus or the Mediterranean islands."
    },
    {
      "term": "Harlot",
      "definition": "A metaphor used in Scripture to describe a city or nation that has turned away from God to pursue idolatry or alliances with other nations."
    }
  ],
  "outline": [
    {
      "heading": "The Lament over Tyre’s Destruction",
      "verseRange": "Isaiah 23:1-5",
      "description": "The chapter opens with a lamentation over Tyre’s devastation, calling ships and inhabitants to mourn as the city is laid waste, highlighting the loss of its commercial prosperity."
    },
    {
      "heading": "The Sovereign Decree Against Tyre",
      "verseRange": "Isaiah 23:6-12",
      "description": "God’s sovereign judgment is declared against Tyre, emphasizing that its pride and strength will be humbled by divine command, and its merchants and strongholds will be destroyed."
    },
    {
      "heading": "Historical Context and the Fall of Chaldeans",
      "verseRange": "Isaiah 23:13",
      "description": "A brief historical reflection on the rise and fall of the Chaldeans, illustrating God’s power to establish and bring down kingdoms."
    },
    {
      "heading": "The Seventy Years of Tyre’s Desolation",
      "verseRange": "Isaiah 23:14-17",
      "description": "Tyre will be forgotten for seventy years, a period of desolation, after which it will sing again, symbolizing restoration and renewed commerce but with a changed character."
    },
    {
      "heading": "Tyre’s Future Restoration and Dedication to the LORD",
      "verseRange": "Isaiah 23:18",
      "description": "Tyre’s merchandise and earnings will ultimately be dedicated to the LORD, serving His people’s needs, pointing to a future where even worldly wealth is consecrated to God."
    }
  ],
  "application": [
    "Trust in God’s sovereignty over nations rather than in wealth or human strength, recognizing that all power is subject to His will.",
    "Respond to God’s judgments with humility, understanding that pride and self-reliance lead to downfall.",
    "Embrace God’s promise of restoration, knowing that He can redeem and use even the broken aspects of life for His glory.",
    "Dedicate your resources and talents to the Lord’s service, allowing what you have to bless others and honor God."
  ],
  "keyVerses": [
    {
      "reference": "Isaiah 23:9",
      "text": "The LORD of hosts hath purposed it, to stain the pride of all glory, and to bring into contempt all the honourable of the earth.",
      "significance": "This verse reveals God’s sovereign purpose to humble the proud and exalt His glory above human honor."
    },
    {
      "reference": "Isaiah 23:15",
      "text": "And it shall come to pass in that day, that Tyre shall be forgotten seventy years, according to the days of one king: after the end of seventy years shall Tyre sing as an harlot.",
      "significance": "This prophecy sets a specific timeframe for Tyre’s desolation and foretells its eventual restoration, emphasizing God’s control over history."
    },
    {
      "reference": "Isaiah 23:18",
      "text": "And her merchandise and her hire shall be holiness to the LORD: it shall not be treasured nor laid up; for her merchandise shall be for them that dwell before the LORD, to eat sufficiently, and for durable clothing.",
      "significance": "This verse points to the ultimate consecration of Tyre’s wealth to God’s service, illustrating the transformation of worldly resources for holy purposes."
    }
  ]
}