{
  "book": "jeremiah",
  "bookName": "Jeremiah",
  "chapter": 21,
  "title": "Judgment on Jerusalem",
  "shortSummary": "Jeremiah 21 records a message from God delivered through the prophet Jeremiah to King Zedekiah and the people of Jerusalem during the Babylonian siege. The chapter warns of inevitable judgment due to their disobedience but also offers a stark choice between life and death. It emphasizes God's sovereign justice and calls for repentance and righteous action.",
  "timeline": "c. 588 BC - During the Babylonian siege of Jerusalem under King Zedekiah",
  "keyCharacters": [
    {
      "name": "Jeremiah",
      "description": "The prophet through whom God delivers His message of judgment and warning to King Zedekiah and the people of Judah."
    },
    {
      "name": "King Zedekiah",
      "description": "The last king of Judah before the Babylonian captivity, who sends envoys to Jeremiah seeking guidance from the LORD."
    },
    {
      "name": "Pashur son of Melchiah",
      "description": "One of the envoys sent by King Zedekiah to inquire of Jeremiah."
    },
    {
      "name": "Zephaniah son of Maaseiah",
      "description": "A priest and one of the envoys sent by King Zedekiah to Jeremiah."
    },
    {
      "name": "Nebuchadrezzar",
      "description": "King of Babylon who is besieging Jerusalem, representing God's instrument of judgment."
    }
  ],
  "definitions": [
    {
      "term": "Chaldeans",
      "definition": "A term used in the Bible to refer to the Babylonians, especially their ruling class and military forces."
    },
    {
      "term": "Pestilence",
      "definition": "A deadly epidemic disease; here it symbolizes divine judgment through widespread death."
    },
    {
      "term": "Way of life and way of death",
      "definition": "A biblical phrase representing the choice between obedience to God leading to life and disobedience leading to death."
    },
    {
      "term": "Execute judgment",
      "definition": "To carry out justice fairly and righteously, especially by defending the oppressed and punishing wrongdoing."
    }
  ],
  "outline": [
    {
      "heading": "Jeremiah’s Commission and the King’s Inquiry",
      "verseRange": "Jeremiah 21:1-3",
      "description": "King Zedekiah sends Pashur and Zephaniah to Jeremiah to inquire of the LORD about the Babylonian siege, seeking hope or deliverance."
    },
    {
      "heading": "God’s Judgment Announced",
      "verseRange": "Jeremiah 21:4-7",
      "description": "God declares He will turn the weapons of war back upon Jerusalem and personally bring judgment through pestilence, sword, and famine, delivering the survivors into Babylon’s hands."
    },
    {
      "heading": "The Choice Between Life and Death",
      "verseRange": "Jeremiah 21:8-10",
      "description": "Jeremiah conveys God’s stark choice: those who stay in Jerusalem will perish, but those who surrender to Babylon will live, emphasizing God’s determined judgment on the city."
    },
    {
      "heading": "Call for Justice and Warning of God’s Wrath",
      "verseRange": "Jeremiah 21:11-14",
      "description": "God commands the house of David to practice justice by defending the oppressed, warning that failure to do so will provoke an unquenchable divine fury and destruction."
    }
  ],
  "application": [
    "Seek God earnestly in times of crisis, trusting His sovereign will even when circumstances seem dire.",
    "Choose the way of life by obeying God’s commands and turning from sin, recognizing that disobedience leads to destruction.",
    "Practice justice and defend the oppressed as a reflection of God’s character and to avoid His righteous judgment.",
    "Understand that God’s discipline is purposeful and calls for repentance, not presumption of mercy."
  ],
  "keyVerses": [
    {
      "reference": "Jeremiah 21:8",
      "text": "And unto this people thou shalt say, Thus saith the LORD; Behold, I set before you the way of life, and the way of death.",
      "significance": "This verse highlights the fundamental choice God gives His people between obedience that leads to life and rebellion that leads to death."
    },
    {
      "reference": "Jeremiah 21:9",
      "text": "He that abideth in this city shall die by the sword, and by the famine, and by the pestilence: but he that goeth out, and falleth to the Chaldeans that besiege you, he shall live , and his life shall be unto him for a prey.",
      "significance": "This verse underscores the certainty of judgment for those who resist and the promise of life for those who submit to God’s appointed judgment."
    },
    {
      "reference": "Jeremiah 21:12",
      "text": "O house of David, thus saith the LORD; Execute judgment in the morning, and deliver him that is spoiled out of the hand of the oppressor, lest my fury go out like fire, and burn that none can quench it, because of the evil of your doings.",
      "significance": "This verse calls for immediate and righteous action, warning that neglecting justice will provoke God’s unstoppable wrath."
    }
  ]
}