{
  "book": "jeremiah",
  "bookName": "Jeremiah",
  "chapter": 20,
  "title": "Jeremiah's Persecution and Prayer",
  "shortSummary": "Jeremiah 20 reveals the prophet's intense personal suffering and persecution for proclaiming God's message of judgment against Judah. Despite being beaten and mocked, Jeremiah remains faithful, expressing both his anguish and his trust in God's justice. This chapter highlights the cost of prophetic obedience and the power of God's word within the believer.",
  "timeline": "c. 627-586 BC - Late 7th to early 6th century BC, during the reign of King Zedekiah and the impending Babylonian captivity",
  "keyCharacters": [
    {
      "name": "Jeremiah",
      "description": "The prophet called by God to warn Judah of coming judgment; he suffers persecution but remains faithful to God's word."
    },
    {
      "name": "Pashur son of Immer",
      "description": "A priest and chief governor in the house of the LORD who opposes Jeremiah, punishes him, and receives a prophecy of judgment."
    }
  ],
  "definitions": [
    {
      "term": "Stocks",
      "definition": "A wooden device used to restrain and publicly humiliate prisoners by locking their feet and sometimes hands."
    },
    {
      "term": "Magormissabib",
      "definition": "A name meaning 'terror on every side,' given by Jeremiah to Pashur as a prophetic judgment symbolizing fear and calamity."
    },
    {
      "term": "Derision",
      "definition": "Mockery or ridicule; scornful laughter often directed at those who suffer for righteousness."
    },
    {
      "term": "Captivity",
      "definition": "The state of being taken prisoner or enslaved, often referring to the Babylonian exile of Judah's people."
    }
  ],
  "outline": [
    {
      "heading": "Jeremiah's Punishment by Pashur",
      "verseRange": "Jeremiah 20:1-3",
      "description": "Pashur, a priest and official, hears Jeremiah's prophecies and reacts by physically punishing him and placing him in the stocks, demonstrating opposition to God's messenger."
    },
    {
      "heading": "Prophecy of Judgment on Pashur and Judah",
      "verseRange": "Jeremiah 20:4-6",
      "description": "God declares through Jeremiah that Pashur and his household will face terror and captivity in Babylon, along with the destruction and exile of Judah, affirming the certainty of divine judgment."
    },
    {
      "heading": "Jeremiah's Lament and Inner Struggle",
      "verseRange": "Jeremiah 20:7-9",
      "description": "Jeremiah expresses deep anguish, feeling deceived and mocked for his prophetic calling, yet he cannot contain God's word burning within him, illustrating the prophet’s emotional and spiritual conflict."
    },
    {
      "heading": "Enemies Plot Against Jeremiah, but God Supports Him",
      "verseRange": "Jeremiah 20:10-12",
      "description": "Despite plots and accusations from his adversaries, Jeremiah trusts in the LORD's protection and justice, appealing to God to vindicate him and punish the wicked."
    },
    {
      "heading": "Prayer of Praise and Cursing His Birth",
      "verseRange": "Jeremiah 20:13-18",
      "description": "Jeremiah praises God for deliverance but also curses the day of his birth, revealing the profound sorrow and burden of his prophetic mission."
    }
  ],
  "application": [
    "Remain faithful to God's calling even when facing opposition or suffering, trusting that God is with you.",
    "Express your honest emotions to God in prayer, including lament and frustration, knowing He understands your heart.",
    "Rely on God's justice and protection when persecuted, rather than seeking revenge or compromise.",
    "Recognize the power and urgency of God's word within you, allowing it to motivate obedience despite difficulties."
  ],
  "keyVerses": [
    {
      "reference": "Jeremiah 20:9",
      "text": "Then I said, I will not make mention of him, nor speak any more in his name. But his word was in mine heart as a burning fire shut up in my bones, and I was weary with forbearing, and I could not stay.",
      "significance": "This verse powerfully illustrates the irresistible compulsion to obey God's word despite personal suffering."
    },
    {
      "reference": "Jeremiah 20:11",
      "text": "But the LORD is with me as a mighty terrible one: therefore my persecutors shall stumble, and they shall not prevail: they shall be greatly ashamed; for they shall not prosper: their everlasting confusion shall never be forgotten.",
      "significance": "It affirms God's protection over His servants and the ultimate defeat of their enemies."
    },
    {
      "reference": "Jeremiah 20:14",
      "text": "Cursed be the day wherein I was born: let not the day wherein my mother bare me be blessed.",
      "significance": "This verse reveals the depth of Jeremiah's anguish and the heavy burden of prophetic ministry."
    }
  ]
}