{
  "book": "jeremiah",
  "bookName": "Jeremiah",
  "chapter": 14,
  "title": "Famine and False Prophets",
  "shortSummary": "Jeremiah 14 depicts a severe drought and famine in Judah as a consequence of the people's sin and unfaithfulness to God. The chapter contrasts the false prophets' lies with Jeremiah's honest lament and God's declaration of judgment, while also including a plea for mercy and a reminder of God's sovereignty over nature.",
  "timeline": "c. 627-586 BC - Late Kingdom of Judah, during Jeremiah's prophetic ministry before the Babylonian exile",
  "keyCharacters": [
    {
      "name": "Jeremiah",
      "description": "The prophet receiving God's word concerning the drought and the people's sin, lamenting Judah's condition and confronting false prophecy."
    },
    {
      "name": "False Prophets",
      "description": "Prophets who falsely claim peace and security to the people, contradicting God's true message of coming judgment."
    },
    {
      "name": "Nobles of Judah",
      "description": "Leaders who send their children to seek water during the drought, illustrating the desperation of the people."
    }
  ],
  "definitions": [
    {
      "term": "Dearth",
      "definition": "A severe scarcity or famine, especially of food and water, as experienced by Judah in this chapter."
    },
    {
      "term": "Chapt",
      "definition": "Dried up or cracked, describing the parched ground due to lack of rain."
    },
    {
      "term": "Oblation",
      "definition": "An offering or sacrifice presented to God, often in worship or atonement."
    },
    {
      "term": "Divination",
      "definition": "The practice of seeking knowledge of the future or the unknown by supernatural means, condemned here as false prophecy."
    }
  ],
  "outline": [
    {
      "heading": "The Drought and Its Effects",
      "verseRange": "Jeremiah 14:1-6",
      "description": "Jeremiah describes the devastating drought in Judah, highlighting the physical suffering of the land, animals, and people, symbolizing the spiritual barrenness caused by sin."
    },
    {
      "heading": "Prayer and Lament of the People",
      "verseRange": "Jeremiah 14:7-9",
      "description": "Despite acknowledging their sin, the people cry out to God for mercy, expressing confusion and desperation over God's apparent absence in their time of trouble."
    },
    {
      "heading": "God’s Judgment on Judah and False Prophets",
      "verseRange": "Jeremiah 14:10-16",
      "description": "God declares that He will not accept the people's fasting or offerings due to their persistent sin and warns that false prophets who promise peace are lying and will face judgment."
    },
    {
      "heading": "Jeremiah’s Grief and Plea for Mercy",
      "verseRange": "Jeremiah 14:17-22",
      "description": "Jeremiah expresses deep sorrow over the suffering of Judah and pleads with God not to reject His people or break His covenant, affirming faith in God's power over nature and hope for restoration."
    }
  ],
  "application": [
    "Recognize the consequences of persistent sin and the importance of genuine repentance before God.",
    "Discern and reject false teachings that promise peace apart from God's truth and righteousness.",
    "Maintain faith and hope in God's sovereignty even in times of hardship and apparent silence.",
    "Persist in prayer and intercession for others, trusting God's covenant faithfulness."
  ],
  "keyVerses": [
    {
      "reference": "Jeremiah 14:10",
      "text": "Thus saith the LORD unto this people, Thus have they loved to wander, they have not refrained their feet, therefore the LORD doth not accept them; he will now remember their iniquity, and visit their sins.",
      "significance": "This verse reveals God's righteous judgment against Judah's persistent rebellion and unrepentance."
    },
    {
      "reference": "Jeremiah 14:14",
      "text": "Then the LORD said unto me, The prophets prophesy lies in my name: I sent them not, neither have I commanded them, neither spake unto them: they prophesy unto you a false vision and divination, and a thing of nought, and the deceit of their heart.",
      "significance": "It highlights the danger of false prophecy and the importance of discerning God's true word."
    },
    {
      "reference": "Jeremiah 14:21",
      "text": "Do not abhor us, for thy name's sake, do not disgrace the throne of thy glory: remember, break not thy covenant with us.",
      "significance": "A heartfelt plea reminding God of His covenant faithfulness and mercy despite the people's sin."
    },
    {
      "reference": "Jeremiah 14:22",
      "text": "Are there any among the vanities of the Gentiles that can cause rain? or can the heavens give showers? art not thou he, O LORD our God? therefore we will wait upon thee: for thou hast made all these things.",
      "significance": "This verse affirms God's unique sovereignty over creation and calls believers to trust and wait on Him alone."
    }
  ]
}