{
  "book": "jeremiah",
  "bookName": "Jeremiah",
  "chapter": 26,
  "title": "Jeremiah's Prophecy and Trial",
  "shortSummary": "Jeremiah delivers a solemn warning from God to the people of Judah, urging them to repent or face destruction. His message provokes a violent reaction, leading to a trial where his life is threatened, but he is ultimately spared through the intervention of influential supporters. This chapter highlights the cost of faithful prophecy and the call to heed God's warnings.",
  "timeline": "c. 609 BC - Early reign of Jehoiakim, king of Judah",
  "keyCharacters": [
    {
      "name": "Jeremiah",
      "description": "The prophet called by God to deliver a message of repentance and warning to Judah during Jehoiakim's reign."
    },
    {
      "name": "Jehoiakim",
      "description": "King of Judah during whose reign Jeremiah prophesies; he seeks to kill other prophets but is involved indirectly in Jeremiah's trial."
    },
    {
      "name": "Ahikam son of Shaphan",
      "description": "A nobleman who protects Jeremiah from being handed over to the people for execution."
    },
    {
      "name": "Urijah son of Shemaiah",
      "description": "A prophet who also prophesied against Jerusalem and was killed by King Jehoiakim."
    }
  ],
  "definitions": [
    {
      "term": "Shiloh",
      "definition": "An ancient city that was once the religious center of Israel but was destroyed due to the people's unfaithfulness, used here as a symbol of judgment."
    },
    {
      "term": "Repent",
      "definition": "To turn away from sin and return to obedience to God, a central theme in Jeremiah's message."
    },
    {
      "term": "Prophet",
      "definition": "A messenger chosen by God to deliver His words and warnings to the people."
    },
    {
      "term": "Innocent blood",
      "definition": "The unjust shedding of a righteous person's life, which brings guilt upon those responsible."
    }
  ],
  "outline": [
    {
      "heading": "Jeremiah’s Commission to Proclaim God’s Warning",
      "verseRange": "Jeremiah 26:1-6",
      "description": "God commands Jeremiah to stand in the temple courtyard and deliver a message calling the people of Judah to repentance, warning that failure to listen will bring destruction upon the temple and Jerusalem."
    },
    {
      "heading": "Jeremiah’s Message Provokes Hostility",
      "verseRange": "Jeremiah 26:7-9",
      "description": "After Jeremiah finishes speaking, priests, prophets, and the people react violently, accusing him of blasphemy and demanding his death for prophesying doom against the city and temple."
    },
    {
      "heading": "The Princes Intervene and Hear Jeremiah’s Defense",
      "verseRange": "Jeremiah 26:10-15",
      "description": "The leaders of Judah convene to judge Jeremiah; he defends his prophecy as a divine message and warns that killing him would bring innocent blood guilt upon the people."
    },
    {
      "heading": "Jeremiah’s Life is Spared by the People’s Decision",
      "verseRange": "Jeremiah 26:16-19",
      "description": "Some elders recall the example of Micah, a prophet who also warned of destruction but was spared, persuading the assembly that Jeremiah should not be put to death."
    },
    {
      "heading": "The Fate of Urijah and Jeremiah’s Protection",
      "verseRange": "Jeremiah 26:20-24",
      "description": "Another prophet, Urijah, who spoke similarly, is killed by King Jehoiakim; however, Jeremiah is protected by Ahikam son of Shaphan, preventing his execution."
    }
  ],
  "application": [
    "Obey God’s commands fully and do not diminish His word, even when it is difficult or unpopular.",
    "Stand firm in faith and courage when facing opposition for proclaiming God’s truth.",
    "Pray for wisdom and protection for those who faithfully serve God’s calling.",
    "Remember that repentance can avert judgment, so continually seek to turn from sin and obey God."
  ],
  "keyVerses": [
    {
      "reference": "Jeremiah 26:3",
      "text": "If so be they will hearken, and turn every man from his evil way, that I may repent me of the evil, which I purpose to do unto them because of the evil of their doings.",
      "significance": "This verse highlights God's desire for repentance and His willingness to withhold judgment if His people turn from their sins."
    },
    {
      "reference": "Jeremiah 26:15",
      "text": "But know ye for certain, that if ye put me to death, ye shall surely bring innocent blood upon yourselves, and upon this city, and upon the inhabitants thereof: for of a truth the LORD hath sent me unto you to speak all these words in your ears.",
      "significance": "Jeremiah warns that killing a true prophet is a grave sin that brings guilt and judgment upon the people and the city."
    },
    {
      "reference": "Jeremiah 26:16",
      "text": "Then said the princes and all the people unto the priests and to the prophets; This man is not worthy to die: for he hath spoken to us in the name of the LORD our God.",
      "significance": "This verse shows the recognition of Jeremiah’s genuine prophetic authority and the decision to spare his life."
    }
  ]
}