{
  "book": "jeremiah",
  "bookName": "Jeremiah",
  "chapter": 36,
  "title": "The Burning of the Scroll",
  "shortSummary": "Jeremiah is commanded by the Lord to write down His words of judgment against Judah and the nations. Baruch, Jeremiah’s scribe, reads the scroll publicly, but King Jehoiakim burns it in defiance. God instructs Jeremiah to rewrite the scroll, emphasizing the certainty of divine judgment despite human opposition.",
  "timeline": "c. 605 BC - Early reign of Jehoiakim, king of Judah",
  "keyCharacters": [
    {
      "name": "Jeremiah",
      "description": "The prophet of God who receives the word of the Lord and dictates it to Baruch for the people of Judah."
    },
    {
      "name": "Baruch",
      "description": "Jeremiah’s faithful scribe who writes down the prophetic words and reads them publicly as commanded."
    },
    {
      "name": "Jehoiakim",
      "description": "King of Judah who rejects God’s message by burning the scroll, symbolizing his rebellion against divine authority."
    },
    {
      "name": "Michaiah",
      "description": "A witness who hears the scroll read and reports its contents to the princes."
    }
  ],
  "definitions": [
    {
      "term": "Roll of a book",
      "definition": "A scroll made of parchment or papyrus used for writing before the invention of bound books."
    },
    {
      "term": "Fasting day",
      "definition": "A day set aside for solemn prayer and fasting, often to seek God’s mercy or guidance."
    },
    {
      "term": "Penknife",
      "definition": "A small knife used for cutting or trimming, here used by Jehudi to cut the scroll before burning."
    },
    {
      "term": "Winterhouse",
      "definition": "A part of the king’s palace used during the colder months, indicating where Jehoiakim was when he heard the scroll."
    }
  ],
  "outline": [
    {
      "heading": "Jeremiah Commands Baruch to Write the Prophecy",
      "verseRange": "Jeremiah 36:1-6",
      "description": "God instructs Jeremiah to dictate all His words of judgment against Israel, Judah, and the nations to Baruch, with the hope that the people will repent and be forgiven."
    },
    {
      "heading": "Public Reading of the Scroll",
      "verseRange": "Jeremiah 36:7-15",
      "description": "Baruch reads the scroll publicly on a fasting day in the temple, and the message spreads to the princes, who summon Baruch to hear the words themselves."
    },
    {
      "heading": "The Princes Report to King Jehoiakim",
      "verseRange": "Jeremiah 36:16-20",
      "description": "The princes, fearful of the message, report the words to King Jehoiakim and advise Jeremiah and Baruch to hide for their safety."
    },
    {
      "heading": "Jehoiakim Burns the Scroll",
      "verseRange": "Jeremiah 36:21-26",
      "description": "Jehudi reads the scroll before the king and his officials; Jehoiakim responds by cutting and burning the scroll, rejecting God’s warning."
    },
    {
      "heading": "God Commands Jeremiah to Rewrite the Scroll",
      "verseRange": "Jeremiah 36:27-32",
      "description": "After the scroll is burned, God commands Jeremiah to write another scroll with the same words and additional messages, reaffirming the certainty of judgment on Jehoiakim."
    }
  ],
  "application": [
    "Obey God’s commands faithfully, even when it is difficult or dangerous, trusting that His word is powerful and true.",
    "Respond to God’s warnings with repentance, recognizing that His discipline is intended to bring us back to Him.",
    "Stand firm in proclaiming God’s truth, knowing that opposition and rejection may come but God’s purposes will prevail.",
    "Pray for courage and protection for those who faithfully serve God’s word in hostile environments."
  ],
  "keyVerses": [
    {
      "reference": "Jeremiah 36:3",
      "text": "It may be that the house of Judah will hear all the evil which I purpose to do unto them; that they may return every man from his evil way; that I may forgive their iniquity and their sin.",
      "significance": "This verse reveals God's desire for repentance and forgiveness despite impending judgment."
    },
    {
      "reference": "Jeremiah 36:23",
      "text": "And it came to pass, that when Jehudi had read three or four leaves, he cut it with the penknife, and cast it into the fire that was on the hearth, until all the roll was consumed in the fire that was on the hearth.",
      "significance": "This dramatic act symbolizes the king’s rejection of God’s word and highlights human rebellion against divine authority."
    },
    {
      "reference": "Jeremiah 36:29",
      "text": "And thou shalt say to Jehoiakim king of Judah, Thus saith the LORD; Thou hast burned this roll, saying, Why hast thou written therein, saying, The king of Babylon shall certainly come and destroy this land, and shall cause to cease from thence man and beast?",
      "significance": "God confronts Jehoiakim’s defiance directly, affirming the certainty of Babylon’s coming judgment."
    },
    {
      "reference": "Jeremiah 36:32",
      "text": "Then took Jeremiah another roll, and gave it to Baruch the scribe, the son of Neriah; who wrote therein from the mouth of Jeremiah all the words of the book which Jehoiakim king of Judah had burned in the fire: and there were added besides unto them many like words.",
      "significance": "God’s word cannot be destroyed by human hands; it will be preserved and expanded despite opposition."
    }
  ]
}