{
  "book": "jeremiah",
  "bookName": "Jeremiah",
  "chapter": 28,
  "title": "False Prophecy and Divine Judgment",
  "shortSummary": "Jeremiah 28 recounts a confrontation between the true prophet Jeremiah and the false prophet Hananiah, who falsely prophesies the end of Babylonian captivity within two years. Jeremiah warns that Hananiah’s message is a lie from God, and Hananiah’s sudden death confirms the Lord’s judgment on false prophecy. This chapter highlights the importance of discerning true prophecy and trusting God’s sovereign plans.",
  "timeline": "c. 597 BC - Early reign of King Zedekiah of Judah during Babylonian domination",
  "keyCharacters": [
    {
      "name": "Jeremiah",
      "description": "The true prophet of God who faithfully delivers God's warnings and judgments concerning Judah and Babylon."
    },
    {
      "name": "Hananiah",
      "description": "A false prophet from Gibeon who falsely assures the people that Babylon’s yoke will be broken within two years."
    },
    {
      "name": "Zedekiah",
      "description": "King of Judah during whose reign this prophetic confrontation takes place."
    },
    {
      "name": "Jeconiah",
      "description": "Former king of Judah, mentioned as one whom God promises to restore from captivity."
    }
  ],
  "definitions": [
    {
      "term": "Yoke",
      "definition": "A wooden frame placed on the necks of oxen to control them; metaphorically represents subjugation or bondage."
    },
    {
      "term": "Prophet",
      "definition": "One chosen by God to deliver His messages, often including warnings, judgments, or promises."
    },
    {
      "term": "Captives",
      "definition": "People taken prisoner and exiled, here referring to the Judeans taken to Babylon."
    },
    {
      "term": "Yoke of iron",
      "definition": "A metaphor for a stronger, more enduring bondage or judgment imposed by God."
    }
  ],
  "outline": [
    {
      "heading": "Hananiah’s False Prophecy of Deliverance",
      "verseRange": "Jeremiah 28:1-7",
      "description": "Hananiah proclaims that God will break Babylon’s yoke within two years and restore the temple vessels and captives, including Jeconiah. Jeremiah initially responds with cautious amen but prepares to challenge Hananiah’s message."
    },
    {
      "heading": "The Criterion for True Prophecy",
      "verseRange": "Jeremiah 28:8-9",
      "description": "Jeremiah explains that true prophets are recognized by the fulfillment of their words, especially when they bring messages of peace that come to pass."
    },
    {
      "heading": "Hananiah Breaks Jeremiah’s Yoke",
      "verseRange": "Jeremiah 28:10-11",
      "description": "Hananiah symbolically breaks the wooden yoke from Jeremiah’s neck, declaring God’s promise to break Babylon’s yoke within two years, asserting his false prophecy publicly."
    },
    {
      "heading": "God’s Judgment on Hananiah’s False Prophecy",
      "verseRange": "Jeremiah 28:12-17",
      "description": "God reveals to Jeremiah that Hananiah has broken wooden yokes but will replace them with iron yokes, symbolizing harsher bondage. Jeremiah confronts Hananiah, declaring God’s judgment that he will die within the year, which comes to pass."
    }
  ],
  "application": [
    "Test all prophetic words by Scripture and the fruit of their fulfillment to avoid being misled by false teachers.",
    "Trust God’s sovereign timing and plans, even when circumstances seem bleak or contrary to hopeful messages.",
    "Speak the truth in love, as Jeremiah did, even when it is unpopular or risks personal harm.",
    "Pray for discernment to recognize God’s true messengers and to remain faithful amid opposition."
  ],
  "keyVerses": [
    {
      "reference": "Jeremiah 28:9",
      "text": "The prophet which prophesieth of peace, when the word of the prophet shall come to pass, then shall the prophet be known, that the LORD hath truly sent him.",
      "significance": "This verse provides the biblical standard for discerning true prophecy by its fulfillment."
    },
    {
      "reference": "Jeremiah 28:14",
      "text": "For thus saith the LORD of hosts, the God of Israel; I have put a yoke of iron upon the neck of all these nations, that they may serve Nebuchadnezzar king of Babylon; and they shall serve him: and I have given him the beasts of the field also.",
      "significance": "This verse reveals God’s sovereign control over nations and His use of Babylon as an instrument of judgment."
    },
    {
      "reference": "Jeremiah 28:15",
      "text": "Then said the prophet Jeremiah unto Hananiah the prophet, Hear now, Hananiah; The LORD hath not sent thee; but thou makest this people to trust in a lie.",
      "significance": "Jeremiah’s direct rebuke highlights the danger of false prophecy leading people into deception."
    },
    {
      "reference": "Jeremiah 28:17",
      "text": "So Hananiah the prophet died the same year in the seventh month.",
      "significance": "Hananiah’s death confirms the Lord’s judgment against false prophecy and serves as a solemn warning."
    }
  ]
}