{
  "book": "john",
  "bookName": "John",
  "chapter": 11,
  "title": "The Raising of Lazarus",
  "shortSummary": "John 11 recounts the miraculous resurrection of Lazarus, demonstrating Jesus' power over death and revealing Him as the resurrection and the life. This chapter highlights themes of faith, divine timing, and the glory of God through Jesus’ compassion and authority. It also sets the stage for the increasing opposition Jesus faces from religious leaders.",
  "timeline": "c. AD 30 - Ministry of Jesus in Judea before the Passion",
  "keyCharacters": [
    {
      "name": "Jesus",
      "description": "The Son of God who performs the miracle of raising Lazarus from the dead, revealing His divine authority over life and death."
    },
    {
      "name": "Lazarus",
      "description": "Brother of Mary and Martha, whose death and resurrection serve as the central miracle of the chapter."
    },
    {
      "name": "Martha",
      "description": "Sister of Lazarus and Mary, who expresses faith in Jesus’ power and engages in theological dialogue with Him."
    },
    {
      "name": "Mary",
      "description": "Sister of Lazarus and Martha, who anointed Jesus previously and shows deep grief and faith during Lazarus’ death."
    },
    {
      "name": "Caiaphas",
      "description": "The high priest who prophesies that Jesus must die for the nation, unwittingly speaking of Jesus’ sacrificial death."
    }
  ],
  "definitions": [
    {
      "term": "Bethany",
      "definition": "A village near Jerusalem, home to Lazarus, Mary, and Martha, and the setting of this miracle."
    },
    {
      "term": "Resurrection",
      "definition": "The act of rising from the dead; here it refers both to Lazarus’ physical resurrection and the future resurrection of believers."
    },
    {
      "term": "Graveclothes",
      "definition": "The burial cloths used to wrap a dead body, which Lazarus was bound with when Jesus raised him."
    },
    {
      "term": "High Priest",
      "definition": "The chief religious leader in Judaism, responsible for temple worship and significant in the plot against Jesus."
    },
    {
      "term": "Glory of God",
      "definition": "The manifestation of God's presence and power, often revealed through miraculous works and Jesus’ ministry."
    }
  ],
  "outline": [
    {
      "heading": "The Sickness and Death of Lazarus",
      "verseRange": "John 11:1-16",
      "description": "Jesus receives news of Lazarus’ illness but delays His visit, explaining that the sickness will glorify God. Jesus prepares His disciples for the coming miracle and the danger involved."
    },
    {
      "heading": "Jesus’ Arrival and the Sisters’ Faith",
      "verseRange": "John 11:17-27",
      "description": "Jesus arrives after Lazarus has died and engages Martha in a profound declaration of His identity as the resurrection and the life, calling her to faith."
    },
    {
      "heading": "Mary’s Grief and Jesus’ Compassion",
      "verseRange": "John 11:28-37",
      "description": "Mary mourns deeply, and Jesus is moved by the sorrow of Mary and the Jews, demonstrating His empathy and love."
    },
    {
      "heading": "The Resurrection of Lazarus",
      "verseRange": "John 11:38-44",
      "description": "Jesus commands the stone to be removed and calls Lazarus forth from the tomb, showcasing His authority over death and confirming His divine power."
    },
    {
      "heading": "The Aftermath and Plot Against Jesus",
      "verseRange": "John 11:45-57",
      "description": "Many believe in Jesus because of the miracle, but the religious leaders plot His death, fearing loss of power and Roman intervention."
    }
  ],
  "application": [
    "Trust in God’s timing even when circumstances seem hopeless, knowing He works all things for His glory.",
    "Believe in Jesus as the resurrection and the life, embracing the hope of eternal life through faith in Him.",
    "Respond to grief and loss by turning to Jesus, who empathizes with our sorrows and offers comfort.",
    "Be willing to stand with Jesus even in the face of danger, following His lead faithfully as Thomas exemplified."
  ],
  "keyVerses": [
    {
      "reference": "John 11:25",
      "text": "Jesus said unto her, I am the resurrection, and the life: he that believeth in me, though he were dead, yet shall he live:",
      "significance": "This verse reveals Jesus’ identity and the foundation of Christian hope in eternal life."
    },
    {
      "reference": "John 11:35",
      "text": "Jesus wept.",
      "significance": "The shortest verse in the Bible, showing Jesus’ genuine compassion and humanity in the face of death."
    },
    {
      "reference": "John 11:40",
      "text": "Jesus saith unto her, Said I not unto thee, that, if thou wouldest believe, thou shouldest see the glory of God?",
      "significance": "This verse emphasizes the power of faith to witness God’s miraculous works."
    },
    {
      "reference": "John 11:43-44",
      "text": "And when he thus had spoken, he cried with a loud voice, Lazarus, come forth. And he that was dead came forth, bound hand and foot with graveclothes: and his face was bound about with a napkin. Jesus saith unto them, Loose him, and let him go.",
      "significance": "These verses document the miraculous resurrection of Lazarus, affirming Jesus’ authority over death."
    }
  ]
}