{
  "book": "john",
  "bookName": "John",
  "chapter": 21,
  "title": "Jesus' Restoration and Commission",
  "shortSummary": "John 21 recounts Jesus' post-resurrection appearance to His disciples by the Sea of Tiberias, where He performs a miraculous catch of fish and restores Peter through a threefold affirmation of love. This chapter highlights Jesus’ care for His followers, the commissioning of Peter to shepherd His flock, and the affirmation of the beloved disciple’s testimony.",
  "timeline": "c. AD 30-33 - Post-Resurrection Appearances of Jesus",
  "keyCharacters": [
    {
      "name": "Simon Peter",
      "description": "A leading disciple of Jesus who is restored and commissioned to shepherd Jesus’ followers after his earlier denial."
    },
    {
      "name": "Jesus",
      "description": "The risen Lord who reveals Himself to His disciples, performs a miracle, and gives Peter a renewed commission."
    },
    {
      "name": "The Beloved Disciple",
      "description": "The disciple whom Jesus loved, who recognizes Jesus first at the shore and whose testimony validates the Gospel."
    },
    {
      "name": "Thomas (Didymus)",
      "description": "One of the disciples present, known for his earlier doubt but here part of the group witnessing Jesus’ appearance."
    }
  ],
  "definitions": [
    {
      "term": "Sea of Tiberias",
      "definition": "Another name for the Sea of Galilee, a freshwater lake in northern Israel where Jesus appeared to His disciples after His resurrection."
    },
    {
      "term": "Fishers’ coat",
      "definition": "A heavy outer garment worn by fishermen; Peter girding it on signifies readiness for action and humility."
    },
    {
      "term": "Feed my sheep",
      "definition": "A metaphorical charge given by Jesus to Peter, instructing him to care for and lead the believers as a shepherd cares for his sheep."
    },
    {
      "term": "Beloved Disciple",
      "definition": "A title used for the disciple who had a close relationship with Jesus and is traditionally identified as John, the author of this Gospel."
    }
  ],
  "outline": [
    {
      "heading": "Jesus Appears at the Sea of Tiberias",
      "verseRange": "John 21:1-7",
      "description": "Jesus reveals Himself to His disciples after His resurrection by the Sea of Tiberias, leading to a miraculous catch of fish that confirms His identity and power."
    },
    {
      "heading": "Jesus Invites the Disciples to Breakfast",
      "verseRange": "John 21:8-14",
      "description": "The disciples come ashore to find Jesus preparing a meal, symbolizing fellowship and provision, affirming His continued care for them."
    },
    {
      "heading": "Jesus Restores Peter",
      "verseRange": "John 21:15-19",
      "description": "Jesus asks Peter three times if he loves Him, paralleling Peter’s three denials, and commissions him to shepherd His followers, restoring Peter’s role."
    },
    {
      "heading": "Peter’s Future and the Beloved Disciple",
      "verseRange": "John 21:20-23",
      "description": "Jesus foretells Peter’s martyrdom and instructs him to follow Him, while addressing questions about the beloved disciple’s fate."
    },
    {
      "heading": "The Beloved Disciple’s Testimony and Conclusion",
      "verseRange": "John 21:24-25",
      "description": "The chapter closes affirming the truthfulness of the beloved disciple’s testimony and acknowledging the vastness of Jesus’ works beyond what is recorded."
    }
  ],
  "application": [
    "Trust in Jesus’ provision and guidance even when circumstances seem fruitless, as He can bring blessing in unexpected ways.",
    "Embrace restoration through Jesus’ forgiveness and respond to His call to serve faithfully, regardless of past failures.",
    "Commit to following Jesus personally and obediently, focusing on your own walk rather than comparing yourself to others.",
    "Value the fellowship of believers and partake regularly in spiritual nourishment through community and the Word."
  ],
  "keyVerses": [
    {
      "reference": "John 21:6",
      "text": "He said unto them, Cast the net on the right side of the ship, and ye shall find. They cast therefore, and now they were not able to draw it for the multitude of fishes.",
      "significance": "This verse demonstrates Jesus’ power to provide abundantly and His authority over nature, encouraging trust in His direction."
    },
    {
      "reference": "John 21:15",
      "text": "So when they had dined, Jesus saith to Simon Peter, Simon, son of Jonas, lovest thou me more than these? He saith unto him, Yea, Lord; thou knowest that I love thee. He saith unto him, Feed my lambs.",
      "significance": "This verse marks the restoration and commissioning of Peter, emphasizing love as the foundation for Christian service and leadership."
    },
    {
      "reference": "John 21:22",
      "text": "Jesus saith unto him, If I will that he tarry till I come, what is that to thee? follow thou me.",
      "significance": "Jesus teaches the importance of focusing on one’s own calling and obedience rather than being distracted by others’ destinies."
    },
    {
      "reference": "John 21:24",
      "text": "This is the disciple which testifieth of these things, and wrote these things: and we know that his testimony is true.",
      "significance": "This verse affirms the reliability and truthfulness of the Gospel account, grounding faith in trustworthy eyewitness testimony."
    }
  ]
}