{
  "book": "john",
  "bookName": "John",
  "chapter": 13,
  "title": "Jesus Washes Feet",
  "shortSummary": "John 13 reveals Jesus’ humble act of washing His disciples’ feet, teaching servanthood and love as central to His followers. It also includes His prediction of Judas’ betrayal and a new commandment to love one another as He has loved us.",
  "timeline": "c. AD 30 - The Last Supper before Jesus’ crucifixion",
  "keyCharacters": [
    {
      "name": "Jesus",
      "description": "The Son of God who humbly serves His disciples by washing their feet and teaches them about love and servanthood."
    },
    {
      "name": "Simon Peter",
      "description": "One of Jesus’ closest disciples who initially resists Jesus washing his feet but ultimately desires full cleansing."
    },
    {
      "name": "Judas Iscariot",
      "description": "The disciple who is influenced by Satan to betray Jesus, identified by Jesus during the meal."
    },
    {
      "name": "The Beloved Disciple",
      "description": "The disciple who reclines next to Jesus and inquires about the betrayer, traditionally understood as John."
    }
  ],
  "definitions": [
    {
      "term": "Passover",
      "definition": "A Jewish feast commemorating God’s deliverance of Israel from Egypt, marking the time of Jesus’ final meal with His disciples."
    },
    {
      "term": "Bason",
      "definition": "A basin or bowl used for washing feet, symbolizing humility and service in this context."
    },
    {
      "term": "Sop",
      "definition": "A piece of bread dipped in a sauce or broth, used here as a token identifying the betrayer."
    },
    {
      "term": "Glorified",
      "definition": "To be honored or exalted; Jesus speaks of His glorification through His death and resurrection, revealing God’s glory."
    }
  ],
  "outline": [
    {
      "heading": "Jesus Washes the Disciples’ Feet",
      "verseRange": "John 13:1-11",
      "description": "Jesus humbles Himself by washing His disciples’ feet, demonstrating servant leadership and preparing them for His imminent departure."
    },
    {
      "heading": "Jesus Commands Mutual Service and Love",
      "verseRange": "John 13:12-17",
      "description": "After washing their feet, Jesus instructs His disciples to serve one another in love, setting an example to follow."
    },
    {
      "heading": "Prediction of Judas’ Betrayal",
      "verseRange": "John 13:18-30",
      "description": "Jesus reveals that one disciple will betray Him, identifies Judas as the betrayer, and signals the beginning of His passion."
    },
    {
      "heading": "A New Commandment of Love",
      "verseRange": "John 13:31-35",
      "description": "Jesus gives a new commandment to love one another as He has loved them, marking true discipleship by love."
    },
    {
      "heading": "Peter’s Declaration and Jesus’ Prediction",
      "verseRange": "John 13:36-38",
      "description": "Peter expresses his loyalty, but Jesus predicts Peter’s denial, highlighting human weakness and the need for grace."
    }
  ],
  "application": [
    "Embrace humility by serving others selflessly, following Jesus’ example of washing feet.",
    "Practice loving one another deeply and sacrificially as a testimony of true discipleship.",
    "Be alert to spiritual deception and remain faithful even when facing trials or betrayal.",
    "Trust God’s plan even when facing difficult circumstances, knowing that Jesus’ glorification brings hope."
  ],
  "keyVerses": [
    {
      "reference": "John 13:14",
      "text": "If I then, your Lord and Master, have washed your feet; ye also ought to wash one another's feet.",
      "significance": "This verse commands believers to serve one another humbly, modeling Jesus’ example."
    },
    {
      "reference": "John 13:34",
      "text": "A new commandment I give unto you, That ye love one another; as I have loved you, that ye also love one another.",
      "significance": "Jesus establishes love as the defining mark of His followers."
    },
    {
      "reference": "John 13:38",
      "text": "Jesus answered him, Wilt thou lay down thy life for my sake? Verily, verily, I say unto thee, The cock shall not crow, till thou hast denied me thrice.",
      "significance": "This verse reveals Peter’s forthcoming failure and highlights the need for reliance on God’s grace."
    },
    {
      "reference": "John 13:1",
      "text": "Now before the feast of the passover, when Jesus knew that his hour was come that he should depart out of this world unto the Father, having loved his own which were in the world, he loved them unto the end.",
      "significance": "This opening verse sets the tone of sacrificial love and Jesus’ awareness of His impending death."
    }
  ]
}