{
  "book": "john",
  "bookName": "John",
  "chapter": 2,
  "title": "Jesus' First Miracle and Temple Cleansing",
  "shortSummary": "John chapter 2 records Jesus' first public miracle at the wedding in Cana, where He turned water into wine, revealing His divine glory and prompting belief in Him. The chapter also recounts Jesus cleansing the temple in Jerusalem, demonstrating His zeal for God's holiness and foreshadowing His resurrection.",
  "timeline": "c. AD 27-30 - Early ministry of Jesus, including His first miracle and temple cleansing during the Passover",
  "keyCharacters": [
    {
      "name": "Jesus",
      "description": "The Son of God who performs His first miracle and cleanses the temple, revealing His divine authority and mission."
    },
    {
      "name": "Mary",
      "description": "Mother of Jesus, who brings the wine shortage to Jesus' attention and encourages obedience to Him."
    },
    {
      "name": "Disciples of Jesus",
      "description": "Followers of Jesus who witness His first miracle and later recall His words about the temple."
    },
    {
      "name": "Ruler of the Feast",
      "description": "The official overseeing the wedding feast who marvels at the quality of the wine Jesus provides."
    }
  ],
  "definitions": [
    {
      "term": "Firkins",
      "definition": "A firkin is a unit of liquid measurement used in biblical times, approximately equal to 9 gallons or 34 liters."
    },
    {
      "term": "Waterpots of stone",
      "definition": "Large stone jars used for Jewish ceremonial washing, symbolizing purification and ritual cleanliness."
    },
    {
      "term": "Zeal of thine house",
      "definition": "A phrase expressing passionate devotion and righteous anger for the honor of God's temple."
    },
    {
      "term": "Temple of his body",
      "definition": "Jesus’ metaphor referring to His own body as the true temple, which would be destroyed and raised again in resurrection."
    }
  ],
  "outline": [
    {
      "heading": "The Wedding at Cana and Jesus’ First Miracle",
      "verseRange": "John 2:1-11",
      "description": "Jesus performs His first recorded miracle by turning water into wine at a wedding, demonstrating His divine power and glory, which leads His disciples to believe in Him."
    },
    {
      "heading": "Jesus Departs for Capernaum",
      "verseRange": "John 2:12",
      "description": "After the wedding, Jesus travels to Capernaum with His family and disciples, marking a transition in His ministry."
    },
    {
      "heading": "Jesus Cleanses the Temple",
      "verseRange": "John 2:13-17",
      "description": "Jesus drives out the merchants and money changers from the temple, asserting the holiness of God's house and condemning its misuse for profit."
    },
    {
      "heading": "Jesus’ Authority Questioned and His Prophetic Sign",
      "verseRange": "John 2:18-22",
      "description": "When challenged by the Jews for His actions, Jesus speaks of destroying and raising the temple of His body, foreshadowing His death and resurrection."
    },
    {
      "heading": "Many Believe, but Jesus Does Not Fully Trust Them",
      "verseRange": "John 2:23-25",
      "description": "Despite many believing in Jesus because of His miracles, He does not commit Himself to them fully, knowing their hearts and the true nature of faith."
    }
  ],
  "application": [
    "Trust in Jesus’ power and timing, as He reveals His glory in ways that build faith in His divine mission.",
    "Obey Jesus’ commands wholeheartedly, as Mary instructs the servants to do whatever He says, demonstrating faith in His authority.",
    "Maintain reverence for God’s house and personal holiness, rejecting any form of commercialism or irreverence in worship.",
    "Reflect on Jesus’ resurrection as the foundation of Christian hope and belief, remembering His words and promises."
  ],
  "keyVerses": [
    {
      "reference": "John 2:11",
      "text": "This beginning of miracles did Jesus in Cana of Galilee, and manifested forth his glory; and his disciples believed on him.",
      "significance": "This verse highlights the significance of Jesus’ first miracle as a revelation of His divine glory that leads to faith."
    },
    {
      "reference": "John 2:16",
      "text": "And said unto them that sold doves, Take these things hence; make not my Father's house an house of merchandise.",
      "significance": "Jesus’ zeal for the purity of worship is shown here, emphasizing the holiness of God’s temple and the need to honor it properly."
    },
    {
      "reference": "John 2:19",
      "text": "Jesus answered and said unto them, Destroy this temple, and in three days I will raise it up.",
      "significance": "This prophetic statement points to Jesus’ death and resurrection, revealing the true temple as His body."
    },
    {
      "reference": "John 2:25",
      "text": "And needed not that any should testify of man: for he knew what was in man.",
      "significance": "This verse underscores Jesus’ divine knowledge of human hearts, reminding believers of His omniscience and the importance of genuine faith."
    }
  ]
}