{
  "book": "john",
  "bookName": "John",
  "chapter": 12,
  "title": "The Glorification of Christ",
  "shortSummary": "John 12 records Jesus' final days before the Passover, highlighting His public anointing, triumphal entry into Jerusalem, and teachings about His impending death and glorification. The chapter reveals the growing division among the people, the fulfillment of prophecy, and Jesus’ call to faith and discipleship.",
  "timeline": "c. AD 30 - Six days before the Passover during Jesus' final week before crucifixion",
  "keyCharacters": [
    {
      "name": "Jesus",
      "description": "The Son of God who is about to be glorified through His death and resurrection; central figure teaching about sacrifice and salvation."
    },
    {
      "name": "Mary",
      "description": "Sister of Lazarus and Martha, who anoints Jesus’ feet with costly ointment as an act of devotion and preparation for His burial."
    },
    {
      "name": "Judas Iscariot",
      "description": "One of Jesus’ disciples who objects to Mary’s anointing, revealing his greed and foreshadowing his betrayal."
    },
    {
      "name": "Lazarus",
      "description": "The man Jesus raised from the dead, whose presence and miracle cause many to believe but also provoke the chief priests’ hostility."
    },
    {
      "name": "Philip",
      "description": "One of Jesus’ disciples who is approached by Greeks seeking to see Jesus, initiating a teaching about Jesus’ glorification."
    }
  ],
  "definitions": [
    {
      "term": "Spikenard",
      "definition": "A costly aromatic ointment derived from a plant, used in biblical times for anointing and perfume."
    },
    {
      "term": "Hosanna",
      "definition": "A Hebrew expression meaning 'Save now' or 'Please save,' used as a shout of praise and recognition of the Messiah."
    },
    {
      "term": "Son of man",
      "definition": "A Messianic title Jesus frequently uses for Himself, emphasizing both His humanity and divine mission."
    },
    {
      "term": "Glorified",
      "definition": "The state of being honored and exalted, especially referring to Jesus’ death, resurrection, and exaltation to the Father."
    }
  ],
  "outline": [
    {
      "heading": "Jesus Anointed at Bethany",
      "verseRange": "John 12:1-8",
      "description": "Jesus visits Bethany where Mary anoints His feet with costly ointment, an act symbolizing His impending burial. Judas objects, revealing his true motives, while Jesus affirms the significance of this preparation."
    },
    {
      "heading": "Plot to Kill Lazarus and Growing Popularity",
      "verseRange": "John 12:9-19",
      "description": "Many Jews come to see Jesus and Lazarus, whose resurrection has caused belief but also fear among the chief priests, who plot to kill Lazarus to stop the spread of faith."
    },
    {
      "heading": "The Triumphal Entry",
      "verseRange": "John 12:12-19",
      "description": "Jesus enters Jerusalem riding on a young donkey, fulfilling prophecy and being hailed as King by the crowds, marking the beginning of His final week."
    },
    {
      "heading": "Jesus Teaches About His Glorification",
      "verseRange": "John 12:20-36",
      "description": "Greeks seek Jesus, prompting Him to speak about His death as a necessary seed falling to the ground to bear much fruit, calling believers to follow Him and live sacrificially."
    },
    {
      "heading": "Jesus Predicts Judgment and Calls to Believe",
      "verseRange": "John 12:37-50",
      "description": "Despite Jesus’ miracles, many do not believe, fulfilling Isaiah’s prophecy about hardened hearts. Jesus emphasizes belief in Him as belief in the Father and declares His mission to save, not judge."
    }
  ],
  "application": [
    "Offer your best to Jesus as Mary did, recognizing His worth and preparing your heart for His work in your life.",
    "Follow Jesus sacrificially, understanding that true life comes through dying to self and living for Him.",
    "Respond to Jesus’ call to believe in the light while it is available, avoiding the darkness of unbelief.",
    "Trust in Jesus’ words and mission, knowing He speaks by the Father’s authority and offers eternal life."
  ],
  "keyVerses": [
    {
      "reference": "John 12:24",
      "text": "Verily, verily, I say unto you, Except a corn of wheat fall into the ground and die, it abideth alone: but if it die, it bringeth forth much fruit.",
      "significance": "This verse teaches the necessity of Jesus’ death for salvation and the principle of sacrificial fruitfulness in the Christian life."
    },
    {
      "reference": "John 12:32",
      "text": "And I, if I be lifted up from the earth, will draw all men unto me.",
      "significance": "Jesus reveals that His crucifixion will draw people to Himself, highlighting the power of the cross to save all who believe."
    },
    {
      "reference": "John 12:46",
      "text": "I am come a light into the world, that whosoever believeth on me should not abide in darkness.",
      "significance": "This verse emphasizes Jesus as the light of the world, offering deliverance from spiritual darkness through faith."
    },
    {
      "reference": "John 12:50",
      "text": "And I know that his commandment is life everlasting: whatsoever I speak therefore, even as the Father said unto me, so I speak.",
      "significance": "Jesus affirms His obedience to the Father’s will and the life-giving nature of His words."
    }
  ]
}