{
  "book": "joshua",
  "bookName": "Joshua",
  "chapter": 2,
  "title": "Rahab and the Spies",
  "shortSummary": "Joshua 2 recounts the sending of two Israelite spies into Jericho, where they find refuge with Rahab, a local woman who recognizes the power of the God of Israel. Her faith and courage lead her to protect the spies, resulting in a covenant that ensures the safety of her family when Israel conquers the land.",
  "timeline": "c. 1406 BC - Israelite spies sent into Jericho during the conquest of Canaan",
  "keyCharacters": [
    {
      "name": "Joshua",
      "description": "Leader of Israel who sends two men to secretly spy out Jericho in preparation for the conquest."
    },
    {
      "name": "Rahab",
      "description": "A harlot in Jericho who hides the Israelite spies and expresses faith in the LORD, securing protection for her family."
    },
    {
      "name": "King of Jericho",
      "description": "The ruler who seeks to capture the Israelite spies and commands Rahab to surrender them."
    },
    {
      "name": "Two Israelite Spies",
      "description": "Men sent by Joshua to scout Jericho; they rely on Rahab’s help to escape capture."
    }
  ],
  "definitions": [
    {
      "term": "Harlot",
      "definition": "A woman engaged in prostitution; in this chapter, Rahab’s profession highlights God’s grace in using unlikely people."
    },
    {
      "term": "Scarlet Thread",
      "definition": "A red cord Rahab uses as a sign in her window to mark her house for protection during Jericho’s destruction."
    },
    {
      "term": "Fords",
      "definition": "Shallow places in a river or stream where it can be crossed on foot or by animals; the spies fled toward the Jordan River’s fords."
    },
    {
      "term": "Swear an Oath",
      "definition": "To make a solemn promise before God, binding oneself to a commitment, as the spies do with Rahab."
    }
  ],
  "outline": [
    {
      "heading": "Joshua Sends Spies to Jericho",
      "verseRange": "Joshua 2:1-5",
      "description": "Joshua commissions two men to secretly scout Jericho. They lodge in Rahab’s house, but the king of Jericho learns of their presence and demands their capture."
    },
    {
      "heading": "Rahab Hides the Spies",
      "verseRange": "Joshua 2:6-7",
      "description": "Rahab hides the spies on her roof under stalks of flax, deceiving the king’s men and allowing the spies to escape safely."
    },
    {
      "heading": "Rahab’s Confession of Faith",
      "verseRange": "Joshua 2:8-11",
      "description": "Rahab acknowledges the LORD’s power and Israel’s victories, expressing her belief that their God is sovereign over heaven and earth."
    },
    {
      "heading": "The Covenant Between Rahab and the Spies",
      "verseRange": "Joshua 2:12-21",
      "description": "Rahab requests protection for her family in exchange for her kindness. The spies swear an oath to spare her household and instruct her to mark her window with a scarlet cord."
    },
    {
      "heading": "Spies Escape and Report to Joshua",
      "verseRange": "Joshua 2:22-24",
      "description": "The spies hide in the mountains until the pursuers give up, then return to Joshua with a confident report that the LORD has delivered the land into Israel’s hands."
    }
  ],
  "application": [
    "Trust in God’s sovereignty even when circumstances seem dangerous or uncertain, as Rahab did by recognizing the LORD’s power.",
    "Show courage and faith by acting in obedience to God’s purposes, even if it means risking personal safety.",
    "Honor commitments and covenants made before God, as the spies and Rahab did with their oath.",
    "Recognize that God can use anyone, regardless of their past, to accomplish His plans and extend His grace."
  ],
  "keyVerses": [
    {
      "reference": "Joshua 2:9",
      "text": "And she said unto the men, I know that the LORD hath given you the land, and that your terror is fallen upon us, and that all the inhabitants of the land faint because of you.",
      "significance": "Rahab’s declaration reveals her faith in God’s promise and the fear His people inspire in the land."
    },
    {
      "reference": "Joshua 2:14",
      "text": "And the men answered her, Our life for yours, if ye utter not this our business. And it shall be, when the LORD hath given us the land, that we will deal kindly and truly with thee.",
      "significance": "The spies’ oath demonstrates God’s faithfulness and the importance of trust and covenant in God’s plan."
    },
    {
      "reference": "Joshua 2:21",
      "text": "And she said, According unto your words, so be it. And she sent them away, and they departed: and she bound the scarlet line in the window.",
      "significance": "The scarlet cord symbolizes Rahab’s faith and the protective covenant between her and Israel."
    },
    {
      "reference": "Joshua 2:24",
      "text": "And they said unto Joshua, Truly the LORD hath delivered into our hands all the land; for even all the inhabitants of the country do faint because of us.",
      "significance": "The spies’ report confirms God’s promise of victory and encourages Israel to trust His power."
    }
  ]
}