{
  "book": "judges",
  "bookName": "Judges",
  "chapter": 6,
  "title": "Gideon's Calling",
  "shortSummary": "Judges chapter 6 recounts Israel's oppression by the Midianites due to their sin, and God's call of Gideon to deliver His people. Despite Gideon's initial doubts, God reassures him with signs and promises, commissioning him as a mighty deliverer. This chapter highlights God's faithfulness and power to save through weak vessels.",
  "timeline": "c. 1375 BC - Period of the Judges in Israel",
  "keyCharacters": [
    {
      "name": "Gideon",
      "description": "A humble man from the tribe of Manasseh called by God to deliver Israel from Midianite oppression."
    },
    {
      "name": "Joash",
      "description": "Gideon's father, owner of the altar of Baal that Gideon destroys as an act of obedience to God."
    },
    {
      "name": "Angel of the LORD",
      "description": "The divine messenger who appears to Gideon, commissioning him and confirming God's presence."
    },
    {
      "name": "Prophet of the LORD",
      "description": "Sent by God to remind Israel of His past deliverance and call them to repentance."
    }
  ],
  "definitions": [
    {
      "term": "Midianites",
      "definition": "A nomadic people who oppressed Israel for seven years as a consequence of Israel's disobedience."
    },
    {
      "term": "Fleece",
      "definition": "A piece of wool used by Gideon as a sign to confirm God's promise through dew appearing only on it."
    },
    {
      "term": "Altar of Baal",
      "definition": "A pagan worship site dedicated to Baal, a Canaanite false god, which Gideon destroys to demonstrate loyalty to Yahweh."
    },
    {
      "term": "Jehovahshalom",
      "definition": "Meaning 'The LORD is Peace,' the name Gideon gave to the altar he built after encountering the angel of the LORD."
    }
  ],
  "outline": [
    {
      "heading": "Israel's Oppression by Midian",
      "verseRange": "Judges 6:1-6",
      "description": "Israel falls into sin and is oppressed by the Midianites for seven years, leading them to hide in caves and cry out to the LORD for deliverance."
    },
    {
      "heading": "God Sends a Prophet to Rebuke Israel",
      "verseRange": "Judges 6:7-10",
      "description": "A prophet reminds Israel of God's past deliverance and calls them to obedience, highlighting their failure to follow God's voice."
    },
    {
      "heading": "The Angel of the LORD Appears to Gideon",
      "verseRange": "Judges 6:11-24",
      "description": "Gideon is called and encouraged by the angel, who assures him of God's presence and power; Gideon offers a sacrifice that is supernaturally consumed, confirming the call."
    },
    {
      "heading": "Gideon Destroys Baal's Altar",
      "verseRange": "Judges 6:25-32",
      "description": "Obeying God's command, Gideon destroys his father's altar to Baal and the accompanying grove, provoking opposition but demonstrating faithfulness to God."
    },
    {
      "heading": "Gideon Prepares for Battle",
      "verseRange": "Judges 6:33-40",
      "description": "The Spirit of the LORD empowers Gideon as he gathers troops, and he seeks confirmation from God through the sign of the fleece, demonstrating his desire for assurance."
    }
  ],
  "application": [
    "Trust God’s power even when you feel weak or unqualified, as He equips those He calls.",
    "Respond to God’s call with obedience, even when it requires courage to stand against popular opinion or family.",
    "Seek God’s guidance and confirmation through prayer when facing important decisions.",
    "Remember God’s faithfulness in past deliverances to strengthen your faith in present trials."
  ],
  "keyVerses": [
    {
      "reference": "Judges 6:12",
      "text": "And the angel of the LORD appeared unto him, and said unto him, The LORD is with thee, thou mighty man of valour.",
      "significance": "This verse affirms God's presence with Gideon, encouraging him despite his low self-esteem."
    },
    {
      "reference": "Judges 6:16",
      "text": "And the LORD said unto him, Surely I will be with thee, and thou shalt smite the Midianites as one man.",
      "significance": "God’s promise of His presence assures Gideon of victory, emphasizing reliance on God rather than human strength."
    },
    {
      "reference": "Judges 6:24",
      "text": "Then Gideon built an altar there unto the LORD, and called it Jehovahshalom: unto this day it is yet in Ophrah of the Abiezrites.",
      "significance": "Gideon’s altar named 'The LORD is Peace' marks a pivotal moment of worship and trust in God’s peace amid conflict."
    },
    {
      "reference": "Judges 6:40",
      "text": "And God did so that night: for it was dry upon the fleece only, and there was dew on all the ground.",
      "significance": "God’s miraculous sign confirms His promise, encouraging believers to seek God’s reassurance through faith and prayer."
    }
  ]
}