{
  "book": "luke",
  "bookName": "Luke",
  "chapter": 22,
  "title": "The Last Supper and Betrayal",
  "shortSummary": "Luke 22 details the events leading up to Jesus' crucifixion, including the institution of the Lord's Supper, Jesus' teachings on humility and service, Peter's denial prediction, and Jesus' arrest. This chapter highlights Jesus' obedience to the Father's will and the fulfillment of prophecy, emphasizing the cost of discipleship and the power of prayer.",
  "timeline": "c. AD 30 - The Passion Week, days before Jesus' crucifixion",
  "keyCharacters": [
    {
      "name": "Jesus",
      "description": "The Son of God who institutes the Lord's Supper, teaches His disciples about humility, prays earnestly in Gethsemane, and submits to arrest."
    },
    {
      "name": "Judas Iscariot",
      "description": "One of the twelve disciples who is possessed by Satan and conspires with the chief priests to betray Jesus for money."
    },
    {
      "name": "Peter",
      "description": "A leading disciple who boldly claims loyalty but is predicted by Jesus to deny Him three times before the rooster crows."
    },
    {
      "name": "Chief Priests and Scribes",
      "description": "Religious leaders who plot to kill Jesus out of fear of the people and orchestrate His arrest."
    }
  ],
  "definitions": [
    {
      "term": "Passover",
      "definition": "A Jewish feast commemorating Israel's deliverance from Egypt, involving the sacrifice of a lamb and the eating of unleavened bread."
    },
    {
      "term": "New Testament",
      "definition": "In this context, a covenant or agreement; Jesus refers to the new covenant established by His blood for the forgiveness of sins."
    },
    {
      "term": "Sift as wheat",
      "definition": "A metaphor meaning to test or try someone severely, like separating wheat from chaff by shaking."
    },
    {
      "term": "Upper Room",
      "definition": "A large furnished room in a house where Jesus and His disciples ate the Passover meal, later the site of Pentecost."
    }
  ],
  "outline": [
    {
      "heading": "Plot to Betray Jesus and Preparation for Passover",
      "verseRange": "Luke 22:1-13",
      "description": "The chief priests and scribes plot Jesus' death; Judas agrees to betray Him. Jesus sends Peter and John to prepare the Passover meal, fulfilling Jewish customs and setting the stage for the Last Supper."
    },
    {
      "heading": "Institution of the Lord's Supper and Teachings on Service",
      "verseRange": "Luke 22:14-30",
      "description": "Jesus shares the Passover meal with His disciples, institutes the Lord's Supper as a remembrance of His sacrifice, and teaches about humility and servant leadership, promising them a future kingdom."
    },
    {
      "heading": "Peter's Denial Foretold and Instructions for Disciples",
      "verseRange": "Luke 22:31-38",
      "description": "Jesus warns Peter of Satan’s desire to test him, predicts his denial, and instructs the disciples to prepare for coming trials, symbolized by the need for swords."
    },
    {
      "heading": "Jesus Prays in Gethsemane",
      "verseRange": "Luke 22:39-46",
      "description": "Jesus withdraws to pray earnestly, submitting to the Father’s will despite the agony, while His disciples struggle to stay alert and pray."
    },
    {
      "heading": "Arrest of Jesus and Peter’s Denial",
      "verseRange": "Luke 22:47-62",
      "description": "Judas betrays Jesus with a kiss; Jesus is arrested. Peter denies knowing Jesus three times, fulfilling Jesus’ prophecy, and is overcome with remorse."
    },
    {
      "heading": "Jesus Mocked and Questioned by Religious Leaders",
      "verseRange": "Luke 22:63-71",
      "description": "Jesus is mocked and beaten by His captors, then questioned by the elders and chief priests about His identity, affirming His Messiahship and divine authority."
    }
  ],
  "application": [
    "Trust in God’s sovereign plan even when facing trials, following Jesus’ example of submission to the Father’s will in prayer.",
    "Embrace humility and servant leadership in daily life, putting others before self as Jesus taught His disciples.",
    "Be vigilant in prayer to resist temptation and strengthen faith, especially during times of spiritual testing.",
    "Recognize the seriousness of betrayal and denial, and seek God’s grace to remain faithful under pressure."
  ],
  "keyVerses": [
    {
      "reference": "Luke 22:19",
      "text": "And he took bread, and gave thanks, and brake it, and gave unto them, saying, This is my body which is given for you: this do in remembrance of me.",
      "significance": "This verse institutes the Lord’s Supper, a central Christian ordinance commemorating Jesus’ sacrificial death."
    },
    {
      "reference": "Luke 22:31-32",
      "text": "And the Lord said, Simon, Simon, behold, Satan hath desired to have you, that he may sift you as wheat: But I have prayed for thee, that thy faith fail not: and when thou art converted, strengthen thy brethren.",
      "significance": "Jesus predicts Peter’s testing and assures him of prayer and restoration, highlighting the power of intercession."
    },
    {
      "reference": "Luke 22:42",
      "text": "Saying, Father, if thou be willing, remove this cup from me: nevertheless not my will, but thine, be done.",
      "significance": "Jesus models perfect submission to God’s will, even in the face of suffering."
    },
    {
      "reference": "Luke 22:62",
      "text": "And Peter went out, and wept bitterly.",
      "significance": "Peter’s remorse after denial shows the human weakness of even the strongest believers and the need for repentance."
    }
  ]
}