{
  "book": "luke",
  "bookName": "Luke",
  "chapter": 14,
  "title": "Discipleship and Humility",
  "shortSummary": "Luke 14 presents Jesus teaching on humility, hospitality, and the cost of discipleship through parables and direct instruction. It challenges believers to prioritize the kingdom of God above social status and earthly possessions, emphasizing self-denial and wholehearted commitment to Christ.",
  "timeline": "c. AD 27-30 - Ministry of Jesus in Galilee",
  "keyCharacters": [
    {
      "name": "Jesus",
      "description": "The central figure teaching about the Sabbath, humility, hospitality, and the demands of discipleship."
    },
    {
      "name": "Pharisees",
      "description": "Religious leaders who observe Jesus closely, particularly regarding Sabbath observance and legalistic practices."
    },
    {
      "name": "A certain man with dropsy",
      "description": "A man suffering from edema whom Jesus heals on the Sabbath, demonstrating mercy over legalism."
    },
    {
      "name": "The master of the house",
      "description": "The host in Jesus’ parable who invites guests to a great supper, symbolizing God’s invitation to salvation."
    }
  ],
  "definitions": [
    {
      "term": "Dropsy",
      "definition": "An old term for edema, a condition characterized by swelling caused by fluid accumulation."
    },
    {
      "term": "Sabbath",
      "definition": "The seventh day of the week, observed by Jews as a day of rest and worship, with strict prohibitions against work."
    },
    {
      "term": "Parable",
      "definition": "A simple story used by Jesus to illustrate a moral or spiritual lesson."
    },
    {
      "term": "Discipleship",
      "definition": "The process of following Jesus, involving self-denial, obedience, and commitment to His teachings."
    }
  ],
  "outline": [
    {
      "heading": "Healing on the Sabbath and Question of Lawfulness",
      "verseRange": "Luke 14:1-6",
      "description": "Jesus heals a man with dropsy on the Sabbath, confronting the Pharisees’ legalism and emphasizing mercy over ritualistic law."
    },
    {
      "heading": "Teaching on Humility at a Feast",
      "verseRange": "Luke 14:7-11",
      "description": "Jesus instructs guests to choose the lowest seat to avoid shame and teaches that God exalts the humble and humbles the proud."
    },
    {
      "heading": "Instructions on Hospitality",
      "verseRange": "Luke 14:12-14",
      "description": "Jesus advises inviting the poor and marginalized to feasts, promising a blessing and reward at the resurrection for such selfless hospitality."
    },
    {
      "heading": "Parable of the Great Supper",
      "verseRange": "Luke 14:15-24",
      "description": "Jesus tells a parable about those who reject God’s invitation and the subsequent inclusion of the poor and outcasts, illustrating the kingdom’s open invitation."
    },
    {
      "heading": "The Cost of Discipleship",
      "verseRange": "Luke 14:25-33",
      "description": "Jesus teaches that following Him requires loving Him above all else, bearing one’s cross, and counting the cost before committing."
    },
    {
      "heading": "Salt Without Saltiness",
      "verseRange": "Luke 14:34-35",
      "description": "Jesus warns that disciples must retain their distinctiveness and effectiveness, or they become worthless and rejected."
    }
  ],
  "application": [
    "Practice humility by seeking to serve others rather than seeking honor or status in social or church settings.",
    "Show Christlike hospitality by reaching out to those who cannot repay you, trusting in God’s eternal reward.",
    "Evaluate your commitment to Jesus honestly, counting the cost and being willing to forsake all for His sake.",
    "Maintain your spiritual distinctiveness and influence by living faithfully and obediently to God’s Word."
  ],
  "keyVerses": [
    {
      "reference": "Luke 14:11",
      "text": "For whosoever exalteth himself shall be abased; and he that humbleth himself shall be exalted.",
      "significance": "This verse encapsulates the biblical principle of humility as essential for exaltation by God."
    },
    {
      "reference": "Luke 14:26",
      "text": "If any man come to me, and hate not his father, and mother, and wife, and children, and brethren, and sisters, yea, and his own life also, he cannot be my disciple.",
      "significance": "It highlights the radical cost of discipleship, calling for ultimate loyalty to Christ above all relationships."
    },
    {
      "reference": "Luke 14:33",
      "text": "So likewise, whosoever he be of you that forsaketh not all that he hath, he cannot be my disciple.",
      "significance": "This verse stresses the necessity of total surrender of possessions and priorities to follow Jesus."
    },
    {
      "reference": "Luke 14:14",
      "text": "And thou shalt be blessed; for they cannot recompense thee: for thou shalt be recompensed at the resurrection of the just.",
      "significance": "It promises eternal reward for selfless acts of kindness done without expectation of earthly repayment."
    }
  ]
}