{
  "book": "mark",
  "bookName": "Mark",
  "chapter": 14,
  "title": "The Passion Begins",
  "shortSummary": "Mark chapter 14 details the events leading up to Jesus' crucifixion, including His anointing, the Last Supper, His prayer in Gethsemane, His betrayal by Judas, and Peter's denial. This chapter highlights Jesus' obedience to the Father's will and the fulfillment of Old Testament prophecy, setting the stage for the atoning sacrifice of Christ.",
  "timeline": "c. AD 30 - The Passion Week, days before Jesus' crucifixion",
  "keyCharacters": [
    {
      "name": "Jesus Christ",
      "description": "The Son of God who prepares for His impending death, institutes the Lord’s Supper, prays in Gethsemane, and faces betrayal and arrest."
    },
    {
      "name": "Judas Iscariot",
      "description": "One of the twelve disciples who betrays Jesus to the chief priests for money."
    },
    {
      "name": "Peter",
      "description": "A leading disciple who boldly claims he will not deny Jesus but ultimately denies Him three times as Jesus predicted."
    },
    {
      "name": "The Woman with the Alabaster Box",
      "description": "An unnamed woman who anoints Jesus with expensive ointment, symbolizing His forthcoming burial."
    },
    {
      "name": "The Chief Priests and Scribes",
      "description": "Religious leaders who plot to arrest and kill Jesus, seeking to eliminate Him as a threat."
    }
  ],
  "definitions": [
    {
      "term": "Passover",
      "definition": "A Jewish feast commemorating Israel’s deliverance from Egypt, involving the sacrifice of a lamb and the eating of unleavened bread."
    },
    {
      "term": "Alabaster Box",
      "definition": "A small, precious container made of alabaster stone, used to hold costly perfumes or ointments."
    },
    {
      "term": "New Testament",
      "definition": "The new covenant established by Jesus through His blood, fulfilling and replacing the old Mosaic covenant."
    },
    {
      "term": "Gethsemane",
      "definition": "A garden at the foot of the Mount of Olives where Jesus prayed in anguish before His arrest."
    },
    {
      "term": "Blasphemy",
      "definition": "The act of speaking irreverently about God or sacred things, considered a grave offense in Jewish law."
    }
  ],
  "outline": [
    {
      "heading": "Plot to Kill Jesus and Anointing at Bethany",
      "verseRange": "Mark 14:1-9",
      "description": "The chief priests plan to kill Jesus but avoid doing so during the Passover feast. Meanwhile, a woman anoints Jesus with expensive ointment, an act Jesus commends as preparation for His burial."
    },
    {
      "heading": "Judas’ Betrayal and Preparation for the Passover",
      "verseRange": "Mark 14:10-16",
      "description": "Judas agrees to betray Jesus for money. Jesus instructs His disciples to prepare the Passover meal, demonstrating His control over the unfolding events."
    },
    {
      "heading": "The Last Supper and Jesus Predicts His Betrayal",
      "verseRange": "Mark 14:17-31",
      "description": "During the Passover meal, Jesus institutes the Lord’s Supper, revealing the significance of His body and blood. He foretells His betrayal and Peter’s denial, highlighting human weakness despite good intentions."
    },
    {
      "heading": "Jesus Prays in Gethsemane",
      "verseRange": "Mark 14:32-42",
      "description": "Jesus experiences deep sorrow and prays earnestly for the Father’s will to be done. His disciples fail to watch and pray, illustrating the struggle between spirit and flesh."
    },
    {
      "heading": "Arrest of Jesus and Peter’s Denial",
      "verseRange": "Mark 14:43-72",
      "description": "Judas betrays Jesus with a kiss, leading to His arrest. Jesus is taken to the high priest’s house, where false witnesses accuse Him. Peter denies Jesus three times, fulfilling Jesus’ prophecy and showing human frailty."
    }
  ],
  "application": [
    "Trust God’s sovereign plan even in times of suffering and uncertainty, following Jesus’ example of submission to the Father’s will.",
    "Value and participate in the Lord’s Supper as a remembrance of Christ’s sacrifice and a proclamation of the gospel.",
    "Be vigilant in prayer to resist temptation, recognizing the weakness of the flesh and the need for the Spirit’s strength.",
    "Examine your heart for moments of denial or compromise and seek God’s grace to remain faithful under trial."
  ],
  "keyVerses": [
    {
      "reference": "Mark 14:24",
      "text": "And he said unto them, This is my blood of the new testament, which is shed for many.",
      "significance": "This verse reveals the foundation of the new covenant through Jesus’ sacrificial death, central to Christian faith."
    },
    {
      "reference": "Mark 14:38",
      "text": "Watch ye and pray, lest ye enter into temptation. The spirit truly is ready, but the flesh is weak.",
      "significance": "A timeless exhortation to remain spiritually alert and dependent on prayer to overcome temptation."
    },
    {
      "reference": "Mark 14:62",
      "text": "And Jesus said, I am: and ye shall see the Son of man sitting on the right hand of power, and coming in the clouds of heaven.",
      "significance": "Jesus’ affirmation of His divine identity and messianic authority, which leads to His condemnation for blasphemy."
    },
    {
      "reference": "Mark 14:72",
      "text": "And the second time the cock crew. And Peter called to mind the word that Jesus said unto him, Before the cock crow twice, thou shalt deny me thrice. And when he thought thereon, he wept.",
      "significance": "Peter’s denial and repentance highlight human weakness and the hope of forgiveness through Christ."
    }
  ]
}