{
  "book": "matthew",
  "bookName": "Matthew",
  "chapter": 28,
  "title": "The Resurrection and Great Commission",
  "shortSummary": "Matthew 28 recounts the resurrection of Jesus Christ, the angelic announcement to the women at the tomb, and Jesus’ appearances to His disciples. The chapter culminates with the Great Commission, where Jesus commands His followers to make disciples of all nations, assuring His continual presence.",
  "timeline": "c. AD 30-33 - Resurrection of Jesus Christ",
  "keyCharacters": [
    {
      "name": "Mary Magdalene",
      "description": "A devoted follower of Jesus who, along with the other Mary, discovers the empty tomb and receives the angel’s message of Christ’s resurrection."
    },
    {
      "name": "The Other Mary",
      "description": "Likely Mary the mother of James, she accompanies Mary Magdalene to the tomb and witnesses the resurrection events."
    },
    {
      "name": "Angel of the Lord",
      "description": "A heavenly messenger who rolls back the stone from the tomb, announces Jesus’ resurrection, and comforts the women."
    },
    {
      "name": "Jesus Christ",
      "description": "The risen Savior who appears to His disciples, declares His authority over heaven and earth, and commissions them to spread the gospel."
    },
    {
      "name": "The Eleven Disciples",
      "description": "The remaining apostles who receive the Great Commission from the risen Jesus and are sent to make disciples of all nations."
    }
  ],
  "definitions": [
    {
      "term": "Sabbath",
      "definition": "The seventh day of the week, a day of rest and worship in Jewish tradition, ending at sunset on Saturday."
    },
    {
      "term": "Sepulchre",
      "definition": "A tomb or burial place; here it refers to the tomb where Jesus was laid after His crucifixion."
    },
    {
      "term": "Great Commission",
      "definition": "Jesus’ command to His disciples to spread the gospel and baptize all nations, found in Matthew 28:19-20."
    },
    {
      "term": "Baptizing",
      "definition": "The Christian ordinance of immersion or sprinkling in water symbolizing repentance, cleansing from sin, and identification with Christ."
    },
    {
      "term": "Angel of the Lord",
      "definition": "A divine messenger sent by God, often appearing with authority and power to communicate God’s will."
    }
  ],
  "outline": [
    {
      "heading": "The Resurrection Announced to the Women",
      "verseRange": "Matthew 28:1-7",
      "description": "Mary Magdalene and the other Mary visit Jesus’ tomb, encounter an angel who announces that Jesus has risen, fulfilling His promise and demonstrating victory over death."
    },
    {
      "heading": "The Women Meet the Risen Jesus",
      "verseRange": "Matthew 28:8-10",
      "description": "The women leave the tomb with fear and joy, encounter the risen Christ Himself, who encourages them to share the news with His disciples."
    },
    {
      "heading": "The Guards’ Report and the Jewish Leaders’ Bribe",
      "verseRange": "Matthew 28:11-15",
      "description": "The guards report the events to the chief priests, who bribe them to spread a false story that Jesus’ disciples stole His body, illustrating opposition to the resurrection truth."
    },
    {
      "heading": "The Disciples Meet Jesus in Galilee",
      "verseRange": "Matthew 28:16-17",
      "description": "The eleven disciples go to the mountain Jesus appointed, worship Him though some doubt, highlighting the reality of faith and human uncertainty."
    },
    {
      "heading": "The Great Commission",
      "verseRange": "Matthew 28:18-20",
      "description": "Jesus declares His universal authority and commands His followers to make disciples of all nations, baptizing and teaching them, promising His presence until the end of the age."
    }
  ],
  "application": [
    "Trust in the power of the resurrection as the foundation of Christian faith and hope.",
    "Respond to Jesus’ call to share the gospel boldly, just as the women and disciples obeyed His command.",
    "Overcome doubt through worship and obedience, recognizing that faith may coexist with uncertainty.",
    "Rely on Jesus’ promise of His continual presence and guidance as you fulfill His Great Commission."
  ],
  "keyVerses": [
    {
      "reference": "Matthew 28:6",
      "text": "He is not here: for he is risen, as he said. Come, see the place where the Lord lay.",
      "significance": "This verse proclaims the central truth of Christianity—the resurrection of Jesus, confirming His victory over death."
    },
    {
      "reference": "Matthew 28:18",
      "text": "And Jesus came and spake unto them, saying, All power is given unto me in heaven and in earth.",
      "significance": "Jesus declares His sovereign authority over all creation, empowering His followers for mission."
    },
    {
      "reference": "Matthew 28:19",
      "text": "Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost:",
      "significance": "The Great Commission commands believers to evangelize and disciple all peoples, establishing the global mission of the church."
    },
    {
      "reference": "Matthew 28:20",
      "text": "Teaching them to observe all things whatsoever I have commanded you: and, lo, I am with you alway, even unto the end of the world. Amen.",
      "significance": "Jesus promises His abiding presence and support as His followers obey His teachings and carry out His mission."
    }
  ]
}