{
  "book": "matthew",
  "bookName": "Matthew",
  "chapter": 14,
  "title": "Faith and Provision",
  "shortSummary": "Matthew 14 recounts pivotal events including the beheading of John the Baptist, Jesus’ miraculous feeding of the five thousand, and His walking on water. These narratives reveal Jesus’ divine authority, compassion, and the call to faith amidst trials.",
  "timeline": "c. AD 28-30 - Ministry of Jesus in Galilee",
  "keyCharacters": [
    {
      "name": "Herod Antipas",
      "description": "Tetrarch who imprisoned and executed John the Baptist due to political and personal pressures."
    },
    {
      "name": "John the Baptist",
      "description": "Prophet who boldly confronted Herod about his unlawful marriage and was ultimately beheaded."
    },
    {
      "name": "Jesus Christ",
      "description": "Central figure performing miracles, teaching, and demonstrating divine power and compassion."
    },
    {
      "name": "Peter",
      "description": "Disciple who demonstrates both faith and doubt while walking on the water toward Jesus."
    },
    {
      "name": "Herodias’ Daughter",
      "description": "Dancer who, prompted by her mother, requested John the Baptist’s head, leading to his execution."
    }
  ],
  "definitions": [
    {
      "term": "Tetrarch",
      "definition": "A ruler of a quarter of a province; Herod Antipas governed part of Galilee and Perea."
    },
    {
      "term": "Charger",
      "definition": "A large flat dish or platter used to present food or, in this context, John the Baptist’s severed head."
    },
    {
      "term": "Loaves and Fishes",
      "definition": "Basic food items symbolizing God’s provision and Jesus’ miraculous ability to multiply resources."
    },
    {
      "term": "Fourth Watch of the Night",
      "definition": "The last segment of the night (approximately 3-6 a.m.), indicating Jesus’ supernatural timing in coming to His disciples."
    }
  ],
  "outline": [
    {
      "heading": "John the Baptist’s Imprisonment and Execution",
      "verseRange": "Matthew 14:1-12",
      "description": "Herod Antipas, troubled by Jesus’ fame, recalls John’s rebuke of his unlawful marriage. Herodias’ daughter’s dance leads to John’s beheading, highlighting the cost of prophetic truth and the fulfillment of God’s plan."
    },
    {
      "heading": "Jesus Feeds the Five Thousand",
      "verseRange": "Matthew 14:13-21",
      "description": "Moved by compassion, Jesus miraculously feeds a large crowd with five loaves and two fishes, demonstrating His divine provision and care for physical and spiritual needs."
    },
    {
      "heading": "Jesus Walks on Water",
      "verseRange": "Matthew 14:22-33",
      "description": "Jesus walks on the sea to His disciples during a storm, calling Peter to faith. Peter’s momentary doubt and Jesus’ rescue teach trust in Christ’s power over nature and circumstances."
    },
    {
      "heading": "Healing in Gennesaret",
      "verseRange": "Matthew 14:34-36",
      "description": "Upon arrival in Gennesaret, Jesus heals all who touch His garment, revealing His authority to restore and the power of faith expressed in simple acts."
    }
  ],
  "application": [
    "Stand firm in truth even when facing opposition, as John the Baptist did, trusting God’s sovereign plan.",
    "Trust in Jesus’ provision in times of need, remembering that He can multiply our resources beyond expectation.",
    "Exercise faith boldly, like Peter stepping out onto the water, and call on Jesus in moments of doubt or fear.",
    "Approach Jesus with simple faith, believing in His power to heal and restore, just as the sick sought to touch His garment."
  ],
  "keyVerses": [
    {
      "reference": "Matthew 14:14",
      "text": "And Jesus went forth, and saw a great multitude, and was moved with compassion toward them, and he healed their sick.",
      "significance": "This verse highlights Jesus’ compassion and healing ministry, demonstrating His care for both physical and spiritual needs."
    },
    {
      "reference": "Matthew 14:29",
      "text": "And he said, Come. And when Peter was come down out of the ship, he walked on the water, to go to Jesus.",
      "significance": "Peter’s step of faith exemplifies the call to trust Jesus even in seemingly impossible circumstances."
    },
    {
      "reference": "Matthew 14:31",
      "text": "And immediately Jesus stretched forth his hand, and caught him, and said unto him, O thou of little faith, wherefore didst thou doubt?",
      "significance": "Jesus’ response teaches the importance of unwavering faith and His readiness to save when we falter."
    },
    {
      "reference": "Matthew 14:33",
      "text": "Then they that were in the ship came and worshipped him, saying, Of a truth thou art the Son of God.",
      "significance": "This confession affirms Jesus’ divine identity revealed through His miraculous power."
    }
  ]
}