{
  "book": "matthew",
  "bookName": "Matthew",
  "chapter": 26,
  "title": "The Passion Begins",
  "shortSummary": "Matthew 26 details the events leading up to Jesus’ crucifixion, including His anointing, the Last Supper, His prayer in Gethsemane, His arrest, and Peter’s denial. This chapter highlights Jesus’ obedience to the Father’s will and the fulfillment of Old Testament prophecy concerning the Messiah’s suffering.",
  "timeline": "c. AD 30 - The final days of Jesus’ earthly ministry during the Passover feast in Jerusalem",
  "keyCharacters": [
    {
      "name": "Jesus Christ",
      "description": "The Son of Man and Messiah who prepares for His crucifixion, institutes the Lord’s Supper, prays in Gethsemane, and submits to arrest."
    },
    {
      "name": "Judas Iscariot",
      "description": "One of the twelve disciples who betrays Jesus to the chief priests for thirty pieces of silver."
    },
    {
      "name": "Peter",
      "description": "A leading disciple who boldly declares loyalty but ultimately denies Jesus three times as foretold."
    },
    {
      "name": "Caiaphas",
      "description": "The high priest who presides over the council plotting Jesus’ death and questioning Him during His trial."
    },
    {
      "name": "The Woman with the Alabaster Box",
      "description": "An unnamed woman who anoints Jesus’ head with precious ointment, symbolizing His impending burial."
    }
  ],
  "definitions": [
    {
      "term": "Passover",
      "definition": "A Jewish feast commemorating Israel’s deliverance from Egypt, during which Jesus is betrayed and crucified."
    },
    {
      "term": "Alabaster box",
      "definition": "A small, precious container made of alabaster stone used to hold costly ointment or perfume."
    },
    {
      "term": "New Testament",
      "definition": "The new covenant established by Jesus’ blood, signifying forgiveness of sins and reconciliation with God."
    },
    {
      "term": "Gethsemane",
      "definition": "A garden at the Mount of Olives where Jesus prayed in anguish before His arrest."
    },
    {
      "term": "Legions of angels",
      "definition": "A reference to a vast number of angels Jesus could call upon for protection, emphasizing His voluntary submission."
    }
  ],
  "outline": [
    {
      "heading": "Plot to Betray Jesus and Anointing at Bethany",
      "verseRange": "Matthew 26:1-16",
      "description": "Jesus predicts His betrayal and crucifixion; the religious leaders plot to kill Him; a woman anoints Jesus with costly ointment, symbolizing His burial; Judas agrees to betray Him for thirty pieces of silver."
    },
    {
      "heading": "Preparation and Institution of the Lord’s Supper",
      "verseRange": "Matthew 26:17-30",
      "description": "Jesus instructs His disciples to prepare the Passover; during the meal, He predicts His betrayal and institutes the Lord’s Supper, establishing the new covenant in His blood."
    },
    {
      "heading": "Jesus Predicts Peter’s Denial",
      "verseRange": "Matthew 26:31-35",
      "description": "Jesus foretells the disciples’ scattering and Peter’s denial, highlighting human weakness contrasted with divine foreknowledge."
    },
    {
      "heading": "Prayer in Gethsemane",
      "verseRange": "Matthew 26:36-46",
      "description": "Jesus prays in deep anguish, submitting to the Father’s will despite the suffering ahead; the disciples fail to stay awake and watch with Him."
    },
    {
      "heading": "Arrest of Jesus and Peter’s Denial",
      "verseRange": "Matthew 26:47-75",
      "description": "Judas betrays Jesus with a kiss; Jesus is arrested; Peter denies Him three times as Jesus predicted; Jesus is taken to the high priest’s house for trial."
    }
  ],
  "application": [
    "Trust in God’s sovereign plan even in times of suffering, following Jesus’ example of submission to the Father’s will.",
    "Value the significance of the Lord’s Supper as a remembrance of Christ’s sacrifice and a call to live in covenant relationship with Him.",
    "Be vigilant in prayer and watchfulness, recognizing the weakness of the flesh and the need for spiritual strength.",
    "Examine personal faithfulness and humility, learning from Peter’s failure to deny Christ and the importance of repentance."
  ],
  "keyVerses": [
    {
      "reference": "Matthew 26:28",
      "text": "For this is my blood of the new testament, which is shed for many for the remission of sins.",
      "significance": "This verse reveals the foundation of the new covenant through Jesus’ sacrificial death for the forgiveness of sins."
    },
    {
      "reference": "Matthew 26:39",
      "text": "And he went a little further, and fell on his face, and prayed, saying, O my Father, if it be possible, let this cup pass from me: nevertheless not as I will, but as thou wilt.",
      "significance": "Jesus’ prayer exemplifies submission to God’s will even in the face of intense suffering."
    },
    {
      "reference": "Matthew 26:31",
      "text": "Then saith Jesus unto them, All ye shall be offended because of me this night: for it is written, I will smite the shepherd, and the sheep of the flock shall be scattered abroad.",
      "significance": "This prophecy highlights the disciples’ forthcoming failure and the fulfillment of Scripture regarding the Messiah’s suffering."
    },
    {
      "reference": "Matthew 26:75",
      "text": "And Peter remembered the word of Jesus, which said unto him, Before the cock crow, thou shalt deny me thrice. And he went out, and wept bitterly.",
      "significance": "Peter’s bitter weeping shows the gravity of sin and the hope of repentance after failure."
    }
  ]
}