{
  "book": "micah",
  "bookName": "Micah",
  "chapter": 3,
  "title": "Judgment on Leaders",
  "shortSummary": "Micah chapter 3 delivers a stern rebuke against the leaders of Israel—its rulers, priests, and prophets—who have corrupted justice and exploited the people. The chapter warns of God’s impending judgment due to their greed, false prophecy, and injustice, emphasizing the consequences of turning away from God’s righteous standards.",
  "timeline": "c. 740-700 BC - Ministry of the prophet Micah during the reigns of Jotham, Ahaz, and Hezekiah in Judah",
  "keyCharacters": [
    {
      "name": "Heads of Jacob",
      "description": "The civil leaders and rulers of Israel who are responsible for administering justice but are condemned here for perverting it."
    },
    {
      "name": "Princes of the house of Israel",
      "description": "Noble leaders and officials who share in the guilt of injustice and exploitation of the people."
    },
    {
      "name": "Priests",
      "description": "Religious leaders who are accused of teaching for bribes rather than faithfully instructing God’s law."
    },
    {
      "name": "Prophets",
      "description": "Those who should speak God’s truth but instead prophesy for money and promote false peace, misleading the people."
    }
  ],
  "definitions": [
    {
      "term": "Judgment",
      "definition": "The act of discerning and administering justice according to God’s standards."
    },
    {
      "term": "Divine vision",
      "definition": "Supernatural revelation or insight given by God to prophets and seers."
    },
    {
      "term": "Flay",
      "definition": "To strip off the skin, here used metaphorically to describe ruthless exploitation."
    },
    {
      "term": "Equity",
      "definition": "Fairness and impartiality in judgment and treatment of others."
    }
  ],
  "outline": [
    {
      "heading": "Condemnation of Corrupt Leaders",
      "verseRange": "Micah 3:1-5",
      "description": "Micah confronts the leaders of Israel for their hatred of good and love of evil, describing their brutal exploitation of the people and warning that God will not hear their cries in judgment."
    },
    {
      "heading": "Judgment on False Prophets",
      "verseRange": "Micah 3:6-7",
      "description": "The prophet declares that false prophets will be confounded and silenced because God will withhold revelation from them due to their deceit and failure to speak His truth."
    },
    {
      "heading": "Micah’s Divine Commission",
      "verseRange": "Micah 3:8",
      "description": "Micah affirms his calling and empowerment by the Spirit of the LORD to declare Israel’s sins and transgressions boldly."
    },
    {
      "heading": "Accusation of Leaders’ Injustice",
      "verseRange": "Micah 3:9-11",
      "description": "The leaders are charged with abhorring justice and perverting equity, building Zion with violence, and relying falsely on God while practicing corruption for personal gain."
    },
    {
      "heading": "Prophecy of Jerusalem’s Destruction",
      "verseRange": "Micah 3:12",
      "description": "As a consequence of their sins, Micah prophesies that Jerusalem will be destroyed and laid waste, a sobering warning of God’s righteous judgment."
    }
  ],
  "application": [
    "Leaders and believers alike must pursue justice and righteousness, rejecting corruption and exploitation in all forms.",
    "Christians should be discerning of false teaching and rely on the Spirit’s guidance to uphold biblical truth.",
    "Trust in God must be genuine and accompanied by obedience, not a false confidence that ignores sin.",
    "Boldness in proclaiming God’s truth, like Micah’s, is essential for confronting sin and calling others to repentance."
  ],
  "keyVerses": [
    {
      "reference": "Micah 3:1",
      "text": "And I said, Hear, I pray you, O heads of Jacob, and ye princes of the house of Israel; Is it not for you to know judgment?",
      "significance": "This verse introduces the accountability of Israel’s leaders for administering justice rightly."
    },
    {
      "reference": "Micah 3:8",
      "text": "But truly I am full of power by the spirit of the LORD, and of judgment, and of might, to declare unto Jacob his transgression, and to Israel his sin.",
      "significance": "Micah declares his divine empowerment to boldly confront Israel’s sin, modeling faithful prophetic ministry."
    },
    {
      "reference": "Micah 3:11",
      "text": "The heads thereof judge for reward, and the priests thereof teach for hire, and the prophets thereof divine for money: yet will they lean upon the LORD, and say, Is not the LORD among us? none evil can come upon us.",
      "significance": "This verse exposes the hypocrisy of leaders who corrupt justice yet falsely trust in God’s protection."
    },
    {
      "reference": "Micah 3:12",
      "text": "Therefore shall Zion for your sake be plowed as a field, and Jerusalem shall become heaps, and the mountain of the house as the high places of the forest.",
      "significance": "A solemn prophecy of Jerusalem’s destruction as a direct result of the leaders’ sins, underscoring the seriousness of divine judgment."
    }
  ]
}