{
  "book": "micah",
  "bookName": "Micah",
  "chapter": 2,
  "title": "Judgment on Injustice",
  "shortSummary": "Micah chapter 2 pronounces God's woe against those who scheme and commit injustice by violently seizing land and houses. The chapter contrasts the oppression of the people with God's promise to gather and restore the faithful remnant under the leadership of a coming king. It highlights both the consequences of sin and the hope of divine deliverance.",
  "timeline": "c. 8th century BC - Ministry of the prophet Micah during the reigns of Jotham, Ahaz, and Hezekiah in Judah",
  "keyCharacters": [
    {
      "name": "The Oppressors",
      "description": "Those who devise evil plans to seize land and houses by violence, oppressing others for personal gain."
    },
    {
      "name": "The People of Israel",
      "description": "The nation suffering under oppression and injustice, whose fields and homes are taken away."
    },
    {
      "name": "The Prophet Micah",
      "description": "God’s messenger who delivers warnings of judgment and promises of restoration to Israel."
    },
    {
      "name": "The Breaker",
      "description": "A messianic figure who leads the people out of captivity, breaking through gates and guiding them to freedom."
    }
  ],
  "definitions": [
    {
      "term": "Woe",
      "definition": "An expression of grief or denunciation pronounced against those who commit sin or injustice."
    },
    {
      "term": "Parable",
      "definition": "A short, illustrative story or saying used to convey a spiritual or moral lesson."
    },
    {
      "term": "Remnant",
      "definition": "The faithful portion of Israel preserved by God despite widespread judgment and exile."
    },
    {
      "term": "Breaker",
      "definition": "A title referring to one who breaks open gates, symbolizing a deliverer or Messiah who leads God’s people to freedom."
    }
  ],
  "outline": [
    {
      "heading": "Condemnation of the Wicked and Their Greed",
      "verseRange": "Micah 2:1-5",
      "description": "God pronounces woe on those who plot evil and violently seize land and homes, oppressing others. Their greed leads to the loss of inheritance and the disruption of the community’s peace."
    },
    {
      "heading": "Rejection of False Prophecy and Divine Justice",
      "verseRange": "Micah 2:6-7",
      "description": "The people reject true prophecy, silencing God’s messengers, while God reminds them that His words benefit the upright and that His Spirit is not limited."
    },
    {
      "heading": "Oppression and Exile of God’s People",
      "verseRange": "Micah 2:8-10",
      "description": "The chapter describes the harsh treatment of the people, including the stripping away of their possessions and the exile of women and children, warning that their polluted rest will bring destruction."
    },
    {
      "heading": "False Prophets and the Promise of Restoration",
      "verseRange": "Micah 2:11-13",
      "description": "False prophets promise deceitful messages of wine and strong drink, but God promises to gather the faithful remnant like a flock and lead them through the gate with a coming king and the LORD at their head."
    }
  ],
  "application": [
    "Guard against the temptation to oppress others for personal gain, remembering that God judges injustice.",
    "Listen attentively to true prophecy and God’s Word, which brings blessing to those who walk uprightly.",
    "Trust in God’s promise to gather and restore His faithful remnant even in times of judgment and hardship.",
    "Live in hope of Christ, the Breaker, who leads His people to freedom and eternal security."
  ],
  "keyVerses": [
    {
      "reference": "Micah 2:1",
      "text": "Woe to them that devise iniquity, and work evil upon their beds! when the morning is light, they practise it, because it is in the power of their hand.",
      "significance": "This verse introduces the chapter’s theme of deliberate and persistent evil planned by those in power."
    },
    {
      "reference": "Micah 2:12",
      "text": "I will surely assemble, O Jacob, all of thee; I will surely gather the remnant of Israel; I will put them together as the sheep of Bozrah, as the flock in the midst of their fold: they shall make great noise by reason of the multitude of men.",
      "significance": "This verse offers hope by promising God’s gathering and protection of the faithful remnant."
    },
    {
      "reference": "Micah 2:13",
      "text": "The breaker is come up before them: they have broken up, and have passed through the gate, and are gone out by it: and their king shall pass before them, and the LORD on the head of them.",
      "significance": "This verse points to the Messiah who leads and delivers God’s people, a key promise of salvation."
    }
  ]
}