{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 140,
  "title": "Prayer for Protection",
  "shortSummary": "Psalm 140 is a heartfelt plea by David for deliverance from violent and wicked enemies who plot harm against him. It highlights the believer’s reliance on God’s protection and justice, affirming that God defends the afflicted and establishes the righteous.",
  "timeline": "c. 1000 BC - Reign of King David",
  "keyCharacters": [
    {
      "name": "David",
      "description": "The psalmist and king of Israel who prays earnestly for God's protection against his enemies."
    },
    {
      "name": "The Evil Man",
      "description": "Represents the violent and wicked adversaries who plot mischief and seek to harm David."
    }
  ],
  "definitions": [
    {
      "term": "Selah",
      "definition": "A musical or liturgical pause found in the Psalms, possibly indicating a moment for reflection."
    },
    {
      "term": "Adders",
      "definition": "Venomous snakes; used metaphorically here to describe the poisonous and deceitful speech of enemies."
    },
    {
      "term": "Gins",
      "definition": "Traps or snares set to catch prey, symbolizing the schemes of the wicked against the psalmist."
    },
    {
      "term": "Supplications",
      "definition": "Earnest and humble prayers or requests made to God."
    }
  ],
  "outline": [
    {
      "heading": "David’s Plea for Deliverance from Evil",
      "verseRange": "Psalms 140:1-5",
      "description": "David cries out to God to protect him from violent men who devise evil plans and set traps, emphasizing the danger posed by their deceitful words and intentions."
    },
    {
      "heading": "Affirmation of God’s Protection",
      "verseRange": "Psalms 140:6-7",
      "description": "David declares his trust in God as his strength and salvation, acknowledging God’s protective care during times of spiritual battle."
    },
    {
      "heading": "Prayer for Justice Against the Wicked",
      "verseRange": "Psalms 140:8-11",
      "description": "David asks God to frustrate the desires and plans of the wicked, calling for divine judgment to prevent their exaltation and to bring down their schemes."
    },
    {
      "heading": "Confidence in God’s Justice and Praise",
      "verseRange": "Psalms 140:12-13",
      "description": "The psalm concludes with David’s assurance that God defends the afflicted and the poor, and that the righteous will give thanks and dwell in God’s presence."
    }
  ],
  "application": [
    "Trust God to protect you from those who seek to harm you, bringing your fears and dangers before Him in prayer.",
    "Maintain integrity and righteousness even when surrounded by deceit and violence, relying on God’s justice rather than personal vengeance.",
    "Pray earnestly and persistently, knowing that God hears the supplications of His people and acts on their behalf.",
    "Give thanks and praise to God for His faithfulness in defending the oppressed and establishing the upright."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 140:1",
      "text": "Deliver me, O LORD, from the evil man: preserve me from the violent man;",
      "significance": "This opening verse sets the tone of urgent prayer for deliverance from hostile enemies."
    },
    {
      "reference": "Psalms 140:7",
      "text": "O GOD the Lord, the strength of my salvation, thou hast covered my head in the day of battle.",
      "significance": "It expresses confidence in God’s protection as the source of salvation and strength in spiritual conflict."
    },
    {
      "reference": "Psalms 140:12",
      "text": "I know that the LORD will maintain the cause of the afflicted, and the right of the poor.",
      "significance": "This verse affirms God’s justice and care for the vulnerable, encouraging believers to trust in His righteous judgment."
    },
    {
      "reference": "Psalms 140:13",
      "text": "Surely the righteous shall give thanks unto thy name: the upright shall dwell in thy presence.",
      "significance": "It concludes with a promise of praise and fellowship with God for those who live righteously."
    }
  ]
}