{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 47,
  "title": "God Reigns Over All",
  "shortSummary": "Psalm 47 is a jubilant call for all people to praise God as the supreme King over the entire earth. It celebrates God's sovereign rule, His victory over nations, and His chosen inheritance in the people of Jacob. This psalm encourages believers to worship God with understanding and joyful praise.",
  "timeline": "c. 10th century BC - United Monarchy period, attributed to the sons of Korah",
  "keyCharacters": [
    {
      "name": "Sons of Korah",
      "description": "A group of Levitical singers and temple musicians credited with composing this psalm, leading worship in ancient Israel."
    },
    {
      "name": "Jacob",
      "description": "The patriarch whose descendants, the nation of Israel, are God's chosen inheritance mentioned in this psalm."
    },
    {
      "name": "Princes of the people",
      "description": "Leaders and rulers gathered in recognition of God's sovereignty over all nations."
    }
  ],
  "definitions": [
    {
      "term": "Selah",
      "definition": "A liturgical or musical pause in the psalm, possibly indicating a moment for reflection or emphasis."
    },
    {
      "term": "Terrible",
      "definition": "In the KJV, this means awe-inspiring or fearsome, highlighting God's majestic power and authority."
    },
    {
      "term": "Inheritance",
      "definition": "The land or blessings God chooses to give His people, signifying His covenant relationship with Israel."
    },
    {
      "term": "Trumpet",
      "definition": "A musical instrument used in worship and to signal important events, symbolizing God's triumphant presence."
    }
  ],
  "outline": [
    {
      "heading": "Call to Praise and Triumph",
      "verseRange": "Psalms 47:1-2",
      "description": "The psalm opens with an enthusiastic invitation for all people to clap and shout in triumph, recognizing the LORD as the exalted and awe-inspiring King over all the earth."
    },
    {
      "heading": "God’s Sovereign Victory and Inheritance",
      "verseRange": "Psalms 47:3-4",
      "description": "These verses affirm God's power to subdue nations and establish His chosen inheritance in Jacob, emphasizing His loving selection of Israel."
    },
    {
      "heading": "God’s Ascension and Call to Praise",
      "verseRange": "Psalms 47:5-7",
      "description": "The psalmist celebrates God's ascension with shouts and trumpet blasts, urging the people to sing praises to their King with understanding."
    },
    {
      "heading": "God’s Reign Over Nations and Exaltation",
      "verseRange": "Psalms 47:8-9",
      "description": "The closing verses declare God's reign over the nations, His holy throne, and the gathering of leaders who acknowledge His supreme authority and protection."
    }
  ],
  "application": [
    "Praise God joyfully and with understanding, recognizing His supreme authority over all creation.",
    "Trust in God’s sovereign power to overcome challenges and establish His purposes in your life.",
    "Remember that God has chosen believers as His inheritance, encouraging a life of faithfulness and worship.",
    "Gather with fellow believers to acknowledge God’s reign and exalt His name together."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 47:2",
      "text": "For the LORD most high is terrible; he is a great King over all the earth.",
      "significance": "This verse highlights God's majestic and awe-inspiring sovereignty over all nations, central to the psalm's theme."
    },
    {
      "reference": "Psalms 47:5",
      "text": "God is gone up with a shout, the LORD with the sound of a trumpet.",
      "significance": "This verse celebrates God's triumphant ascension, symbolizing His victory and exalted position."
    },
    {
      "reference": "Psalms 47:7",
      "text": "For God is the King of all the earth: sing ye praises with understanding.",
      "significance": "This verse calls for worship that is both joyful and thoughtful, recognizing God's universal kingship."
    }
  ]
}