{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 72,
  "title": "The Reign of Solomon",
  "shortSummary": "Psalm 72 is a royal psalm attributed to Solomon, praying for God’s righteous judgment and blessing upon the king’s reign. It highlights the ideal king’s role in justice, peace, and prosperity, extending his dominion and care to the poor and needy, and envisions a kingdom marked by universal praise and enduring blessing.",
  "timeline": "c. 970–931 BC - Reign of Solomon",
  "keyCharacters": [
    {
      "name": "Solomon",
      "description": "The son of David and king of Israel, to whom this psalm is attributed; he is the ideal king whose reign is prayed for in righteousness and justice."
    },
    {
      "name": "David",
      "description": "Father of Solomon and author of many psalms; his prayers conclude this psalm, linking it to his legacy."
    }
  ],
  "definitions": [
    {
      "term": "Judgments",
      "definition": "Decisions or rulings made by a king or judge, reflecting God’s justice and righteousness."
    },
    {
      "term": "Oppressor",
      "definition": "One who unjustly burdens or harms others, especially the poor and needy."
    },
    {
      "term": "Dominion",
      "definition": "Sovereign authority or rule over a territory or people."
    },
    {
      "term": "Redeem",
      "definition": "To rescue or deliver, often implying a price paid to set someone free from harm or bondage."
    }
  ],
  "outline": [
    {
      "heading": "Prayer for Righteous Judgment",
      "verseRange": "Psalms 72:1-5",
      "description": "The psalm opens with a plea for God to grant the king righteous judgment and justice, emphasizing care for the poor and oppressed as foundational to godly leadership."
    },
    {
      "heading": "Blessings of the King’s Reign",
      "verseRange": "Psalms 72:6-11",
      "description": "This section describes the flourishing and peace that will characterize the king’s reign, with dominion extending broadly and even foreign kings bringing tribute."
    },
    {
      "heading": "Compassion for the Needy",
      "verseRange": "Psalms 72:12-14",
      "description": "The king’s role as protector and redeemer of the poor and needy is emphasized, highlighting his mercy and the preciousness of their lives in his sight."
    },
    {
      "heading": "Prosperity and Enduring Legacy",
      "verseRange": "Psalms 72:15-17",
      "description": "The psalmist envisions abundant provision and lasting fame for the king, with blessings extending to all nations who will call him blessed."
    },
    {
      "heading": "Praise to God and Conclusion",
      "verseRange": "Psalms 72:18-20",
      "description": "The psalm concludes with praise to the LORD, acknowledging His wondrous works and glory, and notes the end of David’s prayers."
    }
  ],
  "application": [
    "Pray for leaders to govern with God’s righteousness and justice, especially caring for the vulnerable.",
    "Trust in God’s sovereign rule that brings peace and prosperity when His principles are followed.",
    "Emulate the king’s compassion by actively helping and defending the poor and oppressed in your community.",
    "Praise God continually for His wondrous works and sovereign authority over all nations."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 72:2",
      "text": "He shall judge thy people with righteousness, and thy poor with judgment.",
      "significance": "This verse highlights the king’s God-ordained responsibility to administer justice fairly, especially toward the disadvantaged."
    },
    {
      "reference": "Psalms 72:12",
      "text": "For he shall deliver the needy when he crieth; the poor also, and him that hath no helper.",
      "significance": "It underscores the king’s role as a deliverer and protector of those who are helpless and in need."
    },
    {
      "reference": "Psalms 72:17",
      "text": "His name shall endure for ever: his name shall be continued as long as the sun: and men shall be blessed in him: all nations shall call him blessed.",
      "significance": "This verse prophesies the enduring legacy and universal blessing associated with the righteous king’s reign."
    }
  ]
}