{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 29,
  "title": "The Voice of the LORD",
  "shortSummary": "Psalm 29 is a majestic hymn praising the power and glory of God's voice as it thunders over the waters and shakes the wilderness. It highlights God's sovereign authority over nature and His eternal kingship, concluding with a promise of strength and peace for His people.",
  "timeline": "c. 1000 BC - Reign of King David",
  "keyCharacters": [
    {
      "name": "David",
      "description": "The author of the psalm, a king of Israel known for his poetic and musical worship of God."
    },
    {
      "name": "The LORD",
      "description": "God, depicted as the sovereign King whose powerful voice commands creation and brings blessing."
    }
  ],
  "definitions": [
    {
      "term": "Cedars of Lebanon",
      "definition": "Famous, strong trees known for their height and durability, symbolizing strength and majesty."
    },
    {
      "term": "Sirion",
      "definition": "Another name for Mount Hermon, a prominent mountain in the region, symbolizing grandeur."
    },
    {
      "term": "Hinds",
      "definition": "Female deer; used here to illustrate the natural response to God's powerful voice."
    },
    {
      "term": "Temple",
      "definition": "The sacred place where God's presence dwells and where His glory is acknowledged."
    }
  ],
  "outline": [
    {
      "heading": "Call to Worship and Praise",
      "verseRange": "Psalms 29:1-2",
      "description": "The psalm opens with a call for the mighty to give glory and strength to the LORD, emphasizing worship in holiness as due to His name."
    },
    {
      "heading": "The Power of God's Voice in Nature",
      "verseRange": "Psalms 29:3-9",
      "description": "A vivid description of the LORD’s voice as it thunders over waters, breaks cedars, divides flames, shakes the wilderness, and causes natural phenomena, demonstrating His sovereign control over creation."
    },
    {
      "heading": "God’s Eternal Kingship and Blessing",
      "verseRange": "Psalms 29:10-11",
      "description": "The psalm concludes by affirming the LORD’s eternal reign over the floods and His promise to give strength and peace to His people."
    }
  ],
  "application": [
    "Recognize and worship God’s majesty and holiness in your daily life, giving Him the glory due to His name.",
    "Trust in God’s sovereign power over all circumstances, knowing He controls even the forces of nature.",
    "Find strength and peace by relying on the LORD’s eternal kingship and His promises to His people.",
    "Let the testimony of God's glory in creation inspire reverence and faith in His unchanging power."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 29:4",
      "text": "The voice of the LORD is powerful; the voice of the LORD is full of majesty.",
      "significance": "This verse highlights the overwhelming power and majesty of God's voice, central to the psalm's theme."
    },
    {
      "reference": "Psalms 29:10",
      "text": "The LORD sitteth upon the flood; yea, the LORD sitteth King for ever.",
      "significance": "It affirms God's eternal sovereignty and His reign over chaotic forces, assuring believers of His ultimate control."
    },
    {
      "reference": "Psalms 29:11",
      "text": "The LORD will give strength unto his people; the LORD will bless his people with peace.",
      "significance": "This verse offers a comforting promise of divine strength and peace to those who belong to God."
    }
  ]
}