{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 84,
  "title": "The Blessedness of Dwelling with God",
  "shortSummary": "Psalm 84 expresses a deep longing for the presence of God and the joy found in dwelling in His house. It highlights the blessedness of those who trust in God and find strength in Him, emphasizing the incomparable value of being near to the Lord.",
  "timeline": "c. 10th century BC - United Monarchy period, attributed to the sons of Korah during the time of temple worship in Jerusalem",
  "keyCharacters": [
    {
      "name": "Sons of Korah",
      "description": "A group of Levitical temple singers and composers traditionally credited with this psalm, expressing their devotion and longing for God's presence."
    },
    {
      "name": "The LORD of hosts",
      "description": "God, the sovereign Commander of heavenly armies, who is the focus of worship and the source of strength in this psalm."
    }
  ],
  "definitions": [
    {
      "term": "Gittith",
      "definition": "A musical term or tune to which this psalm was to be sung, possibly linked to the town of Gath or a specific melody."
    },
    {
      "term": "Baca",
      "definition": "A valley of weeping or a place of hardship; here symbolizing trials through which God provides refreshment and blessing."
    },
    {
      "term": "Selah",
      "definition": "A liturgical or musical pause in the psalm, inviting reflection on the preceding words."
    },
    {
      "term": "Doorkeeper",
      "definition": "A lowly temple servant responsible for guarding the entrance, symbolizing humble service and devotion to God."
    }
  ],
  "outline": [
    {
      "heading": "Longing for God's Presence",
      "verseRange": "Psalms 84:1-4",
      "description": "The psalmist expresses heartfelt yearning and admiration for God's dwelling place, describing the joy and blessing of those who live in His house."
    },
    {
      "heading": "Strength and Blessing from God",
      "verseRange": "Psalms 84:5-7",
      "description": "Believers who trust in God find renewed strength even through difficult trials, progressing spiritually as they appear before God in Zion."
    },
    {
      "heading": "Prayer for God's Favor",
      "verseRange": "Psalms 84:8-9",
      "description": "A petition for God to hear the prayer and look upon His anointed, acknowledging God's protective and gracious nature."
    },
    {
      "heading": "The Incomparable Value of God's Presence",
      "verseRange": "Psalms 84:10-12",
      "description": "The psalmist declares that a single day in God's courts surpasses a thousand elsewhere and affirms God's provision of grace, glory, and good to those who walk uprightly."
    }
  ],
  "application": [
    "Cultivate a deep desire for God's presence through regular prayer and worship, recognizing it as the source of true joy and strength.",
    "Trust in God during life's trials, knowing He transforms hardships into spiritual growth and blessing.",
    "Value humble service to God above worldly status, embracing roles that keep you close to Him.",
    "Walk uprightly and depend on God's grace, confident that He will withhold no good thing from those who trust Him."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 84:10",
      "text": "For a day in thy courts is better than a thousand. I had rather be a doorkeeper in the house of my God, than to dwell in the tents of wickedness.",
      "significance": "This verse highlights the supreme joy and honor of being near God, valuing His presence above all earthly pleasures."
    },
    {
      "reference": "Psalms 84:11",
      "text": "For the LORD God is a sun and shield: the LORD will give grace and glory: no good thing will he withhold from them that walk uprightly.",
      "significance": "It reveals God's protective and generous nature toward those who live righteously, assuring believers of His blessing."
    },
    {
      "reference": "Psalms 84:2",
      "text": "My soul longeth, yea, even fainteth for the courts of the LORD: my heart and my flesh crieth out for the living God.",
      "significance": "This verse powerfully expresses the psalmist's intense spiritual yearning for communion with God."
    }
  ]
}