{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 113,
  "title": "Praise to the LORD",
  "shortSummary": "Psalm 113 is a call to praise the LORD, emphasizing His greatness above all nations and His care for the lowly and needy. It highlights God's sovereignty and compassion, encouraging continual worship from sunrise to sunset. This psalm celebrates God's exalted position and His intimate involvement in the lives of the humble and oppressed.",
  "timeline": "c. 1000 BC - United Monarchy period, attributed to the time of David or the Levitical worship tradition",
  "keyCharacters": [
    {
      "name": "Servants of the LORD",
      "description": "The worshippers called to praise God, representing the faithful community who serve and honor the LORD."
    },
    {
      "name": "The Poor and Needy",
      "description": "Those whom God uplifts from lowly and despised conditions, demonstrating His mercy and power to exalt."
    },
    {
      "name": "The Barren Woman",
      "description": "A symbol of God's miraculous blessing and transformation, given joy and children where there was none."
    }
  ],
  "definitions": [
    {
      "term": "Blessed",
      "definition": "To be favored or endowed with divine favor and happiness."
    },
    {
      "term": "Dunghill",
      "definition": "A heap of refuse or manure, symbolizing a place of lowliness and degradation."
    },
    {
      "term": "Barren",
      "definition": "Unable to bear children; used here to illustrate God's power to bring life and joy."
    },
    {
      "term": "Princes",
      "definition": "Rulers or leaders; here indicating those elevated to positions of honor and authority."
    }
  ],
  "outline": [
    {
      "heading": "Call to Praise the LORD",
      "verseRange": "Psalms 113:1-3",
      "description": "The psalm opens with a repeated exhortation for the servants of the LORD to praise His name continually, from sunrise to sunset, emphasizing the constancy and universality of worship."
    },
    {
      "heading": "God’s Exalted Position",
      "verseRange": "Psalms 113:4-5",
      "description": "These verses declare the LORD’s supremacy above all nations and heavens, highlighting His uniqueness and exalted dwelling place."
    },
    {
      "heading": "God’s Compassion for the Lowly",
      "verseRange": "Psalms 113:6-8",
      "description": "The psalmist describes God’s humility in caring for the lowly, lifting the poor and needy from degradation to honor among princes, showcasing His mercy and power."
    },
    {
      "heading": "God’s Blessing on the Barren",
      "verseRange": "Psalms 113:9",
      "description": "The chapter concludes by celebrating God’s blessing on the barren woman, granting her joy and children, a sign of His life-giving power and faithfulness."
    }
  ],
  "application": [
    "Commit to praising God daily, recognizing His greatness and faithfulness from morning until night.",
    "Trust in God’s sovereign power to uplift you in times of hardship and lowliness.",
    "Rejoice in God’s ability to bring blessing and new life where there seems to be none.",
    "Serve God faithfully as His servant, joining the community in continual worship and praise."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 113:3",
      "text": "From the rising of the sun unto the going down of the same the LORD'S name is to be praised.",
      "significance": "This verse underscores the call for continual worship and the universal scope of praising God."
    },
    {
      "reference": "Psalms 113:6",
      "text": "Who humbleth himself to behold the things that are in heaven, and in the earth!",
      "significance": "It reveals God's humility and attentiveness despite His exalted position, encouraging believers to trust in His care."
    },
    {
      "reference": "Psalms 113:7",
      "text": "He raiseth up the poor out of the dust, and lifteth the needy out of the dunghill;",
      "significance": "This verse highlights God's mercy and power to elevate the lowly, offering hope to the oppressed."
    },
    {
      "reference": "Psalms 113:9",
      "text": "He maketh the barren woman to keep house, and to be a joyful mother of children. Praise ye the LORD.",
      "significance": "It demonstrates God’s miraculous blessing and the joy He brings, concluding the psalm with a call to praise."
    }
  ]
}