{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 142,
  "title": "David's Prayer in Distress",
  "shortSummary": "Psalm 142 is a heartfelt prayer of David during a time of deep distress, traditionally understood to be when he was hiding in a cave. The psalm expresses a profound sense of loneliness, danger, and reliance on God as refuge and deliverer. It highlights the power of honest prayer and trust in God's protection amid persecution.",
  "timeline": "c. 1000 BC - David's time as a fugitive from King Saul",
  "keyCharacters": [
    {
      "name": "David",
      "description": "The author of the psalm, a king of Israel, who is depicted here as a fugitive seeking God's help while hiding in a cave."
    }
  ],
  "definitions": [
    {
      "term": "Maschil",
      "definition": "A term meaning 'instruction' or 'contemplation,' indicating this psalm is intended to teach or provide insight."
    },
    {
      "term": "Supplication",
      "definition": "A humble and earnest prayer or request made to God."
    },
    {
      "term": "Refuge",
      "definition": "A place or state of safety and protection, often used metaphorically for God’s protection."
    },
    {
      "term": "Prison",
      "definition": "Here symbolically represents a state of confinement or distress from which the psalmist seeks deliverance."
    }
  ],
  "outline": [
    {
      "heading": "David’s Cry to God",
      "verseRange": "Psalms 142:1-2",
      "description": "David begins by openly crying out to the LORD, pouring out his complaints and revealing his troubles in prayer, demonstrating the importance of honest communication with God."
    },
    {
      "heading": "David’s Isolation and Danger",
      "verseRange": "Psalms 142:3-4",
      "description": "David describes his overwhelmed spirit and the secret snares set by his enemies, emphasizing his loneliness and the absence of human help or sympathy."
    },
    {
      "heading": "God as Refuge and Portion",
      "verseRange": "Psalms 142:5",
      "description": "Despite his dire circumstances, David declares God as his refuge and portion, affirming his trust and dependence on God for life and sustenance."
    },
    {
      "heading": "Plea for Deliverance",
      "verseRange": "Psalms 142:6-7",
      "description": "David urgently asks God to hear his cry, deliver him from stronger persecutors, and bring him out of prison so he may praise God, confident that the righteous will surround him and God will show kindness."
    }
  ],
  "application": [
    "When facing overwhelming troubles, bring your honest feelings and complaints before God in prayer, trusting He understands your path.",
    "Recognize that even in times of isolation and abandonment, God is your true refuge and portion in life.",
    "Persist in prayer for deliverance from difficulties, knowing that God’s bountiful care surrounds and sustains the righteous.",
    "Use times of hardship as opportunities to deepen your trust in God’s protection and to praise His name for His faithfulness."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 142:5",
      "text": "I cried unto thee, O LORD: I said, Thou art my refuge and my portion in the land of the living.",
      "significance": "This verse captures the heart of the psalmist’s trust in God as the ultimate source of safety and sustenance."
    },
    {
      "reference": "Psalms 142:7",
      "text": "Bring my soul out of prison, that I may praise thy name: the righteous shall compass me about; for thou shalt deal bountifully with me.",
      "significance": "It expresses confident hope for deliverance and the intention to glorify God publicly once rescued."
    }
  ]
}