{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 21,
  "title": "The King's Joy and Victory",
  "shortSummary": "Psalm 21 is a royal psalm celebrating the king's joy in God's strength and salvation. It highlights God's blessings, protection, and justice upon the king and his enemies, emphasizing trust in the Lord's power and mercy. This psalm encourages believers to rejoice in God's faithfulness and to trust Him in times of trial.",
  "timeline": "c. 1000 BC - Reign of King David",
  "keyCharacters": [
    {
      "name": "David",
      "description": "The author and king, expressing joy and confidence in God's blessings and protection."
    },
    {
      "name": "The LORD",
      "description": "God, the source of the king’s strength, salvation, and justice."
    }
  ],
  "definitions": [
    {
      "term": "Selah",
      "definition": "A Hebrew term often interpreted as a pause for reflection or musical interlude."
    },
    {
      "term": "Crown of pure gold",
      "definition": "A symbol of royal authority, honor, and divine blessing upon the king."
    },
    {
      "term": "Mercy of the Most High",
      "definition": "God’s compassionate and steadfast love that sustains and protects the king."
    },
    {
      "term": "Fiery oven",
      "definition": "A metaphor for God’s consuming judgment against the king’s enemies."
    }
  ],
  "outline": [
    {
      "heading": "The King's Joy in God's Strength and Salvation",
      "verseRange": "Psalms 21:1-3",
      "description": "The psalm opens with the king rejoicing in the Lord’s strength and salvation, acknowledging that God has granted his heart’s desires and crowned him with honor."
    },
    {
      "heading": "God’s Blessing of Life and Majesty",
      "verseRange": "Psalms 21:4-7",
      "description": "God grants the king long life, glory, honor, and unshakable security through His mercy, highlighting the king’s trust in the Lord."
    },
    {
      "heading": "God’s Judgment Against the King’s Enemies",
      "verseRange": "Psalms 21:8-12",
      "description": "The psalmist describes God’s active role in defeating the king’s enemies, portraying divine wrath that consumes and destroys those who oppose Him."
    },
    {
      "heading": "Praise for God’s Strength",
      "verseRange": "Psalms 21:13",
      "description": "The psalm concludes with a call to exalt the Lord in His strength and to praise His power, affirming God’s sovereign protection."
    }
  ],
  "application": [
    "Trust in God’s strength and mercy during times of leadership and responsibility, knowing He grants success and protection.",
    "Rejoice in God’s blessings and answered prayers, recognizing that He fulfills the desires of a righteous heart.",
    "Rely on God’s justice against opposition, confident that He will defend His people and bring about righteous judgment.",
    "Praise and exalt the Lord continually, acknowledging His power as the ultimate source of victory and security."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 21:1",
      "text": "The king shall joy in thy strength, O LORD; and in thy salvation how greatly shall he rejoice!",
      "significance": "This verse captures the central theme of the psalm—the king’s joy and confidence in God’s saving power."
    },
    {
      "reference": "Psalms 21:7",
      "text": "For the king trusteth in the LORD, and through the mercy of the most High he shall not be moved.",
      "significance": "It emphasizes the stability and security that come from trusting God’s mercy."
    },
    {
      "reference": "Psalms 21:9",
      "text": "Thou shalt make them as a fiery oven in the time of thine anger: the LORD shall swallow them up in his wrath, and the fire shall devour them.",
      "significance": "This verse vividly portrays God’s righteous judgment against the king’s enemies."
    }
  ]
}