{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 3,
  "title": "David's Prayer for Deliverance",
  "shortSummary": "Psalm 3 is a heartfelt prayer of King David during a time of intense personal crisis when he fled from his son Absalom. The psalm expresses trust in God's protection and deliverance despite overwhelming opposition, highlighting the believer's confidence in God's sustaining power.",
  "timeline": "c. 1000 BC - During King David's reign, specifically at the time of Absalom's rebellion",
  "keyCharacters": [
    {
      "name": "David",
      "description": "The author of the psalm and king of Israel, who is fleeing from his son Absalom's rebellion."
    },
    {
      "name": "Absalom",
      "description": "David's son who rebelled against him, causing David to flee for his life."
    }
  ],
  "definitions": [
    {
      "term": "Selah",
      "definition": "A liturgical or musical pause in the psalm, possibly indicating reflection or emphasis."
    },
    {
      "term": "Shield",
      "definition": "A metaphor for God's protection and defense against enemies."
    },
    {
      "term": "Ungodly",
      "definition": "Those who are wicked or opposed to God and His ways."
    },
    {
      "term": "Cheek bone",
      "definition": "A symbolic reference to striking a humiliating blow to an enemy, indicating defeat."
    }
  ],
  "outline": [
    {
      "heading": "David’s Distress and Opposition",
      "verseRange": "Psalms 3:1-2",
      "description": "David laments the great number of enemies rising against him and the despair expressed by those who doubt God's help, setting the scene for his urgent cry to God."
    },
    {
      "heading": "God’s Protection and Sustenance",
      "verseRange": "Psalms 3:3-5",
      "description": "David affirms God as his shield and source of honor, recounting how God sustains him even in sleep, demonstrating trust in divine protection."
    },
    {
      "heading": "Confidence in God’s Deliverance",
      "verseRange": "Psalms 3:6-8",
      "description": "David boldly declares he will not fear his enemies, calls on God to arise and save him, and acknowledges that salvation and blessing belong to the Lord and His people."
    }
  ],
  "application": [
    "Trust God as your shield and protector in times of trouble, knowing He sustains you even when circumstances seem overwhelming.",
    "Pray earnestly and confidently, believing that God hears your cries and will respond according to His perfect will.",
    "Do not fear opposition or adversity, for God’s power is greater than any enemy or challenge you face.",
    "Remember that ultimate salvation and blessing come from the Lord, encouraging steadfast faith and reliance on Him."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 3:3",
      "text": "But thou, O LORD, art a shield for me; my glory, and the lifter up of mine head.",
      "significance": "This verse highlights God’s role as protector and encourager, lifting the believer’s spirit in times of distress."
    },
    {
      "reference": "Psalms 3:5",
      "text": "I laid me down and slept; I awaked; for the LORD sustained me.",
      "significance": "It expresses profound trust in God’s sustaining power even during vulnerable moments like sleep."
    },
    {
      "reference": "Psalms 3:6",
      "text": "I will not be afraid of ten thousands of people, that have set themselves against me round about.",
      "significance": "This verse demonstrates fearless confidence in God’s protection despite overwhelming opposition."
    },
    {
      "reference": "Psalms 3:8",
      "text": "Salvation belongeth unto the LORD: thy blessing is upon thy people. Selah.",
      "significance": "It affirms that ultimate deliverance and blessing come from God alone, encouraging believers to rely fully on Him."
    }
  ]
}