{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 11,
  "title": "Trust in God’s Justice",
  "shortSummary": "Psalm 11 is a confident declaration of trust in the Lord amid threats from the wicked. David expresses faith that God, who reigns in heaven, observes all and will bring righteous judgment against evildoers while protecting the upright.",
  "timeline": "c. 1000 BC - Reign of King David",
  "keyCharacters": [
    {
      "name": "David",
      "description": "The psalmist and king of Israel who expresses his trust in God’s protection and justice in the face of wicked opposition."
    },
    {
      "name": "The Wicked",
      "description": "Those who oppose the righteous, preparing to harm the upright secretly and violently."
    }
  ],
  "definitions": [
    {
      "term": "Chief Musician",
      "definition": "The leader or director of music in the temple, responsible for overseeing the singing and instrumental accompaniment."
    },
    {
      "term": "Upright in heart",
      "definition": "Those who live with integrity and righteousness, sincere in their devotion to God."
    },
    {
      "term": "Foundations",
      "definition": "Symbolic of the basic principles or stability of society or faith; their destruction implies chaos and moral collapse."
    },
    {
      "term": "Try",
      "definition": "To test or examine closely, often referring to God’s examination of human hearts and motives."
    }
  ],
  "outline": [
    {
      "heading": "Confidence Amid Danger",
      "verseRange": "Psalms 11:1-3",
      "description": "David declares his trust in the Lord despite advice to flee from danger, questioning what the righteous can do if the very foundations of justice and order are destroyed."
    },
    {
      "heading": "God’s Sovereign Observation",
      "verseRange": "Psalms 11:4-5",
      "description": "The psalmist affirms that God is enthroned in heaven, watching all people and testing the righteous while hating the wicked and those who love violence."
    },
    {
      "heading": "Judgment and Protection",
      "verseRange": "Psalms 11:6-7",
      "description": "God will bring severe judgment upon the wicked, but His favor and protection rest upon the righteous because He loves righteousness and looks upon the upright."
    }
  ],
  "application": [
    "Place your full trust in God even when circumstances suggest fleeing or fear; He is sovereign over all.",
    "Remember that God sees and tests the heart; live with integrity and righteousness before Him.",
    "Take comfort that God will judge wickedness and protect those who live uprightly.",
    "Commit to loving righteousness and rejecting violence, reflecting God’s character in your own life."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 11:1",
      "text": "In the LORD put I my trust: how say ye to my soul, Flee as a bird to your mountain?",
      "significance": "This verse highlights the psalmist’s unwavering trust in God despite counsel to escape danger."
    },
    {
      "reference": "Psalms 11:4",
      "text": "The LORD is in his holy temple, the LORD'S throne is in heaven: his eyes behold, his eyelids try, the children of men.",
      "significance": "It emphasizes God’s sovereign oversight and His active examination of human hearts."
    },
    {
      "reference": "Psalms 11:7",
      "text": "For the righteous LORD loveth righteousness; his countenance doth behold the upright.",
      "significance": "This verse affirms God’s love for righteousness and His favor toward those who live uprightly."
    }
  ]
}