{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 97,
  "title": "The LORD Reigns",
  "shortSummary": "Psalm 97 proclaims the sovereign reign of the LORD over all the earth, emphasizing His holiness, justice, and power. The psalm calls for rejoicing among the nations and righteous worship of God alone, contrasting the futility of idolatry with the security and joy found in the LORD.",
  "timeline": "Traditional attribution to King David, c. 1000 BC",
  "keyCharacters": [
    {
      "name": "The LORD",
      "description": "The sovereign God who reigns over all the earth, displaying righteousness, justice, and power throughout the psalm."
    },
    {
      "name": "Zion",
      "description": "Personified as the city of God, representing God's people who rejoice in His righteous judgments."
    },
    {
      "name": "Daughters of Judah",
      "description": "Symbolic of the people of Judah who celebrate the LORD’s righteous rule and judgments."
    }
  ],
  "definitions": [
    {
      "term": "Graven images",
      "definition": "Carved idols or statues worshiped as gods, which the psalm condemns as false and powerless."
    },
    {
      "term": "Judgments",
      "definition": "God’s righteous decisions and actions that demonstrate His justice and holiness."
    },
    {
      "term": "Saints",
      "definition": "Believers who are set apart for God, preserved and delivered by Him from evil."
    },
    {
      "term": "Light sown",
      "definition": "A metaphor for blessings, guidance, and joy given to the righteous by God."
    }
  ],
  "outline": [
    {
      "heading": "The LORD’s Sovereign Reign and Power",
      "verseRange": "Psalms 97:1-5",
      "description": "This section declares the LORD’s reign over the earth, describing His majestic presence with clouds, fire, and lightning that cause the earth to tremble and hills to melt, emphasizing His overwhelming power and holiness."
    },
    {
      "heading": "The Heavens and Earth Declare God’s Righteousness",
      "verseRange": "Psalms 97:6-9",
      "description": "The heavens proclaim God’s righteousness and glory, while the psalm contrasts the futility of idol worship with the exaltation of the LORD above all gods, calling all ‘gods’ to worship Him."
    },
    {
      "heading": "The Righteous Rejoice in the LORD",
      "verseRange": "Psalms 97:10-12",
      "description": "The psalm concludes by exhorting those who love the LORD to hate evil, rejoice in His holiness, and receive the light and gladness He provides to the upright in heart."
    }
  ],
  "application": [
    "Recognize and submit to the LORD’s sovereign reign in every area of life, rejoicing in His power and justice.",
    "Reject all forms of idolatry and false worship, committing to worship God alone in spirit and truth.",
    "Cultivate a hatred of evil and a love for the LORD, trusting Him to preserve and deliver His people.",
    "Rejoice regularly in God’s holiness and give thanks for His righteous judgments that bring justice and peace."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 97:1",
      "text": "The LORD reigneth; let the earth rejoice; let the multitude of isles be glad thereof.",
      "significance": "This verse sets the tone of the psalm, affirming God's sovereign reign and calling all creation to rejoice in His rule."
    },
    {
      "reference": "Psalms 97:7",
      "text": "Confounded be all they that serve graven images, that boast themselves of idols: worship him, all ye gods.",
      "significance": "It highlights the futility of idol worship and calls even false gods to worship the one true God, emphasizing His supremacy."
    },
    {
      "reference": "Psalms 97:10",
      "text": "Ye that love the LORD, hate evil: he preserveth the souls of his saints; he delivereth them out of the hand of the wicked.",
      "significance": "This verse encourages believers to live in holiness and trust God’s protection and deliverance."
    },
    {
      "reference": "Psalms 97:12",
      "text": "Rejoice in the LORD, ye righteous; and give thanks at the remembrance of his holiness.",
      "significance": "A closing exhortation to the righteous to rejoice and give thanks, focusing on God’s holiness as the foundation of their joy."
    }
  ]
}