{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 98,
  "title": "A New Song of Praise",
  "shortSummary": "Psalm 98 is a joyful call to worship God for His marvelous deeds, especially His salvation and righteous judgment. It invites all creation to celebrate the Lord’s victory and His coming righteous judgment over the earth.",
  "timeline": "c. 1000 BC - United Monarchy period, traditionally attributed to King David",
  "keyCharacters": [
    {
      "name": "The LORD",
      "description": "The sovereign God who has accomplished salvation and righteous judgment, the central figure of praise in this psalm."
    }
  ],
  "definitions": [
    {
      "term": "New Song",
      "definition": "A fresh, inspired song of praise celebrating God's recent acts of salvation and victory."
    },
    {
      "term": "Right Hand",
      "definition": "A biblical symbol of power and authority, representing God's mighty acts and intervention."
    },
    {
      "term": "Cornet",
      "definition": "A brass wind instrument used in ancient Israelite worship to announce joyful occasions and praise."
    },
    {
      "term": "Judge",
      "definition": "One who executes justice; here referring to God’s role in righteous and equitable judgment of the earth."
    }
  ],
  "outline": [
    {
      "heading": "Call to Sing a New Song for God’s Victory",
      "verseRange": "Psalms 98:1-3",
      "description": "The psalm opens with a call to sing a new song because of God’s marvelous deeds, highlighting His salvation, righteousness, mercy, and faithfulness revealed to all nations."
    },
    {
      "heading": "Invitation to Joyful Praise",
      "verseRange": "Psalms 98:4-6",
      "description": "All the earth is invited to rejoice and make a joyful noise with music and singing, using instruments like the harp, trumpet, and cornet to honor the Lord, the King."
    },
    {
      "heading": "Creation Joins in Praise",
      "verseRange": "Psalms 98:7-8",
      "description": "The psalmist poetically calls on the sea, floods, and hills to join in joyful praise, emphasizing that all creation recognizes God’s glory."
    },
    {
      "heading": "The Lord’s Coming Judgment",
      "verseRange": "Psalms 98:9",
      "description": "The psalm concludes with a declaration of God’s coming righteous judgment over the earth, affirming His justice and equity over all peoples."
    }
  ],
  "application": [
    "Regularly offer God new songs of praise that reflect His ongoing work in your life and the world.",
    "Engage in joyful worship using all means available—singing, instruments, and heartfelt celebration—as an expression of gratitude to God.",
    "Recognize and honor God’s sovereign authority as the righteous judge who will one day bring justice to all the earth.",
    "Allow the truth of God’s mercy and faithfulness to inspire confidence and hope in your daily walk of faith."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 98:1",
      "text": "O sing unto the LORD a new song; for he hath done marvellous things: his right hand, and his holy arm, hath gotten him the victory.",
      "significance": "This verse sets the tone of the psalm, emphasizing God’s mighty acts and the call to respond with fresh praise."
    },
    {
      "reference": "Psalms 98:4",
      "text": "Make a joyful noise unto the LORD, all the earth: make a loud noise, and rejoice, and sing praise.",
      "significance": "It highlights the universal call for all creation to actively participate in joyful worship."
    },
    {
      "reference": "Psalms 98:9",
      "text": "Before the LORD; for he cometh to judge the earth: with righteousness shall he judge the world, and the people with equity.",
      "significance": "This verse reminds believers of God’s future righteous judgment, encouraging reverence and trust in His justice."
    }
  ]
}