{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 20,
  "title": "Prayer for the King",
  "shortSummary": "Psalm 20 is a prayer of intercession and confidence in God's protection over the king in times of trouble. It expresses trust in the Lord rather than in human strength, affirming God's power to save and bless according to His will.",
  "timeline": "c. 1000 BC - Reign of King David",
  "keyCharacters": [
    {
      "name": "David",
      "description": "The author of the psalm, king of Israel, who prays for God's protection and blessing upon the king."
    },
    {
      "name": "The King",
      "description": "The anointed leader of Israel for whom the psalm is prayed, representing God's chosen ruler."
    }
  ],
  "definitions": [
    {
      "term": "Selah",
      "definition": "A Hebrew term found in the Psalms, likely indicating a pause for contemplation or musical interlude."
    },
    {
      "term": "Anointed",
      "definition": "A person chosen and consecrated by God, often referring to kings or priests set apart for divine service."
    },
    {
      "term": "Sanctuary",
      "definition": "The holy place where God’s presence dwells, often referring to the tabernacle or temple in Jerusalem."
    },
    {
      "term": "Banners",
      "definition": "Flags or standards used in battle to represent a people or cause, symbolizing victory and identity."
    }
  ],
  "outline": [
    {
      "heading": "Prayer for God's Help and Protection",
      "verseRange": "Psalms 20:1-3",
      "description": "David petitions God to hear in times of trouble, send help from His sanctuary, and accept the offerings presented, emphasizing reliance on divine aid."
    },
    {
      "heading": "Petition for Fulfillment of Desires",
      "verseRange": "Psalms 20:4-5",
      "description": "The psalmist asks God to grant the king’s heart’s desires and fulfill his plans, expressing communal rejoicing in salvation and confidence in God’s provision."
    },
    {
      "heading": "Confidence in God’s Saving Power",
      "verseRange": "Psalms 20:6-7",
      "description": "Affirmation that the Lord saves His anointed and hears from heaven, contrasting trust in God with trust in military strength."
    },
    {
      "heading": "Victory and Prayer for Salvation",
      "verseRange": "Psalms 20:8-9",
      "description": "Declaration of triumph over enemies through God’s help, concluding with a plea for the Lord to save and hear the king’s call."
    }
  ],
  "application": [
    "Trust God in times of trouble rather than relying on human strength or resources.",
    "Pray earnestly for leaders, asking God to grant them wisdom and success according to His will.",
    "Rejoice in the salvation God provides and publicly acknowledge His power in your life.",
    "Remember that true victory comes from God’s saving strength, encouraging steadfast faith."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 20:7",
      "text": "Some trust in chariots, and some in horses: but we will remember the name of the LORD our God.",
      "significance": "This verse highlights the contrast between trusting in human power and trusting in God, a central theme of the psalm."
    },
    {
      "reference": "Psalms 20:6",
      "text": "Now know I that the LORD saveth his anointed; he will hear him from his holy heaven with the saving strength of his right hand.",
      "significance": "It affirms God’s faithfulness to save His chosen king, assuring believers of God’s attentive and powerful care."
    },
    {
      "reference": "Psalms 20:9",
      "text": "Save, LORD: let the king hear us when we call.",
      "significance": "A final plea for divine salvation and an expression of communal prayer for the king’s deliverance."
    }
  ]
}