{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 96,
  "title": "A New Song of Praise",
  "shortSummary": "Psalm 96 calls all the earth to sing a new song of worship to the LORD, declaring His glory and sovereignty over all nations and idols. It emphasizes God’s greatness, righteous judgment, and the universal call to worship Him in holiness and truth.",
  "timeline": "c. 1000 BC - United Monarchy period, traditionally attributed to David",
  "keyCharacters": [
    {
      "name": "The LORD",
      "description": "The sovereign God of Israel, creator of the heavens, worthy of all praise and worship."
    },
    {
      "name": "The Heathen (Nations)",
      "description": "The non-Israelite peoples among whom God’s glory and salvation are to be declared."
    }
  ],
  "definitions": [
    {
      "term": "New Song",
      "definition": "A fresh, heartfelt expression of praise to God, often signifying a renewed experience of His salvation and greatness."
    },
    {
      "term": "Heathen",
      "definition": "Gentile nations or peoples who do not know the true God, often worshipping idols."
    },
    {
      "term": "Idols",
      "definition": "Man-made objects or images worshipped as gods, which are powerless compared to the true God."
    },
    {
      "term": "Beauty of Holiness",
      "definition": "The pure and reverent worship due to God, reflecting His holiness and majesty."
    }
  ],
  "outline": [
    {
      "heading": "Call to Praise the LORD with a New Song",
      "verseRange": "Psalms 96:1-3",
      "description": "The psalmist invites all the earth to sing a new song to the LORD, proclaiming His salvation and declaring His glory among all nations."
    },
    {
      "heading": "The LORD’s Supremacy Over False Gods",
      "verseRange": "Psalms 96:4-6",
      "description": "God is exalted as great and worthy of fear above all idols, for He alone created the heavens and is surrounded by honor and majesty."
    },
    {
      "heading": "Call to Worship and Offering",
      "verseRange": "Psalms 96:7-9",
      "description": "All peoples are urged to give glory and strength to the LORD, bringing offerings and worshiping Him in holiness and reverence."
    },
    {
      "heading": "Proclamation of God’s Reign and Judgment",
      "verseRange": "Psalms 96:10-13",
      "description": "The psalm declares the LORD’s reign over the nations, His establishment of the world, and His righteous judgment, causing all creation to rejoice."
    }
  ],
  "application": [
    "Regularly offer new and heartfelt praise to God, recognizing His ongoing work in your life and the world.",
    "Reject all forms of idolatry by affirming God’s unique sovereignty as Creator and Judge.",
    "Approach worship with reverence and holiness, giving God the glory and honor He deserves.",
    "Trust in God’s righteous judgment and reign, finding peace in His sovereign control over all creation."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 96:1",
      "text": "O sing unto the LORD a new song: sing unto the LORD, all the earth.",
      "significance": "This verse sets the tone for the entire psalm, calling all creation to a fresh and joyful worship of God."
    },
    {
      "reference": "Psalms 96:4",
      "text": "For the LORD is great, and greatly to be praised: he is to be feared above all gods.",
      "significance": "It affirms God’s unmatched greatness and the proper reverence due to Him above all false gods."
    },
    {
      "reference": "Psalms 96:10",
      "text": "Say among the heathen that the LORD reigneth: the world also shall be established that it shall not be moved: he shall judge the people righteously.",
      "significance": "This verse proclaims God’s sovereign reign and righteous judgment, assuring stability and justice under His rule."
    },
    {
      "reference": "Psalms 96:13",
      "text": "Before the LORD: for he cometh, for he cometh to judge the earth: he shall judge the world with righteousness, and the people with his truth.",
      "significance": "It emphasizes the certainty of God’s coming judgment, encouraging believers to live in truth and righteousness."
    }
  ]
}