{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 123,
  "title": "A Prayer for Mercy",
  "shortSummary": "Psalm 123 is a heartfelt prayer expressing dependence on God’s mercy amid contempt and scorn from the proud and those at ease. The psalmist lifts his eyes to the Lord in humble expectation, illustrating a posture of trust and patient waiting for divine compassion.",
  "timeline": "c. 1000 BC - United Monarchy period, traditionally attributed to King David",
  "keyCharacters": [
    {
      "name": "The Psalmist",
      "description": "The author who lifts his eyes to God, expressing deep reliance on the Lord’s mercy in the face of contempt."
    },
    {
      "name": "The Proud and Those at Ease",
      "description": "Oppressors or arrogant individuals who scorn and show contempt toward the psalmist and his people."
    }
  ],
  "definitions": [
    {
      "term": "A Song of degrees",
      "definition": "A type of psalm sung by pilgrims ascending to Jerusalem, often expressing trust and worship during a journey."
    },
    {
      "term": "Contempt",
      "definition": "Disdain or scornful disrespect, reflecting deep rejection or dishonor."
    },
    {
      "term": "Scorning",
      "definition": "Mocking or deriding with contempt, showing disdainful rejection."
    },
    {
      "term": "At ease",
      "definition": "Those who live in comfort and security, often indifferent or prideful toward the suffering of others."
    }
  ],
  "outline": [
    {
      "heading": "Lifting Eyes to God in Heaven",
      "verseRange": "Psalms 123:1",
      "description": "The psalmist begins by directing his gaze upward to God who dwells in heaven, signifying dependence on divine help and recognition of God's sovereign position."
    },
    {
      "heading": "Waiting Expectantly for Mercy",
      "verseRange": "Psalms 123:2",
      "description": "Using vivid imagery of servants and maidens looking to their masters, the psalmist illustrates a posture of hopeful waiting and trust in God’s mercy."
    },
    {
      "heading": "A Plea for Mercy Amid Contempt",
      "verseRange": "Psalms 123:3",
      "description": "The psalmist urgently petitions God for mercy, acknowledging the overwhelming contempt they face and their desperate need for divine compassion."
    },
    {
      "heading": "The Burden of Scorn from the Proud",
      "verseRange": "Psalms 123:4",
      "description": "The psalmist describes the soul’s heavy burden caused by the mocking and disdain of those who live in ease and pride, emphasizing the emotional and spiritual distress."
    }
  ],
  "application": [
    "In times of difficulty or rejection, lift your eyes to God in humble dependence, trusting in His sovereign care.",
    "Cultivate a patient and expectant attitude in prayer, waiting on the Lord’s mercy without despair.",
    "Recognize that contempt and scorn from others are opportunities to deepen reliance on God rather than on human approval.",
    "Respond to pride and mockery with prayer and humility, seeking God’s help to endure and overcome."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 123:1",
      "text": "Unto thee lift I up mine eyes, O thou that dwellest in the heavens.",
      "significance": "This verse sets the tone of the psalm, emphasizing the believer’s focus on God as the source of help and hope."
    },
    {
      "reference": "Psalms 123:2",
      "text": "Behold, as the eyes of servants look unto the hand of their masters, and as the eyes of a maiden unto the hand of her mistress; so our eyes wait upon the LORD our God, until that he have mercy upon us.",
      "significance": "It powerfully illustrates the posture of expectant trust and dependence on God’s mercy."
    },
    {
      "reference": "Psalms 123:3",
      "text": "Have mercy upon us, O LORD, have mercy upon us: for we are exceedingly filled with contempt.",
      "significance": "A heartfelt plea that reveals the psalmist’s deep need for God’s compassion amid overwhelming rejection."
    }
  ]
}