{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 82,
  "title": "God's Judgment on Earthly Judges",
  "shortSummary": "Psalm 82 is a prophetic psalm where God stands in judgment over earthly rulers and judges who have failed to administer justice. It calls for the defense of the weak and pronounces the eventual downfall of unjust leaders, while affirming God's ultimate sovereignty over all nations.",
  "timeline": "c. 10th century BC - Period of the United Monarchy or early divided kingdom, attributed to Asaph, a Levitical singer during the reign of David or Solomon",
  "keyCharacters": [
    {
      "name": "God",
      "description": "The supreme Judge who stands in the assembly of the mighty and pronounces judgment on unjust earthly rulers."
    },
    {
      "name": "Earthly Judges ('gods')",
      "description": "Human rulers or judges who are called 'gods' due to their authority but are rebuked for their failure to judge justly."
    },
    {
      "name": "The Poor and Needy",
      "description": "The vulnerable groups whom the judges are commanded to defend and deliver from oppression."
    }
  ],
  "definitions": [
    {
      "term": "Selah",
      "definition": "A liturgical or musical term used in the Psalms, possibly indicating a pause for reflection."
    },
    {
      "term": "Gods",
      "definition": "In this context, a title for human judges or rulers who exercise divine authority on earth but are accountable to the true God."
    },
    {
      "term": "Congregation of the mighty",
      "definition": "The assembly or council of powerful beings or rulers before whom God presides as judge."
    },
    {
      "term": "Foundations of the earth",
      "definition": "A poetic expression referring to the established order and justice upon which society rests."
    }
  ],
  "outline": [
    {
      "heading": "God's Judgment Among the Mighty",
      "verseRange": "Psalms 82:1",
      "description": "God is depicted standing in the assembly of the mighty, judging among the 'gods'—earthly rulers who hold authority but are subject to His judgment."
    },
    {
      "heading": "Rebuke of Unjust Judges",
      "verseRange": "Psalms 82:2-4",
      "description": "God challenges the judges for their unjust decisions and partiality toward the wicked, commanding them to defend and deliver the poor and needy."
    },
    {
      "heading": "Warning of Ignorance and Impending Death",
      "verseRange": "Psalms 82:5-7",
      "description": "The judges are condemned for their ignorance and failure to understand, resulting in chaos; despite their exalted status, they will die like mere men."
    },
    {
      "heading": "Prayer for God's Universal Judgment",
      "verseRange": "Psalms 82:8",
      "description": "The psalm concludes with a plea for God to rise up and judge the earth, affirming His ultimate authority and inheritance of all nations."
    }
  ],
  "application": [
    "Recognize that all earthly authority is accountable to God and must be exercised with justice and integrity.",
    "Commit to praying for leaders and judges to govern righteously and defend the vulnerable.",
    "Understand the seriousness of partiality and injustice, and strive to act justly in all relationships.",
    "Trust in God's ultimate sovereignty and judgment over all nations and rulers."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 82:1",
      "text": "God standeth in the congregation of the mighty; he judgeth among the gods.",
      "significance": "This verse establishes God's supreme authority over earthly rulers and sets the tone for the psalm's message of divine judgment."
    },
    {
      "reference": "Psalms 82:3",
      "text": "Defend the poor and fatherless: do justice to the afflicted and needy.",
      "significance": "A clear command emphasizing the responsibility of leaders to protect and provide justice for society's most vulnerable."
    },
    {
      "reference": "Psalms 82:6",
      "text": "I have said, Ye are gods; and all of you are children of the most High.",
      "significance": "This verse highlights the elevated role of judges as God's representatives, underscoring their accountability despite their human mortality."
    },
    {
      "reference": "Psalms 82:8",
      "text": "Arise, O God, judge the earth: for thou shalt inherit all nations.",
      "significance": "A concluding prayer affirming God's ultimate dominion and the certainty of His righteous judgment over all the earth."
    }
  ]
}