{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 90,
  "title": "God's Eternity and Human Frailty",
  "shortSummary": "Psalm 90, a prayer of Moses, contrasts the eternal nature of God with the fleeting, fragile life of humanity. It calls believers to wisdom in numbering their days and seeking God's mercy amid the reality of sin, judgment, and the brevity of life.",
  "timeline": "c. 1446 BC - Time of Moses during the wilderness wanderings after the Exodus",
  "keyCharacters": [
    {
      "name": "Moses",
      "description": "The author of this psalm, a prophet and leader of Israel, who prays to God reflecting on human mortality and divine eternity."
    },
    {
      "name": "Children of men",
      "description": "A poetic term referring to all humanity, emphasizing human frailty and mortality in contrast to God’s eternal nature."
    }
  ],
  "definitions": [
    {
      "term": "Dwelling place",
      "definition": "A metaphor for God’s protection and refuge, indicating a place of safety and permanence."
    },
    {
      "term": "Everlasting",
      "definition": "Without beginning or end; eternal, describing God's nature as timeless and unchanging."
    },
    {
      "term": "Number our days",
      "definition": "To recognize the brevity of life and live with wisdom and purpose accordingly."
    },
    {
      "term": "Wrath",
      "definition": "God’s righteous anger against sin, which brings conviction and judgment."
    }
  ],
  "outline": [
    {
      "heading": "God’s Eternal Nature and Human Mortality",
      "verseRange": "Psalms 90:1-6",
      "description": "Moses begins by praising God as the eternal refuge, existing before creation. He contrasts this with human life’s transience, likening it to grass that flourishes briefly and then withers."
    },
    {
      "heading": "The Reality of Sin and Divine Judgment",
      "verseRange": "Psalms 90:7-11",
      "description": "The psalmist acknowledges that human sin provokes God’s anger, which leads to suffering and the swift passing of life. This section highlights the seriousness of sin and the power of God’s wrath."
    },
    {
      "heading": "A Prayer for Wisdom and Mercy",
      "verseRange": "Psalms 90:12-17",
      "description": "Moses petitions God to teach His people to live wisely by understanding life’s brevity, to show mercy, and to bless their work. The psalm closes with a plea for God’s favor and the establishment of their labors."
    }
  ],
  "application": [
    "Recognize the brevity of life and seek to live each day with eternal perspective and godly wisdom.",
    "Approach God humbly in prayer, asking for mercy and forgiveness for sin that provokes His righteous anger.",
    "Trust in God as your eternal refuge and foundation amid life’s uncertainties and trials.",
    "Commit your daily work and efforts to the Lord, asking Him to establish and bless them for His glory."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 90:2",
      "text": "Before the mountains were brought forth, or ever thou hadst formed the earth and the world, even from everlasting to everlasting, thou art God.",
      "significance": "This verse powerfully affirms God’s eternal existence and sovereignty over all creation."
    },
    {
      "reference": "Psalms 90:12",
      "text": "So teach us to number our days, that we may apply our hearts unto wisdom.",
      "significance": "It calls believers to live wisely by recognizing life’s limited time and focusing on what truly matters."
    },
    {
      "reference": "Psalms 90:10",
      "text": "The days of our years are threescore years and ten; and if by reason of strength they be fourscore years, yet is their strength labour and sorrow; for it is soon cut off, and we fly away.",
      "significance": "This verse reminds us of human mortality and the inevitability of death, urging dependence on God."
    },
    {
      "reference": "Psalms 90:17",
      "text": "And let the beauty of the LORD our God be upon us: and establish thou the work of our hands upon us; yea, the work of our hands establish thou it.",
      "significance": "A closing plea for God’s blessing and presence to be evident in the lives and labors of His people."
    }
  ]
}