{
  "book": "psalms",
  "bookName": "Psalms",
  "chapter": 58,
  "title": "Judgment on the Wicked",
  "shortSummary": "Psalm 58 is a bold imprecation against unjust rulers and wicked men who pervert justice and practice deceit from birth. David calls upon God to break the power of the wicked and vindicate the righteous, affirming that God is the ultimate judge who rewards righteousness on earth.",
  "timeline": "c. 1000 BC - Reign of King David",
  "keyCharacters": [
    {
      "name": "David",
      "description": "The psalmist and king of Israel who authors this imprecatory psalm, pleading for divine justice against corrupt judges and wicked men."
    },
    {
      "name": "Sons of men",
      "description": "Refers to human judges or rulers addressed in the psalm who are accused of unjust judgment and wickedness."
    }
  ],
  "definitions": [
    {
      "term": "Altaschith",
      "definition": "A Hebrew musical term meaning 'Do Not Destroy,' indicating the style or tune to which this psalm was to be sung."
    },
    {
      "term": "Michtam",
      "definition": "A term of uncertain meaning, possibly denoting a golden or precious poem, suggesting the psalm's special significance."
    },
    {
      "term": "Charmers",
      "definition": "Those who use enchantments or incantations; here symbolizing futile attempts to persuade or control the wicked."
    },
    {
      "term": "Imprecatory Psalm",
      "definition": "A type of psalm that calls for God's judgment or curses upon the wicked, expressing righteous anger and desire for justice."
    }
  ],
  "outline": [
    {
      "heading": "Accusation of Unjust Judges",
      "verseRange": "Psalms 58:1-3",
      "description": "David challenges the congregation and judges, questioning their righteousness and exposing their inherent wickedness and deceit from birth, highlighting the deep corruption in human justice."
    },
    {
      "heading": "Description of the Wicked’s Nature",
      "verseRange": "Psalms 58:4-5",
      "description": "The psalmist likens the wicked to venomous serpents and deaf adders who refuse to listen to wise counsel, emphasizing their stubbornness and spiritual blindness."
    },
    {
      "heading": "Prayer for Divine Judgment",
      "verseRange": "Psalms 58:6-9",
      "description": "David petitions God to break the power of the wicked, using vivid imagery of destruction and dissolution to depict their complete downfall by divine wrath."
    },
    {
      "heading": "Vindication and Reward of the Righteous",
      "verseRange": "Psalms 58:10-11",
      "description": "The psalm concludes with the assurance that the righteous will rejoice in God's justice, affirming that God truly judges the earth and rewards those who live uprightly."
    }
  ],
  "application": [
    "Examine your own heart to ensure that your judgments and actions are righteous and not influenced by wickedness or partiality.",
    "Trust in God’s ultimate justice when facing corrupt authorities or injustice, knowing He will vindicate the righteous in His perfect timing.",
    "Pray earnestly for God to break the power of evil and uphold truth and righteousness in society and the church.",
    "Rejoice and find encouragement in the certainty that God judges the earth and rewards those who faithfully follow Him."
  ],
  "keyVerses": [
    {
      "reference": "Psalms 58:3",
      "text": "The wicked are estranged from the womb: they go astray as soon as they be born, speaking lies.",
      "significance": "This verse highlights the innate sinful nature of mankind and the deep-rooted corruption that affects human justice."
    },
    {
      "reference": "Psalms 58:6",
      "text": "Break their teeth, O God, in their mouth: break out the great teeth of the young lions, O LORD.",
      "significance": "A powerful plea for God to neutralize the destructive power of the wicked, symbolized by the breaking of their teeth."
    },
    {
      "reference": "Psalms 58:10",
      "text": "The righteous shall rejoice when he seeth the vengeance: he shall wash his feet in the blood of the wicked.",
      "significance": "This verse affirms the joy and vindication the righteous will experience when God executes justice against evil."
    },
    {
      "reference": "Psalms 58:11",
      "text": "So that a man shall say, Verily there is a reward for the righteous: verily he is a God that judgeth in the earth.",
      "significance": "It concludes with a confident declaration that God is the righteous judge who rewards those who live uprightly."
    }
  ]
}