{
  "book": "zechariah",
  "bookName": "Zechariah",
  "chapter": 11,
  "title": "The Broken Shepherd",
  "shortSummary": "Zechariah 11 depicts a prophetic vision of judgment upon Israel through the imagery of a shepherd caring for a flock destined for slaughter. The chapter highlights the failure of Israel’s leaders, the breaking of covenants, and the coming of a foolish shepherd who will exploit the people, emphasizing God’s sovereign discipline and the consequences of unfaithfulness.",
  "timeline": "c. 520 BC - Post-exilic period during the prophetic ministry of Zechariah",
  "keyCharacters": [
    {
      "name": "Zechariah",
      "description": "The prophet receiving and delivering God's message through symbolic actions and visions."
    },
    {
      "name": "The Shepherd",
      "description": "A symbolic figure representing leadership over Israel, whose failure and rejection bring judgment."
    },
    {
      "name": "The Poor of the Flock",
      "description": "Faithful remnant of Israel who recognize the word of the LORD and suffer under corrupt leadership."
    }
  ],
  "definitions": [
    {
      "term": "Shepherd",
      "definition": "A leader or ruler responsible for guiding and caring for God's people, often used metaphorically in Scripture."
    },
    {
      "term": "Bands",
      "definition": "A staff used to bind or unite, symbolizing the covenant or brotherhood between Judah and Israel."
    },
    {
      "term": "Beauty",
      "definition": "The name of one of the staffs representing God's covenant and favor toward His people."
    },
    {
      "term": "Thirty pieces of silver",
      "definition": "The price paid to betray Jesus, here symbolizing the undervaluing and rejection of God's shepherd."
    }
  ],
  "outline": [
    {
      "heading": "Judgment on Lebanon and the Forest (Verses 1-3)",
      "verseRange": "Zechariah 11:1-3",
      "description": "The chapter opens with a lament over Lebanon’s cedars and the forest, symbolizing the destruction of the mighty and the leaders of Israel, setting the tone of divine judgment."
    },
    {
      "heading": "God’s Command to Feed the Flock of Slaughter (Verses 4-6)",
      "verseRange": "Zechariah 11:4-6",
      "description": "God instructs Zechariah to shepherd a doomed flock whose owners exploit them without guilt, highlighting the failure of Israel’s leaders and impending judgment through foreign oppression."
    },
    {
      "heading": "The Two Staffs and the Broken Covenant (Verses 7-14)",
      "verseRange": "Zechariah 11:7-14",
      "description": "Zechariah takes two staffs named Beauty and Bands, symbolizing God’s covenant and unity, then breaks them to signify the breaking of the covenant and the division between Judah and Israel."
    },
    {
      "heading": "The Foolish Shepherd and Coming Woe (Verses 15-17)",
      "verseRange": "Zechariah 11:15-17",
      "description": "God raises a foolish shepherd who will exploit and neglect the flock, bringing woe and judgment upon the leaders who fail their responsibilities."
    }
  ],
  "application": [
    "Trust in God’s sovereign care even when leadership fails, remembering He ultimately shepherds His people.",
    "Recognize the seriousness of covenant faithfulness and the consequences of breaking God’s commands.",
    "Be discerning of leaders and shepherds, praying for godly leadership that seeks to heal and feed the flock.",
    "Respond to God’s discipline with repentance and renewed commitment to follow Him faithfully."
  ],
  "keyVerses": [
    {
      "reference": "Zechariah 11:4",
      "text": "Thus saith the LORD my God; Feed the flock of the slaughter;",
      "significance": "This verse reveals God's call to shepherd a doomed people, emphasizing His sovereign control even amid judgment."
    },
    {
      "reference": "Zechariah 11:12",
      "text": "And I said unto them, If ye think good, give me my price; and if not, forbear. So they weighed for my price thirty pieces of silver.",
      "significance": "This verse prophetically foreshadows the betrayal of Christ for thirty pieces of silver, highlighting the rejection of God's true shepherd."
    },
    {
      "reference": "Zechariah 11:14",
      "text": "Then I cut asunder mine other staff, even Bands, that I might break the brotherhood between Judah and Israel.",
      "significance": "This act symbolizes the breaking of unity between the northern and southern kingdoms, illustrating the consequences of disobedience."
    },
    {
      "reference": "Zechariah 11:17",
      "text": "Woe to the idol shepherd that leaveth the flock! the sword shall be upon his arm, and upon his right eye: his arm shall be clean dried up, and his right eye shall be utterly darkened.",
      "significance": "This verse pronounces judgment on unfaithful leaders who abandon their responsibilities, warning of divine retribution."
    }
  ]
}