{
  "The Church": {
    "description": "The body of Christ, the community of all believers",
    "overview": "<p class=\"intro-text\"><span class=\"newthought\">The church constitutes</span> God's new covenant community, comprised of all who have been redeemed by Christ's blood and regenerated by His Spirit. The Greek word <em>ekklesia</em> means \"called out ones\"—those whom God has summoned from darkness into His marvelous light. The church exists both universally (all believers everywhere) and locally (visible congregations in specific places).</p>\n\n<p class=\"intro-text\">Scripture employs rich metaphors to describe the church. It is <strong>Christ's body</strong>, with Jesus as Head and believers as interdependent members (1 Corinthians 12). It is <strong>God's temple</strong>, a spiritual house where the Holy Spirit dwells (Ephesians 2:21-22). It is <strong>Christ's bride</strong>, loved and purified by Him for presentation in splendor (Ephesians 5:25-27). It is <strong>God's family</strong>, with believers as brothers and sisters adopted by the Father (Galatians 3:26).</p>\n\n<p class=\"intro-text\">Christ established the church and promised that the gates of hell would not prevail against it (Matthew 16:18). He gave the church its ordinances (baptism and the Lord's Supper), its mission (making disciples of all nations), its leaders (pastors, elders, deacons), and its spiritual gifts for mutual edification. The church is not a human organization but a divine organism, though it takes organizational form in local expressions.</p>\n\n<p class=\"intro-text\">Active participation in a local church is not optional for believers. Scripture commands us not to forsake assembling together (Hebrews 10:25) and describes Christians using one another to build up the body. Isolated Christianity contradicts biblical Christianity. The church, with all its imperfections, remains God's primary instrument for evangelism, discipleship, and displaying His glory to the world.</p>",
    "subtopics": {
      "Body of Christ": {
        "description": "The church as Christ's body",
        "verses": [
          {
            "ref": "1 Corinthians 12:27",
            "note": "Ye are the body of Christ"
          },
          {
            "ref": "Ephesians 1:22-23",
            "note": "Church, which is his body"
          },
          {
            "ref": "Colossians 1:18",
            "note": "Head of the body, the church"
          },
          {
            "ref": "Romans 12:5",
            "note": "One body in Christ"
          }
        ]
      },
      "Gathering Together": {
        "description": "The importance of assembly",
        "verses": [
          {
            "ref": "Hebrews 10:25",
            "note": "Not forsaking the assembling"
          },
          {
            "ref": "Matthew 18:20",
            "note": "Where two or three are gathered"
          },
          {
            "ref": "Acts 2:42",
            "note": "Continued steadfastly in fellowship"
          },
          {
            "ref": "1 Corinthians 14:26",
            "note": "When ye come together"
          }
        ]
      },
      "Christ's Love for the Church": {
        "description": "Jesus' devotion to His bride",
        "verses": [
          {
            "ref": "Ephesians 5:25",
            "note": "Christ loved the church"
          },
          {
            "ref": "Acts 20:28",
            "note": "Purchased with his own blood"
          },
          {
            "ref": "Ephesians 5:27",
            "note": "Present it to himself glorious"
          },
          {
            "ref": "Matthew 16:18",
            "note": "I will build my church"
          }
        ]
      }
    }
  }
}