{
  "catalog_entry": {
    "title": "The Attributes of God",
    "description": "The perfections of the divine nature",
    "slug": "attributes-of-god",
    "verses": [
      "Exodus 34:6-7",
      "Isaiah 6:3",
      "1 John 4:8",
      "Psalm 90:2"
    ]
  },
  "content": {
    "title": "The Attributes of God",
    "description": "The perfections of the divine nature",
    "sections": [
      {
        "title": "God's Self-Existence and Eternality",
        "verses": [
          "Exodus 3:14",
          "Psalm 90:2",
          "Isaiah 40:28",
          "Revelation 1:8"
        ],
        "content": "God alone exists of Himself, uncaused and self-sufficient, the source of all other existence. When Moses asked God's name, He replied, 'I AM THAT I AM'—the self-existent One who depends on nothing outside Himself.<br><br>Before the mountains were brought forth, or ever thou hadst formed the earth and the world, even from everlasting to everlasting, thou art God. The everlasting God, the LORD, the Creator of the ends of the earth, fainteth not, neither is weary.<br><br>'I am Alpha and Omega, the beginning and the ending, saith the Lord, which is, and which was, and which is to come, the Almighty.' God has no beginning, no ending, no succession of moments—He inhabits eternity, seeing all time as an eternal present. He does not grow, develop, or change.<br><br>All creation depends on Him; He depends on nothing. This truth humbles us—we are contingent beings, existing only because God sustains us moment by moment.<br><br>It provides stability—our unchanging God is the same yesterday, today, and forever. It offers hope—the eternal God will never fail, never tire, never cease to be."
      },
      {
        "title": "God's Omniscience and Wisdom",
        "verses": [
          "Psalm 147:5",
          "Isaiah 46:10",
          "Romans 11:33-34",
          "Hebrews 4:13"
        ],
        "content": "God possesses infinite knowledge—knowing all things actual and possible, past, present, and future, including the thoughts and intents of every heart. 'Great is our Lord, and of great power: his understanding is infinite.' He declares the end from the beginning, and from ancient times things not yet done.<br><br>O the depth of the riches both of the wisdom and knowledge of God! How unsearchable are his judgments, and his ways past finding out!<br><br>For who hath known the mind of the Lord? Neither is there any creature that is not manifest in his sight: but all things are naked and opened unto the eyes of him with whom we have to do.<br><br>God never learns, never discovers, never is surprised. His knowledge is intuitive, not acquired; complete, not partial; certain, not probable.<br><br>His wisdom perfectly applies His knowledge to accomplish His purposes by the best possible means. This truth warns us—nothing is hidden from God; all will be revealed.<br><br>It comforts us—God knows our needs before we ask, our sorrows before we weep, our situations completely. It humbles us—His thoughts are higher than our thoughts; we cannot comprehend His ways but can trust His wisdom."
      },
      {
        "title": "God's Omnipotence",
        "verses": [
          "Genesis 18:14",
          "Jeremiah 32:17",
          "Matthew 19:26",
          "Revelation 19:6"
        ],
        "content": "God is almighty—possessing infinite power to accomplish whatever He wills, with nothing too hard for Him. 'Is any thing too hard for the LORD?' Ah Lord GOD! behold, thou hast made the heaven and the earth by thy great power and stretched out arm, and there is nothing too hard for thee.<br><br>With God all things are possible. Alleluia: for the Lord God omnipotent reigneth.<br><br>God's power is unlimited in extent—He created all things from nothing by His word. It is unlimited in duration—He never grows weary or faint.<br><br>It is unlimited in application—no purpose of His can be thwarted. Yet God's power operates according to His nature; He cannot lie, cannot deny Himself, cannot be tempted with evil.<br><br>His power serves His wisdom and love. This truth encourages prayer—we ask an almighty God who can do exceeding abundantly above all we ask or think.<br><br>It strengthens faith—the same power that raised Christ from the dead works in us. It promotes worship—our God is the Creator, Sustainer, and Ruler of all things."
      },
      {
        "title": "God's Holiness",
        "verses": [
          "Isaiah 6:3",
          "Revelation 4:8",
          "1 Peter 1:15-16",
          "Habakkuk 1:13"
        ],
        "content": "Holiness is God's central attribute—His absolute purity, moral perfection, and infinite separation from all evil. The seraphim cry, 'Holy, holy, holy, is the LORD of hosts: the whole earth is full of his glory.' The four living creatures rest not day and night, saying, 'Holy, holy, holy, Lord God Almighty, which was, and is, and is to come.' As He which hath called you is holy, so be ye holy in all manner of conversation; because it is written, Be ye holy; for I am holy.<br><br>Thou art of purer eyes than to behold evil, and canst not look on iniquity. God's holiness is not merely the absence of evil but the infinite presence of moral beauty and perfection.<br><br>It is the attribute that qualifies all others—His love is holy love, His wrath is holy wrath, His justice is holy justice. This holiness both attracts (Isaiah fell at His feet in worship) and terrifies (Isaiah cried 'Woe is me!').<br><br>It demands our holiness—we are called to be holy as He is holy. It necessitates atonement—only Christ's sacrifice can bridge the infinite gap between holy God and sinful humanity."
      },
      {
        "title": "God's Justice and Wrath",
        "verses": [
          "Psalm 89:14",
          "Romans 2:5-6",
          "Nahum 1:2-3",
          "Deuteronomy 32:4"
        ],
        "content": "God is perfectly just—rendering to all their due, punishing sin, and rewarding righteousness without partiality or error. Justice and judgment are the habitation of His throne.<br><br>God will render to every man according to his deeds—there is no respect of persons with God. God is jealous, and the LORD revengeth; the LORD revengeth, and is furious; the LORD will take vengeance on his adversaries.<br><br>He is the Rock, his work is perfect: for all his ways are judgment: a God of truth and without iniquity, just and right is he. God's wrath is not capricious rage but holy indignation against sin—the necessary response of infinite holiness to moral evil.<br><br>His justice is not cruel severity but perfect righteousness. The cross displays both: God's justice demanded sin's punishment; God's love provided the substitute.<br><br>At Calvary, mercy and truth met together; righteousness and peace kissed each other. Understanding God's justice produces holy fear—sin will be punished.<br><br>It produces gratitude—Christ bore the wrath we deserved. It produces confidence—God will ultimately right every wrong."
      },
      {
        "title": "God's Love and Mercy",
        "verses": [
          "1 John 4:8",
          "Exodus 34:6-7",
          "Ephesians 2:4-5",
          "Lamentations 3:22-23"
        ],
        "content": "God is love—not merely loving, but love in His very essence, the source and standard of all true love. 'He that loveth not knoweth not God; for God is love.' The LORD passed before Moses and proclaimed, 'The LORD, The LORD God, merciful and gracious, longsuffering, and abundant in goodness and truth, keeping mercy for thousands, forgiving iniquity and transgression and sin.' God, who is rich in mercy, for his great love wherewith he loved us, even when we were dead in sins, hath quickened us together with Christ.<br><br>It is of the LORD's mercies that we are not consumed, because his compassions fail not. They are new every morning: great is thy faithfulness.<br><br>God's love is eternal—He loved us before the foundation of the world. It is unconditional—not based on our worthiness.<br><br>It is sacrificial—demonstrated supremely in Christ's death. It is effectual—accomplishing our salvation.<br><br>His mercy is His love toward the miserable; His grace is His love toward the undeserving. This love provides assurance—nothing can separate us from it.<br><br>It motivates obedience—we love Him because He first loved us. It compels worship—such love deserves our all."
      },
      {
        "title": "God's Immutability and Faithfulness",
        "verses": [
          "Malachi 3:6",
          "James 1:17",
          "Numbers 23:19",
          "2 Timothy 2:13"
        ],
        "content": "God is unchangeable in His being, perfections, purposes, and promises—the same yesterday, today, and forever. 'I am the LORD, I change not; therefore ye sons of Jacob are not consumed.' Every good gift and every perfect gift is from above, and cometh down from the Father of lights, with whom is no variableness, neither shadow of turning.<br><br>God is not a man, that he should lie; neither the son of man, that he should repent: hath he said, and shall he not do it? If we believe not, yet he abideth faithful: he cannot deny himself.<br><br>God does not grow, improve, decay, or develop—He is eternally the same in all His perfections. His purposes, established in eternity, will certainly be accomplished.<br><br>His promises, made to His people, will never fail. This immutability grounds our hope—the God who saved us will keep us.<br><br>It establishes assurance—His love will not waver, His commitment will not weaken. It demands consistency—we should reflect His faithfulness in our own commitments.<br><br>The unchanging God is our rock in a world of constant flux and disappointment."
      }
    ],
    "slug": "attributes-of-god"
  },
  "category": "Doctrinal Studies"
}