{
  "catalog_entry": {
    "title": "Covenant Theology",
    "description": "The covenants as the framework of redemptive history",
    "slug": "covenant-theology",
    "verses": [
      "Genesis 3:15",
      "Genesis 17:7",
      "Jeremiah 31:31-34",
      "Hebrews 8:6"
    ]
  },
  "content": {
    "title": "Covenant Theology",
    "description": "The covenants as the framework of redemptive history",
    "sections": [
      {
        "title": "What Is a Covenant?",
        "verses": [
          "Genesis 9:9-11",
          "Genesis 15:18",
          "Exodus 24:7-8",
          "Hebrews 9:15-17"
        ],
        "content": "A covenant is a solemn, binding agreement establishing a relationship with promises, conditions, and consequences—God's chosen means of relating to His people. God established His covenant with Noah, promising never again to destroy the earth with a flood.<br><br>The LORD made a covenant with Abram, promising land, seed, and blessing. Moses read the book of the covenant, and the people responded, 'All that the LORD hath said will we do, and be obedient.' Christ is the mediator of the new testament (covenant), that by means of death, they which are called might receive the promise of eternal inheritance.<br><br>Covenants involve parties (God and man), promises (what God pledges to do), stipulations (what man is required to do), signs (visible tokens like circumcision or baptism), and sanctions (blessings for obedience, curses for disobedience). Unlike contracts between equals, divine covenants are sovereignly administered by God, who sets the terms and graciously binds Himself to keep them.<br><br>Covenant is the unifying theme of Scripture—the Bible is organized into Old Covenant (Testament) and New Covenant, with God progressively revealing His redemptive purposes through successive covenants."
      },
      {
        "title": "The Covenant of Works",
        "verses": [
          "Genesis 2:16-17",
          "Hosea 6:7",
          "Romans 5:12-19",
          "1 Corinthians 15:22"
        ],
        "content": "God established a covenant with Adam in Eden, promising life upon obedience and death upon disobedience—Adam represented all humanity as their covenant head. 'Of every tree of the garden thou mayest freely eat: but of the tree of the knowledge of good and evil, thou shalt not eat of it: for in the day that thou eatest thereof thou shalt surely die.' Adam, like men, transgressed the covenant (Hosea 6:7, alternate reading).<br><br>By one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned. In Adam all die.<br><br>Adam stood as the federal (covenant) head of humanity—his obedience would have secured life for all; his disobedience brought death to all. The covenant of works established the principle that eternal life requires perfect obedience to God's law.<br><br>Since Adam failed, and in him all humanity failed, no one can now be justified by works—the law brings only condemnation to fallen sinners. This covenant demonstrates human inability and prepares for the gospel: Christ, the last Adam, succeeded where the first Adam failed, earning righteousness for His people through perfect obedience."
      },
      {
        "title": "The Covenant of Grace",
        "verses": [
          "Genesis 3:15",
          "Galatians 3:8",
          "Hebrews 13:20",
          "Romans 4:13-16"
        ],
        "content": "After the fall, God established the covenant of grace—promising salvation through faith in Christ, not through human works. The first gospel promise came immediately after the fall: 'I will put enmity between thee and the woman, and between thy seed and her seed; it shall bruise thy head, and thou shalt bruise his heel.' The Scripture, foreseeing that God would justify the heathen through faith, preached before the gospel unto Abraham.<br><br>The God of peace brought again from the dead our Lord Jesus, through the blood of the everlasting covenant. The promise is of faith, that it might be by grace; to the end the promise might be sure to all the seed.<br><br>The covenant of grace encompasses all God's saving dealings with humanity from the fall to the consummation. It is one covenant with various administrations—the substance remains constant (salvation by grace through faith in Christ), while the form develops through biblical history.<br><br>Adam, Noah, Abraham, Moses, David, and the New Covenant are not separate covenants of grace but progressive unfoldings of the one eternal covenant. Christ is the covenant's mediator, securing its promises by His blood."
      },
      {
        "title": "The Abrahamic Covenant",
        "verses": [
          "Genesis 12:1-3",
          "Genesis 17:7",
          "Galatians 3:16",
          "Galatians 3:29"
        ],
        "content": "God's covenant with Abraham established the pattern for all subsequent covenants—promising land, seed, and blessing to Abraham and his descendants. 'I will make of thee a great nation, and I will bless thee, and make thy name great; and thou shalt be a blessing: and in thee shall all families of the earth be blessed.' I will establish my covenant between me and thee and thy seed after thee in their generations for an everlasting covenant, to be a God unto thee, and to thy seed after thee.<br><br>Now to Abraham and his seed were the promises made. He saith not, And to seeds, as of many; but as of one, And to thy seed, which is Christ.<br><br>If ye be Christ's, then are ye Abraham's seed, and heirs according to the promise. The Abrahamic covenant promised: (1) numerous descendants, (2) the land of Canaan, (3) blessing to all nations through Abraham's seed.<br><br>Its ultimate fulfillment is in Christ, the true Seed, and in His church, Abraham's spiritual descendants. Circumcision was its sign, faith was its condition for receiving the promises, and its scope was universal—all families of the earth would be blessed."
      },
      {
        "title": "The Mosaic Covenant",
        "verses": [
          "Exodus 19:5-6",
          "Exodus 24:7-8",
          "Galatians 3:24",
          "Romans 10:4"
        ],
        "content": "God established a covenant with Israel at Sinai, giving the law to reveal His holiness, expose sin, and point to Christ. 'If ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people: for all the earth is mine: and ye shall be unto me a kingdom of priests, and an holy nation.' Moses took the blood and sprinkled it on the people, and said, Behold the blood of the covenant, which the LORD hath made with you concerning all these words.<br><br>The law was our schoolmaster to bring us unto Christ, that we might be justified by faith. Christ is the end (goal/termination) of the law for righteousness to every one that believeth.<br><br>The Mosaic covenant governed Israel as a nation—civil, ceremonial, and moral law. Its purpose was not to provide a way of salvation (no one is justified by law-keeping) but to reveal God's standards, expose human sinfulness, and point forward to Christ.<br><br>The sacrificial system pictured substitutionary atonement. The tabernacle pictured God dwelling with His people.<br><br>The law's demands, impossible to fulfill, drove sinners to seek grace. Christ fulfilled the law perfectly and abolished the ceremonial requirements, while the moral law remains as a guide for Christian living."
      },
      {
        "title": "The New Covenant",
        "verses": [
          "Jeremiah 31:31-34",
          "Hebrews 8:6-13",
          "Luke 22:20",
          "2 Corinthians 3:6"
        ],
        "content": "God promised a new covenant surpassing the old—writing His law on hearts, providing complete forgiveness, and granting intimate knowledge of Himself. 'Behold, the days come, saith the LORD, that I will make a new covenant with the house of Israel, and with the house of Judah: not according to the covenant that I made with their fathers...<br><br>I will put my law in their inward parts, and write it in their hearts; and will be their God, and they shall be my people... for I will forgive their iniquity, and I will remember their sin no more.' Christ is the mediator of a better covenant, established upon better promises. Jesus took the cup saying, 'This cup is the new testament in my blood, which is shed for you.' God hath made us able ministers of the new testament; not of the letter, but of the spirit: for the letter killeth, but the spirit giveth life.<br><br>The new covenant brings what the old could not: internal transformation, complete forgiveness, the Spirit's indwelling, and direct knowledge of God. Christ's blood ratified this covenant eternally.<br><br>Baptism and the Lord's Supper are its signs. The church—Jew and Gentile united in Christ—constitutes its covenant community."
      }
    ],
    "slug": "covenant-theology"
  },
  "category": "Doctrinal Studies"
}