{
  "catalog_entry": {
    "title": "Faith and Works",
    "description": "James and Paul reconciled",
    "slug": "faith-and-works",
    "verses": [
      "Ephesians 2:8-10",
      "James 2:17-18",
      "Romans 3:28",
      "James 2:24"
    ]
  },
  "content": {
    "title": "Faith and Works",
    "description": "James and Paul reconciled",
    "sections": [
      {
        "title": "Salvation by Grace Through Faith",
        "verses": [
          "Ephesians 2:8-9",
          "Romans 3:28",
          "Galatians 2:16",
          "Titus 3:5"
        ],
        "content": "Scripture emphatically teaches that salvation is by grace alone through faith alone in Christ alone, not by human works or merit. 'By grace are ye saved through faith; and that not of yourselves: it is the gift of God: not of works, lest any man should boast.' We conclude that a man is justified by faith without the deeds of the law.<br><br>Knowing that a man is not justified by the works of the law, but by the faith of Jesus Christ, even we have believed in Jesus Christ, that we might be justified by the faith of Christ, and not by the works of the law: for by the works of the law shall no flesh be justified. Not by works of righteousness which we have done, but according to his mercy he saved us.<br><br>This is the glorious truth of the Reformation: sola gratia, sola fide, solus Christus. We contribute nothing to our salvation except the sin that made it necessary.<br><br>Justification is a legal declaration, not a moral transformation—God declares sinners righteous on the basis of Christ's imputed righteousness, received through faith alone. Any addition of human works corrupts the gospel and destroys grace."
      },
      {
        "title": "Faith That Works",
        "verses": [
          "James 2:17-18",
          "James 2:24",
          "James 2:26",
          "Galatians 5:6"
        ],
        "content": "James teaches that genuine faith inevitably produces works—faith without works is dead, being alone. 'Even so faith, if it hath not works, is dead, being alone.<br><br>Yea, a man may say, Thou hast faith, and I have works: shew me thy faith without thy works, and I will shew thee my faith by my works.' Ye see then how that by works a man is justified, and not by faith only. As the body without the spirit is dead, so faith without works is dead also.<br><br>In Jesus Christ neither circumcision availeth any thing, nor uncircumcision; but faith which worketh by love. James does not contradict Paul; they address different questions.<br><br>Paul answers 'How is a person justified before God?'—by faith alone. James answers 'What kind of faith justifies?'—living faith that produces works.<br><br>James attacks a dead orthodoxy that professes faith but shows no evidence of transformation. Even demons believe—and tremble.<br><br>True faith is never alone; it always produces fruit. Works do not contribute to justification but demonstrate its reality.<br><br>Faith is the root; works are the fruit. We are saved by faith alone, but the faith that saves is never alone."
      },
      {
        "title": "The Nature of Saving Faith",
        "verses": [
          "Hebrews 11:1",
          "Romans 10:9-10",
          "John 1:12",
          "Acts 16:31"
        ],
        "content": "Saving faith involves knowledge, assent, and trust—believing the gospel intellectually, agreeing that it is true, and personally relying on Christ for salvation. 'Faith is the substance of things hoped for, the evidence of things not seen.' If thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved.<br><br>For with the heart man believeth unto righteousness. As many as received him, to them gave he power to become the sons of God, even to them that believe on his name.<br><br>Believe on the Lord Jesus Christ, and thou shalt be saved. Faith is not mere intellectual agreement—demons have that.<br><br>Faith is not mere emotional experience—feelings fluctuate. Saving faith is wholehearted trust in Christ, resting entirely on Him for salvation.<br><br>It includes repentance—turning from sin and self-righteousness to Christ. It produces obedience—faith without works is dead.<br><br>But salvation is received through faith, not through the works that follow. The object of faith is Christ, not our faith itself; we are saved by Christ through faith, not by faith through Christ."
      },
      {
        "title": "Created for Good Works",
        "verses": [
          "Ephesians 2:10",
          "Titus 2:14",
          "Matthew 5:16",
          "Colossians 1:10"
        ],
        "content": "Though saved by grace through faith apart from works, believers are saved unto good works—created in Christ Jesus for this purpose. 'We are his workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them.' Christ gave himself for us, that he might redeem us from all iniquity, and purify unto himself a peculiar people, zealous of good works.<br><br>Let your light so shine before men, that they may see your good works, and glorify your Father which is in heaven. Walk worthy of the Lord unto all pleasing, being fruitful in every good work.<br><br>Good works are not the ground of salvation but its goal and evidence. God planned our good works before the foundation of the world and prepared us to walk in them through regeneration and sanctification.<br><br>We work because we are saved, not to be saved. These works include loving God and neighbor, serving the church, caring for the poor, proclaiming the gospel, pursuing holiness, and every act of obedience to God's commands.<br><br>When others see our good works, they should glorify not us but our Father in heaven—works testify to grace."
      },
      {
        "title": "Examining Ourselves",
        "verses": [
          "2 Corinthians 13:5",
          "Matthew 7:21-23",
          "1 John 2:3-4",
          "1 John 3:14"
        ],
        "content": "Scripture calls believers to examine themselves for evidence of genuine faith—not everyone who professes Christ truly knows Him. 'Examine yourselves, whether ye be in the faith; prove your own selves.' Not every one that saith unto me, Lord, Lord, shall enter into the kingdom of heaven; but he that doeth the will of my Father which is in heaven.<br><br>Many will say to me in that day, Lord, Lord, have we not prophesied in thy name?... And then will I profess unto them, I never knew you.<br><br>Hereby we do know that we know him, if we keep his commandments. He that saith, I know him, and keepeth not his commandments, is a liar, and the truth is not in him.<br><br>We know that we have passed from death unto life, because we love the brethren. Self-examination asks: Do I love God?<br><br>Do I keep His commandments? Do I love fellow believers?<br><br>Is there fruit of the Spirit in my life? Am I growing in holiness?<br><br>Do I hate sin? Do I hunger for righteousness?<br><br>These are marks of genuine conversion. False assurance is deadly; true assurance is precious.<br><br>We examine ourselves not to doubt God's promises but to confirm we truly believe them."
      },
      {
        "title": "Perseverance as Evidence",
        "verses": [
          "Colossians 1:22-23",
          "Hebrews 3:14",
          "1 John 2:19",
          "Matthew 24:13"
        ],
        "content": "Perseverance in faith and holiness is both the gift of God to His elect and the evidence that faith is genuine. Christ will present you holy and unblameable and unreproveable in his sight: 'if ye continue in the faith grounded and settled, and be not moved away from the hope of the gospel.' We are made partakers of Christ, if we hold the beginning of our confidence stedfast unto the end.<br><br>They went out from us, but they were not of us; for if they had been of us, they would no doubt have continued with us: but they went out, that they might be made manifest that they were not all of us. He that shall endure unto the end, the same shall be saved.<br><br>Those who fall away prove they were never truly Christ's—they were among us but not of us. Genuine believers persevere because God preserves them.<br><br>Yet perseverance is the means by which we inherit the promises. This creates not uncertainty but diligence—we make our calling and election sure by adding to faith virtue, knowledge, temperance, patience, godliness, brotherly kindness, and charity.<br><br>Final salvation awaits those who endure to the end—and all whom God justifies will endure, for He completes what He begins."
      }
    ],
    "slug": "faith-and-works"
  },
  "category": "Thematic Studies"
}