{
  "catalog_entry": {
    "title": "The Gospel in the Old Testament",
    "description": "Christ hidden in the Hebrew Scriptures",
    "slug": "gospel-in-ot",
    "verses": [
      "Luke 24:27",
      "John 5:39",
      "1 Peter 1:10-12",
      "Galatians 3:8"
    ]
  },
  "content": {
    "title": "The Gospel in the Old Testament",
    "description": "Christ hidden in the Hebrew Scriptures",
    "sections": [
      {
        "title": "Christ the Key to the Old Testament",
        "verses": [
          "Luke 24:27",
          "Luke 24:44-45",
          "John 5:39",
          "John 5:46"
        ],
        "content": "Jesus Himself taught that the entire Old Testament points to Him—He is its central theme and interpretive key. 'Beginning at Moses and all the prophets, he expounded unto them in all the scriptures the things concerning himself.' He said, 'All things must be fulfilled, which were written in the law of Moses, and in the prophets, and in the psalms, concerning me.<br><br>Then opened he their understanding, that they might understand the scriptures.' 'Search the scriptures; for in them ye think ye have eternal life: and they are they which testify of me.' 'Had ye believed Moses, ye would have believed me: for he wrote of me.' The Old Testament is not merely Jewish history or moral instruction but Christian Scripture testifying to Christ. Reading the Old Testament without seeing Christ is like reading a mystery novel and missing the solution.<br><br>Every page anticipates, prepares for, or pictures the coming Redeemer. This Christ-centered hermeneutic transforms Old Testament study from mere antiquarian interest to spiritual encounter with the living Christ revealed in Scripture."
      },
      {
        "title": "The Protoevangelium",
        "verses": [
          "Genesis 3:15",
          "Galatians 4:4",
          "Romans 16:20",
          "Hebrews 2:14"
        ],
        "content": "The first gospel promise appears immediately after the fall—the seed of the woman will crush the serpent's head, though suffering in the process. 'I will put enmity between thee and the woman, and between thy seed and her seed; it shall bruise thy head, and thou shalt bruise his heel.' This cryptic promise contains the gospel in seed form.<br><br>The 'seed of the woman' (unusual phrase—normally seed is traced through men) points to the virgin birth. The enmity between seeds indicates the ongoing conflict between Christ and Satan, between the godly line and the ungodly.<br><br>The crushing of the serpent's head signifies Satan's decisive defeat; the bruising of the heel indicates Christ's suffering in achieving victory. When the fulness of the time was come, God sent forth his Son, made of a woman.<br><br>The God of peace shall bruise Satan under your feet shortly. Through death Christ destroyed him that had the power of death, that is, the devil.<br><br>From Eden onward, the Old Testament progressively unfolds this promise until its fulfillment in Christ's incarnation, death, and resurrection."
      },
      {
        "title": "Gospel in the Patriarchs",
        "verses": [
          "Genesis 22:8",
          "Genesis 22:14",
          "Galatians 3:8",
          "Hebrews 11:17-19"
        ],
        "content": "Abraham's life, especially the offering of Isaac, powerfully pictures the gospel of God's provision and substitutionary sacrifice. When Isaac asked about the lamb for burnt offering, Abraham prophetically answered, 'My son, God will provide himself a lamb for a burnt offering.' Abraham called the place Jehovah-jireh—'The LORD will provide.' The Scripture, foreseeing that God would justify the heathen through faith, preached before the gospel unto Abraham, saying, In thee shall all nations be blessed.<br><br>By faith Abraham offered up Isaac, accounting that God was able to raise him up, even from the dead; from whence also he received him in a figure. The binding of Isaac pictures the Father offering His Son; the ram caught in the thicket pictures substitutionary atonement—another dying in Isaac's place.<br><br>Abraham's faith in resurrection foreshadows the gospel hope. Jacob's blessing of Judah (Genesis 49:10) promised the scepter would not depart until Shiloh (the one to whom it belongs) comes—pointing to Christ the King.<br><br>Joseph, betrayed by brothers, sold for silver, unjustly condemned, raised to glory, and saving his people through suffering, is one of Scripture's clearest types of Christ."
      },
      {
        "title": "Gospel in the Exodus",
        "verses": [
          "Exodus 12:13",
          "1 Corinthians 5:7",
          "John 1:29",
          "1 Peter 1:18-19"
        ],
        "content": "The Passover and Exodus provide the Old Testament's most developed gospel picture—redemption through the blood of the lamb and deliverance from bondage. 'When I see the blood, I will pass over you, and the plague shall not be upon you to destroy you.' Christ our passover is sacrificed for us.<br><br>John the Baptist declared, 'Behold the Lamb of God, which taketh away the sin of the world.' Ye were not redeemed with corruptible things, as silver and gold... but with the precious blood of Christ, as of a lamb without blemish and without spot. The Passover lamb pictures Christ: without blemish, killed at twilight (as Christ died at the ninth hour), its blood applied to doorposts (as Christ's blood is applied by faith), its flesh eaten (as we feed on Christ), and none of its bones broken (as Christ's bones were not broken).<br><br>Israel's bondage pictures slavery to sin; Pharaoh pictures Satan; the plagues picture God's judgment on false gods; the Red Sea crossing pictures baptism and deliverance; the wilderness pictures sanctification; Canaan pictures the believer's rest in Christ. The entire Exodus narrative is gospel dramatized."
      },
      {
        "title": "Gospel in the Sacrifices",
        "verses": [
          "Leviticus 17:11",
          "Hebrews 9:22",
          "Hebrews 10:1-4",
          "Isaiah 53:10"
        ],
        "content": "The Levitical sacrificial system taught gospel truths: sin requires death, blood makes atonement, and substitution is God's gracious provision. 'The life of the flesh is in the blood: and I have given it to you upon the altar to make an atonement for your souls: for it is the blood that maketh an atonement for the soul.' Without shedding of blood is no remission.<br><br>The law had a shadow of good things to come; those sacrifices could never take away sins—they pointed forward to the one sacrifice that could. It pleased the LORD to bruise him; he hath put him to grief: when thou shalt make his soul an offering for sin.<br><br>The burnt offering pictured complete consecration to God. The sin offering addressed specific transgressions.<br><br>The guilt offering provided restitution. The peace offering celebrated fellowship with God.<br><br>All were shadows; Christ is the substance. His one sacrifice accomplished what millions of animal sacrifices could not—eternal redemption, permanent cleansing, complete forgiveness.<br><br>The Old Testament believer who brought sacrifices in faith was looking forward to Christ; we look backward to the same Christ, but He is the object of faith in both testaments."
      },
      {
        "title": "Gospel in the Prophets",
        "verses": [
          "Isaiah 53:5-6",
          "Micah 5:2",
          "Zechariah 9:9",
          "Malachi 3:1"
        ],
        "content": "The prophets spoke explicitly of the coming Messiah—His birth, ministry, suffering, death, resurrection, and reign. 'He was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed.<br><br>All we like sheep have gone astray; we have turned every one to his own way; and the LORD hath laid on him the iniquity of us all.' Bethlehem is named as the birthplace of one 'whose goings forth have been from of old, from everlasting.' Zechariah predicted the triumphal entry: 'thy King cometh unto thee... lowly, and riding upon an ass.' 'The Lord, whom ye seek, shall suddenly come to his temple.' Isaiah 7:14 promised a virgin-born son named Immanuel. Isaiah 9:6 described a child who would be called Mighty God, Everlasting Father.<br><br>Psalm 22 describes crucifixion in detail. Daniel 9 predicted the Messiah's coming and death.<br><br>Zechariah 12:10 foretold that Israel would look upon the one they pierced. The prophets provide such detailed predictions that Jesus' fulfillment of them constitutes powerful evidence for His messiahship and Scripture's divine inspiration."
      }
    ],
    "slug": "gospel-in-ot"
  },
  "category": "Thematic Studies"
}