{
  "catalog_entry": {
    "title": "The Law and the Christian",
    "description": "The three uses of the law and its ongoing relevance",
    "slug": "law-and-christian",
    "verses": [
      "Romans 3:20",
      "Galatians 3:24",
      "Romans 13:8-10",
      "Matthew 5:17-19"
    ]
  },
  "content": {
    "title": "The Law and the Christian",
    "description": "The three uses of the law and its ongoing relevance",
    "sections": [
      {
        "title": "Christ Fulfilled the Law",
        "verses": [
          "Matthew 5:17-18",
          "Romans 10:4",
          "Galatians 4:4-5",
          "Romans 8:3-4"
        ],
        "content": "Christ fulfilled the law perfectly, accomplishing what we could never do and satisfying its demands on our behalf. 'Think not that I am come to destroy the law, or the prophets: I am not come to destroy, but to fulfil.<br><br>For verily I say unto you, Till heaven and earth pass, one jot or one tittle shall in no wise pass from the law, till all be fulfilled.' Christ is the end (goal/termination) of the law for righteousness to every one that believeth. God sent forth his Son, made of a woman, made under the law, to redeem them that were under the law.<br><br>What the law could not do, in that it was weak through the flesh, God sending his own Son in the likeness of sinful flesh, and for sin, condemned sin in the flesh: that the righteousness of the law might be fulfilled in us. Christ fulfilled the law in two ways: actively, by perfectly obeying its commands throughout His life, and passively, by suffering its penalty for lawbreakers on the cross.<br><br>His perfect righteousness is imputed to believers; His atoning death satisfies the law's just demands. We are therefore not under law but under grace—not because the law was abolished but because its demands have been fully met in Christ."
      },
      {
        "title": "The First Use: Restraining Sin",
        "verses": [
          "Romans 2:14-15",
          "1 Timothy 1:8-10",
          "Romans 13:3-4",
          "Galatians 3:19"
        ],
        "content": "The law functions to restrain sin in society—the civil use that maintains order and curbs outward wickedness. Even Gentiles who do not have the written law 'shew the work of the law written in their hearts, their conscience also bearing witness.' The law is good if a man use it lawfully, knowing that the law is not made for a righteous man, but for the lawless and disobedient, for the ungodly and for sinners, for murderers, for whoremongers, for them that defile themselves with mankind, for menstealers, for liars, for perjured persons.<br><br>Civil rulers are God's ministers who bear the sword to execute wrath upon evildoers. The law was added because of transgressions.<br><br>This 'civil use' of the law restrains human wickedness through fear of punishment, providing relative peace and order in society. Civil governments rightly base laws on moral principles rooted in God's law.<br><br>While this use cannot change hearts or save souls, it provides restraint necessary for society's functioning. The law written on human hearts produces conscience, and civil law reinforces moral boundaries.<br><br>This use benefits both believers and unbelievers, creating conditions for human flourishing."
      },
      {
        "title": "The Second Use: Revealing Sin",
        "verses": [
          "Romans 3:20",
          "Romans 7:7",
          "Galatians 3:24",
          "Romans 5:20"
        ],
        "content": "The law's primary evangelical function is to expose sin, convict sinners, and drive them to Christ for salvation. 'By the law is the knowledge of sin.' I had not known sin, but by the law: for I had not known lust, except the law had said, Thou shalt not covet.<br><br>The law was our schoolmaster to bring us unto Christ, that we might be justified by faith. The law entered, that the offence might abound.<br><br>But where sin abounded, grace did much more abound. The law acts as a mirror showing us our spiritual condition—condemned, guilty, helpless.<br><br>It strips away self-righteousness by revealing the impossibility of earning salvation through law-keeping. No flesh will be justified by the deeds of the law.<br><br>The law's impossible demands crush human pride and create despair, preparing sinners to embrace grace. Without the law's convicting work, people imagine themselves righteous.<br><br>The law, applied by the Spirit, creates the sense of need that makes the gospel welcome. Luther called this the law's 'proper use'—its theological function of killing self-righteousness and driving sinners to the only Savior.<br><br>Preach the law to the self-righteous; preach grace to the broken."
      },
      {
        "title": "The Third Use: Guiding Believers",
        "verses": [
          "Psalm 119:97-105",
          "Romans 13:8-10",
          "1 John 5:3",
          "James 1:25"
        ],
        "content": "For believers, the moral law remains a guide for godly living—showing what pleases God, not for justification but for sanctification. 'O how love I thy law! it is my meditation all the day...<br><br>Thy word is a lamp unto my feet, and a light unto my path.' Love worketh no ill to his neighbour: therefore love is the fulfilling of the law. This is the love of God, that we keep his commandments: and his commandments are not grievous.<br><br>Whoso looketh into the perfect law of liberty, and continueth therein, he being not a forgetful hearer, but a doer of the work, this man shall be blessed in his deed. The believer is not under law for justification but delights in God's law as the revelation of His will.<br><br>We obey not to earn salvation but because we are saved, not from fear of punishment but from love for our Redeemer. The law shows what holiness looks like in practice.<br><br>It guides our sanctification, revealing sin to be mortified and righteousness to be pursued. The Ten Commandments summarize moral obligations that remain binding—though their motivation and power are transformed by grace.<br><br>We love God's law because we love the Lawgiver."
      },
      {
        "title": "Moral, Ceremonial, and Civil Law",
        "verses": [
          "Matthew 5:17-19",
          "Colossians 2:16-17",
          "Hebrews 9:9-10",
          "Acts 15:28-29"
        ],
        "content": "The Old Testament law contains three aspects: moral (permanent), ceremonial (fulfilled in Christ), and civil (for Israel's theocracy). The moral law, summarized in the Ten Commandments, reflects God's eternal character and remains binding on all people in all ages.<br><br>Jesus intensified its demands, showing that it addresses heart attitudes as well as outward actions. The ceremonial law—sacrifices, priesthood, dietary regulations, purity laws—pointed to Christ and was fulfilled by Him.<br><br>Let no man therefore judge you in meat, or in drink, or in respect of an holy day: which are a shadow of things to come; but the body is of Christ. These were figures for the time then present, imposed until the time of reformation.<br><br>Christians are not bound by ceremonial regulations. The civil law governed Israel as a theocratic nation—judicial procedures, property laws, civil penalties.<br><br>While its specific regulations were for Israel's unique situation, its underlying moral principles (equity, justice, mercy) have broader application. The Jerusalem Council determined that Gentile Christians need not observe Jewish ceremonial law—the moral law alone is binding."
      },
      {
        "title": "Law and Gospel",
        "verses": [
          "John 1:17",
          "Romans 6:14",
          "Galatians 5:18",
          "Romans 3:31"
        ],
        "content": "Law and gospel are distinct but not opposed—understanding their proper relationship is essential for Christian living. 'The law was given by Moses, but grace and truth came by Jesus Christ.' Ye are not under the law, but under grace.<br><br>If ye be led of the Spirit, ye are not under the law. Do we then make void the law through faith?<br><br>God forbid: yea, we establish the law. The law commands; the gospel gives.<br><br>The law says 'do this and live'; the gospel says 'live because Christ has done this.' The law condemns; the gospel justifies. The law drives us from ourselves to Christ; in Christ we find power to fulfill the law's righteous requirements.<br><br>We are not under law as a covenant of works, seeking justification by obedience. We are under grace, justified freely, with Christ's righteousness imputed to us.<br><br>Yet the moral law remains God's standard, now written on our hearts by the Spirit. We establish the law through faith—not by perfectly keeping it (impossible) but by recognizing its righteous requirements fulfilled in Christ and progressively reflected in our Spirit-empowered lives.<br><br>Antinomianism (lawlessness) and legalism (law-righteousness) are both errors; biblical Christianity maintains law and gospel in proper relationship."
      }
    ],
    "slug": "law-and-christian"
  },
  "category": "Thematic Studies"
}