{
  "catalog_entry": {
    "title": "Miracles of Jesus",
    "description": "Signs and wonders of the Messiah",
    "slug": "miracles",
    "verses": [
      "John 2:11",
      "Mark 4:39-41",
      "John 11:43-44",
      "Matthew 14:25",
      "Mark 5:41-42",
      "John 6:11-13",
      "Matthew 8:2-3"
    ]
  },
  "content": {
    "title": "Miracles of Jesus",
    "description": "Signs and wonders of the Messiah",
    "sections": [
      {
        "title": "Purpose of Jesus' Miracles",
        "verses": [
          "John 20:30-31",
          "John 2:11",
          "Acts 2:22"
        ],
        "content": "Jesus' miracles were not random displays of power or mere acts of compassion, though compassion certainly motivated many of them. They served specific purposes in God's redemptive plan.<br><br>John explicitly states the purpose: \"And many other signs truly did Jesus in the presence of his disciples, which are not written in this book: But these are written, that ye might believe that Jesus is the Christ, the Son of God; and that believing ye might have life through his name\" (John 20:30-31).<br><br>The miracles recorded in John's Gospel are called \"signs\"—they point beyond themselves to Jesus' identity. They're evidence that He is the Christ (Messiah), the Son of God. And the goal of believing this identity is not just intellectual assent but receiving eternal life through His name.<br><br>After Jesus' first miracle at Cana, John writes: \"This beginning of miracles did Jesus in Cana of Galilee, and manifested forth his glory; and his disciples believed on him\" (John 2:11). The miracle manifested (revealed, displayed) His glory—His divine nature, power, and majesty. The result was faith in His disciples.<br><br>Peter, preaching at Pentecost, described Jesus as \"a man approved of God among you by miracles and wonders and signs, which God did by him in the midst of you\" (Acts 2:22). The miracles were God's authentication of Jesus, demonstrating divine approval and authority.<br><br>Jesus Himself appealed to His miracles as evidence: \"Believe me that I am in the Father, and the Father in me: or else believe me for the very works' sake\" (John 14:11). If His words weren't enough, His works should convince them.<br><br>The miracles also fulfilled Old Testament prophecies about the Messiah. When John the Baptist sent disciples to ask if Jesus was truly the Messiah, Jesus responded: \"Go and shew John again those things which ye do hear and see: The blind receive their sight, and the lame walk, the lepers are cleansed, and the deaf hear, the dead are raised up, and the poor have the gospel preached to them\" (Matthew 11:4-5). These were prophesied signs of the Messianic age (Isaiah 35:5-6; 61:1).<br><br>The miracles demonstrated Jesus' authority over nature, disease, demons, and death—every realm of creation. This comprehensive authority proved He was no mere prophet or teacher but God incarnate.<br><br>They also revealed God's character—His compassion for human suffering, His power to deliver, His willingness to meet human needs, His kingdom breaking into the present evil age."
      },
      {
        "title": "Miracles Over Nature",
        "verses": [
          "Mark 4:35-41",
          "Matthew 14:22-33",
          "John 2:1-11"
        ],
        "content": "Jesus demonstrated His authority over the natural world through several dramatic miracles. When He and His disciples crossed the Sea of Galilee, a fierce storm arose. While waves broke over the boat, Jesus slept. Terrified disciples woke Him: \"Master, carest thou not that we perish?\" (Mark 4:38).<br><br>Jesus \"arose, and rebuked the wind, and said unto the sea, Peace, be still. And the wind ceased, and there was a great calm\" (Mark 4:39). With a word, He calmed the storm instantly. Then He challenged the disciples: \"Why are ye so fearful? how is it that ye have no faith?\" (Mark 4:40).<br><br>The disciples' response reveals the miracle's impact: \"What manner of man is this, that even the wind and the sea obey him?\" (Mark 4:41). Only God commands creation. Yet this man did. The conclusion was inescapable: Jesus is divine.<br><br>Walking on water (Matthew 14:22-33) further demonstrated mastery over nature. In the fourth watch of the night (3-6 AM), Jesus came to the disciples walking on the sea. They thought He was a spirit and cried out in fear. Jesus reassured them: \"It is I; be not afraid\" (Matthew 14:27).<br><br>Peter asked to come to Jesus on the water. Jesus said, \"Come.\" Peter walked on water—until he saw the wind, became afraid, and began to sink. Jesus immediately caught him, saying, \"O thou of little faith, wherefore didst thou doubt?\" (Matthew 14:31). When they entered the boat, the wind ceased. The disciples worshiped Him: \"Of a truth thou art the Son of God\" (Matthew 14:33).<br><br>This miracle shows that faith enables us to do the impossible (Peter walked on water!), but fear and doubt cause us to sink. Jesus' immediate rescue demonstrates His readiness to save when we cry out, even when our faith falters.<br><br>Turning water to wine (John 2:1-11) was Jesus' first recorded miracle. At a wedding in Cana, the wine ran out. Mary told Jesus; He initially seemed reluctant but then instructed servants to fill six stone waterpots (containing 20-30 gallons each) with water. When they drew out some and took it to the master of the feast, it had become wine—and superior wine at that.<br><br>This miracle demonstrated Jesus' creative power—transforming one substance into another. It pointed to His glory and caused His disciples to believe. It also symbolized the transformation Jesus brings: the old covenant (water in stone jars used for Jewish purification) becoming the new covenant (wine representing joy, celebration, the Spirit).<br><br>These nature miracles prove Jesus is Lord of creation, demonstrate His deity, call for faith in Him, and foreshadow the new creation He will bring."
      },
      {
        "title": "Healing Miracles",
        "verses": [
          "Matthew 8:1-3",
          "Mark 2:1-12",
          "John 9:1-7",
          "Luke 8:43-48"
        ],
        "content": "Jesus' healing miracles demonstrated His compassion and authority while also illustrating spiritual truths. When a leper came saying, \"Lord, if thou wilt, thou canst make me clean,\" Jesus, \"moved with compassion,\" touched him and said, \"I will; be thou clean. And as soon as he had spoken, immediately the leprosy departed from him\" (Mark 1:40-42).<br><br>Touching a leper was radical—lepers were ceremonially unclean, socially isolated, and physically untouchable. Jesus' touch itself is a miracle of grace. He was willing. His power was immediate. The healing was complete.<br><br>The paralytic lowered through the roof (Mark 2:1-12) combines physical and spiritual healing. Unable to reach Jesus through the crowd, four men dug through the roof and lowered their paralyzed friend. \"When Jesus saw their faith\"—the faith of the four who brought him—\"he said unto the sick of the palsy, Son, thy sins be forgiven thee\" (Mark 2:5).<br><br>Scribes objected: \"Who can forgive sins but God only?\" (Mark 2:7). Jesus responded: \"Whether is it easier to say to the sick of the palsy, Thy sins be forgiven thee; or to say, Arise, and take up thy bed, and walk? But that ye may know that the Son of man hath power on earth to forgive sins, (he saith to the sick of the palsy,) I say unto thee, Arise, and take up thy bed, and go thy way into thine house\" (Mark 2:9-11).<br><br>The man immediately rose, took his bed, and walked out. The physical healing proved Jesus' authority to forgive sins—the greater miracle. Physical healing is temporary; forgiveness is eternal. The man's ultimate problem wasn't paralysis but sin, and Jesus addressed both.<br><br>The man born blind (John 9) prompted the question: \"Who did sin, this man, or his parents, that he was born blind?\" Jesus answered: \"Neither hath this man sinned, nor his parents: but that the works of God should be made manifest in him\" (John 9:2-3). Not all suffering is direct punishment for sin. Sometimes God allows affliction to display His power and glory.<br><br>Jesus spat on the ground, made clay, anointed the blind man's eyes, and told him to wash in the pool of Siloam. The man obeyed and \"came seeing\" (John 9:7). This healing sparked controversy—it occurred on the Sabbath. But more significantly, the healed man came to worship Jesus as the Son of God while religious leaders rejected Him. Physical sight led to spiritual sight for the humble man, while the Pharisees remained spiritually blind despite physical sight.<br><br>The woman with the issue of blood (Luke 8:43-48) suffered twelve years and spent all her money on physicians without being helped. She came behind Jesus in the crowd and touched the hem of His garment, thinking, \"If I may touch but his clothes, I shall be whole\" (Mark 5:28). Immediately her bleeding stopped.<br><br>Jesus knew power had gone out from Him and asked who touched Him. Peter noted the absurdity—in a crowd, many were touching Him. But Jesus knew a different kind of touch—the touch of faith. The woman came trembling and told the whole truth. Jesus said, \"Daughter, thy faith hath made thee whole; go in peace\" (Luke 8:48).<br><br>Her faith was imperfect—she thought the power was in Jesus' garment, not Jesus Himself. But Jesus honored even imperfect faith when it reached out to Him. He also insisted she publicly declare what happened—not to embarrass her but to testify to God's power and strengthen her faith."
      },
      {
        "title": "Power Over Demons",
        "verses": [
          "Mark 5:1-20",
          "Mark 9:17-29",
          "Luke 11:14-22"
        ],
        "content": "Jesus' authority over demonic powers demonstrated His supremacy over the spiritual realm. The Gerasene demoniac (Mark 5:1-20) was possessed by many demons. He lived among tombs, had supernatural strength (breaking chains), and cut himself with stones—a picture of Satan's destructive work.<br><br>When Jesus approached, the demons cried out, \"What have I to do with thee, Jesus, thou Son of the most high God? I adjure thee by God, that thou torment me not\" (Mark 5:7). Notice: demons recognized Jesus' identity (Son of God), acknowledged His authority (feared torment), and knew their ultimate fate (torment).<br><br>Jesus asked the demon's name. The response: \"My name is Legion: for we are many\" (Mark 5:9). A Roman legion numbered thousands. This man was severely oppressed. The demons begged not to be sent out of the country but into a nearby herd of pigs. Jesus permitted it. The pigs—about 2,000—ran down a steep bank and drowned.<br><br>When people came, they found the formerly demon-possessed man \"sitting, and clothed, and in his right mind\" (Mark 5:15). Complete transformation. From naked to clothed, from manic to calm, from insane to sane. This is what Jesus does—He restores humanity to what God intended.<br><br>The demonized boy (Mark 9:17-29) had a spirit that made him mute, threw him into fire and water, caused convulsions, gnashing of teeth, and wasting away. The disciples couldn't cast it out. The father brought the boy to Jesus: \"If thou canst do any thing, have compassion on us, and help us\" (Mark 9:22).<br><br>Jesus responded, \"If thou canst believe, all things are possible to him that believeth\" (Mark 9:23). The father cried out with tears, \"Lord, I believe; help thou mine unbelief\" (Mark 9:24)—honest acknowledgment of imperfect faith asking for help. Jesus rebuked the demon and healed the boy completely.<br><br>When disciples asked why they couldn't cast it out, Jesus answered, \"This kind can come forth by nothing, but by prayer and fasting\" (Mark 9:29). Some spiritual battles require deeper spiritual resources—extended prayer, fasting, and dependence on God.<br><br>When Jesus cast out a mute demon (Luke 11:14-22), some accused Him of using Satan's power. Jesus exposed the absurdity: \"If Satan also be divided against himself, how shall his kingdom stand?\" (Luke 11:18). Why would Satan fight himself?<br><br>Then Jesus made a key statement: \"He that is not with me is against me: and he that gathereth not with me scattereth\" (Luke 11:23). There's no neutrality with Jesus. We're either with Him or against Him.<br><br>He also described His work: \"When a strong man armed keepeth his palace, his goods are in peace: But when a stronger than he shall come upon him, and overcome him, he taketh from him all his armour wherein he trusted, and divideth his spoils\" (Luke 11:21-22). Satan is the strong man; Jesus is the stronger one who overcomes him, plunders his kingdom, and sets captives free.<br><br>These miracles demonstrate Jesus' absolute authority over demons, His power to free those in bondage, and the reality that He has come to destroy the devil's works."
      },
      {
        "title": "Raising the Dead",
        "verses": [
          "Luke 7:11-17",
          "Mark 5:35-43",
          "John 11:38-44"
        ],
        "content": "Jesus' power over death is the ultimate demonstration of His authority. In Nain (Luke 7:11-17), Jesus encountered a funeral procession. A widow's only son had died. \"When the Lord saw her, he had compassion on her, and said unto her, Weep not\" (Luke 7:13).<br><br>Then Jesus touched the coffin—making Himself ceremonially unclean—and said, \"Young man, I say unto thee, Arise\" (Luke 7:14). The dead man sat up and began to speak, and Jesus gave him to his mother. The people's response: \"A great prophet is risen up among us; and, That God hath visited his people\" (Luke 7:16).<br><br>Notice Jesus' compassion moved Him to act. He wasn't asked; He volunteered. This reveals God's heart toward human suffering and death. Also, notice the power of His word—\"Arise\"—and life returned immediately. Word and power together.<br><br>Jairus' daughter (Mark 5:35-43) had just died when messengers brought word to Jairus: \"Thy daughter is dead: why troublest thou the Master any further?\" (Mark 5:35). Jesus told Jairus, \"Be not afraid, only believe\" (Mark 5:36).<br><br>At the house, mourners were wailing. Jesus said, \"Why make ye this ado, and weep? the damsel is not dead, but sleepeth\" (Mark 5:39). They laughed at Him. Jesus put them out, took only Peter, James, John, and the parents, went to the child, took her hand, and said, \"Talitha cumi\" (\"Little girl, I say to you, arise\"). \"And straightway the damsel arose, and walked\" (Mark 5:42).<br><br>Jesus' statement that she was sleeping doesn't mean she wasn't really dead—mourners knew death when they saw it. Rather, it reveals Jesus' perspective: death is temporary, reversible, no more permanent than sleep for those whom He will awaken.<br><br>Lazarus' resurrection (John 11:38-44) is the most dramatic. Lazarus had been dead four days—past the point where Jews believed the soul might return. Martha warned Jesus: \"Lord, by this time he stinketh: for he hath been dead four days\" (John 11:39).<br><br>Jesus reminded her: \"Said I not unto thee, that, if thou wouldest believe, thou shouldest see the glory of God?\" (John 11:40). They rolled away the stone. Jesus prayed aloud (for the benefit of onlookers) then \"cried with a loud voice, Lazarus, come forth. And he that was dead came forth, bound hand and foot with graveclothes: and his face was bound about with a napkin. Jesus saith unto them, Loose him, and let him go\" (John 11:43-44).<br><br>This miracle is stunning: four days dead, body decomposing, yet Jesus called him back to life with a word. It proved Jesus' claim: \"I am the resurrection, and the life: he that believeth in me, though he were dead, yet shall he live: And whosoever liveth and believeth in me shall never die\" (John 11:25-26).<br><br>These resurrections foreshadow Jesus' own resurrection and the final resurrection of all believers. Death is not the end. Jesus has authority over it. Those who trust Him will live, even though they die."
      },
      {
        "title": "Miraculous Provision",
        "verses": [
          "Matthew 14:15-21",
          "Matthew 15:32-38",
          "Luke 5:4-7"
        ],
        "content": "Jesus demonstrated His ability to provide for physical needs through miraculous multiplication. Feeding the 5,000 (Matthew 14:15-21) is the only miracle recorded in all four Gospels, suggesting its significance.<br><br>When evening came in a deserted place, disciples urged Jesus to send the multitude away to buy food. Jesus said, \"They need not depart; give ye them to eat\" (Matthew 14:16). The disciples protested: \"We have here but five loaves, and two fishes\" (Matthew 14:17).<br><br>Jesus said, \"Bring them hither to me\" (Matthew 14:18). He took the five loaves and two fish, looked up to heaven, blessed and broke them, and gave them to disciples to distribute. \"And they did all eat, and were filled: and they took up of the fragments that remained twelve baskets full. And they that had eaten were about five thousand men, beside women and children\" (Matthew 14:20-21). Likely 10,000-15,000 people total.<br><br>Several principles emerge: Jesus tests our faith (\"give ye them to eat\"); He uses what we bring, however inadequate; He multiplies our little into abundance; thanksgiving to God precedes provision; He provides more than enough (twelve baskets left over—more than they started with!); and He cares about physical needs.<br><br>Feeding the 4,000 (Matthew 15:32-38) is a similar but separate event. Jesus' motivation: \"I have compassion on the multitude, because they continue with me now three days, and have nothing to eat: and I will not send them away fasting, lest they faint in the way\" (Matthew 15:32).<br><br>With seven loaves and a few small fish, Jesus fed about 4,000 men plus women and children, with seven baskets of fragments remaining. This demonstrates that God's provision is not a one-time event. He provides repeatedly. Each situation requires fresh faith, and He proves faithful again and again.<br><br>The miraculous catch of fish (Luke 5:4-7) occurred after Peter fished all night and caught nothing. Jesus told him, \"Launch out into the deep, and let down your nets for a draught\" (Luke 5:4). Peter protested—they'd fished all night without success—but obeyed: \"Nevertheless at thy word I will let down the net\" (Luke 5:5).<br><br>The catch was so large their nets were breaking. They signaled partners for help, and both boats became so full they began to sink. Peter's response: \"Depart from me; for I am a sinful man, O Lord\" (Luke 5:8). Encountering Jesus' power exposed Peter's sinfulness and unworthiness.<br><br>Jesus' response: \"Fear not; from henceforth thou shalt catch men\" (Luke 5:10). The miracle illustrated Jesus' call on Peter's life—he'd been fishing for fish; now he'd fish for people. And the principle remains: when we obey Jesus' word, even when it seems futile, He provides abundantly beyond what we could accomplish ourselves."
      },
      {
        "title": "Faith and Miracles",
        "verses": [
          "Matthew 9:27-30",
          "Matthew 13:58",
          "Matthew 17:20",
          "James 5:14-16"
        ],
        "content": "Faith is consistently connected to Jesus' miracles. When two blind men followed Jesus crying for mercy, He asked, \"Believe ye that I am able to do this?\" They answered, \"Yea, Lord.\" Jesus touched their eyes saying, \"According to your faith be it unto you. And their eyes were opened\" (Matthew 9:28-30).<br><br>\"According to your faith\"—the level of faith corresponded to the level of healing received. This doesn't mean miracles are earned by faith or that lack of healing always indicates lack of faith. But generally, faith positions us to receive what God wants to give.<br><br>Conversely, unbelief limits Jesus' work. In His hometown, \"he did not many mighty works there because of their unbelief\" (Matthew 13:58). Not that He couldn't, but their unbelief created an atmosphere hostile to faith, and Jesus typically honored the faith level of those He healed.<br><br>Jesus taught about faith's potential: \"If ye have faith as a grain of mustard seed, ye shall say unto this mountain, Remove hence to yonder place; and it shall remove; and nothing shall be impossible unto you\" (Matthew 17:20).<br><br>A mustard seed is tiny, yet even that amount of genuine faith can accomplish the impossible. It's not about the quantity of faith but the quality and object—faith in the omnipotent God.<br><br>James instructs the church: \"Is any sick among you? let him call for the elders of the church; and let them pray over him, anointing him with oil in the name of the Lord: And the prayer of faith shall save the sick, and the Lord shall raise him up; and if he have committed sins, they shall be forgiven him\" (James 5:14-15).<br><br>The \"prayer of faith\" brings healing. This involves both the faith of the sick person (calling for elders) and the faith of elders (praying expectantly). The connection between sin and sickness is acknowledged—sometimes confession and forgiveness are part of the healing process.<br><br>James continues: \"Confess your faults one to another, and pray one for another, that ye may be healed. The effectual fervent prayer of a righteous man availeth much\" (James 5:16). Fervent, righteous prayer is powerful and effective.<br><br>Several principles emerge: Faith pleases God and positions us to receive from Him; unbelief hinders what God wants to do; even small genuine faith can accomplish great things; prayer in faith brings healing; confession of sin sometimes accompanies physical healing; and God is still a miracle-working God who responds to faith-filled prayer.<br><br>While we don't see miracles of the same frequency or magnitude today as in Jesus' ministry (which served specific authentication purposes), God still heals, provides, and works miracles in response to faith. We should pray expectantly, believe God's power, and trust His wisdom in how and when He chooses to work."
      },
      {
        "title": "Responding to Miracles",
        "verses": [
          "John 6:14-15",
          "John 6:26-27",
          "Luke 17:11-19",
          "John 11:45-48"
        ],
        "content": "People responded variously to Jesus' miracles, revealing the condition of their hearts. After feeding the 5,000, people wanted to make Jesus king by force (John 6:14-15). But Jesus withdrew—they wanted Him for wrong reasons. The next day, Jesus confronted them: \"Ye seek me, not because ye saw the miracles, but because ye did eat of the loaves, and were filled. Labour not for the meat which perisheth, but for that meat which endureth unto everlasting life\" (John 6:26-27).<br><br>They wanted physical provision, not spiritual salvation. They followed Jesus for benefits, not for who He was. Many still approach Jesus this way—wanting Him to solve problems, provide comfort, grant prosperity—without truly wanting Him as Lord.<br><br>Ten lepers were cleansed (Luke 17:11-19), but only one returned to thank Jesus. Jesus asked, \"Were there not ten cleansed? but where are the nine?\" (Luke 17:17). Nine received healing but didn't return to worship the Healer. Only the Samaritan (ironically, the ethnic and religious outsider) returned with a grateful heart.<br><br>This reveals a sad truth: many receive from Jesus without truly knowing or thanking Him. Benefits without relationship. Blessings without worship. Jesus told the grateful leper, \"Thy faith hath made thee whole\" (Luke 17:19)—suggesting a deeper wholeness than just physical healing, perhaps spiritual salvation the other nine missed.<br><br>After Lazarus' resurrection, some believed (John 11:45), but others reported to Pharisees, who then plotted to kill Jesus (John 11:46-48). The same miracle produced radically different responses: faith and murder plots.<br><br>Miracles don't automatically produce faith. The Pharisees had undeniable evidence—a dead man walked out of a tomb—yet they hardened their hearts. They feared Jesus' growing influence and political ramifications more than they feared God.<br><br>This reveals that unbelief is ultimately a heart issue, not an evidence issue. No amount of evidence convinces someone determined not to believe. Conversely, receptive hearts respond to even small evidences.<br><br>The proper response to miracles is:<br><br>1. Recognize them as signs pointing to Jesus' identity\n2. Believe in Him as the Christ, the Son of God\n3. Worship and thank Him\n4. Follow Him, not just His benefits\n5. Testify to others what He's done\n6. Trust Him for future needs<br><br>Miracles should lead to discipleship, not just amazement or desire for more miracles. They reveal who Jesus is and call for our allegiance, worship, and obedience. The question is: Will we respond like the grateful leper or the ungrateful nine? Like those who believed or those who plotted murder? Our response to Jesus' works reveals our heart."
      }
    ],
    "slug": "miracles"
  },
  "category": "Biblical Themes"
}