{
  "catalog_entry": {
    "title": "Spiritual Warfare",
    "description": "Fighting the good fight of faith",
    "slug": "spiritual-warfare",
    "verses": [
      "Ephesians 6:10-18",
      "2 Corinthians 10:4-5",
      "1 Peter 5:8-9",
      "James 4:7",
      "Revelation 12:11",
      "1 John 4:4",
      "Romans 8:37"
    ]
  },
  "content": {
    "title": "Spiritual Warfare",
    "description": "Fighting the good fight of faith",
    "sections": [
      {
        "title": "Our Real Enemy",
        "verses": [
          "Ephesians 6:12",
          "2 Corinthians 10:3-4"
        ],
        "content": "We wrestle not against flesh and blood, but against principalities, powers, and spiritual wickedness in high places. Our warfare is not carnal but spiritual. We must recognize our true enemy is Satan and his demonic forces."
      },
      {
        "title": "The Armor of God",
        "verses": [
          "Ephesians 6:13-18"
        ],
        "content": "God provides spiritual armor for battle: the belt of truth, breastplate of righteousness, shoes of the gospel of peace, shield of faith, helmet of salvation, and sword of the Spirit. We must take up the full armor to stand against the devil's schemes."
      },
      {
        "title": "The Enemy's Schemes",
        "verses": [
          "1 Peter 5:8",
          "2 Corinthians 11:14",
          "John 8:44"
        ],
        "content": "Our adversary the devil prowls like a roaring lion seeking whom he may devour. He masquerades as an angel of light. He is a liar and the father of lies, seeking to deceive and destroy God's people."
      },
      {
        "title": "Weapons of Our Warfare",
        "verses": [
          "2 Corinthians 10:4-5",
          "Hebrews 4:12",
          "Ephesians 6:17"
        ],
        "content": "Our weapons are divinely powerful for pulling down strongholds. We demolish arguments and pretensions raised against God's knowledge. The Word of God is living and active, sharper than any two-edged sword, our primary offensive weapon."
      },
      {
        "title": "Resisting the Devil",
        "verses": [
          "James 4:7",
          "1 Peter 5:9",
          "Luke 4:8"
        ],
        "content": "Submit to God and resist the devil, and he will flee. Stand firm against him, solid in your faith. Jesus modeled resistance by quoting Scripture when tempted. The Word of God is our defense against Satan's attacks."
      },
      {
        "title": "Victory in Christ",
        "verses": [
          "1 John 4:4",
          "Romans 8:37",
          "Revelation 12:11"
        ],
        "content": "Greater is He who is in us than he who is in the world. We are more than conquerors through Christ who loved us. They overcame Satan by the blood of the Lamb and the word of their testimony. Victory is assured in Christ."
      },
      {
        "title": "Authority Over Evil",
        "verses": [
          "Luke 10:19",
          "Mark 16:17",
          "James 4:7"
        ],
        "content": "Jesus gave us authority to trample on serpents and scorpions and over all the power of the enemy. In His name, we cast out demons. When we resist the devil in Jesus' name, he must flee. We operate in Christ's delegated authority."
      },
      {
        "title": "Prayer: Our Primary Weapon",
        "verses": [
          "Ephesians 6:18",
          "Matthew 26:41",
          "1 Thessalonians 5:17"
        ],
        "content": "We are to pray at all times in the Spirit, with all prayer and supplication. Watch and pray lest you enter into temptation. Pray without ceasing. Prayer is essential in spiritual warfare—it's our communication with our Commander."
      }
    ],
    "slug": "spiritual-warfare"
  },
  "category": "Doctrinal Studies"
}